[{"title": "Best Value, Best Staff, Best Breakfast, Best View", "review": "This is one of the great places we stay around the world while traveling for work, We import EVOO from Riva del Garda and travel there three times a year. The residence has everything a traveler could want plus there is a great restaurant attached where the chef is great, food spectacular, wonderful service and a 10% discount for people staying at the Residence. Who could ask for more? I give them 6 stars!!!!!!!!", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1013113-r722760883", "sub_review": {"Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Centro Vela for a short stay", "review": "Rooms with a lake view are quite loud, there's a street near hotel. Lake view is nice. Location near center and lake. Good location for a walk and for a bike trip. Very helpfull stuff in hotel. Room are big but withou air condition. Parking is small but free.", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1013113-r695688704", "sub_review": {"Sleep Quality": 2, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Very nice place", "review": "Location was perfect. Room was good and clean and the view was amazing. Sound from restaurant near by was a little annoying. Shop down stairs is good and bio. Staff was very helpful and nice. Not cheap, not expensive.", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1013113-r687502329", "sub_review": {"Sleep Quality": 4, "Rooms": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Love it", "review": "Good morning and thanks a lot for this nice review! We are happy you enjoyed our beautiful view from the apartment and thanks a lot for the nice words spend for our staff. We are vey proud! Hope to guest you in the future, we wish you a nice day debora", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1013113-r686035692", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good stay in great location", "review": "Ottimo posto, vista spettacolare e posizione strategica a due passi dal centro e dal lago. 🔝 Great place, amazing lake view and it's really close to the center and the lake. I love It and the are lots of sports to practise there", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1013113-r685734651", "sub_review": {"Location": 5, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Stay in the most beautiful city ever", "review": "The location od the hotel is great - it's easy to find when arriving to Riva del Garda and great to start walking around the city and the lake. The apartment we chose - family room with a living room/kitchen and a badroom - was very spacious, clean and comfortable. It could easily fit a couple with 3 kids (there is one double bed + folding bed in the bedroom + folding bed consisting of 2 smaller sleeping areas in the living room). Breakfast is served in a building nearby and is of good quality (standard buffet breakfast). Like other reviewers, I enjoyed the coffee a lot!  I am not giving the venue full stars because of the following: 1. We did not get the bathroom set at the beginning but only on our request which I find quite unprofessional, 2. We wre told that underground…", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1013113-r684453451", "sub_review": {"Value": 4, "Location": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great Stay", "review": "Over all stay was Great. The Location, the hospitality, Cleanliness and quick replies for and service when ever we needed. Kitchen, bath rooms are good and clean. Beds are done well everyday. housekeeping does an excellent job. Keep It up...", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1013113-r682833617", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "everything perfect", "review": "Good morning Gulam we always try to give the best to all our guest. During the Expo Riva Schuh we add this extra service of the daily cleaning because we know that you have to use all your energy for work! Thanks for this super review! debora", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1013113-r680293577", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "GREAT PLACE", "review": "for us is like be at home. Superior apartments are awesome, location is perfect, great breakfast, evrybody always kind and ready to solve your problems. Bicycle is at your disposal and you can reach all you need by that.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1013113-r679241938", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Large appartment", "review": "Hello Andrea, wow! What a fantastic review! Thanks a lot! No better words to make us so happy! We are proud of our staff that always try to make the guests feel like home! Have a nice day debora", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1013113-r678733839", "sub_review": {"Value": 4, "Location": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "On our way to Austria", "review": "Apartment was great. A microwave would have made it excellent. Very close to numerous restaurants, shops etc. Lovely walk through the park, waters edge to the centre. Free car parking was very limited. Only about 10 spaces, however free parking very close by but up steps etc.", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1013113-r676578136", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "great view", "review": "great view from hotel, also the receptionists were lovely, super helpful with our requests! nice restaurant 5min walk away and also gelato right across the street with it. local food store very close so easy t o do your shopping! our apartment was nice,cozy and clean so absolutely nothing to complain about. plus, Riva Del Garda definitely the best place from the whole lake side.", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1013113-r676402024", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great place to stay in Riva del Garda", "review": "This is one of the best apartments we stay in around the world and the quality and value are top notch. We stay three time a year when we are in Riva del Garda for business and have enjoyed every visit.", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1013113-r664271157", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Best place", "review": "Our best place for a holiday. Excellent apartments, beautiful views from the windows. An available terrace for both rooms. Two-room apartments are designed for families. Debora, Michele, Tomas - always help and professional.", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1013113-r647517403", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Brilliant apartments ", "review": "Great situation opposite Porto St Nicola to the west of Riva Del Garda, for us an ideal situation away from the hustle and bustle of the town centre. We find this establishment first class, the staff could not be more helpful always going the extra mile to help. The `new` apartments are a must as they are air conditioned and of a higher standard. Also included is a secure car park. We have been staying here for twenty years!!!", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1013113-r520498425", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great views and location", "review": "We have been staying here for over twenty years!! The location to the east of the town centre is ideal. It is a one kilometre walk into Riva Town Centre along the lake shore which is very picturesque. The new apartments are all air conditioned and very well appointed. There is a covered care park available at no extra cost", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1013113-r408429494", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fabulous Service & excellent value", "review": "Can highly recommend. Outstanding service by all staff.  Nothing is too much trouble and this starts well before you arrive with exceptional efficiency in the booking process. Deborah and Michelle, the office staff go out of their way to make your stay perfect and their genuine warmth and enthusiasm make every interaction a joy.  We recently spent a week in apartment 306 for a sailing regatta.  This is in the newer building with awesome views of the mountains & lake, however most of the apartments seem to have views even in the older building.  Our apartment was perfect for a couple (and also if you had a child on the fold out sofa bed).  Scrupulously clean and with the luxury of double glazing, air con and block out blinds, conducive to sleeping in.  If you like to sleep with…", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1013113-r375877174", "sub_review": {"Value": 4, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Fantastic value for money", "review": "Views some of the best around The renovations to the new comfort rooms are lovely and easily accommodate 2 adults and 2 older children/teenagers. Our booking was muddled despite a conformation email but we were found a room and happily settled in. Kitchen update is lovely but very minimal appliances. Small traveller kettle and no toaster! 1 cutting knife, a ladle and pasta scoop, a frying pan and 2 saucepans was slightly limiting for self catering. Good wifi connection on this trip- an essential for the family as younger members were able to watch Netflix instead of the local dubbed Italian stations. Free bikes for the duration also essential for getting to and from the sailing club and a balcony with drying rack to dry wet sailing kit. We would happily return as this is our 2nd…", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1013113-r322964806", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "A LOVELY HOLIDAY", "review": "We have been coming here for twenty years and thoroughly enjoyed ourselves due to the relatively quite location on the edge if town. This year we are staying in the new luxury apartments which are brilliant. All air-conditioned with ample power points and free wi-fi. Well worth considering ", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1013113-r296023444", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very good apartments", "review": "We travelled as a family of 6 to stay here for a family wedding on 29th June to 3rd July and would have liked to have stayed longer! We had 2  rooms in the new part - excellent views. The rooms were basic but spotless. The facilities were there ro eat in but we dined out - a taxi to the town square is only 8 Euro or a half hour stroll. My husband and I are not so mobile and there was a lift.   The kids went kayaking - about a 15 minutes stroll. The most picturesque and beautiful place we have ever been to. Thankyou to the receptionist who helped us out on the final day printing off our boarding passes for Ryanair. We will definitely be back!", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1013113-r288463648", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Excellent apartments for sailing", "review": "Big Thanks to the staff. The new rooms are spacious and have a great layout for a person who comes there sailing. There is a restaurant in the hotel - great cuisine and nice staff! The rooms are clean and definitely worth the money spent.", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1013113-r238125620", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Terrible Apartments", "review": "I have stayed in many apartments on my holidays and this is by far the worst complex that I have stay in.It was like staying in a hostel.The kitchen was dirty ,two of the rings on the cooker did not work.I do not know how this premises has a three star rating. There is a lovely view from the balcony and the staff at reception were friendly but I could not recommend this place to anybody", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1013113-r219547670", "sub_review": {"Value": 1, "Location": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Great for the price and the bicycles are a bonus! ", "review": "The flats are clean, and ours had a stunning view of the mountains. Don't expect fancy furnishings, but it has everything you need. They even throw in free use of bicycles which come in handy if you are in the mood to explore or want a quick way into town. The location suited us perfectly, but it is outside the hustle  and bustle of the old town. It was a good excuse for a wonder along the lake shore. We had a great stay! ", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1013113-r210767479", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great location & value for families.", "review": "WE stayed 5 nights here with adult children & found the apartment more than adequate.  The mountain view was spectacular & sitting on the balcony relaxing was a treat.  It was a heat w e whilst there and we're asked for fans, this was enough to give relief.  The kitchen was very basic.  There is free use of laundry on site, so this is a bonus.  Also bikes available free of charge. I would say overall great value, good location.  The staff were wonderful, helpful and very friendly.  Not a luxury resort, just clean, comfortable & spacious family style accommodation.", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1013113-r133010476", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}]