[{"title": "Lovely hotel very close to Victoria Beach", "review": "We drove down to Cadiz to celebrate my birthday.  The check-in was smooth and our room was ready. The underground parking garage is located across the street from the hotel and they provide a 40% discount. Very clean and bright room.  We were able to rent beach chairs from the front desk for a nominal fee.  Breakfast was good, whether you wanted a full buffet or just off the menu.  A 2 minute walk to the beautiful, wide beach with soft sand.  A very pleasant hotel with many restaurants near by.  The bus stop was close, which will take you into the old town of Cadiz in 15 minutes.  The bus was great to use.  I'd definitely book this hotel again!", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r719117320", "sub_review": {"Value": 4, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Fabulous Weekend Break", "review": "Thank you very much for your fantastic opinion and description of our services. We hope to see you again on another occasion", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r719107445", "sub_review": {"Value": 4, "Rooms": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Location, location, location ...", "review": "We have just returned from a wonderful 3 night break at this lovely Hotel.  The Hotel is right next to the beach, so the location couldn't be better, there are numerous bars and restaurants in the immediate vicinity, most of which we visited, and the \"Hop-on-hop-off\" bus stop is just opposite the entrance to the Hotel. We mentioned on our booking that it was a \"Special occasion\" and were afforded an Apartment on the 6th floor, with full views of the City and beach, so this added to our overall experience. The staff were all very helpful, but special mention must go to the young lad in the breakfast room/cafe, who went above and beyond, to ensure our stay was perfect. The breakfast was very nice, which considering there were a host of different nationalities, shows how much they try to please everyone. Parking was very easy too, with a car park approx 15-20 metres away, which is also discounted, if you are staying at the Hotel. All in all, a lovely weekend, so thank you Christina and all of your staff for a great time.…", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r717080861", "sub_review": {"Sleep Quality": 4, "Rooms": 4, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Great Family Suite on the Beach", "review": "Thank you so much for your opinionGarry T. We are glad to know that you have been very good with us and we hope to see you again at another time.", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r708158749", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "A basic, clean hotel", "review": "We (me and my old mate Johnny) drove down to Cadiz after 3 days in Seville. We flew easyJet from Bristol. Just 1hr 20mins drive. The Hotel Playa Victoria is located right on the beach and we had no complaints. Check-in was smooth and welcoming and the car park under the hotel had plenty of spaces. Yes, it's tight but just take it slow. The room - 414 - was a corner room at the end of the corridor on the 4th floor and boy, what a view. A twin room, bit rough around the edges. By that I mean the furniture was a bit scuffed that's all. Its a beach hotel. Lovely balcony and views front and to the right towards the Old Town. Fab beach. Stretches for miles. The room was clean, spacious, loads of storage, comfy beds and a big bathroom. Shower in the bath but you can't have everything. Loads of hot water, loo & bidet. Lift close by takes you down to the pool & beach. Sun loungers & umbrellas available out front (public beach) for 6 euros per day. Breakfast busy and plentiful. Don't forget to order fresh coffee (and tea) for the table rather than get it from a machine. Loads of bread, fresh fruit, yoghurt, cereals, cheese & meat, pastries etc. Best to get there before 9am if you can. Lots of restaurants in the area within 5 minutes walk. Arrebol was nice. Take a cab or an Uber to the Old City for about 7 euros (one way). Great restaurants, cobbled streets, shopping & culture (cathedral and tower are great) to be had there. We ate at Taberna El Tio de la Tiza (opens at 9pm) just like Rick Stein. Fab fishfood. Also Los Napolitanos for a very reasonable Italian in a side street. Nice staff. We would have tried Confusione for pizza but didn't get there. Took the car to Sanlucar de Barrameda one day. Lovely place to visit. Great squares, restaurants and beach.All in all, Cadiz surprised us (positively) and The Hotel Playa Victoria was a great place to stay. No real negatives. I think we paid around £159 for the twin sea-view room with breakfast.…", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r682726709", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Charming Hotel", "review": "Charming and reasonably priced. Love this place! The beach is right there! The room was spacious by European standards, clean and well appointed. We had 2 twin beds pushed together. Might as well have had one bed! Apparently this is fairly typical in Europe. But the bed was comfortable. In-room safe and coffee service was appreciated. Parking is not provided by the hotel but public parking is just across the street and discounted by the hotel.", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r661244055", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Wonderful experience", "review": "Dear Luckme0. Thank you very much for leaving your opinion. We are very happy to know that you have enjoyed our hotel. On another occasion ask for a double bed! we have twins and double beds ;)  .. We hope to see you again in the future.", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r643957892", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Lovely hotel & excellent value", "review": "We stayed in this spa hotel for two nights over New Years Eve. The staff are very friendly, the room spacious and clean, small balcony, kettle and fridge. We enjoyed the spa experience very much. The spa staff couldn't have been more helpful and friendly. We used the jacuzzi and even had a massage. I can highly recommend Almunden as a masseuse. Very professional and relaxing. The location is great - beach promenade right next to hotel, plenty of restaurants and bars. A long walk or short taxi into Cadiz center as well. The Cadiz food market is great with so many different food options ( also vegetarian ) - they are open every day!  All in all a top notch experience.", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r640206543", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Good value in the winter", "review": " Thank you very much for your wonderful opinion, ChesterNewbie. We are glad to know that you have also enjoyed our Spa services. We hope to see you again on another occasion and we hope that our city has seemed beautiful and want to return to visit", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r633821443", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Well priced off beach hotel.", "review": "Enjoyed a 3-night stay here in December, room overlooking a small square all decorated for Christmas.  Modern hotel, large room, equipped with fridge & kettle.  Approx 20 min walk to town along the beach promenade or 5-min bus from outside hotel.  Plenty of cafes and restaurants withing walking distance. Helpful and friendly staff at Reception.  Recommend this hotel for a visit to this wonderful city.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r588444797", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Great! ", "review": "£75 for one night for two people. Stones throw from the beach. Good 30 minute walk to the cathedral and old town. Lovely clean and fresh room, would definitely stay there again. Plenty of bars and restaurants around the hotel. Didn’t have a car so can’t comment on parking. ", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r572197083", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Few days away", "review": "Thank you very much for your opinion, Oortracey. We hope that you have enjoyed in our city and we wish to see you again very soon!", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r558830446", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Friendly, comfortable hotel in a great location", "review": "We were very pleased all round with the hotel! Easy to park and unload with the underground car park just outside and a discount with hotel. Friendly, helpful staff. Room very comfortable and clean. Breakfast had everything we required.  The price was very reasonable for the time of year. Would definitely go back.  Cadiz is a Fascinating place, lots to see and beautiful Sunsets. 😍😍", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r536569676", "sub_review": {"Value": 4, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Lacks the very basics for a 4 star hotel", "review": "Thank you Linda! We hope to see you again very soon! ;)", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r536151138", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Cheap", "review": "Cádiz for me was perhaps the highlight of my Spanish holiday in 2017: I loved this historic, beautiful place. I was also most pleased that I stayed at the Hotel Spa Cadiz Plaza. I hadn't intended to stay at a hotel close to the city's famous beaches but somehow I misread the information on the internet. A happy mistake for me! The walk to and from the historic centre of Cádiz along the beachfront was always delightful (there were good, inexpensive public buses as well). While my room was spacious, clean and most comfortable, I guess what impressed me most about the hotel were the people. Reception, cafetería and breakfast room staff were so friendly and welcoming. And the breakfasts really pleased me too. This would be a place that I'd love to return to if I come to Cádiz again.", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r524931129", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": " Good value and location ", "review": "My partner and I stayed here in August on honeymoon. The hotel is located close to Estadio train station and if you get an ocean view - which we did - you can see the beach from your room. The room was good and we had a small patio which was nice. The toilet unfortunately ran all the time and the shower wet the washroom easily while bathing. That said, there is very good value for money here. Wi-Fi is strong and the air conditioning is very effective. I would suggest this is likely a higher end three star hotel, but for the price and location, we were quite pleased. Note: If you don't take the elevator (where signs are posted) you may not know you can rent umbrellas, chairs and towels for the beach as a good price. We didn't see this until we left after buying these things!", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r517723944", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great Hotel in a wonderful location", "review": "Thank you for giving us your opinion.We hope you enjoyed in our city", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r511673030", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "No furniture on the balcony", "review": "We came to Cadiz to relax on the beach (after a couple of days full of sightseeing in Seville) and we really did relax. The hotel is very clean and full of light, rooms are big and airy and we had a perfect view of the beach from our balcony. The beach is super nice, wide with white sand and calm waves. There were a couple of down points: 1- the hotel doesn't have parking so you have to park your car in a paid parking nearby.  2- despite the name of the hotel (Hotel Spa Cadiz Plaza), and despite the fact that the spa was highlighted in all the pictures of the hotel, the spa area is not for free even for guests. This was disappointing, of course spa treatments you expect to pay but they were asking us 25 eur a head to use the small jacuzzi and later we read that they allow…", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r504233432", "sub_review": {"Sleep Quality": 4, "Rooms": 3, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good Hotel", "review": "Thank you for your opinion GoliRem. We hope to see you another time! Best regards", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r498512116", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Priceless Day off!", "review": "We stayed here for three nights in the first week of May.The big hotel opposite would have been cheaper but I wanted a smoking room so that I could sit on the balcony with a glass of wine and a cig.  The room was a good size but the balcony was very narrow and had no furniture so when we went out, I mentioned this to the lady on reception . She said she knew that there was no furniture and suggested that I find the house keeper the next day and see if she could help; this was not the response that I expected from a four star hotel. The room we were in was next to the lift, which caused no problems, but our balcony was at right angles to the room next door , and the one night it was occupied we didn`t feel comfortable sitting out ( we used the chairs from the room). The shower…", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r492814554", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Pleasing stay in Cadiz", "review": "After spending a couple of hectic full on days in Seville we were pleased to arrive in Cadiz. We were very happy when the sat nav led us to Hotel Spa Cadiz Plaza. Set just off the sea front we were able to pull up outside the hotel to unload our luggage, we could stay there for up to an hour. There is no car parking at this hotel but there is an underground car park opposite the hotel, it is cheaper to pay for the number of nights you are going to be there when you arrive you are able to take your car in and out as often as you please. The hotel was very comfortable we could see the sea from our room. We didn't eat in the hotel as we were on a tight budget we had breakfast at a cafe on the main street called PAN you could get a large cup of coffee which suited us well, the…", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r479549406", "sub_review": {"Location": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Wonderful beach", "review": "Thank you Margaret R! we hope that you have enjoyed in our city and want to return soon. ;)", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r474029353", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very helpful & friendly staff!", "review": "A gem of a port on the very southern tip of Spain...I have never seen the Atlantic ocean ( usually grey in all places I have seen it) look as blue green as the Mediterranean Sea!  Walk the relaxed, inviting ramparts.", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r465580575", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "The Hotel Spa Cadiz", "review": "Thank you so much for your opinion. We are glad to know that you have enjoyed the charms of our city and hope to see you again on another occasion.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r453294128", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Nice affordable cozy hotel room in Cadiz", "review": "Everything was great - the location, the rooms, service, etc. The only thing we noted was an odor in our room but to be fair we did not complain so we did not give the staff a chance to fix it. The staff was very helpful & personable - gave us lots of info re: Carnaval. Would definitely stay here again - especially in warmer weather as it is 5 mins. from the beach.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r436182902", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Ok!!!", "review": "Hade one night in here 27/10 the rooms are ok and clean but very old needs to get overhauled anytime soon. Ok to stay one night but for a week vacation I would have choice something better. Location is good if you are looking for the beach expect a walk of about 15-20 min in to the old city. ", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r432730718", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great Location next to the beach and great food.", "review": "Dear Capitan80. Thank you very much for your comment. The rooms and apartments are renovated in January. We renew public areas shortly. So we hope that the next time you come, will like it. ", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r430645964", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely hotel, lovely staff", "review": "Stayed for two nights! Amazing place with great staff, especially the wonderful lady on the reception.  Thank you because you made us feel very welcome! There are a couple of spaces to pull up outside the hotel to drop off bags etc.    The hotel is on a square with the front facing the square.  If you are driving the car park that you need is called Emasa, take ticket and then go to the man in the booth and ask for the hotel discount. the ticket will then be converted into a ticket that you can use to come and go for the rest of your stay.  The room was lovely with a small sea view due to the other hotel being in front of it but don't let this put you off.  The room was large with very comfortable beds and very clean with a great bathroom.  The room had a kettle, with tea and…", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r427524603", "sub_review": {"Location": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nice hotel ", "review": "Dear Gaily1. Thank you very much for your excellent opinion and description. We are so glad for it!! Hope you have enjoyed in our wonderful city and want to visit us again in the future. Best Reagrds", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r409901751", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Location great but.........", "review": "Hotel and room  The hotel is set about 25 metres back from the beach. Most rooms have a view onto the sea though not what you would call a sea view as it is between buildings, and no 'sea view' is claimed by the hotel. The rooms are quite simple but roomy enough with good beds, chairs and a desk. They all seem to have a balcony with chairs to sit out. If you're British, you will appreciate the kettle, tea and coffee! Nice touch in a Spanish hotel which suggests they listen to their customers. The staff on Reception are lovely - friendly, helpful and chatty. Some speak better English than others but you should really give your Spanish a go too even if straight from the phrase book - it is always well-received. They will set up visits for you (Donana National Park, Andalucian…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r397626336", "sub_review": {"Sleep Quality": 4, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Lovely Hotel", "review": "Everything you need form a reasonably priced hotel, rooms are clean and modern, staff are very helpful and friendly, wifi is good and free, location is great 100 meters to the beach.   You can get a 50% discount at the car park opposite the hotel.   Breakfast is not great though. I wouldn't bother with breakfast, there is a cafe opposite the hotel much better than the breakfast in hotel.   All together a nice clean, reasonably priced hotel. ", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r375583519", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Above Average for Area", "review": "Dear Callum W. Thank you very much for your kind opinion. We hope that you have enjoyed in our wonderful city. Best regards", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r363061637", "sub_review": {"Location": 4, "Sleep Quality": 4, "Service": 3}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Great value beach hotel with Cadiz old town a 5 minute bus ride away.", "review": "Good location overlooking plaza Victoria and steps away from Playa Victoria.  Spa is also decent and reasonably priced.  The better restaurants are a little further away towards the old city.  Local gym only 1 euro with hotel key card.", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r350902357", "sub_review": {"Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Awesome", "review": "Dear Eric P. Thank you very much for your opinion. We hope you have enjoyed in our City. Best wishes", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r335892646", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Peaceful luxury.", "review": "Good room space and a decent sized bathroom. Very pleasant breakfast buffet. Great location for Cadiz beach. Sea views are partial, but the beach is 100m walk away. Very good price for such a location.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r315831186", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Good prices but no ocean views", "review": "Selected this hotel for the prices and location. Steps to the beach with excellent access to buses taxis etc. no room has an ocean view! Hence the better prices. Rooms are average size and amenities are average as well. Opt out for breakfast not a good selection. ", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r311015191", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "The beach, friendly staff, but overrated!!!", "review": "Dear Eddie R. Thank you for your opinion. Hope you enjoy in our fantastic city. Best wishes!", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r304611318", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "nice hotel in good location", "review": "Recommended if you are a lazy monkey and wanna spend all days at the nearby beach. Which is lovely but a little dirty. About the hotel...well we've stayed for 9 days, and we were offered a discount for the breakfast. Nice one! But the menu is very simple & always the same. The staff was friendly but the owner should take care about the standard. The cutlery was wet, and some plates were still dirty. Our room was clean, but the toilet needs a good scrub. It should rather be a 3 star hotel, definitely not 4. ", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r301331391", "sub_review": {"Location": 4, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great hotel and great location!", "review": "Dear Ewa F. Thank you very much for your opinion. It is very important for us. We will do everything to improve our service. Best regards", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r272941673", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "A very nice hotel", "review": "spent one night at this lovely hotel near the beach. good service and lovely clean rooms with tea coffee available in the room- really needed after road trip. located very conveniently near several great eating places and walking from shopping malls too.", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r238951640", "sub_review": {"Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "A nice hotel near the beach", "review": "The beach with troves of bars and restaurants are just 50 meters away, the old town about 2 kilometers away. The hotel parking is right next door at a parking structure. Good breakfast, but the rooms can be a bit noisy, both through the thin walls and from the street.", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r216062718", "sub_review": {"Location": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Nice hotel", "review": "Clean, nice location. Close to the beach and many beachfront restaurants and tapas bars. Highly recommend Mandilla on this stretch. Great food. Hotel cons: really thin walls so bring ear plugs. Staff not as helpful during the day; nighttime desk clerk very sweet and helpful. Beach towels are 1.5 euros each and they are badly worn and small. The power would randomly go out in the middle of the night which meant the A/C would go off. You have to get up and reset by reinserting your room key and then manually turn on the A/C. This may certainly have been my own incompetence with European power, but it happened both nights we stayed. Pros:  rooms clean and nicely appointed. Bathroom has hair dryer and shampoo, shaving kit, dental kit etc.  The beach is about 50 feet outside the…", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r206214260", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great place for long stays!", "review": "Thank you for your opinion, is very important for us. The beach towels we will change in few days for better ones. We don´t know why your key doesn´t work in the room, because this is not usual. Anyway, we are so gratefully you choose our hotel during your stay in Cadiz. Thank you", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r205716831", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "satisfactory", "review": "I sometimes travel and stay in the Cadiz province for business purposes.  During low season, I'll stay in Cadiz city since prices are so low, and I have stayed at the apartments of this hotel.  The staff is very friendly and accommodating. If you stay in their apartments, you are provided with everything you need for long stays! spacious common room, small kitchen with a washer, a balcony.  If I'm lucky enough, I'll sometimes have a direct view of the beach.  I love hearing the ocean and feeling the ocean breeze and I lay down in my room, absolute bliss!  The hotel is conveniently located by Playa Victoria and is within walking distance to everything, including the historic section of Cadiz.  I love walking out of the hotel to go running along the beach path.  I'll definitely…", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r180420879", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 3, "Rooms": 2, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "AVERAGE HOTEL IN A GOOD LOCATION", "review": "Guys seem to be a bit confused themselves about what category are they in - 4 stars or 3.  They were 3 definitely in the past,  as they still sell(!) slippers with 3 stars printed, 3 stars are printed on the emergency exits map etc. Now they try to fit in higher class. Better they should not. Breakfast is not included, hotel is a bit \"tired\", rooms are small, views from certain rooms are like from prison cells, it is not in the center, nor right on the beach. To be honest - should be listed as maximum 3*", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r177214851", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 1, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Mixed Review", "review": "I cannot stress enough how nice and professional the staff was.  The hotel is conveniently located near Victoria Beach and walking distance to wonderful restaurants.  However, there seems to be a problem with either their plumbing or circuity to the sea because our initial delight turned to disgust when we returned to our room after a great dinner , stroll along the promenade and over all excellent evening in Cadiz.. There was a smell of sewage when we stepped off the elevator that became unbearable once we entered our room.  To their credit, the hotel relocated us immediately to an apartment on the 4th floor.  So quickly that I suspect this was not the first occurrence. Curiously, upon checking reviews (unfortunately AFTER our stay) I saw this very comment on past posts that…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r174898510", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 1, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Great Hotel and Location", "review": "We were very fortunate and got upgraded to a one bed apartment which was lovely.  The staff were very friendly and helpful, with the exception that we had to request that the sofa bed be made up for our son as they only had one double bed for three of us!  When I asked they said that our son could share with us (he's 14!).  However, once this was done then you couldn't fault the hotel.  We were minutes from the lovely Victoria beach and restaurants and a number 7 bus took you into the old town which was absolutely wonderful with so much character.  Parking worked out quite expensive at around £20 per day, so without a car would be better.", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r174277835", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Can't wait to return!", "review": "Stayed here on the nights of Fri 5th April and Sat 6th April on the First Floor. Really liked my room: Functional, comfortable, great bathroom, the best selection of bathroom toiletries ever! Sea view from my room (101) but be aware that the hotel is a couple of buildings back from the sea front. This means that you can see the beach and the sea from your window but you are not fronting on to it. For me, the best part of my stay was, without a doubt, the staff. Friendly, efficient, and will do all that they can to make your stay as pleasant as possible. Nothing seemed to be too much trouble. This attitude really swings it for me when choosing a hotel. This is not a boutique hotel and they don't pretend that it is. What it offers is excellent value for money, a good location,…", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r157080772", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Weekend stay", "review": "We stayed at the hotel on the weekend of April 5 to 7. Friendly staff on check in and were given a room on the first floor. We went out for dinner and when we came back there was a strong sewer smell in the room. The front desk was very apologetic and immediately gave us another room on the 5th floor (an apartment) which was huge. We did not eat breakfast at the hotel but chose a café across the street.   The hotel itself lacks any charm, but ok if you are out all day sightseeing or at the beach.  Great location on the beach and access to lots of restaurants within walking distance. We took a bus into town to see the old part of Cadiz (no. 1 bus across from MacDonald's, only 1 euro) and spent the day wandering the streets of the old city.   Great place to spend a weekend !", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r156943598", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Fine but nothing special", "review": "We spent two nights at this hotel during the July high season. The price was fine, and if you're there for the beach, the location is great. That said, we ended up spending very little time at the beach, so the walk to the historic downtown along the promenade is definitely on the longer side (30-45 min each way).  We didn't have a bad experience, but there are a few reasons why we were not fans of the place (it's somewhere between a 2 and 3 star rating in our book, but we've given it 3 since it was a decent value).  First, they don't seem to have non-smoking floors, and we had what must have been chain smokers on our floor. There was no way to prevent the smoke and smell from coming into our room, even when putting a towel under the door, so the air was perpetually unpleasant,…", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r140333652", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great value and on the beach!", "review": "Though this hotel is 2 km from the old town, it is a simple 10 minute bus ride, 5 euro cab ride or a pleasant bike ride (u can hire bikes at the hotel) along the esplanade. Don't let the distance from the old centre deter you from staying here. The beach is at your doorstep and staff are really helpful!!!", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r140097549", "sub_review": {"Value": 5, "Location": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Nice hotel", "review": "The hotel is right by the beach, a little further from the city center. Rooms are spacious and clean and they all have small balconies. The bathroom was nicely appointed and the internet worked fine, although you need an ethernet cable to connect. The minibar was free for one night but it only had water and juice. They rent towels for the beach at $3 each. Staff was helpful and attentive. Within walking distance of many restaurants. Great location if you want to be near the beach.", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r137028389", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "We really liked this place", "review": "After 5 weeks on the Camino we just wanted some nice beach. We were only gong to stay in Cadiz for three days and then go to Morocco for a few days. A day trip convinced us that wasn't a great idea and we decided to stay on. Pretty much chose it off the tripadvisor site when I couldn't get a room at the Victoria.  The hotel is blah. The breakfast is blah. Servers in Spain drive me nuts. I like to sit outside and drink coffee while I read. Sometimes I smoke while I do it. So every morning I would head outside when I went down to breakfast. One day I told the girl I anted cafe con leche as I headed out. As mentioned by other reviewers, you get four items off the menu. I tended to get 4 cups of coffee. So I order it as I walk through. I do this because I know there will be at least…", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r134132392", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "A great place near a great beach", "review": "The hotel's staff were really helpful, the reception were fluent in English and the breakfast staff happy to manage with our limited Spanish. The hotel is near a great beach, good restaurants and a short bus ride to the centre of town. We recommend this hotel if you are looking for a great surf beach at your door.", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r131919248", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "What a scam", "review": "Although the staff are very polite and helpful the hotel's policies suck. The so called free minibar on your first night consists of 2 bottles (small) of water and 2 (small) cartons of orange juice. Breakfast is restricted to just 4 items off the menu and no refills!", "date": "March 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r127057461", "sub_review": {"Value": 2, "Location": 3, "Rooms": 3, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 3}, {"title": "Great staff, pleasant stay, very good location", "review": "I have been at the hotel with my husband and we chose it because is very good located. However, what surprised us was the friendly and helpful staff and the cleaning.  We had a very pleasant stay and we loved the spa... very relaxing and higly recommended.", "date": "March 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r126929977", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A little gem on the sea", "review": "The Spa Cadiz Plaza is a warm and friendly hotel, just around the corner from the beach and access to miles of scenic beach front walkway filled with lovely restaurants and bars.  We found two restaurants in particular that were exceptional .  For great tapas try Arana,  and if you are looking for a superb meal in the evening - Arte Serrano (was so good we went twice). The hotel is located on Victoria Plaza where the \"hop on-hop off\" bus tour stops, so very convenient to walk less than a minute and catch this bus; which is a wonderful way to get an overview of the city, and then decide on your destinations of interest. The staff always greet you with a pleasant smile, are very helpful, accommodating, and speak English.  The only strange thing is that since we booking online and…", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r119616268", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Difficult to find a fault!", "review": "This hotel was picked largely at random but seemed convenient and good value.  It was all of that with very helpful staff and a lovely room.  Arriving by car, there is an underground car park in the square where the hotel is located.  There are two excellent bus services from this square right into the heart of Old Cadiz.  The breakfasts are nothing to get too excited about but at 5 euros on top of the tarrif, its not bad and competes with the less convenient cafes.  I would definitely recommend this hotel and we will use it again when we revisit Cadiz - a city well worth of a visit for those who don't know it.", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r118615394", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice hotel in a good location", "review": "The hotel is next to the Victoria beach, close to numerous bars, cafes and restaurants yet only a 45 minute stroll along the promenade from the centre of Cadiz.  The rooms are average sized and are modern and very clean.  The hotel staff were all very helpful and friendly.  There is only a very small menu for breakfast, which is served to your table.   The cafeteria where breakfast is served is very small and basic.   I would certainly return to this hotel but maybe on a room only basis as there is no shortage of places close by for breakfast.  An ideal hotel for a short break to the lovely town of Cadiz.", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r118436773", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Bit expensive for what it is", "review": "You are paying for the location - the hotel is clean, staff are nice and its well located about 45 minutes to walk to old Cadiz and its seconds from the busy beach. I would not recomend breakfast - and there are plenty of places to eat outside. Its good - but we paid over 100 euros a night and there was an absence of wow factor - parking is just opposite so thats easy. Would we return - well yes if there was nowhere that scores better on this website available.", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r115446280", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely comfy hotel by the sea", "review": "This hotel was a perfect oasis of comfort with a good location right by the sea and within a walking distance / short taxi/bus drive from the old town. The staff was friendly, the rooms were clean, modern and pretty and breakfast was adequate with various options that were served to the table. I would return here!", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r106778260", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Just perfect", "review": "Just what I wanted for my holydays. Near the beach, new hotel, comfortable room, good spa services. I´ll come back", "date": "February 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r28737435", "sub_review": {"Value": 4, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Awful", "review": "We had an awful stay at this hotel. We booked it late and the cost for one night was 90 Euro without breakfast. We didn't particularly want to stay right in Cadiz but at the time we had no choice. We specifically asked for a quiet room. The man at the front desk told us that there were works going on on the other side of the hotel and put us on the other side. We had asked for a non smoking room and got a smoking one, the smell was awful. We did not get ANY sleep that night as there were mosquitoes and on asking did they have anything we were told no. Tip: never go to Andalucia without a coil or plug. Also, the next morning, bright and early i.e. 6am we were woken up to, yes, works. A pneumatic drill to be exact.  Now the 'funniest' thing in all this, is we were told by the…", "date": "July 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187432-d1017701-r18454479", "sub_review": {"Value": 1, "Location": 2, "Check in / front desk": 2, "Rooms": 2, "Cleanliness": 3, "Service": 1, "Business service (e.g., internet access)": 3}, "travel_purpose": "", "rating": 1}]