[{"title": "Club Hotel La Vela in Torbole, Lake Garda", "review": "Club Hotel La Vela was a wonderful hotel. We travelled with Harry Shaw Coaches for our holiday package and we had a fantastic time. The hotel was clean and staff were very kind and helpful, food was ok for a fussy vegetarian who missed the muesli when it ran out! We would love to come again!", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r721912567", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "A pleasant, comfortable stay.", "review": "Just returned from a six night stay at Club La Vela with Cairngorm Travel. We had an enjoyable week. The hotel decor may be a little dated but it is very clean, with comfortable beds. The bedding and towels were changed twice during our stay. The staff were very friendly and helpful and the bar prices are very reasonable. Location is perfect, in the centre of Torbole, 3 minutes walk to the lake and the bus stops are just outside the hotel. Our only niggle is about the food. Breakfast is good with a good selection of both hot and cold items, various breads, fruit and yogurt. Evening dinner was disappointing, a good and very varied salad bar with breads. the disappointment is in the hot selection. Always a soup, 2 quite tasteless pasta dishes, then the meat and fish, poor quality and over cooked. The single vegetable is frozen as is the potato dish.(Wedges etc. most nights) I can't comment too much on the desserts as they are not my thing, but other people at my table expressed their disappointment. My husband had bought a carafe of red wine at the bar and asked for a glass of water to accompany it and was told quite abruptly by the young woman at the bar that he could not have the water, which we thought was quite rude and uncalled for. A friend went up and asked for a glass of ice and was given it. What is the difference? Overall though our stay was good.…", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r715058172", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Fantastic", "review": "Total value for money staff are very helpful the hotel is modern clean rooms are large breakfast was very nice it's location is very easy to find close to the main road in to torbole it's a very sort walk from the lake it's in the main town so close all bars and restaurants there is secure free parking would highly recommend", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r712015739", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Poor hotel", "review": "4 star hotel takes some believing.  I give it 2 stars. 1 for the staff who were lovely and 1 for the roof that kept us dry during the rain. Rooms utterly substandard and no comfort at all. Hard mattresses and extremely dated bed covers. Strange sofa/ bed thing that was neither use nor ornament really and also uncomfortable.  Extractor fan in bathroom ( no bath by the way) sounded like a dentist's drill when it was turned on. Air conditioning wasnt working. Paint peeling off the balcony ceiling. Food was ok I suppose and there was plenty of it but you have to queue if you are not first in to the dining area. ", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r707101778", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Fantastic service and hotel", "review": "We loved this hotel. Would give 10 stars if possible.  Clean spacious rooms. Great pool with jacuzzi.  Lovely breakfast with so much choice.  All staff so helpful- they are a credit to the hotel. Will definitely go back. Excellent value for money too.", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r703434637", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Hotel la vela", "review": "This hotel is in bad need of a bit of loving care. Air con not working in our 2 bed apt and not fixed despite two requests. Here with family of 5. Asked for basic kitchen items a number of times which didn’t arrive. Staff at reception seem to have a default of ‘sorry not possible’ to practically all queries. Great location but one would need to be self sufficient, car parking very tight", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r700573538", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Convenient location", "review": "Great hotel location, quiet area with bars and restaurants a few minutes walk if you want a bit more liveliness and there is also a great vibe on the lake shore with bars and live music.  Hotel is comfortable and clean, the pool area is not large but has plenty of loungers and outside tables, nice to use in the evenings whilst enjoying a cocktail from the bar.", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r693505899", "sub_review": {"Sleep Quality": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Stay here for a week from 23-06-19 until 29-06-19", "review": " The hotel was very good. The rooms were really good, there was a fridge it was very useful as the weather hit high 30c and over 40c in the middle of the week. Air/con was really good and kept room at a nice temp. the only thing missing was a kettle to make a drink, but it was fine. Food at hotel was good and plenty to choice from. Swimming pool in nice setting. Not far from Lake Garda it self a lovely stroll and very pleasant to walk about plenty going on. Had a lovely stay, would go back again no problem.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r687387757", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "A good base when visiting Lake Garda", "review": "Torbole is a great place to stay and the Club hotel La Vela a good base. We stayed for six nights. The hotel was clean and tidy throughout. Though small, our room was clean and perfectly adequate for our needs. It was located in the Annex and looked out on the mountain range at the rear of the hotel. The cleaner ensured our our room was squeaky clean and changed the towels and bed linen several times - a must given the temperatures (min 36, max 43). The hotel is about 10 minutes walk from the lake.  The staff were friendly and attentive - without being overbearing. Service at the bar was very good. The food was mostly good; pasta dishes (perhaps not surprisingly) were good as were the stewed sausages. Breakfast was a bit hit and miss; scrambled egg good, bacon often cremated,…", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r686366883", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Lake Garda with Leger", "review": "Having read assorted reviews from good to bad I went with an open mind. My 'single' room was a double in the annexe on the ground floor - I actually had a small private 'garden area' with 2 loungers and it was very quiet. Despite being told we would have a cold meal as we were arriving late in the evening there was a 3 course meal waiting for us at 10pm with a choice of hot starters & mains. All our meals were the same as all other guests with a good choice for all courses (unlike some previous Leger holidays where we had a set menu) The drinks were inexpensive and large measures for wine/prosecco etc. Despite there being quite a lot of young students there they were all well behaved and the hotel had a good family atmosphere. Would go there again.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r685716480", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Not up to 21st century standards", "review": "On a Leger holiday coach trip for 5 days. After a 12hr drive to arrive in our room was a huge disappointment. It looked dated and tired, the only decoration was the nail in the centre of the wall over the bed where we presume a picture once hung. No tea/coffee making,no British channels on the TV.Bed had sheets and blankets,what ever happened to duvets. As for the bathroom: the toilet flush did not work all the time, water drained out of the basin as plug did not seat properly, toiletries were cheap. For the size of the hotel the bar area too small.Dinner and breakfast was buffet style.Food was pretty good and plentiful.The saving grace was the hotels location. I summary the rooms in this place need a serious refurbishment.", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r671934754", "sub_review": {"Location": 4, "Sleep Quality": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Coach trip to Lake Garda.", "review": "Everything about this hotel was fine for the 5 days we were there.   All the staff were friendly and helpful.  The rooms although basic, very clean and had everything required.  We did not use the TV so cannot comment. The food, although not the largest choice, was plentiful and well presented.  Drinks at the bar were not expensive.   Altogether we enjoyed our stay and beautiful lake Garda was an easy ten minute walk away.", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r671800537", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely little Hotel.", "review": "Stayed here in July 2018. My wife and i stayed there for a week on a Legers tour. We found the staff to be pleasant, and very helpful when needed.The food was  good as was the service. Rooms were clean and comfortable, the bar was a nice place to unwind after a full day. Would go back to Club Hotel La Vela again.", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r661190897", "sub_review": {"Value": 4, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Steve Smith", "review": "Club Hotel la Vela is an Italian 4 star Hotel with 2 star rooms.we stayed for 8 days as part of a Leger coach tour.  The hotel seems to specialise in coach tours and with exception of the rooms functions well with friendly professional staff. The rooms let this hotel down badly and are fitted with old melamine style furniture and include an ugly boxed unit which contains items for self catering families. The beds are ok and are comfortable. The bathrooms are fitted out ok but have the smallest sho wer units I have ever seen. If you drop the soap good luck as they are only about 2'6\" square.Bruising and bad language are guaranteed. The tv has numerous channels but only 2 in  English cnn and dw...cnn reception was unwatchable and dw quickly mind numbing.  Wifi only seems usable in…", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r631858022", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Long weekend Lake Garda", "review": "We went for a long weekend in Lake Garda at the Torbele end and wanted a good budget hotel. La Vela was a pleasant surprise as we usually go for more boutique accommodation, but this was very good. The room was larger than expected, a good size and very clean with a nice balcony. There was a swimming pool, but as it was not heated it was far too cold to go in, however, on the whole the facilities were very good. Lots of choice at breakfast, good car parking facilities and very close to the lake, 5 minutes walk. Good selection of restaurants and walks within walking distance and for toddlers/young children there is crazy golf and two play grounds one next to the hotel and one next to the lake. There are lots of trails for biking, mountains for climbing and water for any type of…", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r627034426", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Stayed at the hotel as part of an organised tour.It was great,decent rooms and great food and service", "review": "Excellent hotel to stay if you are planning on visiting the towns of Lake Garda. The staff were extremely helpful and the hotel is very well situated to visit the restaurants and coffee shops of the town", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r624918866", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Leger Holiday", "review": "This is a very good 3 star hotel.  Food was very good and a wide range of choices.  Our hotel room number 157 was small, exceptionally clean and adequate for our needs. Coat hangers were sparse and not enough for 2 people.After an horrendous 15 hours journey courtesy of Leger Holidays we received a very warm welcome from night staff, a light supper was at our disposal. Nothing was too much trouble for staff who were exceedingly helpful", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r622974444", "sub_review": {"Location": 4, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "A Clean and Friendly Hotel", "review": "I spent 6 nights at this hotel, as part of a Leger coach tour. We arrived later than planned and missed the allocated dinner time slot. However, a quick call from one of Leger drivers meant that the dining staff laid out a cold buffet for us...I thought that was a good touch. The hotel has a relaxed ambience, with friendly and helpful staff.  This hotel is conveniently located. A Co-op is next door, and the lake is only a few minutes walk away....with several bars and cafes to distract you enroute!  There was a good selection of food. I enjoyed my stay, and I plan to return again some time in the future.", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r616873202", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Mrs Christine Shearer", "review": "Hotel conveniently situated within a 5 min walking distance from the lakeside’s numerous coffee bars and restaurants. Extremely clean and very well appointed with hairdryer and toiletries in bathroom. Restaurant is buffet style but with a delicious choice of good quality foods, there is also a well stocked bar where drinks can be purchased inexpensively.  Staff are extremely courteous and helpful.  Exceptionally good value for money .", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r614106845", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "9 day coach tour 25th August to 2nd September", "review": "Went as part of Ledger Coach tour. Hotel clean, staff fantastic, food great. We were looked after very well, as I am Gluten free I thought it may be difficult but no I was catered for very well. Home made pasta desserts and rolls for breakfast. All in all fantastico!!!", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r613472386", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Clean and friendly", "review": "Enjoyed our 6 night stay. Good location in a nice town, Torbole. Can walk to Riva easily too. Food was nice, good choice. Outside Pool was very cold Only downside was our room was made up as a double when we ordered a twin, not ideal when you’re holidaying with a friend !", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r610184321", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "perfect", "review": "Dear Sue, we thank you for the review, that we really appreciate,  We are sorry for the misundertanding in the room and hope that you had anyway a nice holiday on the lake Garda.  kindest regards Carla Bernardi", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r604981612", "sub_review": {"Value": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "P browes", "review": "we are very happy that we stayed there again, it was our second time and everything was perfect!! we stayed in a 4 people room/apartment and had lots of space.meals are very good and the staff is very friendly", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r601557976", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A Little Gem are On Lake Garda", "review": "We enjoyed the hotel very much staff was so friendly room was lovely big bathroom food was very good plenty of variety at breakfast and evening meal drink prices was also good we hope to visit lake garda again", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r601551720", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Not a 4 stars hotel ", "review": "Dear Gemma, many thanks for your review, we are delighted that you enjoyed your stay and hope to see you again soon. Kindes regards, Carla Bernardi", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r600858505", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Lovely Hotel in prime location.", "review": "We stayed there whilst on a coach holiday with Leger  Holidays. This is a really nice hotel run by very friendly staff who could not do enough for you. Club Hotel La Vela has a pleasant bar area, well laid out dining room, a nice sized pool with childs pool, and good pool area. The bedrooms are of good size, very comfortabe with air conditioning. ", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r598481664", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Do NOT choose this hotel if you arrive by car", "review": "Thank you very much Mr. Thomas for your description of our hotel and we are plesed that you enjoyed the stay by us.  Awaiting you again, we remina with kindest regards Carla Bernardi", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r597737902", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Lake Garda tour", "review": "Do NOT choose this hotel if you arrive by own car and expect to access the parking space that was included in your booking. Completely hopeless parking facilities! You probably most likely face paying for parking in a public parking lot.", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r596927279", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Near Lake Garda, 7 minutes walk. Nice pool, great food.", "review": "Dear Customer, I am very sorry to read your review and for the comment about parking. The hotel has approx. 40 parking spaces and a paid garage (€ 15 per day). So far we have always managed all arrivals by car, considering that the spaces in Torbole are very limited, and we have never had any complaints in this regard. I remain at your disposal and remain with kindest regards, Carla Bernardi", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r594320522", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "DON'T WASTE YOUR TIME/MONEY ON THIS ONE", "review": "This was a wonderful base for our Lake Garda tour. In the centre of Torbole and two minutes from the shore.The standard of everything from room to dining was very high. Plenty of choice at meals served by excellent staff. I would certainly visit again.", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r592543222", "sub_review": {"Sleep Quality": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "This hotel was definitely the low part of our Cosmos tour.", "review": "Accommodation is terrible, rundown and very very dated. Excellent location in Torbole but you get what you pay for. Disappointed in Cosmos for picking this hotel as it was below standard considering we stayed there for 2 nights. Air conditioning wasn't poor, bedspreads were very old and filthy. Sofa and chairs upholstery was filthy. And, bathroom was large with a terrible shower with doors that were not on the track properly and therefore not safe to close. That being said the opening was 14 inches (yes, measured it) so I had to turn sideways to squeeze myself into the shower. Could not bend down without hitting my head on the sides - child sized shower stall at most! Breakfast buffet was 2/5 and dinner Included with our tour was edible but that's it. Shame on Cosmos for booking…", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r591785653", "sub_review": {"Value": 1, "Cleanliness": 3, "Service": 1}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Mr.Leighton and Miss Cater Emery", "review": "Dear client, we are very sorry for not having met your expectations. unfortunately we have not been told anything during your stay, we will certainly have intervened immediately; now it is impossible to verify and assure you a pleasant stay. Other clients of you groups were satisfy and left nice review.   We remain available by e-mail or telephone if you will contatc us to clear the situation,  Kindest regards, Carla Bernardi", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r589256520", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great location, luxurious feel", "review": "This was our first time to Lake Garda,Italy.I would highly recommend Hotel Club La Vela.The hotel is just a 2 minute walk from the lake and the staff are friendly and professional.The hotel is clean and comfortable accommodation and the food is lovely and the drinks.", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r585279930", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Decent location, but that’s about it", "review": "Dear guests, we are delighted to read that you enjoyed the stay in our hotel and hope to see you again the future. Kindest regards, Carla Bernardi", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r583905808", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Great base for touring the region", "review": "Stayed here for two nights at the end of a Cosmos tour of the Italian Lakes. The setting is magnificent. Really enjoyed the view over the lake and the comfortable rooms. The hotel is very spread out so if you have trouble walking ask for a room near reception. Food was good but nothing special. Staff were helpful and efficient. Lots of eating places across the road from the hotel.", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r583634735", "sub_review": {"Location": 5, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "HOLIDAY FROM HELL", "review": "We have recently returned from the holiday from hell, with Leger. My wife has walking difficulties and before we booked, we went to extreme lengths to make sure all her needs would be met. This hotel was just one of the many contributing factors that made this holiday a nightmare.. We were assured that we would have either a ground floor room or a room near a lift.  On arrival, we were offered a room in an annex, which involved a walk that my wife couldn't do. After about forty minutes or so we were found a room on the first floor within the hotel and near a lift.  The room was like something from the 1960's. Although clean, it was dated and dour.  The shower was about two feet square, with an entrance of just 14 inches.  Yes, I measured it!  I'm nearly 6'. A child would have…", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r579390189", "sub_review": {"Sleep Quality": 3, "Cleanliness": 5, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Very friendly hotel ...", "review": "Dear guest, we are really sorry, that your stay was not so confortable as you expected and we apologie for our mistake in the allocation of rooms, we did not see that in the notes there was a walker, as we realized it, we changed the room. This room was at that moment closed for floor makeover, had the wait-time waas about 30 minutes at the bar. At breakfast the Hotel manager went immediately to the restaurant looking for you and she apologized, explaining  the mistake. We are normally very attentive to the needs of our customers and this time it is just escaped. Sorry, surely it will not happen again! The small shower, unfortunatley all our showers have the same dimensions; Disgusting food:this is the first complaint about food, as you can read in the other reviews. The TV didin't work with the English channel because there was a problem with the BBC satellite in general, not only from us, now we have settled and our English channels are CNN and DW  Herewith I allow me to copy the comment of a another guest of your group :\"We enjoyed our stay very much whilst on our Leger tour last week. Have not complaints, except maybe softer pillows, but apart from that excellent service.\"  Anyway, we will consider your review in order to improve even more our services and assure all the guest a confortable stay. I remain at your disposal, if you wish to contact us per e-mail or tel. for further information. Kindest regards Carla Bernardi ", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r539436083", "sub_review": {"Location": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good value hotel at Lake Garda", "review": "Having read some bad reviews of this hotel we visited on a Leger coach trip with a little trepidation! However we have to say this is a very good 3 star hotel, if not quite a 4 star, in a lovely location, a few minutes walk from the lake. Our room in the main hotel was comfortable and clean with a lovely view of the mountains, if a little basic, and the bathroom good, with constant hot water and good shower, although this could be bigger! As English, we would have liked tea/coffee making facilities in the room and are a little surprised that with so many English visitors these have not been provided. The food was excellent with plenty of choice especially at dinner, and my only comment would be that the breakfast fruit salad should be fresh, not tinned. Coffee was good which is…", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r533116002", "sub_review": {"Sleep Quality": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "RUN DOWN AND DIRTY", "review": "We stayed at Vela for five comfortable autumn nights. All staff members were very friendly and competent at all times, giving the hotel a relaxed feeling. The beds in the living area were portable and therefore slightly uncomfortable and without reading lights and bedside tables, but otherwise the furnishings were fine. A heated pool would have been nice, but then again the freezing water was an adventure that will stay in our memories. The buffet meals (breakfast and dinner) met our expectations of freshness and variety. The hotel is located central to town facilities as well as the lake and its surrounding mountains, so there is no time for boredom in Torbole.", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r533064319", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Very pleasant stay at this hotel", "review": "Came here on Leger coach trip and had to spend four of our eight nights in Torbole at Club Hotel La Vela after four nights at the Caraval nearby due to overbooking by someone ! The rooms were old fashioned like a gothic mansion and were very red. The shower was very small and everywhere was tatty and worn out. See photos. The food was good at breakfast but poor and similar every evening. Leger holidays are quite good but the food content always lets them down! Come on Leger .... Buck your ideas up....PLEASE !", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r531494864", "sub_review": {"Value": 5, "Rooms": 3, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "never again", "review": "on arrival we could smell damp in this annexe room, the reception staff assured us that it was cleaning materials !!! they then supplied us with a small heater which did not work. the next day after many requests we were given another room which was an improvement. overall the end of this holiday could not come soon enough.", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r530735362", "sub_review": {"Value": 2, "Sleep Quality": 3, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Like A Budget Motel", "review": "Stayed here as part of a tour. There are a number of buildings that surround an outdoor pool. I'm a single traveler but was given an efficiency unit. However, all of the appliances were locked down so I had no use of them. There was a television in the kitchen area but none in the bedroom. Also, there was no mirror in the bedroom so I had to walk out to the hall or bathroom to put on makeup or do my hair. Each room had a small balcony that was connected to the one next door. A bit of a problem because the unit two doors down was playing loud music day and night. It was raining when I was there and you had to walk outside to get to the main building for breakfast. There was a small supermarket within walking distance. Others in my group were staying at the Caravel or Mirage and…", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r526023209", "sub_review": {"Location": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Not Very friendly", "review": "My Wife and I have just returned from a Ledgers coach trip to Lake Garda ,where we stayed at the La Vela, after a very long and uncomfortable coach jorney , we arrived at about 11pm. We knew we would only get a cold buffet for dinner, all we got was hard rolls and a few plates of meat and cheese ,no drinks, concidering the time we arrived, and the fact it wasnt a proper dinner it would been nice if the hotel had given us a complementry drink but no , all drinks had to be payed for , even water, no tap water.  Our room however was very nice , in the annexe, room 719, spotlessy clean, towels  and bed linen changed regullary.. The next day at dinner i asked about tap water, the waitress shouted \" nine , no tap water only at breakfast, whos ever heard of tap water at breakfast?, the…", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r525537697", "sub_review": {"Value": 3, "Sleep Quality": 4, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good Hotel", "review": "I stayed at this hotel only one night for a exhibition, so it was a business trip. Hotel is quite good and clean. Breakfast is very good. Garda is amazing place, I will come back again for a holiday :)", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r522470613", "sub_review": {"Location": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Pawel Matuszewski ", "review": "We had a fantastic time at Hotel La Vela , multi lingual staff was very kind and helpful, there were small problems with the car park space but receptionist helped us resolve this very quickly. Hotel offers typically continental breakfast service, access to nice and clean swimming pool, they also have great locations e.g close to market and bus station. In my opinion Hotel La Vela has been worth the price for their services and I will definitely think to go back again 👏👏👏", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r521019823", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Holiday", "review": "We enjoy a 7 day holiday at club hotel la vela it was very clean the staff were friendly  the weather good the pool very clean the food had a lot of variety bedrooms cleaned on a daily basics fresh towels and bedding changed regular", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r504280463", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nice tourist hotel", "review": "Club Hotel La Vela is a tourist hotel in the centre of Torbole. Rooms are clean and so is the bathroom. However everything is a bit dated and could use some refurbishing. The quality of the food in the restaurant is OK and the staff is super fast. But in the periode that we've been there it was very noisy. And that was for the whole hotel because in our periode it was populated with several groups of German students (a kind of school excursions).", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r500617739", "sub_review": {"Rooms": 4, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Some what disappointed​.", "review": "Dear guest, thank you very much for taking time to write a review and for pointing out the positive aspect of the hotel. In the same time we are sorry for the noise of the other young guest, we will consider together with the hotel manager the best way to solve this problem. They come to Torbole to practice all the outdoor activities that or region offer, and in the evening they should be very tired! kindest regards, Carla Bernardi ", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r497746581", "sub_review": {"Sleep Quality": 3, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Thoroughly lovely hotel.", "review": "Our first Leger coach holiday can not fault the coach the drivers and trips they were fantastic how ever we felt let down on the choice of hotel in Lake Garda (Club Hotel La Vela) the hotel was clean in the separate bloke that we were in. Air con got noiser as the week went on we had a ground floor room with a lounger and a chair no table and lawn needed cutting. Food was same every night. Staff could have been a little more friendly, bar area was more like a café. But the most annoying thing of all was in my opinion this trip was for the over 50s only to be let down by the amount of teenagers at the hotel the noise was loud and you had no chance of relaxing round the pool when you returned from your trips as it was full of kids shouting and throwing things ( plastic bottles )…", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r496179161", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Comfortable tourist hotel", "review": "We have just returned from Lake Garda where we stayed at Club La Vela. We arrived very late after a very long coach journey and, at first sight, felt the room was very basic. However, after a very comfortable nights sleep, we realised what a great room it was. The bedroom was spacious and the bathroom was very big with a lovely shower and lots of room to put things. The bedroom had a great balcony and we were in the annexe which was very peaceful being slightly away from the pool area, often frequented by the school parties that stayed there. Also, in the room, there was a free safe, which was very useful, and a fridge, which we used a great deal to keep drinks in, as the temperatures outside averaged 35 degrees for the whole of our stay. The TV was a large one nicely situated,…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r493303326", "sub_review": {"Location": 4, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Not a bad hotel but...", "review": "I've just spent two nights here and it wasn't a bad hotel just average. The rooms are small as are the beds but comfortable. The air conditioning hardly works.  The food generally was very good particularly the buffet evening meal which was very tasty. The breakfast was more then sufficient. The service from the restaurant was excellent. The bar staff were a very different story.   It was simply impossible to get a drink as the bar was deserted. After ten minutes I complained and Miss Miserable the barmaid appeared and she was completely devoid of any form of joy. As the bar was empty I decided to play my guitar in the furthest point from the bar where it was quiet. Every time I tried to play this woman made the most noise she could. Banging bottles into the fridge, turning on a…", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r491144499", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent location", "review": "Dear Mr Morgan, please accept our apologies for the behaviuor of our employee, who will be convened as soon as possible to undertstand the reason for her way of doing, normally our staff works hardly to give the best service to all our clients, but every suggestion is useful to continue improving ourselves. We are happy that you liked the structure in all the major aspects and enjoyed your stay, we hope to see you again to have the chance to have a drink together. Please excuse us again and accept our kindest regards, Carla Bernardi", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r488771241", "sub_review": {"Sleep Quality": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely central place to stop", "review": "Just returned from a Leger holiday to this hotel.  Hotel is in an ideal position and as previous reviews, is only about 5 minute walk from the pretty lake.  The hotel staff were very friendly and helpful in all areas, restaurant, reception, bar and the lady who looked after our room!  Our room was in the annexe and was very clean and had a large balcony overlooking a small car park area, but had mountain views. We had a little walk to the main hotel each day which wasn't a problem for us. The outdoor swimming pool looked inviting and was well used by the students who were staying there,  I should imagine that the rooms overlooking the pool could be a bit noisy in high season, but our room in the annexe was lovely and quiet.  There was a good choice of food in the hotel. …", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r487235071", "sub_review": {"Sleep Quality": 4, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Average", "review": "Dear guest, thank you very much for taking the time to write this complete review.  We are really happy that you enjoyed your stay in our hotel and in the small village of Torbole, where every services is close to our hotel. We are also happy to hear that you could visit us again in the future, and we are waiting for you, Thank you again and kind regards, Carla Bernardi", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r480411465", "sub_review": {"Rooms": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Coach holiday", "review": "Stopped here with my partner for 5 days on a half board basis.  The rooms were clean and the meals were good quality, buffet style. The only downside was the room we stayed in was the poor air con.  The staff were very helpful and the waiter Elvis was always smiling.   The pool wasn't heated and while is was fine for me, my partner said it was freezing! Best to use when the sun is on the pool.   The WiFI was fine for general use but couldn't use for streaming.  The beds are two single pushed together to make a double.  Also the room we stopped in looked out across the pool and with people smoking at times it wafted up on to our balcony and room so beware!  The hotel is just a few minutes walk into town and about 5 to the beach and If you want to get food / drinks for picnics or…", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r479986799", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Excellent Value", "review": "Well positioned for access to the lake side.  Comfortable rooms, good food, friendly people. I have restricted mobility and experienced no difficulty with access to the hotel or the room.  Friendly staff who were extremely helpful", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r429276257", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely hotel close to everything ", "review": "Dear Guest,  thank you very much for your nice comment. It is a precious gift for us. We are happy to read that the staff was helpful and friendly and also that you were satisfied with your room. Sure our central position gives our guests the chance to reach the beach and the centre of Torbole within 5 minutes walk and this is what they are mainly looking for when they come here.  Thank you again  We hope to see you soon again Best regards  Club Hotel La Vela  ", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r424053246", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Our visit to Lake Garda at Torbole - Club hotel La Vela", "review": "We stayed here as part of a package with leger holidays having read some of the reviews we did get a bit worried!! But it was lovely from start to finish rooms were comfy food was good and the staff were lovely !! It's about a 5 minute walk to the lake from the hotel so not too far to go ", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r423894567", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Amazing Italian coach Holiday.", "review": "Dear Guest,  thank you very much for your review. We are really happy to read that you experienced a great holiday here with us and that you changed your mind despite some comments. This is what is important to us. We hope to welcome you again in the near future.  Best regards Club Hotel La Vela ", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r423167140", "sub_review": {"Value": 5, "Sleep Quality": 3, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Holiday", "review": "We had a lovely stay at Club hotel La Vela.  We were served a meal at 1:30 am - when we arrived - which was extraordinary...it was delicious and very unexpected.    We felt very very well look after -  staff were so courteous and helpful.  We would recommend the Hotel to any and everyone.  We intend to come back soon.    Our room was lovely - with plenty of room - comfortable beds and balconies with superlative views.  Having more electrical sockets would be useful - as we had to use the bathroom socket to charge laptop batteries because there were no other active sockets in the room, unless we unplugged the tv or refrigerator, which we also did.  Otherwise everything was great.  The lift worked well and was reliable - all bathrooms were very clean and the shower was the BEST…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r422358544", "sub_review": {"Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Could do better", "review": "Visited this hotel as part of package so didn't expect fantastic. However a few points that could have made it better e.g. No drinks at all served with inclusive evening meal, tap water at least would have been nice, if you wanted water had to be paid for it. Lovely balcony with chairs but no little table, balconies in main building all had tables. We were part of a group so expected to sit together but if you attempted to sit anywhere apart from your allotted area you were frogmarched to your part of the restaurant where we were squeezed in very tight.  Staff were very good generally and the room was very clean although arrangement of bed was awkward as difficult to open the balcony door and no proper waste bin except for tiny one in bathroom that you couldn't get much in. Also…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r422330698", "sub_review": {"Value": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "A total dump", "review": "Dear Guest,  Thank you for spending some of your time writing importanyt words for us. We are really sorry you were not fully satisfied with your holiday here at our hotel. Regarding drinks in the reataurant obviously depends on what you have paid for or booked trough your travel agency, on what is included in your package. All drinks must be paid if not included, also water. Thank you for appreciating our staff and the clearing of the room.   With our best regards Club Hotel La Vela  ", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r420361200", "sub_review": {"Value": 2, "Sleep Quality": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Holiday.", "review": "crappy Room with a huge pillar in the middle. Third rate furniture. No amenities in the room. Not even plastic cups. The edges bed keeps hitting you in the legs because the mattresses are way short of the box. Noisy with kids running on the at 11 in the night. A road in the back with motorcyclist running up and down blasting their engines. Okay breakfast. moody Wifi. strong smell in the room, somebody dumped the whole bottle of room freshener on a bed and covered it with sheet. Although after making two requests the staff finally came and changed the sheet but turned the mattress upside down, leaving the smell still inside the room causing wheezing and headache.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r420196754", "sub_review": {"Sleep Quality": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great place", "review": "Dear Guest,  thank you very much for your precious comment. We are really sorry you were not satisfied with your stay here with us.  Sorry for the noise during the night, our night porter tried his best to solve the problem. Our hotel welcomes different guests every year including also students and kids. Regarding the road at the back we are also really sorry but we are in the centre of the town and sometimes can happen. Thank you for appreciating our breakfast which is one of our main good points and on which we focus really hard every day.  Hoping to welcome you again maybe in the next future with our best regards Club Hotel la Vela", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r418378754", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A long journey but worth it", "review": "Hotel rooms where small but clean, but lacked some home comforts ,Shower very small patio lights not working, bedside light not working ,bidet not working,not tea or coffee making facilities in rooms and no lounge area in the bar only tables and chairs for dinner . Not one i would recomend for all round comfort. Had to go out to sit comfortabl.y and have a drink", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r418069756", "sub_review": {"Value": 3, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great hotel in a beautiful resort", "review": "My wife and I travelled to this hotel as part of a coach tour from Scotland. What a wonderful surprise on our arrival.  The position of the hotel is so central, and only a five minute walk to the lake front. The hotel has a good pool with plenty of chairs, and the rooms and bathrooms were spotless. The air conditioning was fantastic, and the bed was just the best. Food was varied and more than adequate, but the dining room was sometimes a little disorganised, however that did nothing to spoil our wonderful experience. All in all a great hotel.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r417558820", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Too many noisy students!", "review": "Dear James and Clare,  Thank you very much for your comment. Your words are the real gratification we have doing our job. As you write in your review, the location is for sure one of our main strengh here in Torbole. Thank you also for appreciating the pool area which is very important during the summer. Food also is an aspect of our hotel on which we focus on very hard. Thank you for qualifying us as a surprise for you!  We hope to selcome you again With our best regards Club Hotel La Vela ", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r415078068", "sub_review": {"Value": 4, "Sleep Quality": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "1 night in torbole", "review": "Room on third floor, clean but very basic, with only one power point to charge items which was not enough. The balcony was large and overlooked the pool, together with very many over excited students who ran amok at night. The choice of food was adequate and the position of the hotel is excellent it's just a shame that the basicness of the room and the noise let it down.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r414820201", "sub_review": {"Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Dirty hotel, dirty room and food way below par", "review": "Dear Guest,  Thank you very for your review.  We are really sorry about the noise of the students.  Regarding your room, our hotel has different kinds of rooms so maybe for the next time if you would like something different from the standard one you have booked  you can choose among our cathegories.  Looking forward to see you soon best regards the manager - Club Hotel La Vela   ", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r410617151", "sub_review": {"Value": 1, "Cleanliness": 1, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Looks are deceiving, and watch your passport !", "review": "very good experience, hotel well located in torbole town, very good breakfast and lake view room! receptionist was very nice to customer as well, and for kite surfers there is a  small box where to leave the equipment.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r409157323", "sub_review": {"Sleep Quality": 1, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled solo", "rating": 2}, {"title": "Nice on outside not on the inside", "review": "It is weird this hotel on the exterior was pristine, freshly painted with a nice pool.  The room on the other hand was bare minimum.  Very budget basic carpet, no pictures.  The A/C did not work.  One of the lights did not work which meant you could not see in the closet.  The room and the bathroom were clean.  The rooms have balconies, but mine was next to a smoker.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r407685190", "sub_review": {"Sleep Quality": 2, "Rooms": 2, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Wonderful place, great location, and price!", "review": "Dear Guest,  thank you very much for your comment.   We are sorry to read we were not so efficient to solve the problem of the AC and the light in the room. Usually our hotel maintenance service is fast and 18h a day.  Thank you for appreciating our pool area and the cleaning, which we focus on day by day.   Hoping to see you again in the near future best regards The Manager - Club Hotel La Vela", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r407655336", "sub_review": {"Location": 5, "Sleep Quality": 3, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Miss", "review": "Very family friendly, great to have a full spread for breakfast, location is wonderful and it's hard to find a bad view. Pool is refreshing, facilities are clean and updated. Mini fridge in the room, flat screen TV, water pressure on the shower. doors and windwos to the outside both open like doors on hinges and also hinge from the bottom so the top is open. AC works too. Beds very firm and pillows are firm and thin, not the worst but not a melt into bed type of thing. However, very welcoming after long days in the sun or working outdoors! Would be nice to have a clock somewhere in the room visible. Perhaps a channel guide for the TV? Enlish subtitles? Regardless, shouldn't be spending too much time in the room! its wonderful outside and should be taking full advantage!!", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r407058204", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "They cater for vegans.", "review": "Dear Guest,  thank you very much for your comment. We are really happy to read that you were satisfied with our breakfast, as weel as the location of the hotel, the pool and our facilities. Our hotel usually provides a list of all the channels for the different languages in the room, we are really sorry you did not find it in you room.  We hope to welcome you again in the near future. best regards. The Manger - Club Hotel La Vela", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r404193790", "sub_review": {"Location": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "7 day Thompson Lakes holiday", "review": "Hotel was part of a lever deal I thought the hotel was great for what we needed, we had a full on tour trips included with ledger every day so only needed somewhere for breakfast , evening meal and sleep for this the hotel was more than adequate,the surrounding area is stunning I loved lake Garda and loved Italy so will defiantly be returning. Myself and my daughter had a lovely holiday and will defiantly be doing a coach holiday again we saw so much of a beautiful country.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r402409643", "sub_review": {"Sleep Quality": 3, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "9 day coach holiday July -016", "review": "The hotel itself was excellent. The only downside was that our room was quite small bout having said that, I don't think Italians go in for plush rooms as we've holidays in Italy lots of times and have yet to stay in a stupendously posh room., but the main thing is that it had air conditioning and a fridge. The meals at the hotel were fantastic. I've never seen such a choice of cold dishes, there must have been dozens of them. and the main meals were buffet style which suites us. A choice of 3 starters, 3 main courses and lots of desserts.  Not the place to stay if you are watching your weight. And to top it all after a superb holiday I discovered I had left my nightdress in the hotel room when I got home. I sent an email and they found it and posted it back to me which I…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r399873270", "sub_review": {"Location": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "One week in July", "review": "Dear Guest,  We are really happy reading your words. This is a big gift for us for our every-day-efforts trying to make our guest's holiday special and enjoyable.  with our best regards The Manager - Club Hotel La Vela", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r395849985", "sub_review": {"Location": 5, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "lake garda holiday", "review": "I would agree that this is not a 4 star hotel.  There is a nice pool.  The bedrooms are average and not that big.  A bonus was the balcony, good tv, hairdryer, safe and fridge.  The fridge had a beer and a couple of cans of soft drinks to welcome you.  The restaurant was a buffet.  Breakfast buffet very good.  Buffet at dinner seemed much the same every night.  Not much variety in the food.  There was free drinks with dinner and the waiters were excellent.  The receptionist was very knowledgeable.  The location of the hotel is excellent.  There is a Coop store next door and also a good camping shop.  Be warned there are no towels provided for the pool.  The camping shop sells beach towels.  On the downside, the shower was very small to enter.  Toilettries were only provided on…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r395740643", "sub_review": {"Sleep Quality": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "8 day coach holiday", "review": "Dear Guest,  thank you very much for you review. We are really happy to read your words about the staff and the location of the hotel which is one of our first advantages when someone makes a reservation here.  Regarding our restaurant, the hot food changes every day and is really variable  while the cold one is quite the same every evening due to the fact that there are a lot of dishes.  We are really sorry if your toilettries were replaced only one time and that you had to ask twice for the towels. We will try to put more attention on the service.  In any case we hope to welcome you again here with our best regards The Manager - Club Hotel La Vela          ", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r395135933", "sub_review": {"Value": 3, "Location": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Standard hotel", "review": "We had a nice room with kingside bed, but the pool outside never seems to close down! So lots of noise from children till around 10pm. We went on a leger holiday, & stayed 8 nights here. Food was OK, but desserts were the same every night! Lake garda is so beautiful, but last time we visited we preferred to stay in rival,  Torbole was not as pretty, & noisier. Also far too many cyclists there!", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r391495587", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "4 star hotel, in your dreams", "review": "Stayed hers last week with my Wife and can honestly say that we were both disappointed.  We are used to The UK Hotel rating system which cannot be the same for Italy as a Four star hotel this isn't.  We were with a coach tour which I would imagine pays considerably less than the add hoc visitor.  The third floor room was extremely basic and nowhere near the cleanliness standard expected.  The shower room looked like something from the sixties with pink wall tiles. The floor tiles originally pink were peeling and painted over.  The food in the evening was a buffet, first class deserts but the main course was dried up pasta, overcooked veg and some form of meat.  The starter was reasonable if you like cold cauliflower and other veggies, not something I would expect as a starter. …", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r390467662", "sub_review": {"Rooms": 1, "Cleanliness": 2, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Lovely hotel", "review": "Dear Guest,  thank you very much for the above comment.  We are really sorry you are not satisfied with your holiday here with us.  Our hotel welcomes a wide range and different types of tourists every year starting from those who come for business trips to leisure, bikers, windsurfers as well as school trips,  that is why we have so many room types and yours was the standard one.  Regarding our restaurant it is an international one with a lot of different kind of dishes, not only Italian food but also a lot of vegatbles for vegans which we serve cold and warm.  Anyhow we hope to meet you again in the future here making sure you will have a better holiday.  Best regards The Manager - Club Hotel La Vela     ", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r387181482", "sub_review": {"Value": 5, "Rooms": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "esperienza positiva", "review": "Stayed here for five nights on a Harry Shaw holiday, the hotel was very nice and the room also was of a good size too with a wonderful balcony overlooking the pool and the patio area of the restaurant, so even when it was raining we were able to sit outside and enjoy the night air.    The hotel was quite full and there was a noisy student lot in who made a lot of noise in the pool at night but hey it was their holiday too and it didn't cause us any problems.   The bathroom was a pleasant surprise as it had a bath and a shower and was quite roomy too.   Plenty of storage in our room to hang our clothes up and we also had a fridge which was handy for the cool beers.    The food was excellent I do not eat fish or meat but found a good choice at each sitting and did not go hungry.  …", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r383450961", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Great room", "review": "Dear Guest,  thank you very much for your comment. We are really glad to read your words as well as happy to have satifsfied your expectations. We apoligize for the air conditioning because usually we try to do our best to solve the inconviniences immediately.  We hope to welcome you again in the near future best regards Manager - Club Hotel La Vela  ", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r382807209", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Three Star hotel at best", "review": "Room lovely and comfortable, food superb and the service was outstanding, nothing was too much trouble, the staff were extremely helpful, cheerful and friendly.  I was also impressed with that fact that many of them spoke several languages which is good for customer's ease.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r382788999", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "excellent hotel", "review": "just returned from an 8 day trip to Italy and stayed at this hotel for 5 days, it is a lovely hotel and the food is excellent and plenty choice,room very clean and comfortable no complaints,the staff are so wonderful and so obliging, many thanks to edo/edward the restaurant manager for the red,he is a great bloke.the coop is just round the corner very well priced for the odd thing you may want,found the cutty sark pub sells a good pint  of guiness had a great time good lot of people on the trip especialy brendan and lovely lyn hope to meet you again. must mention kevin and lorraine from harry shaw of coventry they were just great and realy helped make the holiday many thanks  ken and jean rogers.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r380021762", "sub_review": {"Value": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Lovely holiday on Lake Garda", "review": "Dear Guest,  Thank you very much indeed for your comment. We are really glad to read your words.  We are happy to have fully satisfied all your expectations and we hope  to welcome you again in the future.  With our best regards Manager - Club Hotel La Vela ", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r378616018", "sub_review": {"Value": 5, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Amazing hospitality in northern Italy", "review": "Arrived at hotel after a long coach journey with Leger and was pleasantly surprised with our twin room. We had plenty of space for clothes etc and a lovely balcony with table and chairs which we used most evenings to sit out on and relax. The bathroom was large enough for us and very clean. We always take our own travel kettle with us to Italy along with coffee etc. Milk and cheap water could be purchased at the Co-op just along the road. We also had a fridge to put the milk and wine! The electrics were a little dodgy in the room - my companion would bounce on the bed and the lights would go out - found out the bed was balanced on the switch!!!! Had a good laugh though. The restaurant was well run and we always had a variety of food( some cooked to a higher standard than others)…", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r375996972", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Top Hotel", "review": "Dear Guest,  We would like to thank you for spending some of your time writing this nice comment.  We are really delighted to know that everything went well for your stay here with us. We hope to meet you again in the near future.  With our best regards Manager - Club Hotel La Vela", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r375182789", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Clean and comfortable hotel", "review": "Hotel is very clean, brilliant restourant, helpful and efficient staff.  River is 5 minute walk from the hotel with a nice walking path beside it. Children's play grounds are very close and an excellent family ambient. Very good location. 10 out of 10 for me.  Bravissimo.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r371953814", "sub_review": {"Sleep Quality": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "On a tour with Leger Holidays this was the base hotel", "review": "We were fortunate that we had a lovely room with nice balcony very adequate storage facilities and comfortable twin beds. It is situated in an apparently new block of six rooms each a little different. It had very large shower room containing a very small shower enclosure, a bidet and nice wash basin. Unfortunately the floor was tiled and became very slippery when wet. On one day I forgot to use the shower mat or towel on the floor and skidded feet first in the air and crashed my head into the bidet knocking me senseless and bruising me in a number of places. I did not go to a doctor and recovered slowly over a few days placing myself to blame because one of the Leger drivers, James, had given a warning but I had forgotten. The food was plentiful with choice of five mains at…", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r369456366", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Ok hotel", "review": "Dear Guest,  Thank you very much for spending some of your time writing a review. For us is really important to know everything about your feelings during your stay.  We are really sorry to read about your incident in the bathroom. Will definitively be our pleasure to control the floor of this bathroom and to be sure to put another mat in addition to the one usually at disposal.  We are happy that generally speaking was a nice holiday for you and we hope to welcome you again in the near future.  Best regards Manager - Club Hotel La Vela  ", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r365726242", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "A surprise find!", "review": "The hotel is okay, very clean, rooms adequate but not enough room to put anything, like clothes, would be good for people travelling through. Food not very good, why was all the vegetables stone cold? Hotel staff very polite and friendly", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r323600408", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "On the whole lovely ... but", "review": "Dear Guest,  Thank you very much for your review. We are really glad to know that you appreciated the staff. Our every day commitment is to make our guest feel at ease.  We are really sorry to read that you had problems with our food.  Regarding our salad buffet, we usually have a whole buffet with cold vegetables and starters, while other hot vegetables next to the hot main courses.  However we thank you very much again and we hope to see you and welcome  you as our guest in the future, maybe choosing a different kind of room for your stay.  With our best regards Manager - Club Hotel La Vela    ", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r323582756", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Return to Club La Vela", "review": "We booked this hotel which had mixed reviews and were extremely pleased when it surpassed all expections.Staff were friendly and helpful.  The rooms although basic were clean, spacious and comfortable. Thr location was ideal a short walk to Torpole and good access to  ferry snd buses. Breakfast had lots of choices including cooked or continental items.  Wouldn't hesitate to recommend it to others. Fantastic views of the lake only 5 mins away with a   scenic walk to Riva on it's foorstep. a  ", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r318855450", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Check your tour hotel before confirming booking.", "review": "I'm yet another one who should have read the reports on here about La Vela before confirming my booking with Leger. Having already \"suffered\" one poor hotel with them,   their own organisational skills and dedicated staff persuaded me to try once more.but this is not even three  star.   The shower cubicle was only 600mm square with an opening of 375mm. so small,  a number of fellow travellers admitted they didn't shower for the whole week. It was impossible to wash your hair as you couldn't get both arms above your waist.  There were no drinking glases  provided in the bathroom and those  requested were removed,  without replacement,  the next day.   The menu was so repetitive as to suggest the food was being recycled from day to day.  This hotel,  properly managed,  has much to…", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r315803535", "sub_review": {"Sleep Quality": 2, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "No hot evening meals for an entire week", "review": "While I was very pleased with my room the restaurant really let this holiday down. The manager was cold, unfriendly, overbearing. He reprimanded waiting staff in front of the guests. He even told off a member of the tour group I was in. I didn't have one hot evening meal the entire week as they did not cater for vegetarians. On the first evening he showed me to a table in a corner. Woman alone, stick her in a corner where no-one can see. Others from my tour group called me over to join them, which was lovely. I will not go here again.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r315789299", "sub_review": {"Value": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled solo", "rating": 2}, {"title": "Let down", "review": "After 6 years of touring with ledger in italy badly let down. Other hotels live up to reputation this place is a dive food cold and routine same food different days teenagers partying all night long would not expect this type of hotel i would not give 1 star", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r313615735", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Definatetly not a 4 star hotel", "review": "It is easy to see why this hotel is only rated 26th out of 31 hotels in Torbole.  Wish I had looked on here before booking the trip.  The rooms are extremely small with just room for a bed, television with small fridge under the television stand.  Bathroom a reasonable size but the shower cubicle was tiny and most people would struggle to get into it.  It was also very dirty behind the doors that slid across when closing the cubicle and was obviously never  cleaned behind there.  The electrics left a lot to be desired as the tv and fridge were plugged into an adaptor but would not push in properly and so bare metal pins were showing and if a child had touched this I dread to think what would happen. Hair dryer and plug socket in bathroom must have been wired to the light switch…", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r313465644", "sub_review": {"Location": 3, "Rooms": 1, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Not the best!", "review": "This hotel really falls between two and three rating, and was rather disappointing. It has 4 stars, but really doesn't warrant them. It is supposed to be the top hotel in Torbole, but it is very tired and needs a full revamp. It was clean enough, and the location is good but that is not enough to maintain its reputation. The food was reasonable, but not a great deal of variety. Chicken, fish and pork every night, albeit different ways of cooking, but it got a little boring. The breakfasts were very good, with something for everyone. The problem at mealtimes was the great number of German people,(at least 80%) who have no concept of queuing - it was like a rugby scrum to get to the food. We soon learned to use our elbows, just like them!  The decor of the rooms was very boring…", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r312782730", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Family holiday at Club Hotel la Vela", "review": "We stayed here for a week in July. Great hotel. They have a kids club and Sylvia who runs it was so great with my 18mth old daughter.   Apartments are fairly basic but cleaned and tidied daily. The team were lovely too. Swimming pool is excellent and has a jacuzzi and baby pool area. My daughter loved it and it was safe for young children. Very close to town centre and you can cycle to Riva too.   Breakfast was lovely with loads of choice.   I'd stay here again for definite and I'm happy to recommend it. ", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r311370777", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Torbole experience", "review": "There was no tea making facilities.  Room could have done with an update.  Small cubicle for the shower.  Good food choice and plenty of it and the variety was good.The coach company however advertised another hotel and different area to the one I went to I found out on the day of going off the driver of the coach company.  I dont think the hotel should be rated 4* more like a 3* rating.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r310792561", "sub_review": {"Location": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "First taste of Italy", "review": "Very nice stay for a week with my family. Food was very good, plenty of it and no complaints. Room was comfortable and staff were very accomodating. Weather was good for period of our stay. Part of the package was provision of unlimited wine in the restaurant with your meal, as advertised in the Thomson brochure. This meant that if you wanted more than one glass with your meal, then that was possible. The restaurant were a little funny about this initially, although this was amicably resolved.Torbole was an ideal placer to visit with spectacular views around the resourt and plenty to do.  All in all, a superb holiday in this hotel, which we enjoyed very much.", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r306547715", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Very disappointing", "review": "We recently returned from our first coach holiday with Leger and stayed at this hotel. For the price we paid we expected a reasonable hotel  but this hotel is shabby and in need of a refurb. Our room was very small,shower cubicle VERY small with laminate flooring in the bathroom which had swelled so the bathroom door would not close. Surely the maid who cleaned every day should have reported this. The carpets in the corridor were dirty and badly stained not what you expect of a 4*hotel which this is definitely not. We had the occasional good meal but overall the food was not good. We travelled Silver Service and expected luxury I think Leger should find a better hotel. One good point the staff were very friendly and helpful.", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r301527002", "sub_review": {"Sleep Quality": 1, "Cleanliness": 2, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "A Lake Garda Experience", "review": "The hotel is situated in the centre of Torbole quite near to the Lake's shore line and so is convenient for a stroll in an evening. The hotel is very clean and the staff from the reception, dining room, bar and maid service were all very friendly and helpful and nothing was too much trouble. The food whilst obviously Italian based had a good variety every night to suit most palets with the house wine being both acceptable and reasonably priced. The reason I have given this Hotel an average rating(3 Stars) is that the rooms tend to be on the small size and the shower cubicles are also small - if you are of a XXL stature like \"yours truely\" you have to shoe horn yourself into them. We were offered an alternative refurbished room in the annex but such still had the small shower…", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r299116916", "sub_review": {"Location": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "A Pleasant Surprise", "review": "We stayed at this hotel for five nights in May,arriving on a Leger coach trip.  This was our first coach trip and we travelled on the new Luxuria coach.  It was very comfortable.  We were told that a cold meal would be ready for us when we arrived at the hotel, cold, because it was a late arriveal.  We finally arrived at 2130 and we were warmly greeted and there was a lovely hot buffet waiting for us, most welcome after a full day's travel.  The hotel was clean, comfortable and within a five minute walk of the lakeside.  The breakfast buffet was really excellent, catering for all European tastes.  Bacon, eggs, cereals cheese, meat, cakes fruit, toast, fruit juices, tea, coffee, chocolate, hot milk, youghurt oh, it was truly brilliant  The evening meal always had soup, a fish…", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r293695327", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "First impressions don't count ", "review": "On approach the hotel looks fine, the reception area is good. It is once you leave reception that the true quality of this hotel shows itself. The lift, if you can get it to arrive, is slow and yesterday broke down between floors. The excuse was too much weight. There were six people and the maximum is eight. We are in room 304 and if we were not on a Leger coach tour I would have left the following day. I don't know what Leger paid for this room but it is not what I expected for the money I was asked to pay Leger. Shower room is small. The cubicle difficult to enter as an average size. Had to open the doors to soap oneself. Mastic coming away from the base and black mould present. Shower head had as much water coming through the side as coming from the head. Towel was rizla…", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r290704601", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Lake Garda", "review": "Just back from Torbole, Lake Garda and have to say that it is a beautiful part of the world. We stayed at the Club Hotel La Vela and we were happy with our accomodation,food and service thrughout our visit. We stayed in an annexed part of the complex, which i think would be a relatively new build and the place was kept clean and tidy by staff. I actually think i would prefer t stay in this part of the hotel if i was to return in the future.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r288903800", "sub_review": {"Value": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good location", "review": "We used this hotel as part of a Ledger tours package and was pleased with the location, and friendly attention from all the staff. Alltough part of a package tour we were also impressed by the quality of the food on offer at breakfast and dinner. Our only real grumble  regarding the venue was the size of the shower cubicle in our room, it was impossible to bend down to pick anything up if you dropped it in the shower as the cubicle was quite small.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r286708587", "sub_review": {"Location": 5, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "lovely hotel", "review": "location stunning wonderful food , and good choices. lovely helpful staff full marks comfortable beds, bathroom good, lovely balcony with swimming pool view. only a 5 min walk to lake and delightful restaurants. Would like to return. soon.", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r284991756", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Leger coach trip", "review": "Well her goes , we stayed here for 8 days , we travelled from Essex by coach to this lovely resort, the hotel was lovely we was in a separate part but not far away . Hotel room was lovely ,cleaned daily , food was nice , staff was nice .... nearby is a Co.op store so handy  for water at €1.39 for 6 waters .... lake a lovely walk and great for water sports I tried paddle boarding  Ou r coach had a variety of ages on and we all enjoyed the resort . easy to get around the ferry is great for getting to other parts of the lake ....Some you can walk to if your fit &able . couldn't fault the holiday at all I could have stayed longer ....", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r280532513", "sub_review": {"Sleep Quality": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Never a four star hotel", "review": "hotel clean enough, air conditioning excellent, food have tasted better as I am a regular traveller to Italy, found the night porter extremely unhelpful and the bar was closed far too early, I would not recommend this hotel to anyone, we had difficulty getting access to the swimming pool as it was dominated by teenagers who made it extremely uncomfortable for older people to go into. I was also disappointed that we had no rep on hand and was only contactable by phone therefore there was no welcome induction to inform us about the surrounding area extremely poor", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r280100414", "sub_review": {"Value": 2, "Location": 3, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "What's the problem?", "review": "We  visited in April on a coach trip and stayed for five nights.  We were filled with trpidation having seen what other people had written but we couldn't see what the problem is.  We had a nice clean room with a door opening onto a small garden (others in our group had a balcony looking into the hills).  The food was excellent, self service which meant chosing what you wanted and the manager was around at meal times.  The hotel is a short walk from the lake which has spectacular sunsets.  Close by is a COOP convenience store where wine is very cheap.  So impressed, we have booked to go back later this year.", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r271262600", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Terrible Hotel with cold, bland food", "review": "My Mother and I stayed here during our coach tour to Italy.  We initially had a room in the annexe which was quite disgusting:  blocked shower, stained bedspread, foam mattress on double bed had a large dip in it. It was actually a self-catering apartment.  Balcony overlooked the pool that had around 20 teenagers in it when we arrived - rather noisy!  The food was quite good for the first 2 evenings and then it was bland and cold.  We ended up eating out. After complaining to reception (along with 4 other couples on our tour) we changed rooms after 3 days into the main part of hotel.  Room was more like a 4 star and unfortunately it looked out onto the main road and was very noisy.  Would not recommend this hotel at all.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r271089183", "sub_review": {"Location": 4, "Rooms": 1, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "terrible hotel", "review": "We spent 7 days at this hotel we where put into smelly room in the annex  with a pull down bed settlie to sleep in  the food was bland with not much choice it was the worst hotel I have ever stayed at would not recommend it a disaster of a hotel", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r239637758", "sub_review": {"Value": 1, "Location": 3, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "definetly not 4*", "review": "just returned from 8 nights at this hotel our room was in an annexe away from main hotel no balcony just a window , it was through a car park up a ramp the room was very basic we didn.t even have a bedspread on just an old woollen blanket that had seen better days , the food was the same every night ok if you like pork, the staff were no help very ignorant to English tended to ignore you , would never go back", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r233438706", "sub_review": {"Sleep Quality": 2, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Lovely holiday!!", "review": "We have stayed with our friends in Club la vela and have booked two rooms! In fact, they were more like flats than actually rooms which is good when you are with kids! Rooms were pretty simple but clean and comfortable. Variety of food for breakfast was good too. Staff was always helpful and friendly! Thanks to Ingrid and the team for lovely stay! Location was good however we ended up hiring car and travelling around :).", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r232628695", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Appalling management attitude", "review": "We booked into this hotel for 7 nights on the arrival there was a queue of complaints , this is never a 4 Star , we booked a double room and got a self catering apartment , 2 single beds , and a couch pulled down with a double mattress , the room was clean but when you oped the door it had a smell of fustiness when complained people were told to open the doors and windows , I am sure you will always find something to complain about but this was definitely a Faulty Towers situation the so called Manageress attitude was appalling beyond rude if it was my hotel I would have sacked her on the spot the way she spoke to the customers , the area of Lake Garda is beautiful this made up for this so called 4 star hotel , the hotels which we stopped overnight in Germany were class compared…", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r230099230", "sub_review": {"Value": 2, "Cleanliness": 4, "Service": 1}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Excellent hotel with friendly and helpful staff", "review": "Recently stayed here with my family. The hotel is in the centre of Torbole, and only a couple of minutes walk to the lake. Great hotel with very efficient and friendly staff. From the welcoming and helpful reception team, to the excellent restaurant team, led by Edo (a Restaurant Manager, who clearly loves his job), everyone makes you feel welcome. Food was plentiful with an excellent choice, with the buffet was always being replenished. Bedrooms are fine, spotlessly clean and equipped with everything you need, but lets be honest you don't spend all your time in your bedroom if you are on holiday in such a beautiful part of the world. Thank you to everyone at the Club La Vela for helping us to have such a fantastic holiday. Just next time, please arrange better weather!", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r227032333", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good clean hotel", "review": "I stayed in the La Vela for six nights in August. The best part is the annexe, being the newest part of the hotel.  The room I was in (705) is on the ground floor and has a private garden area measuring 4 by 6 metres. Although this area is secluded it was not in full sun in August so if you want a tan it is not the best.  The food is plentiful and good and although the dining room was full there was not excessive queues as the buffet style made for a quick service.  The room itself was of a reasonable size for sleeping in though not for spending a day in, but we didn't do that anyway.all in all a clean adequate hotel.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r225320996", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "value for money.", "review": "I had a double room, simple clean and tidy. Good size bathroom for one, shower unit small. Balcony with table and chairs, nice view. The food was good with plenty of choice. Service was good but if you leave your table to get something else it may be taken away, mine did one day.Bar area, but small. Pool, but not enough loungers. Quiet hotel in nice area for walks and to the lake. Must try the ice-cream.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r224358280", "sub_review": {"Value": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Value for money", "review": "I have just returned from a week in this hotel. The weather was bad however the hotel accommodation was good value for money. The food was very good with ample choice for most. The service and staff in the restaurant was excellent and they worked hard to ensure everyone was happy with their meals. The hotel is in a good location for walks around the area of Lake Garda however I would hire a car on my next visit to see more of this stunning area. I went half board and prices in and around the resort are very cheap. I must say the size of the pizzas are huge and could easily be shared by two people and the ice cream is something else you must taste. This hotel is rated as a 4 star which I think is generous as compared to some 4star hotels I have visited I would have to say would…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r223627599", "sub_review": {"Location": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Good value and great staff!", "review": "We stayed here for 11 days, effectively 5 adults in a one bedroom suite. Our room was perfectly adequate for our needs and cleaned daily, even when the teenagers did not want to get up!  It is not 5 star luxury, but then it is not at a 5 star price.  Breakfast was included and was an extensive choice of hot and cold items laid out in a buffet style. Big mention for Ana, who was a star and made us feel very welcome.  If you are planning to go to the north end of lake Garda, this hotel is a good base from which to explore.  we would certainly stay there again in the future.", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r220407051", "sub_review": {"Value": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Very nice stay", "review": "We have just come back from a lovely holiday on Lake Garda and stayed at this hotel for 6 nights. It was lovely. Clean and tidy, fairly large rooms and a balcony. Unfortunately only one chair on the balcony but we took the one out of the room as well. We used the swimming pool which was very good, there is a kiddies area in the pool. The food was mainly very good with a huge choice so if you don't like one thing there are plenty of other options.Wine wasn't bad either. Would stay here again if we went to the area. Waiters etc were good fun and worked extremely hard to keep tables cleared etc.", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r215871886", "sub_review": {"Location": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "book the annexe, lovely rooms huge balconies or terrices", "review": "I have to say on the food front I agree. Pasta stodgy, fish not great. Same same old sweets. Breakfasts better. Crispy bacon eggs a bit suspect. Tip, get the hot water for your tea from the machine not the pull own handle thingy! We were with a coach trip and some of our holiday travellers were not happy with their room. I guess we were lucky we were in the recently renovated annexe. We had the ground floor with a lovely little terrace, views of the mountains either side. It depends what you are looking for. We tend to go out for a stroll and a quiet drink somewhere else. The bar isnt that good,and if you don like going out of the hotel in the evening there isnt much in this hotel. Location wise it is very good, very central, 6 minute walk to the lake. There were a lot of…", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r210046675", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Do Not go There !!!!!!", "review": "Oh Dear !!!!  This is the first bad review I have ever written and it is not an enjoyable experience. I can't believe that anyone should find this hotel satisfactory. Our Tour company booked us into this so called 4 star hotel. After 14 hours travelling we were given the key to our room !!!!! 9pm.   So Small...(for eight nights !!) may be there was a comfortable chair !!! NO,  No Room !!!  We were woken in the morning at 7.30am by the sound of heavy machinery they were digging the roads up !!!! under our window. Breakfast was missed as tried to get some sleep. The feeling of claustrophobia was terrible. Thought a nice relax in the lounge would be a good idea.... No way... there was no lounge !!! No outside sitting area !!! NOT ONE comfortable chair in the whole hotel. The bar…", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r207496368", "sub_review": {"Value": 1, "Location": 3, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 3, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Did I stay in another hotel?", "review": "We were booked into the Club Hotel La Vela by the tour company, whose trip also involved three other hotels for overnights, all greatly superior to La Vela.  When we entered the entered our room it smelt of nicotine and mustiness which permeated the bedding and the wardrobe paricularly.  The room was too small for two persons, black scuff marks on the walls and plaster had been knocked a wall corner.  We complained, but there was no other room avaliable.  The hotel's solution was to change all the bedding and keep the door and the balcony door open and air fresheners.  The first night we got stuck in the slow, antiquated lift, which we did not trust; my partner (who has slight mobility problems) and I used the stairs to the 3rd floor.  I had read the reviews before our holiday…", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r207213364", "sub_review": {"Value": 2, "Location": 4, "Sleep Quality": 3, "Rooms": 2, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Holiday break", "review": "We stayed at this hotel from the 25th April to the 30th April 2014 and our room was well furnished and  very clean. The food in the restaurant was very good with plenty of variety and the staff were friendly and attentive. We would have no hesitation in recommending this hotel.", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r204574963", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "vacation place", "review": "Very nicely and conveniently located hotel with great swimming pool in short distance from the beach. Staff is friendly, breakfast is great. The only one thing - wifi doesn't work in rooms - only in lounge. Has own parking.", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r181096037", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Not a 4*", "review": "Stayed at this hotel for 8 nights end of sept/oct with 45 other people who had booked a tour with a certain company who in their wisdom put us up in this hotel. Room on 1st floor where until midnight every night had to listen to chairs being scraped across dining room floor whilst they cleaned the room, kept me awake most nights. Cannot complain about state of room as was clean all be it small, unlike other members of the group, plenty of storage twin beds not double but will push together and make up as a double if asked, large balcony. As others have stated small shower but i coped and even managed to wash my feet. BBC world news only english channel on TV. Noisy water pipes and from other rooms woken up different times through night from people flushing toilets or having…", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r180864145", "sub_review": {"Value": 1, "Location": 4, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 3, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Showering inside a 26 inch box", "review": "Trying to shower in a 26\" box, is not something I would recommend, impossible to bend and touch your toes, never mind wash them, and the fixed showerhead means if you want to wash your private bits, it is best to take a sponge, unless you have access to a small ladder. If you are from the UK it is advisable to take a travel kettle for your morning or nighttimes cup of tea or coffee. Also required is an AC 250V Italy Plug to US UK AU EU Socket Travel Adapter, as the 3 pin Italian sockets are smaller than the standard EU ones. the hotel rooms were OK, and they have changed to a help you self at meal times in the restaurant.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r180691058", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "It has a cheek to call its self a four STAR", "review": "Stayed in this excuse of a hotel for a week book via the Travel Department who should be ashamed to let people pay out big money to stay here.  The hotel was old dirty with the sink in the room cracked.  The bed lined was not changed for the week, the bed spreads had stains on them and holes in the curtains.  The Breakfast was ok what one expects on the continent.  The Dinner which was included was poor the so called hot food was barely luke warn and no staff on in the dining room faulty towers at its best.  Has to be one of the worst hotels I have even set foot in and would not recommend this place to any one and it should be visited by hotel and health inspectors.  I know and knew when booking a four star in Italy would not be the same as a four star in Ireland but my god this…", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r180459775", "sub_review": {"Value": 1, "Location": 2, "Sleep Quality": 2, "Rooms": 1, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "cliub hotel la vela,torbole", "review": "spent 8 days at this so called 4 star hotel Sept/Oct this year. The food was poor in the extreme, overcooked or undercooked and the staff were totally indifferent to complaints.The room was small, cleaned occasionally and the the shower was so small that it was impossible to bend down to wash ones feet.The cracked wash basin added little to the ambience.There is no lounge and the bar offers little in the way of welcome. The barman is offhand and slow bordering on rudeness. The dining room is too small for the number guests and used crockery is not cleared . I coiuld not recommend this hotel to anyone/.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r180240973", "sub_review": {"Value": 1, "Location": 3, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Disappointing!!!", "review": "We have just returned from 8 nights at this hotel.  When we arrived our room was in the annex.  It was damp, the bedroom was very small and there was black mould on the ceiling in the bathroom.  We were given another room next morning which was nice.  The restaurant was disorganised, the food very basic (if you like pasta or pork), the bartender kept disappearing to help clear tables in the restaurant and peoople had to wait to be served and the restaurant staff were not always very helpful!  The hotel is nicely situated for the lake, buses ,etc and plenty of restaurants in the area.  The young lady on reception was very helpful.  Would not want to stay here again.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r179921732", "sub_review": {"Value": 2, "Location": 4, "Sleep Quality": 2, "Rooms": 3, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Good location but meal times a stampede!", "review": "The location of the hotel was great as one could walk into Torbole which is a lovely quiet town in beautiful spot.  The rooms were basic but spotlessly clean.  However cleaning staff seemed to arrive at odd times and no notices to put on door (hotel said they didn't have any!).  Meal times were very noisy and big queues, although the food was good and plenty of choice.  Dinner was buffet style which meant long queues and all coach parties came in at same time instead of being staggered.  Also hot food was put on top of food already going cold instead of removing the old food.   the noise was dreadful and couldn't wait to get out of fining room.  there was no lounge and bar area was nearly as noisy.   Pool area very pleasant and clean but would not stay here again.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r178838651", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Good Location", "review": "In a good location in Torbole for walking to Lake Garda and the old town.   Room was clean but basic with a balcony view of the pool. Staff were friendly and the food was to a good standard and there was a complimentary half litre of wine on your table each night for dinner.   However, whilst expected for breakfast, dinner was also self service. This at times lead to big queues especially if there were several coach parties staying in the hotel. ", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r178690726", "sub_review": {"Value": 4, "Location": 4, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "", "rating": 3}, {"title": "a stampede", "review": "having just returned from a weeks holiday at this hotel i would like to share my views with you.firstly the restaurant is very disorganised with a buffet system that at dinner time the soup station is right in the middle of the main course queue so you get massive lines of people getting two courses at a time plus when you get to the front the dinner is cold and the plates are cold also.in the bar the service is so slow we would,nt get away with it in england so beware if you are looking to book.rooms are noy too bad but the resort is very sparse. there are much better resorts on lake garda such as limone ,malcesine,sirmione,garda and riva garda.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r178237021", "sub_review": {"Value": 3, "Location": 1, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "BETTER THAN EXPECTED", "review": "My husband and I went to Torbole La Vela Hotel the week before last and after reading the reviews I tried my best to get our Hotel changed but we couldn't as we have separate twin rooms for sole use!  However I rang the hotel prior to our departure and asked about the rooms etc etc after taking note of what the reviews had said and I was very pleasantly surprised when we arrived.  Both our rooms were similar and very clean and perfectly adequate.  The beds were fine and believe you me I like a decent bed!  OK shower may be a little small but perfectly adequate if you are of average size (I am small)....  Only thing I will say is my room 152 has a very dark balcony due to a very large tree right outside and gets no sunlight at all!  However who sits in their rooms when there is…", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r177983581", "sub_review": {"Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Stay elsewhere!", "review": "It was more like being at a Butlin's Holiday Camp! Very disappointing stay, although the rooms were good, although we experienced air conditioning & refrigeration problems in ours; after being reported to reception we were promised that the problems would be sorted the day after we arrived. There was a party of German schoolchildren who were noisy, played football in their rooms & moved furniture every night after 1am, who's escorting teachers turned blind eyes. The meals were all self-service, & if coffee was wanted after dinner, we had to buy it from the bar in reception. Serving staff were rude & indolent. The company who arranged our stay will never use this hotel again. Avoid like the plague or stay at your peril! There were other problems, but I don't have room to include…", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r177781141", "sub_review": {"Value": 2, "Location": 4, "Rooms": 4, "Cleanliness": 4, "Service": 2}, "travel_purpose": "", "rating": 2}, {"title": "Perfect Location", "review": "Just returned from a week in Club Hotel La Vela at Lake Garda, Great location for shops, restaurants, buses, ferry's and 5 mins walk to the lake. We had a room in the annex part of the hotel which had just been re-furbished. clean towel's every day. Hotel food was good, great choice of food every meal, wine was included. Staff very helpful. Would stay there again.", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r175720489", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Could do better!", "review": "Have recently returned from a wonderful twelve day holiday in Lake Garda and stayed in this hotel. On our arrival our coach party were asked if someone would volunteer to spend their first night in the sister hotel due to over booking, my daughter and her boyfriend were pressured into it. . . They were quite pleased with the room and room given on their return Me and my husband on the other hand were not. Our room on arrival did in no way resemble the photos used in their brochure. . It was old.I dated, had no air con, no safe or fridge (all of which were advertised in their brochure) It then came to our notice others had complained and I followed suit and was moved into a brand new room in an out building The hotel staff were friendly and happy to oblige. The rooms were clean…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r174201220", "sub_review": {"Value": 3, "Location": 4, "Rooms": 3, "Cleanliness": 3, "Service": 4}, "travel_purpose": "", "rating": 3}, {"title": "Great holiday location!", "review": "Stayed here as a package with Omega Holidays- me 'n my 16yo DD. Great base, had trips out to Verona, Venice and the Dolomites, and spent our other days swimming in the glorious Lake Garda. Food at the hotel was great, staff friendly and helpful, even helping our group out when our late return from Venice meant that we were technically too late for dinner. They waved us in, no problems! Would def go again! :-)", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r173821245", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Lake Garda trip, August 2013.", "review": "I stayed with my wife & 11 year old son, the Hotel staff were very friendly & the rooms were kept very clean, & the food on offer in the restaurant was superb! I have no complaints at all about the Hotel La Vela, & would stay there again if I ever visited Italy again.", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r171834567", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Nice people but missing resources", "review": "+  Good situation. Located beside a park and shops. Just a road to cross to arrive at the beach.  Nice people in the restaurant, in the rooms and at the reception BUT not sufficient in number to manage everything.  - Worst beds I have ever seen (see pictures)  Old hotel requiring complete overhaul (in particular bedrooms and bathrooms)  Noise in the swimming pool at night every day", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r169265528", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 1, "Rooms": 2, "Cleanliness": 2, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Lovely place but not quite up to expectations", "review": "Torbole is a really nice place, in a beautiful setting and the hotel is very well placed for reaching the centre of the town and the lakeside.  However the week we were there it was exceptionally busy,  hosting a  windsurfing and sailing competition and the town was full of cyclists apparently there for the mountain biking but intent on using the lakeside paths.  There's a very \"youthful\" feel to some of the bars, and although restaurants are good there are not as many as you might expect.  The hotel was also very busy with many coach parties (including ours!) and at times, with the mass catering, it felt a little like Butlins or worse, school dinners.  The food was average, as you would perhaps expect under the circumstances although as other reviewers have said was plentiful…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r167624645", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Very Happy Tour Group", "review": "I have travelled to La Vela twice now, once with my husband and once with a party of 60 students aged 11-18.  Both stays were fantastic.  The rooms were very good, the hotel room for myself and my husband was clean, comfortable and spacious.  The apartments given to the students were perfect, they loved the fact that they had a balcony and two separate rooms, one with a table and chairs. Again they were clean and comfortable.  Air conditioned when it was hot and lovely and warm at the end of October when it snowed. The food was excellent value.  The menu choice in the main restaurant was very good, the pasta was especially nice.  When travelling with the students the hotel catered for them all really well, including vegetarians, vegans and non pork eaters.  All the students…", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r144322701", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Great base for touring Lake Garda", "review": "Torbole is a lovely little town on the edge of the more mountainous  North end of Lake Garda. It is not as commercial as the famous locations around the lake, but just as pretty and has a good bus service. The hotel is set back just 150 meters from the Lake beyond the useful shops and petrol garage.   The Hotel serves many coach parties so if you want a small intimate hotel then this is not for you. We were part of a coach party so expected average quality rooms, mass catering, and lots of coming and goings of guests.   Some rooms overlook the central quadrangle, others the pool, others the coach park. Our room was above the dining room which was fine although noise from the pool area could be heard. The rooms were warm, and although had balcony doors onto the balcony, there…", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r143969969", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "A good all round Hotel", "review": "Just back from a Leger coach holiday called \"Scenic Splendour of Lake Garda\".  We stayed 4 nights at the La Vela and found it more than adequate in every way. Breakfast was a cold buffet but with plenty of choice.  Evening meals varied from day to day, but were always enjoyable. One evening we had 5 courses, and we were surprised to find a carraff of red wine provided at meals. Our room was a good spacious size with a balcony giving views of the wonderful mountains.  The shower cubicle was a bit small, but otherwise the bathroom was fine. People who complain about this Hotel are in my opinion very fussy and seem to exagerate tiny faults.  We enjoyed our stay.", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r143913666", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Good Value for Money", "review": "Myself and partner have stayed at numerous hotels around Lake Garda over the years and considering the money we paid, I think that Club Hotel La Vela offers good value. 4* hotels there may not be to the same standard as 4* hotels in the UK or Spain but then the prices generally reflect that. Last year we paid nearly double to stay at a 4* hotel in Riva and even more a few years ago in Sirmione so just wish that all those people posting negative comments would just consider what they have paid.  The hotel is in a great location, with the lake only a few minutes walk away and some great bars and shops in Torbole and nearby Riva. The breakfast was fine and so was the evening meal. The room we had was nice and the staff were friendly.  If you want luxury then go for one of the more…", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r141821656", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Not as bad as some reviews suggest", "review": "This hotel is pretty average, but certainly not as bad as some reviews suggest.  Our room, in a separate block, was very comfortable, well furnished and clean.  The rest of the hotel is slightly tired - for example, the reception area - but it is nevertheless clean.  The food was fairly good - not out of this world, but quite a good choice and plenty to eat.  The waiting staff were excellent and the highlight of our stay.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r141597119", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "\"FAWLTY TOWERS - WHERE'S BASIL?\"", "review": "Recently returned from a 7 night stay at Club hotel la Vela. We thought we had been upgraded to a 4 star offering comfortable furnishings and delicious cuisine. How wrong this was! Grubby entrance mat was the start of things to come. Poorly maintained marked walls and dark corridors. Our room continued this theme. Dodgy TV on table from 1970's with matching chairs and in the bathroom a fan extractor that sounded like a tractor day and night! On the balcony the painwork was tired and the wooden railings not properly maintained and loose. As far the dining room (no sign of Basil yet) the food was bland and unimaginative - frozen vegs and what suspiciously looked like packet soup! Remember this is a 4 star hotel - NOT. Poor service and organisation with not enough sweets on several…", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r141516984", "sub_review": {"Value": 1, "Location": 3, "Sleep Quality": 2, "Rooms": 1, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Not the best experience", "review": "Stayed here for one night on a group tour recently. We were mostly marched out of the main hotel around the back to what was like backpackers accommodation. Even though the rooms were roomy and had balconies the building had that grubby feel about it, including the rooms. The bedspreads would have to be at least 50 years old. Just more modern bedspreads and a bit of paint would have made the room more welcoming. If you are looking for 3 or 4 star accommodation careful booking this hotel. Make sure you get in the main part of the hotel not the detached buildings. Did have a nice evening meal with entertainment and breakfast was sufficient.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r141383703", "sub_review": {"Value": 2, "Location": 2, "Sleep Quality": 3, "Rooms": 2, "Cleanliness": 2, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Italian Dream?", "review": "Just back home from a seven day stay at this hotel. Like one of the other reviewers we thought we were going to Riva Del Garda, Centrale Hotel only to be told on the coach that we would be staying in Torbole. When we arrived we were sent to the Annex. I've never seen anything like it. Butlins was four star compared to it. We complained strongly and four rooms were allocated in the hotel that night and four the next day. The rooms in the hotel were better and the food in the dinging room was acceptable. The staff very helpfull and pleasant in the dining room. I would think twice about using this hotel unless i was given a room in the main building.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r141004172", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Time to improve this Hotel", "review": "We have just returned after spending four days of our touring holiday at this hotel. On arrival it looks just as it claims to be a budget hotel, the lobby, bar and dining room looked smart and presentable, good start. The lift opened to reveal a very grubby floor carpet, ok so its a lift. On arrival on the first floor we were greeted by a stained carpet lining the corridors, partially covered with some very old and disheveld runners placed at strange angles, trip hazards to everyone else. The decor of the corridors was dated, dirty in places with scuffs and kick marks at various points, also some seats/futons were placed strategically in some corners, obviously fire regulations are different over there, glad we are on 1st floor. The room was the same as the corridor, dated,…", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r139993030", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 3, "Rooms": 2, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "STAY AWAY", "review": "Having done many trips to Italy, I can honestly say this is the worst hotel by a long way I have ever stayed at, Anywhere. Reception staff helpful as much as possible, but our party had many grievances. My room had blood on walls by light switches, filthy walls, bedding felt damp although clean. Shower head sprayed everywhere bar on me!! Food- breakfast downstairs was simply unacceptable, no room to fully cater for everyone. Evening meals were at best, poor! Bar area is ridiculous, too small, no comfortable chairs, and 1 guy trying to serve everyone. Simply put, I have put a letter of complaint in to the holiday company, and will be seeking compensation. 4 star hotel rating,1 star reality. Just remember that Italian hotels Buy their stars, not earned!", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r139455395", "sub_review": {"Value": 1, "Location": 4, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "", "rating": 1}, {"title": "Second visit to Hotel and would come again", "review": "Our second holiday to La Vela and we loved it again.  The staff are excellent, very friendly and very helpful.  We needed urgent assistance one day and the staff helped immediately,, thank you. The food is excellent, and the gala dinner is amazing.  We booked through Travel Zoo and Inghams and got a very good deal. The only concern this year was that children were in the pool late at night, some nights even adults.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r139220243", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great Holiday", "review": "This hotel has been used for over 20 years by the tour company with whom we travelled. The rooms in which we were accommodated were spacious and clean. The buffet food for breakfast was plentiful and there was a number of choices for the evening dinner. The service was good and the staff happy and cheerful and always ready to assist. The pool and surrounding area was kept spotlessly clean. The hotel is well situated both to shops and the lake. Will definitely be returning.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r138702582", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very disappointing Stay", "review": "Have just reurned from a 6 night stay at this hotel. The hotel was very disappointing. Staff on reception very unhelful.The double room we stayed in was really only suitable for a single person. When we asked could we change we were eventually shown an apparment in the annex which looked as though it hadn't been used in months.Although the room we stayed in was clean and well maintained it was quite dark and gloomy. However the meals were the worst part of our stay. We had booked for vegetarian meals and one night were presented with a starter consisting of slices of meat . The waiter just laughed. The other  meals were so disgusting that we ended up eating out on 2 nights. Not good when you have booked half board. I would definitely not recommend this hotel.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r138674563", "sub_review": {"Value": 1, "Location": 3, "Sleep Quality": 3, "Rooms": 1, "Cleanliness": 3, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Not 4 Star - Disappointed but OK!", "review": "Went with my daughter and her friend (both 17) early August for one week. Upon Arriving at this hotel my first reaction was instant dismay. Mat to entrance of hotel was filthy dirty and never cleaned whilst we stayed there. No lounge area, only tables around very small bar area.  Booked 'Superior' room for 3. Room was ready for us upon arrival, but not what one expects for paying for 'superior'.  This was on first floor (116), so were able to get free Wifi in our room. Shower miniscule, don't think larger people would be able to shower comfortably. Also only two chairs on balcony for a 3 person room. Only view from room was neighbours opposite, also roof from restaurant was adjacent to our balcony, but look above this and you had good view of mountains.  Went to reception and…", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r138360260", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "No complaints", "review": "We enjoyed staying at this hotel and would recommend it for its location in the heart of Torbole. A supermarket is 50 mtrs away and Lake Garda 100 mtrs.and being just across the road from the main coach park made ideal for site seeing trips. Ice cream and pizza bars were abundant in the surrounding streets.  Breakfast had a good variety and was very tempting. Our evening meal included a 1/2 bottle of wine but mostly the waiters offered more if our glasses were empty. Food was always good and something to look forward to. Gala night was even more so.  The hotel was very clean and gave us a good nights sleep.", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r137550853", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Disgruntled Scot in Italy", "review": "Advertise that local cuisine is served, nope - frozen vegetables most nights. Most nights we were served packet soup.  Did have an occassion where we returned from a day trip to find that our room had not been cleaned or made up. When we reported this to the Reception we were informed \" every has gone home\" \"nobody is here to do it\". We were provided  with clean towels by the Manger later on, but we had to make the beds up ourselves. Not what we pay holiday money for.  Area was beautiful but would not recommend this hotel to anyone", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r137547910", "sub_review": {"Value": 2, "Location": 5, "Sleep Quality": 3, "Rooms": 2, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Disappointing food.", "review": "Very disappointed with the hotel. We were originally meant to stay in Riva at the Hotel Centrale but the holiday company changed us at the last minute. We were assured this was a 4 star but it barely makes 3 in my opinion. Instead of being in the main hotel we were given an appartment in one of the annex buildings. The appartment had a damp smell from the day we came in to it. It was spacious enough and had a good view of the pool from the balcony but the air conditioning was limited in its effectiveness and the shower was tiny. The pool seemed fine but sunbeds were limited in availability. The biggest disappointment was the food. Breakfast was fine offering a reasonable selection each day (including cooked if you wanted it) although the hot food was never very hot. My biggest…", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r134537583", "sub_review": {"Value": 2, "Location": 4, "Sleep Quality": 3, "Rooms": 2, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "No longer a 4 star standard", "review": "Stayed 1 week early Sept 2011 in \"Superior\" room which in my view was worse than a Travel lodge. No creature comforts, 2 kitchen chairs & 2 Plastic balcony chairs, fridge, TV and hair dryer. The food was appalling - gave up after 3 days and ate out at far better lower graded hotels,Staff were rushed no variety at breakfast. The hotel brochure was obviously very out of date as there was no guests lounge as shown and no spa as advertised and the culinary description bore no resemblance to the food I experienced. Only redeeming feature was location, but all the hotels in Torbole could boast this as the town was small and very pleasant.", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r121613862", "sub_review": {"Value": 2, "Location": 4, "Sleep Quality": 2, "Rooms": 2, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled solo", "rating": 2}, {"title": "Excellent value for money", "review": "Wonderful hotel with very helpful staff. Gala Dinner was excellent, food, service, atmosphere everything was just perfect.  We stayed in the new complex at the back of the hotel which had amazing views, very large room with balcony. Very clean rooms, clean towels daily.", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r117743922", "sub_review": {"Value": 5, "Sleep Quality": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice hotel, a bit outdated", "review": "I have recently stayed here and i really enjoyed it , this small hotel has good facilities , a pool and free Wifi (Bear in mind the Wifi is only available in the bar and restaurant) The food at this hotel was a bit up and down some days it was very good and some days it was not as good, but 2 workers at the hotel stood out, 1 guy at reception was fantastic i do not know his name but he was bald, and had glasses and i'm pretty sure he was German but he was very pleasant and got the job done, also 1 woman in the restaurant called Alisa i think she was Romanian she wears glasses and she creates a good atmosphere in the restaurant and gets things done and makes sure the waiters get things done for the people having a meal, I really liked this hotel but it is outdated, a bit old…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r116861958", "sub_review": {"Value": 3, "Sleep Quality": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Nice hotel shame about the service", "review": "We where for the second time in Riva, at the same hotel and the first time when we chose Hotel Flora, I went with massive expectations based on other traveller reviews on trip advisor. Our expectations last year 2010 were even exceeded and that’s because of the staff from breakfast: Mirabella and her fiancé, BUT this year me and my husband had the unpleasant surprise to not meet them again and I say this because the difference between that wonderful couple from  last year(where everyone was talking and complimented them on TripAdvisor) and the staff from this year : it’s HUGE. Service at breakfast practically no longer exists, customers are treated as not being presents, you must hurry in the morning at breakfast to get bread ! if something is missing is no longer replaces…. in…", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r115102587", "sub_review": {"Value": 3, "Sleep Quality": 5, "Cleanliness": 5, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Loved This Hotel", "review": "Stayed at this hotel recently with a group of friends and loved it.  It has a great location just a few minutes walk from the lake.  Also really handy for the bus stop for local buses around the lake and also to Verona. The room was pleasant with a view over the pool. There was a candelit dinner evening with live music one of the nights which was lovely. Breakfast was good so all in all great value for money", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r115020911", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "This is not our usual standard of hotel.", "review": "We were instructed not to come for our evening meal until 8P.M  We had to sit where  we were told  beside another couple with whom we had little in common for the whole of our stay. The food was O.K. but the service was slow.           We were given a room a long way from reception and had to endure a shower which almost scalded us as there was no instruction on the dial. After our third complaint I was   given the key for another room where I had a proper shower!            The only place to sit was in the bar as there is no lounge.The T.V. only had B.B.C.           world news in  English so not much entertainment.", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r104356094", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Basic accomodation.  Comfy enough.  Pleasant stay.", "review": "Rooms:  2 single beds pushed together for a double - this seems fairly standard.  Comfy bed.  Rooms need updating and redecorating to make them nice, but it was OK and got a good nights sleep.  We did not use the aircon (no need at the end of September), so can not comment on it's efficiency / noise etc.  We had a room overlooking the pool and it also overlooked mountains beyond.  Location:  Very pleased with the location.  Couple of minutes walk from the lake, and right next door to the co-op for those holiday essentials (biscuits, crisps, wine etc!).  It is also at the coach point for picking up the coach for day trips.  Faciliites:  Pool - never went in the pool, but we did sunbathe by the side of it on one afternoon.  Everyone who went in the pool shrieked at the coldness. …", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r81917706", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "disappointing birthday trip.", "review": "went with family last minute with inghams (always ok in the past) to celebrate my 50th birthday ,despite telling inghams the hotel and the rep in the resort there was no acknowledgement made at all.The aicon did not work in two of our three rooms ,reported it on saturday and to rep on sunday,saw rep again on thursday eventually got a fan.Room very tired and smelled ,safe did not work and it was never convenient when we asked to use the hotel one ,they suggested we leave our passports in the pigeon hole,never enough towels,only one in room on arrival.most plug and light fittings were loose, gala night everything had pork in ,but one of us was a vegetarian who was promised omlette or fish ,she got the ham taken off the melon for starter and a plate of cold oily aubergine for…", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r77838699", "sub_review": {"Value": 2, "Location": 2, "Sleep Quality": 1, "Rooms": 2, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Nice hotel shame about the service", "review": "Went with a group of 20 adults and 25 kids and had a good time. Location is great near the lake. Weather was hot and AC never worked. Complained 3-4 times but still never worked as with other people in our party. Staff on the whole were pretty good. Room was large and cleaned every day but a bit dated. Shower was the smallest I have ever seen and a tight squeeze to get in. Food was OK which you had to order at breakfast for that evening and had to sit at the same table. Not enough sun beds. The entire party enjoyed their stay and had a good time.", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r76974103", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 3}, "travel_purpose": "", "rating": 4}, {"title": "Varied experiences", "review": "We stayed at the Vela as part of a single parents holiday group and had a mixed bag of experiences.  Our room 613 was lovely and very clean with a large balcony overlooking the pool with views of the mountains beyond.  We found the quality of the food to be very good - we were half board - and the variety was excellent with something for even the fussiest child to enjoy. On the down side, we ate our meals in the cellar room which, although decorated well, meant that even on the sunniest and lovliest evenings, we missed out on the atmosphere.  The staff in the restaurant were quite unhelpful in the main and ran the show with an iron fist - we had to sit at the same tables each time, we had to select our evening food in the morning and they were unprepared to rearrange the tables…", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r76964856", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 5, "Service": 2}, "travel_purpose": "", "rating": 3}, {"title": "never a four star", "review": "Booked a last minute holiday with Inghams to stay at the La Vela Torbole on Lake Garda. The hotel is well situated but the rooms are dated and some guests complained that their rooms smelled. Our room had fridge but others did not. I reported the shower cubicle door was broken but five days later it had still not be fixed.The food is awful we were there on a half board basis but ate out every night. The breakfast was always scrambled egg and bacon, not a great deal of choice. Sometimes they ran out of food. The hotel staff were unhelpfull their command of the english language was very poor, it should be better if being used by english holiday firms. On the plus side the Inghams staff were excellent.", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r76260391", "sub_review": {"Value": 2, "Location": 4, "Sleep Quality": 2, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Great position excellent value for money hotel", "review": "We booked thru travelzoo which directed us to Inghams,after reading the reviews re Inghams guests we were pleasantly surprised that we were allocated a table in the upstairs restaurant as were other Inghams guests.It would appear that the downstairs restaurant was used for groups staying one or two nights.The food was of excellent quality with very good choices every day,lots of local fish on the menu.The rooms were cleaned to a very high standard each day.The only down side was the air con broke down for two nights in the middle of a heatwave 37 c at 5 oclock in the evening,but it didn't spoil the holiday.Air con and safety deposit boxes were free to use. The travel rep Danniella was excellent and was helpful in every way. We would definately return to this hotel .", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r71892044", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good location, poor service", "review": "Hotel is superbly located - short walking distance from the centre and the beach of Torbole, however far enough from the crowded road around the Garda lake. Rooms are proper quality, but not renowated recently. The swimming pool is compact but nice. The problem we experienced was with the stinking water ropes, which the reception was  unable both to repair or to offer another room. Hence we left the hotel, at least with the advance payment returned without hassle. Another problems - the parking was fully packed, so we had to park in front of the hotel entrance and could not approach the room to unpack and pack the luggage.", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r71628241", "sub_review": {"Value": 2, "Location": 4, "Sleep Quality": 2, "Rooms": 2, "Cleanliness": 2, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "very pleasant stay", "review": "Stayed for one week. Room was comfortable if slightly small. Staff very pleasant. Food good. Location very central. My only reservation with the resort were the number of mountain bikers in the area. I would highly recommend the ice cream at the Flora Cafe on the main road to Riva, the best i've ever tasted", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r70709939", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "very good !!!", "review": "Lovely hotel in a beautiful area. staff very helpful, food was plentyful and good value, room cleaned daily and nicely decorated. definatley would stay again well done Club hotel Vela !!! booked through Inghams", "date": "June 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r67012031", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A clean, comfortable hotel offering good value", "review": "This was booked through Inghams as a late deal. The room was clean and recently refurbished.  The bathroom was spacious and the shower excellent. The air conditioning was audible but not a major problem.  The food was better than average with a reasonable choice.  The staff were helpful and friendly.  Overall it was good value and better than other budget priced holidays we have been on.  For Italy which can be expensive I thought we got a good hotel and holiday at a very fair price. Perhaps not a 4 star hotel but certainly a good 3 star.", "date": "May 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r66448755", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Not to 4 star standards", "review": "We stayed for a week in this hotel, having booked through Inghams. The Hotel food is of a very poor standard with limited choice. Our room was basic (not up to travel lodge standard) The air conditioning didn't work and the shower tray was cracked. The staff though, are friendly and helpful. There must be better Hotels in the area than this!", "date": "May 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r65446024", "sub_review": {"Value": 2, "Location": 4, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Good value for money", "review": "We booked through last minute . com and after reading the reviews were a little worried to what the hotel was like.  On arrival we were taken to a new block at the far end of the hotel.  The rooms were new and we had a lovely balcony looking over to the mountains.  We were allocated the downstairs resturant with the other Inghams guests and that was fine. The last evening we were told we had a table in the upstairs resturant and we were looking forward to that.  Not so good as downstairs. Guests had taken deserts with their starters so there were none left for us.  It was noisy and crowded and the downstairs was much nicer.  A lovely stay and very convienient for buses and the lake.", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r45516465", "sub_review": {"Value": 4, "Location": 5, "Rooms": 5, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Nice friendly staff. Food could be easily improved.", "review": "We had a week at La Vela with our young boy (7 months) and the staff were just fantastic.  They made us feel welcome and were very attentive.  We were half board and well thoroughly under impressed by the food.  The breakfast was the same every day (bread roll, meat/cheese slices and a boiled egg, cereals (no cold milk) and some fruits.  Coffee was good however.  The evening meals were more varied, but always over-cooked.  The menu could be improved very easily, with just a few more basic fresh Italian dishes.   Be aware that the pool is not heated.  But overall we had a lovely time and would return to La Vela - not for the food, but for the great service and wonderful staff.", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r45513954", "sub_review": {"Value": 4, "Location": 4, "Rooms": 3, "Cleanliness": 3, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Would highly recommend", "review": "Recently spent a week here in August 2009. Very good location for the town centre without any of the noise food was excellent. We went half board. Included with your meal is wine and whats better if you want some more you can. We found we were having four course dinners on an evening with a buffet salad to start followed by a starter which was usually a soup or pasta dish followed by a meat or fish dish and a choice of gateau's or mousse to finish. The staff were friendly. The rooms were clean. The only problem was the air con did not work as efficiently as we would have liked and was rather noisy. Plenty of bars within a 10 minute walk. Buses the cheapest way to travel.", "date": "August 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r40648143", "sub_review": {"Value": 4, "Location": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Not 4*, but fine", "review": "As with others, booked through internet, hotel allocated on arrival.  Certainly not as bad as it was made out to be.  Staff all really helpful.  Rooms small, no fridge, loud air-con.  Ended up as part of Inghams group - at back of dining room in the basement, didnt object to that, but see why others complained as all other guests either had a bottle of wine and bottle of water with each meal or silver service meals.  Nice range of good fresh food (although one night no vegetarian option available) as other tour companies are served first, Inghams guests didnt always get the full range of dessert options.  We both wanted to drink orange juice, and at 2euros a shot was quite expensive. Used the soap / shampoo and it was not replaced.  When due to leave we checked under around to…", "date": "August 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r37931363", "sub_review": {"Value": 3, "Location": 5, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Not 4* but absolutely fine", "review": "My fiance and I stayed at the La Vela for a week at the beginning of August.  We booked it through Lastminute.com and didn't have a lot of information before we went.  Our room was clean and comfortable and the air conditioning worked (although it was a bit noisy).  It had a small fridge which was handy for keeping water and wine cool.  We were also lucky enough to have a balcony overlooking the pool area which was well attended by children during the day and evening.   We didn't swim there but were told the water was pretty cold.   We were on a half board basis and it was the usual continental breakfast with plenty of choice and most mornings an offer of lovely fresh fruit.  Evening meals were fine.  We had to make our choice for dinner at breakfast time which was a bit odd but…", "date": "August 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r37594449", "sub_review": {"Value": 3, "Location": 4, "Rooms": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Terrific Torbole", "review": "We have just returned from the Club Hotel La vela and we had a fantastic time, we had previously visited Torbole before when staying in Limone and we assumed that Torbole was a very small resort, but having stayed in Torbole this is by far our favourite part of Lake Garda to date. Now for the Hotel,   This Hotel is certainly not a 4 star in relation to the Pool and the pool area as the block paviours around the pool were uneven and cracked making it dangerous for children and adults.  The  pool was cleaned everyday by the pool man but on closer expection it was dirty around the edges eg scum lines.  The pool water was freezing.   The food at this Hotel was excellent, very fresh and very varied, for people in past reviews to moan about the food was hard to believe as we thought…", "date": "August 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r37070933", "sub_review": {"Value": 5, "Location": 5, "Rooms": 3, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Would advise caution", "review": "Just arrived back on the 1st of August. Be prepared if you are in the original hotel (the oldest part) the rooms are very much in need of a refurb. Beds are uncomfortable, had a toilet needing man-handling to stop it running all day and night. Part on order but hadn't been fixed during the week we were there. Shower cubicle very small to move around in and doors kept coming off.  Waiters/bar people very kind including the hotel manager. Customer service from Inghams leaves something to be desired especially in times of crisis.  Main concern is that it has four stars, this hotel should not be sold to UK customers with this rating. We stayed in a four star outside Venice before going to the lakes and there was a vast difference, more in-line with what you would expect.  Pool area…", "date": "July 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r36459222", "sub_review": {"Value": 2, "Location": 4, "Rooms": 1, "Cleanliness": 2, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Nice quiet, comfortable and clean...recommend!", "review": "Pleasant staff and excellent Ingham's reps! Room was small but had pleanty of storage space and fridge (not all rooms have a fridge). The room looked like it had been upgraded recently. We've visited Italy 4 times now (different areas) and have found that all the rooms have tended to be small, the smallest and most expensive was in Venice. This in mind it was a good room . Air con. worked well with no restrictions for use. Food was good with 4 choices for each course. OH!...and sunbeds were NOT reserved at dawn! There seemed to be enough for those who wanted one.  We had a great deal and would certainly recommend this hotel and the beautifull area of Lake Garda!", "date": "July 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r36435554", "sub_review": {"Value": 5, "Location": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice place, good value - to be recommended!", "review": "Had an enjoyable four day stay at the La Vela. The resort of Torbole is in a lovely location with lots of nice bars and cafes.  Being July, it was very busy (never seen so many cyclists!)  but everyone was well mannered & pleasant - not many English and definitely no \"chavs\". The hotel was good value - our room was clean, air conditioned with TV, safe & fridge; it was rather small and when the twin beds were put together little space remained. The bathroom facilities were adequate and clean. Being Italy, we were expected to share the dinner table with others in our group; once we had got used to the idea it actually turned out well. Breakfast was standard continental buffet but dinner was a \"proper\" waiter served meal which we ordered at breakfast; salad was always available…", "date": "July 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r35464723", "sub_review": {"Value": 4, "Location": 4, "Rooms": 3, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "SUPER HOLIDAY!!", "review": "We had a very nice stay In Club Hotel La vela. The \"family rooms\" are an execellent choice, because of the extra room, certainly with older children. There even was a good working fridge. The rooms were cleaned every day and  dirty towels replaced.   The airco cooled just enough. Nice balcon with sight on the pool. The water of the pool was rather cool, but some people kept swimming till 10 o 'clock in the evening, so.... We ate all week in the veranda upstairs with airco, a good service and enough variation in the menu's. Also the people at the front desk were very friendly en helpful. Torbole is a very nice place at the Garda lake. We even made a beautiful bike ride (flat/no cars)  along the Sarca river to Arco! Price/quality for Club Hotel La Vela is very good! We surely …", "date": "July 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r34994413", "sub_review": {"Value": 4, "Location": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Sorry for that exp.", "review": "Rooms were not clean aircon not working and service far far away from expectations. Lady - Manager should be kept away from the customer service - she just make problems 5 times bigger.", "date": "June 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r34825356", "sub_review": {"Value": 2, "Location": 5, "Rooms": 2, "Cleanliness": 2, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Nice & clean, but poor service & food.", "review": "We paid £299 pp half board and were really pleased to get a 4* hotel for this price, but don't think the hotel warrants the 4* rating. We weren't planning on having a holiday this year, so wanted to keep the trip really cheap, but because of the poor food in the hotel and the expense of travelling in this area we ended up spending £700 in the course of a week. Torbole is lovely, but a little quiet for us. Best restaurants were the Terrace (on the front) and a little wine bar opposite the bank which does really good food and wine (can't remember name). Hotel welcome was pretty poor, no showing to rooms or explanations of dinner times/other info. Room was fine, in a new block so nice and clean and decent bathroom, good air con. Real issue with the hotel was the poor food, we only…", "date": "July 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r33882912", "sub_review": {"Value": 2, "Location": 4, "Rooms": 4, "Cleanliness": 4, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "superb accomodation", "review": "just back from this superb hotel,set in the small town of torbole this hotel was everything it promised!.  we arrived at about 9 30 p.m,we had missed dinner,but a cold platter was prepared for us on our arrival,we also had a bottle of wine bought to our table,and i had a glass of beer,drinks were free!!!!!!!. our room was compact,not small,but that suited us,comprised of two singles pushed together,but was ok too. extra pillows were available and so where covers if required,there was a free safe in the room which we used.had a balcony giving stunning views of the mountains. breakfasts were probably our only minor down point,mainly cold meats,rols,boiled eggs,fruit ,etc etc,no english breakfast food im afraid,but you get used to it. dinners were amazing,salad bowl at the…", "date": "September 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r20280683", "sub_review": {"Value": 4, "Location": 5, "Check in / front desk": 5, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Beautifull", "review": "We stayed at hotel club la vela in may 2008 an stoped for 1 week. The staff the hotel and the place was very nice, the rooms was very nice an cleaned every day with fresh towels. you had to go down for breakfast every morning to chose what you wonted for evening meal. The food was nice but the best meal was on the gala buffet night it was beautifull. we went half board which was breakfast and evening meal an recommed that you do that as it was quite dear for food. Alex who worked behind the bar was nice an always happy to help. We enjoyed our stay an it was beautifull round the lake, but there wasnt really anything for us to do its really nice for people who like wind surfin.", "date": "May 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r19368866", "sub_review": {"Value": 4, "Location": 4, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Well, what can I say", "review": "Arriving at the hotel with a coach party was interesting.  There are pros and cons to this place. Overall acceptable apart from the overbearing manager who was never wrong! The young ladies  on reception  were  super efficient and very  pleasent and helpfull.  The 1  lift couldn't cater for all the people at once and no porter service was on offer. Couldn't swing a cat in the shower and the air con only drops the outside temp by 5% so at 35%outside you have 30% inside! Beds were comfy and rooms kept spotless and fresh linen and towels. You either get a balcony or a fridge if there isn't one. fair do's. Can't complain about noise as there wasn't any apart from by the pool ! Porky pig summed up the menu, which was unfortunate when Italian food would have been welcome on the menu…", "date": "August 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r19214093", "sub_review": {"Value": 2, "Location": 3, "Check in / front desk": 5, "Rooms": 2, "Cleanliness": 4, "Service": 3, "Business service (e.g., internet access)": 2}, "travel_purpose": "", "rating": 2}, {"title": "Great hotel.", "review": "We have newly returned from a really great priced spring break at this hotel which we saw on teletext - £299/per person for 7 nights half board.  I have to say we were a bit apprehensive, as we couldn't find any reviews.  However, it was absolutely fabulous.  The staff could not do enough for us - after arriving 8 hours late due to flight delays, we arrived at the hotel about nine o'clock in the evening.  The tour rep had asked all the hotels who were expecting guests who had been delayed to provide a cold platter.  This hotel, however, had the full meal waiting for us, including starter buffet, choice of pasta dish, main course and sweet. The food was absolutely delicious for the whole week, and there was plenty of choice.  Cold buffet breakfast and waiter service evening meal.…", "date": "May 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r17124988", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great Hotel", "review": "We have just returned from a week at Club Hotel La Vela. This is a modern hotel with modern rooms, laminate floors, beech furniture etc. We had a standard room with a balcony. The balcony had a mountain view. The room had a fridge and also a safe which was not charged for. We were half board and the service was excellent. The staff were always friendly and couldn't do enough to help. There was a good choice at breakfast and at dinner a choice of 3 starters or main courses including a vegetarian option. The rooms were cleaned every day to a high standard. The pool area and garden area were lovely. The locations is central. The views from the lake are magnificent and I would say the best in Lake Garda. The only downside of this hotel was probaly that you could hear noise from…", "date": "May 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d1058557-r16091197", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}]