[{"title": "Wedding - 2 Day ", "review": "What a beautiful detonation! We visited for a wedding and were so impressed by the location of this hotel and their wedding venue.  Just beautiful.  Thank you for a great service especially Patricia & Fernandez!!! ", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1152652-d1069879-r627764455", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Place is a dump", "review": "If you’re looking for service and someplace nice, keep driving.  Nice view but still a dump  too bad as it’s an incredible location with clueless staff - terrible.  No love at all, no ownership - thin walls, dirty pool, drink stains on the tables - terrible.  Too bad as an incredible property with no management.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1152652-d1069879-r533854933", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Quietness", "review": "An amazing place. The silence, the birds, the stillness of time, the pool on the evenings  Pros: the quiet room facing the sea, the wonderful breakfast, the singer playing bossanovas at night, the excellent price-quality relation, the kindness of the staff, the Cabo, the restaurant (its own and those nearby)... Cons: mmm... none? Opps yep: no 4-bed rooms which makes family travel considerably more expensive.  In love with the place. I'll return.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1152652-d1069879-r499818714", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Super location", "review": "Superb location and rooms have superb views.  Comfortable bed, additional seating inside and outside there's a terrace with table & chairs. Air-conditioning is efficient and the room includes a fridge (versus a minibar full of overpriced drinks).  Plenty of choice for buffet breakfast.  It's all about the location and views though...", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1152652-d1069879-r484114181", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Highly recommended", "review": "We especially enjoyed the remoteness of this hotel, and the rugged landscape view from the room. Some rooms are facing the ocean, while others offer the views of the wild mountains. The scenery was remarkable and dramatic even in bad weather. Comfortable room. The entradas and postres served in the restaurant were delicious. Main dishes could be improved. In room wi-fi was a bit flimsy. Everything was superb till we received neighbours in the adjoining room, when it became painfully clear at least some of the rooms would benefit from some soundproofing.  All in all, it was a lovely stay and would recommend this hotel, especially if you prefer nature to towns.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1152652-d1069879-r483448628", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent location in natural park", "review": "The location is perfect for a quiet stay, very close to the sea but on its own surrounded by lush country park flowers and small bushes.   The rooms have terraces with great views, very good beds and showers. We could see an amazing sky during the night as there are not many lights nearby.  Breakfast had a bit of everything and we were seating outside looking at the sea and the hills. You can make your own fresh orange juice, tea and coffee. There were eggs, cheese and cold meats, cereals, some fruit and yoghourts,...  There was a charge of 10 euros for renting a beach towell which the receptionist kindly reduced to 5 euros. However, we still think the hotel could take a diposit instead...but that was the only thing we did not like.", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1152652-d1069879-r474481077", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Wonderful Location", "review": "We visit this hotel twice a year for bird-watching in the Cabo de Gata area. Great location well away from any other property, surrounded by the natural environment.  Very friendly staff, excellent breakfast, nice rooms, plenty of private parking.", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1152652-d1069879-r468002698", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great place away from it all", "review": "This hotel is located in a beautiful natural environment well away from any other property. Always a friendly welcome from great staff. Nice rooms, excellent breakfast, plenty of private parking. We always stay here when visiting the Cabo de Gata area for our bird-watching. Very good value. 'Pets not allowed' enhances its appeal for us.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1152652-d1069879-r430570413", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Amazing!", "review": "We were travelling with our little daughter (1.75 years old) and we all loved it. It's a very quiet, unique place with a view that is beyond comparison - the dry, withered landscapes of the Capo de Gata in October against the amazing blue of the Mediterranean Sea. If you want to get away from it all for a few days, go to this little piece of paradise.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1152652-d1069879-r426356837", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Very pleasant hotel", "review": "I had a very pleasant stay. The hotel is close to the sea, and some reasonable beaches. I wouldn't call it 5 star material,but it is certainly very nice, and the general surrounding area is quite unique.", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1152652-d1069879-r360118335", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Get away from it all", "review": "Great place to get away from it all. In the middle of nowhere and very quiet. Only a kilometre from some beautiful  beaches and you can walk from the hotel into the mountains. The staff were very good and would definitely go back again.", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1152652-d1069879-r353481383", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Phenomenal Experience", "review": "I loved every minute of being here. The staff is friendly and very helpful (although not all speak English), so check in even when I arrived late was no issue. The meals (I had breakfasts and dinners) were great, fresh, plentiful, served with a smile. The hotel is in a fantastic location allowing for quiet night and unparalleled views (see my photo). The room was comfy, light and generally lovely to stay in, although some may call it basic. Contrary to what booking websites say, I was pleasantly surprised that there is indeed is a reception open 8-23 and there is wifi available (for free). I wish I stayed a lot more days here! You do need a car to get here and there is only nature around so it is great for hiking. A perfect getaway. If you are looking for a lush 5* resort with…", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1152652-d1069879-r336260392", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Absolutely great", "review": "Located in the rural area before San José, after a short unpaved road, there's this peaceful place with great, modern rooms, beautiful views and very nice service. If you're looking for a quiet, rural place but also appreciate comfort - go there.", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1152652-d1069879-r334732335", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "AN HOTEL WITH A VIEW", "review": "We spend 3 nights at this amazing hotel:  it was a real unforgettable experience. This unique boutique hotel is nested in stunning surroundings and has amazing views.  The staff is very helpfull and friendly. This is the best place to explore Cabo de Gata.  We will definitely go back.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1152652-d1069879-r232166032", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Loved our stay here", "review": "Dear Mr. Stefan,    We are grateful to you for your opinion.    We hope to see you soon again.    Best regads,          Management Hotel Cortijo El Paraiso", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1152652-d1069879-r123521942", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent value - in a peaceful setting", "review": "We booked two nights in this hotel - and liked it so much that we spent an extra night. The staff were friendly and helpful, the rooms spacious, the set evening meal good value and the setting tranquil and relaxing. Excellent centre to explore Cabo de Gata, an interesting and picturesque area of Spain", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1152652-d1069879-r105137343", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely tranquil setting", "review": "This place is perfect if you're looking for quiet relaxation. Great views from the sea-facing bedrooms, make sure you book one! Dinner a good option one night. Would have been nice if the pool had been full, although understandly it wasn't in February. Staff very helpful, provide us directions and advice.", "date": "February 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1152652-d1069879-r98990397", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Really remote, really lovely", "review": "This is a nearly new hotel near San Jose, in a natural park, with fabulous views down over the park to the sea (try to book a room with the sea, not mountain views).  This is a place for getting away from it all, not for clubbing (the nearest sizeable town, San Jose, is about a 10 minute drive).  The rooms are nice and, whilst not large, are of reasonable size and the bathrooms good.  The restaurant was good and reasonably priced and the service exceptionally friendly and helpful.   Two caveats.  One, there is currently no WIFI, though they are trying to deal with that. Two, I believe that they do quite a few wedding receptions, which are unlikely to add to the tranquility you would be seeking if you chose this hotel - so it might just be worth checking if there are any on at…", "date": "December 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1152652-d1069879-r92172766", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Peace & Tranquility", "review": "If you like a remote location (nearest other building circa 1km away) with spectacular views across rugged terrain to the sea then this is the place for you. Rooms are clean, adequately furnished with a good sized private terrace and furniture. Service is friendly and the food acceptable- albeit in common with most hotels equivalent dishes can be had at local restaurants for lower prices. In this respect a quite superb seafood restaurant can be found 3 km away right on the seafront at La Isleta de Moro. The USP of this hotel lies in its stunning location, the magnificent views and its proximity to the cabo de gata.", "date": "October 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1152652-d1069879-r46609683", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}]