[{"title": "A Gem of a hotel", "review": "We visited as a group of 38 which included breakfast and an evening meal. We also had tea in the afternoon and wine/beer/soft drinks included in the package. We stayed in room 209 from which the picture is taken. The entire area is amazingly clean and tidy. The hotel has an indoor and outdoor pool along with a gym and spa facilities should you want to book a treatment.  We dreaded the food having read the reviews of previous tourists that had the buffet style menu. We had no complaints at all with the food. Was all hot and tasty and very plentiful.  Some amazing walks in the vicinity and a few bars and restaurants within a 5-20 walk. I highly recommend this place. The staff couldn’t do enough for us. The bar and food if purchased were very reasonably priced especially for the area. We went to a nearby restaurant on the first lunch and thought we were paying for an expensive slice of pizza each,turned out it was a very cheap full and very tasty pizza.... Silly tourists.  Amazing hotel and a great base to tour the area. PS,the outdoor pool is a little chilly...…", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1071861-r715248214", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "It ticked every box and then some", "review": "Firstly, the hotel is more like a 4 star than 3 star! If you go there expecting 3 stars, like us, you will be pleasantly surprised. The location was a short stroll from the restaurants and bars, there were amazing views! the facilities at the hotel were spot on, great pool area, the rooms were perfect and immaculate. The evening entertainment was so good, and lots of fun, the band were fantastic! Special thanks to Sebastian who went above and beyond to make our stay a memorable one! Also to Luisa who should be very proud of her business. We will see you next year! ", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1071861-r702399857", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Lovely Staff. Lovely Food. Lovely Facilities. Thanks Hotel Splendid", "review": "Having just returned from a school tour stay from 13th-16th of May, 2019. I cannot recommend Hotel Splendid Sole enough. It was the nicest hotel I have ever stayed in as part of a group and school tour. The staff were beyond friendly, so kind and helpful. They made a huge effort with us! All rooms for teachers and students were clean, well equipped with a balcony view. The outside facilities were excellent and safe. The restaurant in the morning and evening offered a great selection of food. I would highly recommend this hotel for school tours too. Thanks so much to all staff. We will be back!", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1071861-r674808477", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Terrible Food", "review": "Dear Danielle ,  We are glad to hear such beautifull compliments , we always take care of our guests and give them the best experience to enjoy their stay. We'll make sure to send your congratulations to the staff and we look forward to receive you again .  Best regards  Luisa", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1071861-r620374902", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Fantastic family holiday", "review": "I travelled to this hotel with a coach company the location is not good if you travel independently you will need a car l had a lovely room and a nice bathroom spotlessly clean take a travel kettle with you as there is not one in the room , the service in the restaurant was slow due to them being under staffed with the volume of people in the hotel but the staff in the restaurant were lovely but the food was terrible the worst l have had", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1071861-r606073114", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Appalling Food", "review": "Although hotel clean, the rooms are sparsely furnished and I have to say the hotel food was just dreadful.  As part of a coach party I can only assume this is why the standard of the meals served and the service was so awful.  A restaurant full of at least 50 and two staff serving several courses.  I am told owned by a family, what a shame they didn't think to give their staff a hand but just sit inside their 'goldfish' bowl adjacent to the main restaurant eating I am sure a far different meal to their guests.  Cold vegetables every day - cauliflower, beans, peas, courgettes, spinach etc etc., were served on an open buffet every day and never touched, bland pasta with no sign of any taste, pork, pork and more pork and an omelette which I've never seen the like.   Thank goodness…", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1071861-r593073240", "sub_review": {"Value": 1, "Sleep Quality": 3, "Service": 1}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "“Spendid” it s", "review": "Very clean, comfortably decorated rooms. Access to two pools! Wonderful friendly staff! Sensible wholesome clean food included-light handed seasonings. Front desk very bright and energetic. Family owned And you are treated as family!  Great place for every one, special spots just for kids! Pizza oven on premises at the  bar Sunshine . Special events, Welcome party with free beer  and three piece band playing familiar tunes to sing along . Breakfast for everyone including yogurt and multi vitamin fruit juice. Hope to return. Close to many sites in walking and short driving distances.", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1071861-r592512507", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Location & food not good", "review": "Hotel is located on top of hill and it is a strenuous & exhausting walk to and from the lake.    No good for elderly or anyone with problems walking.    There are better placed hotels alongside and overlooking the lake.     Evening meals at hotel terrible but there are decent restaurants & bars in the local village nearby which we used on 3 evenings as we could not suffer the hotel meals.    Stayed 8 nights with a coach party and everyone complained.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1071861-r592253263", "sub_review": {"Cleanliness": 2, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "'' Nice place to stay'", "review": "While visiting Gardaland stayed with my friend's at this place... 2 of my friend's and I got an amazing room, modern and new. The food was ok. The employees were very kind and helpful, and also the location was perfect! Overall had a nice stay, would come back!", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1071861-r584536697", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "What a pleasant surprise! ", "review": "I spent a weekend at Hotel Splendid. I was looking for a quite and relaxing hotel and i have been so amazingly surprised by the professionalism of the staff and the lovely room facing the quite courtside and the lake too. Really enjoyed my stay there I will surely come back in the near future. Highly recommended. ", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1071861-r573412590", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Bad customer service and worst restsurant", "review": "We were here as part of a wellness retreat. Bad experience. I can't even count what went wrong.  I start with food. Food was really poor and presented hygiene issues. Some examples...greens were not washed and full of sand. Soups were so salty that we had to turn it back. Or often they were burnt. Vegetables were overlooked all the time. Obviously they don't have a chef in the kitchen. I recommend to skip the restaurant and eat somewhere else.  The rooms are clean-ish. Rust at the bottom of the showers and in the water boiler that became unusable for this reason.   They do have a pool and jacuzzi in the basement with dry and wet sauna. The water in the pool didn't seem clear as I could not see the bottom while swimming. The jacuzzi was cold and had the plastic walls peeling off…", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1071861-r528428074", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Quiet and comfortable.", "review": "We stayed as part of a multi location coach tour for three nights at this delightful treasure near to Lake Garda. Our room was very clean and extremely comfortable, on the ground floor overlooking the very pleasant outdoor pool. In fact from our patio to the pool was perhaps ten paces across the lawn. The only downside was the WiFi not working in our block of rooms. This meant that I had to sit in the bar to use the internet but for that was possibly more enjoyable. The meals were very tasty, the serving staff could not do enough for us, even providing help with my Italian. The bar was stocked well enough and we were well looked after by a very nice, friendly young lady. The indoor pool and gym looked far too energetic for me to manage. Check out at reception was helped by the…", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1071861-r503499218", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Not as welcoming as you think!", "review": "Do not go as part of a group. Poor service, bad manners, poor food, not enough to satisfy a small child. Miserable staff. If you didn't finish your bottle of wine at dinner then they wouldn't allow you to finish at the bar but told you to take it back to your room. I wouldn't go back, awful experience.", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1071861-r497462437", "sub_review": {"Location": 2, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Beautiful hotel in Manerba", "review": "Can't recommend this hotel enough! Everything was very clean and well maintained. The pool and surrounding area immaculate. Staff extremely friendly and very helpful - nothing is too much trouble. Lady called Luisa especially helpful and very knowledgeable of the area, excursions etc...our teenage daughter loved the ice cream counter and probably had most of the flavours on offer! Manerba itself is very pretty. Will definitely return to this hotel. ", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1071861-r414710283", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Nice, quiet and friendly hotel", "review": "The staff were really friendly and helpful. The hotel is in a small village . We walked to the lake its 800 m from the hotel.  The outdoor pool was very nice. The kids loved the indoor pool because it was warm and open until 9:00 at night. The rooms are nice nothing modern but everything was there, balcony, bathroom, tv, wifi.", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1071861-r365062089", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Unhappy with this hotel", "review": "Traveled to the region with a group tour and found the hotel to be a bit disappointing from what we expected.  The restaurant is good I would give them a thumbs up. Very crowded some nights with other tours but overall I enjoyed breakfast and dinner. We were told our rooms had air conditioning and it didn't work. The front desk clerk came to check it and agreed it was very hot and stuffy, not to mention the bathroom heater on full blast. I was told that someone would fix it and nothing was done. I had to sleep with the balcony door wide open just to make the room tolerable. Housekeeping entered the room even after I put the do not disturb sign up. The Internet was horrible and I could barely get out an email. The very much advertised spa and indoor pool was made impossible to…", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1071861-r364461525", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Excellent", "review": "Dear guest, we are very sorry to read your review. We'd like to inform you in Italy the air condition systems are regulated by law: they can be used only from the middle of June till the middle of September. During your stay at our Hotel the heating system was still on (this is normal for this season in North Italy), maybe this was the reason why you got so hot in your room. We also want to inform you our indoor pool is open every day from 9 a.m. till 7 p.m., but only in the afternoon we had a children swim class (exactly from 4 p. m. till 7 p.m.), during the other opening hours the pool was completely free. Because of the swimming class, we also gave to your group of guests the possibilty to use the pool till 9 p.m. (something we normally don't do), right after the end of the swim class, but nobody took this possibility. We always take good care of our Guests and for us your satisfaction is very important and since 1960 we try to do our job at the best of our possibilities.", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1071861-r234468252", "sub_review": {"Value": 4, "Location": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Great hotel", "review": "We stayed here as part of our Newmarket holiday and it   is a lovely hotel. The staff are very plesent and will do anything for you and the food is great. The hotel is very quite in October and there for has its advantages. It has its own spa which we had all to ourselves. The rooms are quite and have shutters u can pull down so you can block out all light at night. The showers are powerful and hot.overall an excellent place to stay.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1071861-r232226042", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Would definitely go back.", "review": "We stayed for one night on our way between Tuscany and Germany.  We have stayed in the area on several occasions using self-catering accommodation.  As we were only staying one night this time, we chose this hotel.  We booked a family room but were given an apartment, which I can highly recommend for a family of four.  Lovely comfortable bedroom with large bed and french windows, plus kitchen/dining/sitting room with sofa bed for the children.  Cool marble floors (plus air con) and two full size french windows gave the place an airy feel.  We had a long balcony with table and chairs overlooking La Rocca.  We couldn't fault the room at all and the pool was great.  We loved being on the edge of the village as you can easily walk in for something to eat or a drink. Breakfast was…", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1071861-r229717606", "sub_review": {"Value": 5, "Location": 4, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 5}, {"title": "good standard on a group package", "review": "Stayed here for 3 nights as part of a coach trip, loved it.  The staff were friendly and very helpful.  Our room was basic, but clean and had all we needed.  The food was fine.  Location was great if you want a quiet place. The centre was within a short walk, lively night market.  However, the walk to the tiny harbour was very steep, not really suitable for those who can't walk very far. But once you get down there, it's beautiful.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1071861-r227904814", "sub_review": {"Location": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Transition year school tour", "review": "I am an Irish student who stayed in this hotel back in April and it's taken me this long to write the review because of the way we were treated while we were there, on our arrival we were all given our room keys and the way it worked there were groups if 3 and 4 per room, I myself was in a group of four and our room had 3 single beds which were pushed together (there was just enough room to walk around the bed) and we were expected to sleep on them with four people which meant that one person had to sleep on the Crack were both beds met each night, while other people with 3 in a group were given large two bedroom rooms, if I'm honest I taught this was very unfair and the manager was no help at all, very unprofessional when we asked for help and gave the impression that they…", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1071861-r218272685", "sub_review": {"Value": 3, "Location": 4, "Rooms": 1, "Cleanliness": 3, "Service": 1}, "travel_purpose": "", "rating": 2}, {"title": "Rugby trip from Ireland", "review": "Totally enjoyed the experience. The hotel was most helpful and friendly throughout our stay. Nothing was ever a problem or too much trouble. Thanks to everyone who helped with the barbecue  on the last night.   A feast!!!!  You will travel a long way to find such a beautiful area and such friendly people in a family run hotel.  We certainly will be revisiting the area and this hotel in the future.", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1071861-r213649597", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Avoid this hotel", "review": "More like a youth hostel: the plumbing was unreliable and woke us at 4.30 one morning. There was no night porter and we could not raise any help when an awful sound woke us and continued for over an hour - it could well have been a fire alarm - and the night emergency numbers were fictional. This was a Newmarket Holiday and should be avoided: the representative was unfocussed and unhelpful. One of the meals was so salty it proved inedible for many in our party.", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1071861-r211804297", "sub_review": {"Value": 1, "Location": 2, "Sleep Quality": 1, "Rooms": 2, "Cleanliness": 2, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Trip with friends", "review": "A very friendly, pleasant hotel in a lovely location slightly removed from the main tourist areas of lake Garda. The only issue I had and to be honest I've come across this in other Italian hotels is that the bed quality was not great. However this was only a small issue as the staff environment and local area made for a very enjoyable stay overall", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1071861-r210047477", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Kevin & Linda", "review": "This hotel lives up to its name, we were on our first coaching holiday with Newmarket travel and had asked for a quiet room with views of Lake Garda and not only did we have that but a magnificent view of the hotel gardens and swimming pool. We were allocated a small apartment with bedroom, dining/kitchen, shower room and very large balcony on the top floor room 208. All the staff spoke English but having Italian relatives we spoke their language when we wanted, they were all most pleasant, helpful and could not do enough for us. Service was excellent and everywhere, clean and we'll cared for. There are some great walks around the immediate area of the old town of Solorolo, LA Roca, the wooded hill behind the hotel with its old fort, stunning views of the lake and surrounding…", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1071861-r209833064", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Hotel Review", "review": "We recently stayed as package tour by Newmarket holiday tour of Italian lakes and the hotel overall stay is good provided you stay in package tour or if you have car otherwise the location is away from Lake harbour and also in small suburban area of the Menerba. The service is good  and there is no public transport to reach the hotel.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1071861-r209291922", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Newmarket Holidays Lakes Tour", "review": "Pleasant hotel in a quiet location.  I was a package tour guest and was made to feel welcome and the staff were friendly.  There were a lot other touring groups including a very well behaved school party.  None of this affected my enjoyment.  The hotel is situation in a peaceful area on a hillside and Manerba was a pretty village.  I would have like to explore the area around the hotel but time did not allow this.  We had a twin bedded room with a balcony with nice view across to the Church.  The food was good considering several large parties were being catered for.  The management put on a gala dinner on our last night which I thought was a pleasant touch.  There is a large outside pool but the weather prevented us from swimming there.  We used the indoor pool and Jacuzzii…", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1071861-r208661649", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "School Trip", "review": "I stayed at this hotel only a few days ago I am an Irish student who went on a school trip to the hotel.As I am a diabetic ,I needed a fridge in my room to store my medication ..to say the least the fridge had gone off food in it and it had a terrible stench. On asking one of the staff members if they could clean it they were very decent and went to clean .Food was horrible couldn't eat any of it .. Only for we had day trips planned during the day  we would have starved rather than eat the food in the hotel( it was that bad ) .The bar staff were very nice and kind , lovely people and very helpful. The Manager seemed to look at us 70 irish students as pests. He treated us with no respect at all.", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1071861-r200474574", "sub_review": {"Value": 2, "Location": 1, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 2, "Service": 1}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Nothing special", "review": "Don't expect a room with a view. My room had an enclosed balcony on the 3rd floor of an annexe to the main hotel. I had to stand on tip-toe to even see the swimming pool below. Too hot to sit on the balcony during the day due to the enclosed space and quite claustrophobic. The hotel seemed to be geared up to families with children, as the swimming pool area was heaving with young kids all splashing about in the pool and screaming and shouting (not ideal if you're looking for a quiet relaxing break). The bar / ice cream parlour / cafe was very basic set with outdoor table and chairs on a tiled floor. The reception is basic with a small leather sofa seating area. The dining room works on a buffet dinner basis, with a help-yourself salad bar, followed by waiter served main and…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1071861-r179092389", "sub_review": {"Value": 3, "Location": 1, "Sleep Quality": 3, "Rooms": 2, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "First 3 days of a package tour", "review": "This was the first part of and 8 day holiday and the hotel was basic but the rooms were clean and we found the beds comfortable.    There were four of us travelling together, we were lucky enough to have neighbouring rooms on the ground floor with lovely patio areas.   The bar staff were exceptionally pleasant and helpful.   Drinks were reasonably priced. The breakfast was adequate but the dinners were appalling, quite inedible, poor quality food and over salted.", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1071861-r165959791", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Cosy, comfortable and clean.", "review": "I stayed at this hotel for a week. The rooms were cleaned every single day from top-to-bottom and left spotlessly clean. The room was very comfortable and each one has a balcony so it is easy to enjoy the stunning surronunding views. The hotel is in great proximity to the picturesque little town of Manerba (2 mins walk) where there are a choice of traditional restaurants. and 10 mins walk from the ferry which took us to other parts of the lake. Really felt i could relax here and the pool was lovely, also cleaned every morning. The indoor pool/spa downstairs was fab and great for a bit of pampering. I would not hesitate to stay here again and prices are very good for the standard offered. The staff are very friendly went out of their way to help us with any of our requests. Thank…", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1071861-r165941638", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "\"Best Hotel in Garda\"", "review": "Its rare to come across a hotel that acts as a home away from home but thats exactly what Splendid Sole offers from the minute you walk in the door. The staff are simply incredible people!!!!!! Second to none!!!!! They make it their business to go the extra mile no matter what. My husband and I couldnt say enough about how much we enjoyed our stay. Our apartment overlooked the pool, beautiful views, quiet when needed, gorgeous indoor pool, fantastic breakfast. Definite value for money, the area of manerba itself is stunning. Lovely restaurants, pier, just a fantastic buzz to the place. A trip we will never forget. Already planning another for next year. Luisa, Lenka, Andrea, Guiseppe, Catalin & Simone we miss you already! Vera and Keiran King", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1071861-r165806458", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "cheerful and generous", "review": "We stayed here for 3 nights as part of an organised, package tour.  We had a room on the ground floor facing the swimming pool.  The swimming pool is oblong and very large - no doubt necessary when the hotel is at full capacity and during hot weather - the siting of the pool is functional though rather unimaginative.  The room and linen were fine, -- clean and entirely acceptable without being spectacular.The staff were friendly and helpful and the prices for \"extras\" (e.g. drinks) were reasonable.  The location of the hotel is very convenient for the village of Manerba (with a few cafes and restaurants) but is well above the lake (though no lake views), so a lake-side visit will require at least a 20 minute steepish downhill walk with the ensuing, and rather more challenging…", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1071861-r164986335", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "TRIP OF A LIFETIME", "review": "0ur daughter recently got married in Lake Garda, and we stayed at this Hotel. Spotlessly clean rooms, great atmosphere and the pool area was brill. All the wedding guests stayed here also and found it to be great value for money and were very happy with the service overall. The most important part for us, was the excellent staff in this Hotel. They were simply superb, and nothing was too much trouble. Special thanks to Luisa, Lenka, Andrea, Antonio, Guiseppe, Catalin, and Simone, who made everything so easy for us. Thinking already of another trip as soon as we can. Our daughter and her new husband were really happy with this Hotel and have said they too want to pay a return visit. Marian and Damien", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1071861-r164613454", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Lovely place, Average accommodation", "review": "To start with I loved this area.  With regard to the hotel, found the accomodation basic , a little on the cold side( not temperature) and the beds the weakest point in my view rather uncomfortable and short. Also the cost of wifi is simply ridiculous!!!  On the plus side the pool area is lovely, the staff fantastic, the bar pleasant, the evenings quiet and relaxed and the local area fantastic. Breakfast was fine the food good but as always in Italy  take your coffee in the bar in these places. So much better.   Porto dusano is a real hidden gem. We strolled down, swan, ate, and drank in fading sunset over the lake. Swimming in the lake was wonderful in early June, water temps pleasant and all around the views majestic.  In addition the local village had three restaurants which…", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1071861-r157241363", "sub_review": {"Value": 3, "Location": 4, "Rooms": 2, "Cleanliness": 4, "Service": 5}, "travel_purpose": "", "rating": 3}, {"title": "Okay :)", "review": "I stayed here with my school back last year there were over 100 students, the hotel handled us very well, the rooms were clean, the bath room was clean, the shower could of done with updating, the pool was freezing i got pushed in... was so cold, was my only time in it, the food was well em okay, the teachers got what they wanted we got what were given, the breakfast was lovely it was buffet, the morning we were leaving they set it all up for us even though we were leaving for the airport at 4.30AM,TIP: bring some food away with you if ur going out for the day, or a long jorney, they didn't mind us taking stuff ), in the room there was a bunk bed with the top bunk with no ladder or bar incase you fell off, and there was 2 beds in the middle of the ground, there was a big…", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1071861-r125236689", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}]