[{"title": "Quite location excellent service", "review": "When we first arrived (group of five) we were a little concerned that we might be too far out of Molyvos as our previous stay's had been closer to town.  The first night we walked into town and realised it was a doddle and nothing to worry about.  It was a 15 minute stroll soon covered as we talked along the way.  The following morning all relaxed we discovered our resort.  Family run, nothing was too much any problem was resolved very quickly.  Will we come back...You betcha!  a lovely lovely place with so many flowers and butterfly's by the score .", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r685458355", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Enjoyable", "review": "As previously stated the apartments are no way 600 meters from the town more like one mile. We were in a studio which was lacking natural light and very small. If known this I would have booked an apartment. The hair dryer was useless.  No kettle in room. Small, hard towels for use in the bathroom. No safe as advertised. The pool area on the older apartments is very quiet and you could always get a sun bed. The new apartments pool was busier. Mainly used by families with children. The food was of a a good standard and most enjoyable. Molyvos itself is beautiful. Lovely restaurants and bars. A relaxing holiday but would not return. ", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r619204204", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "....so, we went back", "review": "We had been staying at another hotel since First Choice dropped the Eriphilly in favour of pushing all inclusive holidays. Wonder how that's going for them? Anyway. Our daughter decided she fancied coming away with us this year and wanted to return to the Eriphilly as, and I quote, \"I need more room to be getting ready in\" Who am I to argue? I contacted Christos direct and booked two weeks from the end of July with him. In his next email he informed me we would be staying in the same room we had 11 years ago. Quite how he remembers that I'm not sure. But we were back in that very room! Anna was waiting to meet us when we arrived and even with the taxi reversing over our suitcase our spirits couldn't be dampened as we instantly settled into Greek mode, The room hadn't changed at all, but was spotlessly clean (as it was for the whole two weeks thanks to the excellent cleaner) although the daughter was convinced it was smaller...forgetting the 11 years since we'd last stayed in it! It's the Wagon Wheels thing.  The new apartments behind the reception area were full but as they have their own flashy new pool, the old pool felt like our own private pool with only a few other visitors over the two weeks. Of course this meant there was no scrapping over sun beds and the peace and quiet meant I could sleep off the previous nights boozing without any disturbances. We walked into the village 12 nights out of the 14. 20 minutes stroll to the first bar. A taxi back from Molly's Bar was €8 - not exactly going to break the bank is it? Eriphilly, Anna and Christos were always friendly and helpful and even if the space loving daughter decides not to join us next year I reckon me and the better half will be pitching up at Eriphilly again!…", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r616741088", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "loved it", "review": "the staff at Eriphilly were very obliging and couldn,t do enough for you we stayed in the older block in the complex which seemed to be for the Brits.These blocks were although older where adequately equipped but the beds where so uncomfortable in our room.The hotel was we read 600 metres from Molyvos but inreality it is quite a bit further 5 euro,s in a taxi phew!", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r611194038", "sub_review": {"Sleep Quality": 3, "Rooms": 3, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Fantastic", "review": "My partner & I visited last two weeks of June. The apartments are comfortable & extremely well looked after & are a credit to the family who own them. As a previous poster mentioned, the newer apartments are mainly for the TUI guests, this means the older accommodation is used mainly by Brits & some EU security forces, which is not a problem. The bonus is that it is like having a private pool, the most we counted round the pool was 7! The food is of a high quality & is cooked to order, though we only eat there a few lunchtimes, but we had breakfast several times. The breakfast was a mixture of continental & hot sausages, eggs etc, again to a high quality & freshly cooked. The only drawback is the walk to the village, whoever said it was 600m I wouldn't like them to measure a carpet for me! We are both early/mid 50's & fit so it wasn't a problem. Just bear in mind 600m is to the very edge of Molyvos, the centre is another 500-600m, we measured the harbour as 1.2 miles. All in all we had a wonderful holiday made all the better by Christos, Anna & family.…", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r593086083", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great to be back!!", "review": "After all the problems with refugees in 2015 (that appeared to put tour operators off) it was wonderful to be back in Molyvos and, in particular, Eriphilly.  The family who run these apartments are absolutely brilliant. Nothing is too much trouble for them. The apartments are kept spotlessly clean, our towels and sheets were changed every two days. Xristos, Anna and Eriphilly work really hard to make everything as smooth and pleasant for guests as they possibly can, nothing is too much trouble. We arrived second week in May, the season has been slow to get started this year, and everyone was gearing up for the guests.  We have stayed at these apartments before and sent a request for the same apartment as last time. The apartments are set back off the road along a lovely oleander…", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r589476481", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nice Place", "review": "Stayed here for two weeks in the self catering accommodation. We were situated in the older part of the complex, & the ground floor room was a bit dated, & lacked any decent kitchen facilities ( perfectly OK to put together a bit of light breakfast ) Linen & Towels changed frequently, & clean enough. Excellent facilities with two swimming pools & plenty of sun beds & brollies. Lovely location, with no traffic noise & a pleasant twenty five minute walk into town. Molyvos is lovely, with a good selection of bars & restaurants, & had a bit of character with a working harbour & the castle. Plenty to do & see, & if you want a better beach then Petra is only 6 km away ( bus or road train available ) & takes about an hour to walk. Highly recommended", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r526322766", "sub_review": {"Location": 5, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Loved it here", "review": "Five of us booked two apartments, and other than very hard beds we really enjoyed our stay. We loved the original pool with the snack bar right at hand. The attention and friendliness of the owners/family made our stay a memorable one.   Although it was height of the season it was not too busy, we stayed in the older block that we’d booked direct with the owner. Plenty of sun beds, and no one putting towels down first thing in the morning. (grateful for that). The views from our room of the Castle were superb, especially when lit-up in the evening.   We had an 83 year old with us, so the otherwise walkable route into town was not an option when we all went out together. We booked taxi’s on many occasions, 5 euro’s into town. With this in mind we did choose to eat at Eriphilly on…", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r512811221", "sub_review": {"Location": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Like coming home", "review": "The hotel is a short walk from the village of Molyvos which is situated in the Northwest of the Island it is a picturesque village overlooking a small harbour, there are many traditional tavernas for local food.  Petra and Efthalou are two neighbouring villages that are within walking distance and are well worth a visit. The hotel complex has two pools a bar and restaurant facilities. There are plenty of car parking spaces for hire cars.  The hotel is a family run business and the staff are brilliant the service we received was excellent.  The rooms are very clean, you can book a small studio or a larger apartment, they come with basic cooking facilities if you need them, but there is a very good restaurant on site. We had an apartment overlooking the olive groves with a…", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r492133522", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "molyvos eriphilly hotel and apartments", "review": "2 week stay here, the place is a family ran busy,the accommodation was great,the grounds are very well kept, they are beautiful  however the staff cannot do enough for you they are so friendly, they will fall over backwards to ensure you are taken care of. The surrounding areas are beautiful ,Molyvos ,Petra, Efthalou etc, I was concerned because of the migrant situation, and all the exaggerated dramas that have been highlighted recently,I personally was  apprehensive regarding the landscape being a mess with inflatables, life jackets and like. But no need to WORRY  the place is stunning and Absolutely clear of the said above. People need to read this, because, this is here and now. NOT the past. Maybe the Airtour companies need to send reps to reevaluate the island . Then get…", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r487915728", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Fantastic hosts and beautiful scenery", "review": "Stayed here for a week in June and it was so much more than we could have hoped for. Everything exceeded our expectations and it was fantastic value for money. The new pool is especially wonderful as are the hundreds of olive trees that surrounday. Molyvos was brilliant as usual, can't wait to return!", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r459727844", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Many positive things to say. ", "review": "We really enjoyed our stay at this Hotel. Placed in the northern part of Lesbos just outside Molyvos. The landscape around the Hotel is wonderful. The weather was perfect. The hospitality of the owners was in top.  The hotel is divided in two parts. A New and an old one. We were placed in the non-Dutch old part. As it seemed like the new part of the hotel was reserved for a contract with a Dutch travelling agency (as I said - it seemed like). No possibility to get a room in the new building. We asked!   We stayed 3 adults in our studio. A bit tight.  I like to cook  - to use Local ingredients.  But here I decided not to. The kitchen is ok for breakfast and nothing else it was very bad equipped.   Positive The landscape. The nearby city. With some great sites and restaurants. …", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r401027708", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "comfort and beautiful surroundings", "review": "We keep coming back each year, we love this family run hotel set in its own gardens and olive groves with a stunning view of Molyvos Castle. The rooms are clean and tidy and have all the amenities you need. A new pool has been added and the bar and dinning area refurbished.  It is so peaceful here and just a short walk from the tavernas and shops of Molyvos. The staff are so friendly and hospitable they make it a very special place to stay.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r381593591", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Convenient and good value", "review": "I stayed her for 8 nights in March, not the high season by any means. The place was clean and tidy. The location was convenient to Molyvos and an easy walk. Be mindful that the hairdryer needs to be pushed up and inwards when returning it to it's proper position otherwise it stays on. I didn't get it the first time, and the owner showed me in 2 seconds! Plenty of storage space and a lovely little kitchenette. Big bonus: I could lie in bed and look at the castle! Recommended!", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r355883122", "sub_review": {"Location": 4, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Our second stay at Eriphilly Apartments .....", "review": "..... couldn't wait to get here again and were not disappointed. \"Eriphilly\" the name of one of the delightful co-owners. Relaxing yet exciting Quiet yet welcoming, lively and friendly Spotlessly clean, tidy and well cared for Handy to Molyvos, but never noisy, a pleasant walk to town Perfect again ..... we knew it would be", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r312808278", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Peaceful and relaxing..", "review": "After first visiting Eriphilly back in 1993, we were hoping to have the same great holiday as we did 20 odd years ago. We were not disappointed !! Still the same family who own the apartments although a spanking brand new complex and pool have been added to the site. We were guested in the older apartments and although a little dated, still clean and spacious, although the mattress was the hardest I have ever slept on. We stayed around the older pool and most days we were on our own or with one or two couples as families with children tended to opt for the new pool, which made our day very peaceful. The pool bar was excellent and the food served was delicious.   I cannot praise Christos and his family enough for making our stay so memorable and hopefully it won't be another 22…", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r303471124", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Peace and tranquility among the oleander blooms", "review": "Peaceful, picturesque and always a home from home. The apartments are situated a pleasant walk from the tavernas and shops of Molyvos. The one bedroom apartments are, in our opinion, a better option than the studios, but that's just personal choice. Either way, the garden setting and lovely quiet pool make this a perfect place for a tranquil holiday. ", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r293710342", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Good value", "review": "This trip was booked as a last minute bargain so we weren't too sure about the accommodation. As it was it was just fine. A  10 -15 minute walk from the bus stand in Molyvos ( and 35 minutes from the harbour!) it wasn't as far out as we had feared. The room was clean and comfortable and the kitchen was better equipped than many I've come across in Greece. During our weeks stay it was cleaned every day except Sunday and we had clean towels and bedding twice ( more than usual).  We only had the 8 Euro breakfast at the hotel once, preferring to self cater, but when we did it was worth the money with a good buffet selection  - try the yoghurt!.  Noce sized pool which we used at the end of each day. I'd happily stay here again next time we come to Molyvos.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r290062739", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Brilliant Holiday", "review": "We stayed at this hotel for two weeks in a studio on the ground floor in June 2015, studios are a little on the small side but Ok. Pool and cafe/bar excellent, owner and staff very friendly and accommodating. A good 600m to Molyvos Tavernas, shops and sea (kept us fit). ", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r289751993", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Great!!!", "review": "Having been to Greek islands many times but not lesvos we more or less knew what to expect for a budget last minute trip. What a lovely surprise. We were in the original studio block, there is a new apartment building to the rear. Our room was basic Greek with a tv,ensuite and small two ring cooker. Kettle,hairdryer and coffee machine also. AND A SHOWER CURTAIN!! Luxury in Greece.spotlessly clean, comfy beds bbc news channel. Pool are was lovely and you can use the new pool.at the apartment building also,20 meter walk. The bar was very reasonable and food also. Wine10euro a bottle and gin,vodka etc 3.50e. Staff cant do enough for you organized our scooter hire taxis etc. Problem with the aircon, payable extra, was sorted straight away next day. Would definitely recommend. It is…", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r288459453", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Beautiful! Relaxing and Quiet", "review": "The hotel is beautiful, located outside of the main town it is very quiet. The grounds are stunning and with the addition of the new reception area and pool there is more than enough room for everyone without being overcrowded. This family run business is extremely friendly and helpful. The rooms are fairly basic, but clean and have all the amenities you need. The only negatives I can put are that having experienced an emergency medical situation whilst staying there: the phone in the room did not work and neither of the \"in case of emergency\" numbers that were provided connected to anyone! I rang 112 and they put me on hold for over 10 minutes as they didn't know where we were!! a very scary situation to be in and at night there are no staff available on site. The Thompson rep…", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r287380183", "sub_review": {"Location": 4, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Perfect location to relax", "review": "Just outside the town, Eriphilly is a beautifully picturesque and friendly hotel. If peace, quiet and relaxation is what you're looking for, you can't do any better than here. The rooms are lovely, and they all have balconies, most with a fantastic view of the castle!  The pool and adjacent pool bar have everything you need if you don't feel like moving. And if you do, the town is just a short, pleasant walk away. I've been here a few times, and I have no doubt that I will be going again.", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r287369591", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Sublime Sunny, traditional Greece at its best......", "review": "We have just returned from a weeks holiday at the Eriphilly.  Quite simply, sublime.  We had originally booked into a studio. However, whilst quite adequate and clean, it was very small and quite dark, and was based on the ground floor.  We were fortunate in that Christos had a spare one-bedroomed apartment on the top floor which had two balconies, and a wonderful view from the lounge overlooking the neighbouring greenery.  From our balconies, we had wonderful views up to the castle, and the hillside of the red-roofed buildings that surround it.  We also had some visitors, in that on one of the balconies, some swifts had made their nest and we spent time watching as their parents flew backwards and forwards regularly throughout the day feeding their hungry offspring. Our…", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r285824384", "sub_review": {"Location": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Happy service!", "review": "Christos & co. are sweet and serviceminded people. And it is a nice place to relax in Molivos.  We actually enjoyed the 15 minute walk into town - made us feel less guilty about all the food and wine ;-) But if you don’t like walking, you’ll find plenty of other options - scooters, taxi and the local bus several times a day.  Rooms are a bit old and small, but it’s quite alright considering the price.  They all seem to be working hard to make this place even better and more beautiful. And I hope next time we visit there will be a stone oven by the pool, where they could cook homemade pizzas og homemade bread for gyros ;-)  Definitely recommendable!   Tip of the day  Being a TA-user you probably already know this. There is one restaurant in Molivos that beats everyone else -…", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r278926689", "sub_review": {"Location": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good to be back", "review": "Just spent two weeks at the Eriphilli and were so happy to be beack.  Not been for 4 years however, Xristos and Eriphilli both remembered us.  We had the same apartment and it was like coming home.  There are new apartments and a fully modernised reception and dining area and the Makres block has been remodelled into apartments for the family.  There is also a wonderful new swimming pool at the back of the reception area and they are installing and landscaping a children's play area.  There have been some negative reviews about Molyvos recently due to immigrants landing at Eftalou.  The situation appears to be quietening down now as the island cannot support the cost of transporting them to Mytilene they now have to make their own way.  This does appear to be having a positive…", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r277223462", "sub_review": {"Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Time to smile!", "review": "We  have just returned from a seven night stay in a garden studio at Eriphilly and wish that we had booked longer. The accommodation was ideal for our needs, good value and was cleaned daily whilst we were out and about.  Everyone was very welcoming, helpful and friendly. The pool and bar area are great. We walked into Molyvos (about 8 minutes away) for our evening meals and can thoroughly recommend Castro's (especially on live Greek music night) and the wonderful Women's Co-operative restaurant opposite and upstairs, with lovely views of the bay from the terrace, where the recipes are much treasured family ones. The best moussaka in Greece? Quite possibly! Also Molyvos Stars, a restaurant in the old market area up by the castle, is well worth visiting for its Greek salad and…", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r274361245", "sub_review": {"Value": 5, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A thoroughly relaxing and carefree destination", "review": "3rd - 17th September 2014, wow, another fabulous holiday on Lesvos. Everyone and everything is just perfect. Walking, exploring, beaching, eating, shopping, meeting and drinking .. idyllic. Our stay at Eriphilly from welcome to au revoir .. PERFECT .. thankyou. On the outskirts of Molyvos town, the appartments are a lovely quiet stroll away. The sunsets over the castle, inspiring.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r232360286", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good value for money", "review": "We have just returned from a ten day stay at the Eriphilly Hotel and were very happy with everything. It is nicely set in its own gardens, with a lovely pool area and pool bar, and a great view of the town and castle, which is lit up beautifully at night.  It is about a fifteen minute walk into the edge of Molyvos, and twenty minutes into the centre. The owners are always available and are very helpful, ringing for taxis and giving useful information about the island if asked.   We ate breakfast twice at the pool bar and it was lovely, the only problem being that wasps were attracted by it, and I was stung on our last day. However, the owner came straight out with vinegar to apply to the sting and an electronic device to stun and deter the wasps.   We booked the two room…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r227879027", "sub_review": {"Value": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "You'll hardly find anything better at that price!", "review": "We stayed two weeks during full tourist season (around August 15th). We were given a nice 2 -room apartment with kitchenette and two balconies. We paid only 50 Euros a day. This hotel has a variety of rooms (without kitchen) and apartments, located in several buildings and on three floors. All have their specificities. We were amazed to find that our rooms were made, bedsheet and towels changed, every other day! The swimming pool is nice ,large enough to swim, you can use it from 8.00 AM to 8.00 PM (no night baths, sorry). Although we didn't take advantage the hotel also provides breakfast and meals. The surrounding atmosphere is quiet and bucolic, you have a nice view pof Molyvos' castle from your room.  Cons: the premises are somewhat away from town and beaches (about 1 mile).…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r222120009", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "The Real Greece", "review": "We returned from Eriphilly just 2 weeks ago. This is a fantastic place to stay and I'm confused as to why some visitors would make negative comments.  The apartments and studios are set in a lovely location, quiet and peaceful and ideal for chilling and as said before, about a 20 minute walk from town, so we walked there and taxied back, always 5 euros from the taxi rank. The taxi service at Molyvos is really good.   We walked to the warm water springs at Eftalou one day which took about 20-30 minutes. An easy enough walk but too hot at midday! We visited here again but rang for a taxi the second time and asked the driver to come back later and collect us later, which he did do. The water springs are well worth a visit and the sea water here is excellent quality.  The studios…", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r220422053", "sub_review": {"Value": 5, "Location": 4, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Just got back and we want to go again.", "review": "Eriphilly is a family run hotel the accommodation is great, the rooms are spacious and kept very clean. Such a peaceful place and only a short walk to town.  The owners and staff are brilliant and always ready to assist. The food is excellent with both English and Traditional Greek food available. The views of  the castle are impressive.  We can’t wait to get back there again, we had a fantastic holiday.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r212062354", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Loved it - so peaceful and relaxing", "review": "We have just returned from a two week stay at The Eriphilly Apartments, Lesvos (our son joined us for the second week).  Please DO NOT take any notice of the negative comments left by some.  We were met from the taxi by the owner - very friendly and welcoming and shown directly to our apartment within seconds.  The one bedroom apartment was light, spacious and had everything you could need for a two week stay in Greece.  We were informed on arrival if we wanted air conditioning it would be an extra 5 Euros per day - we declined and kept the balcony doors open at night with a lovely view of the castle. (need to chase cats off but once told they don't come back until next day). The rooms were cleaned every day apart from Sunday - their well deserved day off.  The cleaners did an…", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r177700786", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great place to stay in wonderful town of Molyvos", "review": "Staggered to read one or tow of the comments on here so let's set the record straight!  The facts: our room was a good size and immaculately clean. The room was cleaned every day (except Sundays) and the bedding and towels changed regularly. The cleaners were always happy and helpful. Yes, we had to pay for air con but this is pretty standard for this type of accommodation in Greece and it was made clear in the details. The pool was extremely clean, a good size, and the insects were scooped off the surface on a very regular basis! There was Wi_fi at the excellent pool bar and also in the room but reception was a bit flakey - this is not unusual (and actually means you had to talk to each other).   The walk into town: the nearest taverna was about a 10 minute stroll away, the…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r175686619", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Amazing!!!!", "review": "This is an amazing family run apartment with a friendly relaxed atmosphere.  The food served at the pool bar cant be faulted and the family will do their absolute best to cater for your every need. Id definitely visit again", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r173396345", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Terrible place", "review": "You have to pay extra for airco (we only knew this on our very last day). 5 euro per day. They say you have internet in the room (free). There is no internet. The swimming pool is dirty and full of insects. They change towels only in 3 days. Cleaning the room is done in 30 seconds (?). The matrass is HORRIBLE. We could not sleep and told this the manager. Nothing was done. We stayed in a studio but....the kitchen was in the bedroom (no place to eat in the room, no table and chairs). You have to walk 30 minutes (there is no bus) to be in the centre of Molivos. Don't make a reservation here. There a re a lot other hotels, studio's or apartments. We have seen them. Much better. And...for sure more clean.", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r171054383", "sub_review": {"Value": 2, "Location": 1, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "A warm and friendly welcome.", "review": "A wonderful hotel in peaceful surroundings with a friendly family atmosphere and great staff.The food is really good the apartments are very clean and there is a  beautiful view of the nearby Molyvos castle and it is only a very short walk to some great tavernas. ", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r160982737", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "First Time Not The Last!", "review": "First time to this island to Eriphilli Apartments. Cannot fault the resort in any way, the apartment was ideal, well equipped and extremely clean and serviced every day. The grounds and the pool area are well maintained and constantly attended and kept up to a high standard. It is a fairly long walk into town and taxi is expensive if yoiu are doing this every day. However, if you want peace and quiet this is the place to be and the walk makes you feel less guilty for lying about all day at the pool doing absolutely nothing. It's definately a chill out holiday and don't expect to it to be very active - if its busy you want and loads to do then go to one of the other islands. Kostas, Eriphilly and Christos are lovely people and made us feel very welcome and instantly at home - we…", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r136949864", "sub_review": {"Value": 5, "Location": 3, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "As good as ever", "review": "Just back from another holiday in Lesvos staying at the Eriphilly apartments and they were as good as ever.Kostas,Eriphilly and Christos have retained the same standards despite the decision of First Choice to pull out of the island and the effect the it had on a lot of these apartment owners.  The prices for food and drinks at the pool bar remained the same as last year and there were plenty of spaces around the pool.  Some days it was just my family and I so it was like having a private villa.  Every area including the pool was kept extremely clean by Kostas and his team and they were always there to help no matter what you needed.  A special mention must be made about the cleaners Vasso and Anna who really do a great job and are always cheerful and polite.  We hope to be back…", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r134811812", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Another Fantastic Holiday at Eriphilly/ Makres", "review": "Just returned from 4th trip to Molyvos, and our 3rd trip to Eriphilly/ Makres.  We had a perfect  holiday.  The apartments are set amongst fields and olive groves about a 10 min walk from Molyvos.  The views to the castle are fantastic and it is very peaceful.  The family who run the apartments are lovely and work very hard to keep the place spotless.  The pool is great with a little bar that serves delicious food; particularly the meatballs. We were on holiday with our two young children and they loved it.  The first two times we stayed in the Makres Block and this time we stayed in the Eriphilly Block as we had child number two!  The room in Eriphilly was great.  Wonderful views to the castle from the balcony, well apointed and spotless.  We've really enjoyed our previous…", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r133292236", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Oustanding place to stay", "review": "We have stayed at The Erifylli twice,couldn't get in in September,not surprised.This is a really delightful place to stay,we would definitely book again.We called in during our recent visit,and were greeted like old friends.", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r119105261", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Fabulous place", "review": "We have stayed in Skala Kalloni previously, but are so glad we chose Molyvos this time. We really loved these apartments, they are in such a picturesque setting. The rooms were very clean and had enough equipment for our needs, we had a lovely view over the gardens and pool. Molyvos is a very beautiful town with quaint cobbled streets and we enjoyed the walk there, which is about 15 to 20 minutes. It wouldn't be suitable for those with mobility problems as it is very hilly. The people  who run the apartments are so lovely and friendly, as are everyone who run the restaurants and shops. We will be back!", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r119007776", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely family run studios in beautiful setting", "review": "Costas, Christos and Eriphylli cannnot do enough for you and it is so sad that Thomson/First choice are pulling out next year.  Ideal for us as half way between Molyvos and Eftalou and we love to walk.  However regular bus stops right outside,  Studios are small and quite claustrophobic but it is Greece and you are not in them for long", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r118361660", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 3, "Rooms": 2, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "2nd year running - no complaints!!", "review": "After reading the last two reviews I felt that I had to post my own! First of all I would like to say that Costas, Eriphilly and Christos are the most sincere people that you could ever meet. They will do absolutely anything for you, nothing is too much trouble. Yes we did stay last year and yes I can understand that people may think that the new Eriphilly block is better than the Makres block but they are wrong!! Last year we paid for a one bedroom appartment for myself, wife and 2 children (16 & 12). This year due to my eldest working, we stayed in a studio. I admit it was small but as we stay in the room for about 6 hours over night then it was not a problem!  As for the problems getting a sun lounger - the 1st week was a problem if you got out of bed after 10am. The 2nd week…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r116820327", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "4 times in 4 years!!!", "review": "yes - it's me again.....just read the last bunch of reviews where people didn't have a good time...fair enough....we were there when they were and as usual had a great time. Yes the rep wasn't brilliant, but he did sort us out with extra towels when asked.   and like i said on my last review.....IT'S GREECE!!! C'mon guys you want five star accomodation? Book 5 star accomodation!!  if a travel company steps up to the plate and takes over from First Choice we'll be back!!!", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r116812207", "sub_review": {"Value": 4, "Sleep Quality": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Had much better", "review": "Just got home from the Eriphilly Makres. Wont be going back ever.  On arrival this guy standing along the drive handed us all the keys to our apartments, only the regular customers knew where to go. We eventually found our room which was in the very old block called the Makres.The room was just a bit bigger than the shower room (room 9) I could open the fridge with my foot when I was in bed if I so wished, I had to remove the putty from the fridge thermostat in order to turn the fridge to cold otherwise you could warm your food in there as there was no oven...!!! The beds were o.k bit firm but o.k, No hair dryer in the room as advertised in brochure, asked for one and got it though also asked for two more pillows but i think they were filled with stones. We only had 1 towell…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r116618144", "sub_review": {"Value": 2, "Sleep Quality": 4, "Cleanliness": 5, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "we wont be back", "review": "simply put very substandard accomadation but if easily pleased it will suit but as a regular greek visitor it is very dated regards pool i did not let my 5 year old in after the first day  you could not see the bottom it was of a milky colour the rooms are not fit for use if you have child with you the fridge is useless but the area is pleasant if you are going there use the pool area @ the diamanti apartments 100 meters towards molyvos very clean and top people", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r116365318", "sub_review": {"Value": 1, "Sleep Quality": 2, "Cleanliness": 2, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Great budget option in a beautiful part of Greece", "review": "We stayed at the Eriphilly studios/apartments from July 14 - 28th 2011. As mentioned elsewhere, the property is split into three blocks - we stayed in what is the oldest building of the three,  the Makres block.   Our studio had two single beds (standard Greek s/c practice) which we pushed together, wardrobe (plenty large enough for two weeks worth of clothes for two people), drawer space and a kitchenette, comprising sink, cupborad space, assorted cutlery/crockery/pots and pans, fridge, kettle and two ring hob. The furniture and decor were a little dated but if you go to Greece and self cater, chanmces are you'll be using your room as somewhere to get your head down/change before an evening out, and little else, so the accomodation suited our needs perfectly.On the few…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r116064007", "sub_review": {"Value": 4, "Sleep Quality": 5, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Erifylli Makres Studios & Apartments Molyvos", "review": "Travelled with First Choice/Thomson holiday company.  Arrived at this accommodation with high expectations following reading the reviews on Trip Advisor site.  First impressions were ok then we were shown to our studio in the Makres section of the complex.  Room number 6 what a dump!  Ex Manos property (had a couple of bad accommodations elsewhere with Manos in the past and purposely don't book with Manos any more) can you imagine our disappointment when above the sink was a sticker with the Manos logo on.  Typical of our past experiences with Manos the room was very cramped and dated, the twin beds were shoved up against the wall meaning one person had to climb over the other one or out of the bottom of a wood surround bed should they want to go to the bathroom in the night. …", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r116020051", "sub_review": {"Value": 2, "Sleep Quality": 1, "Cleanliness": 2, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Mixed feelings", "review": "Just arrived back from 2 weeks at the eriphilly/Makres. I agree with most of the reviewers that the apartments/studios are kept spotlessly clean and the grounds are beautiful with flowering bushes in abundance. The pool area was nice and the view of the caste was stunning. We stayed in the Makres block which was small & a bit tired looking and had a balcony overlooking the road. This wasn't a problem as we like most other people didn't spend much time in the room. What was a problem was having a fridge that didn't chill the water and wine adequately and an ice box which wouldn't freeze. There was clearly a problem with the fridges fan as it was always silent. I  reported the problem to Costas (the owner). His wife who was there at the time asked if it was room 10 which suggested…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r116009682", "sub_review": {"Value": 4, "Sleep Quality": 2, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "What an absolute gem. 5 stars again *****", "review": "Just back from our third consecutive visit to these apartments and they are as good as ever. The complex is owned and run by a lovely family who are always on hand to help you but are never in your face.  From the time we stepped off the bus and were welcomed at the gate by Christos we felt as if we were visiting family. We were immediately invited to the pool bar by Kostas for a  refreshing drink which went down very well after our coach transfer. Eriphilliy was also there and welcomed us like old friends.  The apartment was as we expected,spotlessly clean and nice crisp linen.Cutlery was adequate for our needs as we only ever have breakfast in the apartment. The local supermarket will deliver your shopping to your apartment free of charge.  Apartments include an under counter…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r115691333", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Lives up to its reputation", "review": "We stayed at Eriphilli ( well Makres actually, there are two blocks very close together) and it was really excellent. As we were expecting the studios were small but perfectly suited to a Greek holiday where you just use it to sleep and change. Spotless and comfy ! The whole feel about the complex is so relaxed and the majority of people had been before, many several times which must say a lot about Eriphilli and Molyvos. It was so hot that we asked for Aircon for the last few days , I asked Costas how much he wanted and he replied  \" Just pay me when you leave\". Nothing was too much trouble, food and drink was good value. A great place for a holiday", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r115456527", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent accommodation", "review": "We booked a last minute holiday to Lesbos and stayed at the Eriphilly and could not believe our luck. The apartments and complex are extremely clean, they are in a quiet area, with a bus stop outside and yet within walking distance of shops, bars, supermarkets and restaurants. The people are friendly and the prices in the bar are the same as in town so you do not get ripped off if you eat and drink in the bar.", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r115185250", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Wonderful place to stay!", "review": "This is a smashing hotel run by the most lovely family you can imagine. We stayed in the older Makres block and had 2 different studios as my reuest for an upper floor couldn't be met for the first week.( hotel was full) It was absolutely no problem and true to their word, we were(cheerfully) given an upper floor the second week. Nothing was too much trouble and guests are so well looked after. Eg. I get up earlier than the OH and he then pinches my pillow as he likes a couple. By the third day this had been noticed and a spare just appeared by magic!! The rooms in this block are small and basic but beautifully clean and perfectly adequate. Kitchen /eqipmentutensils are limited but this was no hardship as cheap food can be found in the tavernas and anyway, we did very little…", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r114590819", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent budget accommodation", "review": "My wife and I are in our 60's and have travelled quite widely on the mainland and islands but only the quieter spots. Regretfully we always have a small budget so value for money and free attractions are always a must. We stayed in studio 4 in the old building at the front of the complex and are pleased to report that the room was clean with a good shower room and a spacious balcony with beautiful flowers surrounding it. All the appliances worked well (a first for Greece!) and there was 24hr hot water. The rooms were cleaned every other day. I'm not a great lover of pools but this one was very well maintained and the pool bar provided a friendly service at prices a little higher than in Molyvos itself. We did go to the barbecue and music evening which was 12 euros and very good…", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r111585880", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Another place I will return to... oh I just did :)", "review": "I've stayed here twice and hope to stay here again later this year.  The family who own the place are really friendly and they keep the rooms spotless.  Of course it's basic, but all self-catering accommodation of this rating in Greece is.  If you expect a home from home or luxury apartment you will be disappointed.  The accommodation is small, the facilities for cooking are basic (but I always manage to cook something simple a couple of nights each week) and the fridge is small, making it difficult to store much in.  But the surroundings are beautiful, there are some great walks near here and the local restaurants offer reasonably priced, delicious meals.  Unless you intend to spend more time indoors than outdoors on this holiday the room shouldn't be too much of a worry.", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r108808390", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "excellant relaxing studio", "review": "This was our first visit to lesbos, choose the studios after reading reviews and got a good deal. We were not dissapointed, lovely studio in eriphilly block. Lovely to be able to have window open at night thanks to built in mosquito screen, very quiet at night,lovely view of illuminated castle. The owners were lovely ,food available all day, nice stroll into town the bus passes the entranceyoo, you can go to the hot springs , petra ans annoxos by bus. xl supermarket down the road delivers your shopping. two excellentt tavernas nearby, Ambrosia towards town and Pericles towards eftalou first left down country lane used by all the locals-superb, tues and sat musicians ,dancing. we have already booked for next year!!", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r83694339", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Erifylli Makres Apartments Apartments, Molyvos, Lesvos", "review": "ERIFYLLI APARTMENTS  MOLYVOS:  A late booking 09-16.09.2010. Far exceeded expectations. Very clean, tidy, friendly owners & staff. Everything we needed including Kettle, Coffee machine, Toaster, Hair dryer, bath & shower (with a curtain), comfortable 6ft bed, Mythos, Retsina & Metaxa. Fifteen munutes walk to town for all the bars & restaurants we could need. Fortyfive munutes walk to Hot Springs of Eftalou. Coach transfer from/to airport approx 2hours. Very strict with luggage allowance at airport so beware of what purchases are packed. Euro 14.00 per kilo excess baggage. Check that airport scales are at zero before loading cases on to conveyor. Erifylli is a great base and we will return soon.", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r80270601", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "third visit in three years!", "review": "On this visit - our third in 3 years, which tells you something! We booked late and this time took a studio in the older Makris block. Having had friends stay in this block before we knew it wasn't going to be 5 star quality. No complaints at all, we were in room 5 which had a balconey from which we got a nice view of the town & castle, although the room is basic it does what it says on the tin. somewhere to sleep, shower and change. we don't go on holiday to stay in the room  Christos and Eriphilly were pleased to see us, as were various bar staff (especially Paul & Martin at the wonderful Molly's Bar) and restaurant owners who we have got to know over the years.  There were quite a few families with children the same age as our daughter Lily this year, which pleased her no end…", "date": "May 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r76027614", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Cheap and cheerful hotel in beautiful place", "review": "Just be aware that you may be getting a really small room in the Makres block at least and pretty tired too, think smaller than Travel Lodge,  I could lie in my bed and touch the kitchen sink.  Free kids for First Choice seemed to mean invisible kids as the owners of the studios only expected a couple, so our five year old was given a rusty campbed wedged between kitchen sink and main entrance door.  Rooms are clean enough but think just slightly more up market than a youth hostel.  You get what you pay for of course and it is really cheap.  Pool area had lovely view of castle, bar/cafe prices were more expensive than in town though.   The room got us down at first but a stroll into Molyvos healed any doubts.  It is a town in many parts - cobbled vine covered streets, beautiful…", "date": "May 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r35969311", "sub_review": {"Value": 3, "Location": 5, "Rooms": 1, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Good Value, Good Location.", "review": "We chose this accommodation simply because it worked out at a good price and it was one of the few one bedroomed apartments available on Lesvos with an English holiday company.  There are two buildings block booked by First Choice, containing studios and apartments, a little distance apart and a more modern hotel behind the swimming pool which is let independantly. We were in the Eriphilly, the second building, where there were three apartments on both the first and second floor and on the ground floor, which was a little cellar-like, were studios. These had no windows and only an ordinary door with a tiny window in but they did have a nice patio area.Some people weren't too keen but others loved them.  We had two balconies, a very basic kitchen with a lack of utensils and…", "date": "May 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r31426970", "sub_review": {"Value": 5, "Location": 4, "Check in / front desk": 3, "Rooms": 4, "Cleanliness": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Beautiful setting ...", "review": "This was my first taste of Greece though not my partners, and I fell in love with Lesvos. We arrived at the Eriphilly quite late but were welcomed by the owners and shown to our room which was nice and clean with a small patio with a view of Molyvos castle, stunning is all I can say. We hired a scooter and went eveywhere in the 2 weeks we were there. Eftilou is one of my favourite places as is Molyvos harbour, watch the sunset from here it is beautiful, Oh and try one of their lemon meringue pies ... The Eriphilly is a good 20 min walk to the harbour but with lots of gift shops on the way. They also had 2 adorable kittens which always used to come running when ever they saw us ! Would I go back ..... YES I loved it ....", "date": "June 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r26828659", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A lovely surprise!", "review": "We booked a last minute trip with First Choice, 2 star  self-catering, allocation on arrival. We had no idea what to expect but what a pleasant experience to be sent to the recently refurbished Eriphilly. The studio was clean and comfortable, even had TV. We had a lovely terrace looking onto the gardens. The pool was a bonus and beautiful, surrounded by flowering bushes and distance views - even to the castle. The pool bar did tasty food. The owners are very friendly. Would definately go back. We hired a motorbike and the scenery is breathtaking.( Food much more expensive than last time we went to Greece but Euro not good at the moment.)", "date": "June 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d1074040-r16714562", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 3, "Rooms": 4, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 5}]