[{"title": "Welcome to 70s", "review": "View is fantastic - indisputable. But, this is probably everything positive I can say about this place. The hotel is so old that I felt myself as being in 70s or 80s (I was not even born on that time) because of this, I was feeling I was paying a lot of money for very cheap old lodging. it does not cost 150-200 per night, even with a view cockroaches in the room (again - \"hello from 70s/80s\") wifi was working terrible (as if it was not working) breakfasts were ok (nothing special, and definitely not for money they charge) restaurant - food was good but quite expensive.  and the hotel tries to make money on everything (probably trying to persuade you not to come again): I was shocked when I was informed that I have to pay for having an iron and an iron desk. In 4-star hotel? I travelled a lot in different european cities. and even in very cheap hostels you could get an iron (or go to a special place). here - nothing like this obviously, there was no tea pot in the room (saving money on clients - moto of this hotel)  I do not recommend this hotel. it does not cost. very poor conditions. even in a very basic 3-star hotels one will get more comfort and facilities (and new modern facilities) for 2-3 times less…", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664156-d1095334-r627843306", "sub_review": {"Location": 5, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "First taste of the Lakes", "review": "Much better than expected from some of the reviews. Must have recently been updated or at least in our room 'large superior Lake view room' 106. The views were to die for, breathtaking. Patio needed attention grass not cut or attention to trailing  plants could have made such a difference. Hotel staff made it, very polite and friendly and always a smile on their face despite the long hours. Building itself we found very clinical no colour, no pictures to brighten the place up and the downside no cosy lounge area other than open area next to diners or other room that looked like a conference room. Meals- breakfast could not fault there was nothing that anyone would want for even fresh veg/fruit juicers. Evening meals,salad bar again excellent and set menu gave three choices for each course which unfortunately we found a little bland. Swimming pool area lovely nice size and very clean. Sauna/steam room could only be used if you were naked im no prude but would at lease liked a choice in the matter. Overall good holiday lots to do around the area and see. Moved on to Lake Maggiore which currently outshines Lake Garda especially Stresa.…", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664156-d1095334-r521891854", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Only area that grants it 4 stars is the view...", "review": "It's a great hotel if you're staying there for the fitness activities (pool, sauna, tennis courts and it seems like they do fitness classes too - not sure if this would be in German though since most of the guests were...). We appreciated the view from our balcony, day and night the views were amazing.  But the room itself was extremely basic. We didn't have a kettle, coffee facilities or air con but there was a small fridge and bathroom toiletries. The hotel itself would benefit from an update - the furniture is tired and looks like the place is stuck in the 90s.  If you're not good with heights (or driving vertically), this hotel probably isnt right for you - the roads are not for the faint hearted but worth the view when you get up there. Parking also looks limited at first glance but there is more around the back of the tennis courts. The breakfast had plenty of options but... the cakes/pastries were uncovered - much to the pleasure of the flies, the water for boiling eggs was vile smelling and not fresh. The bread for toast was stale and the fruit juices tasted cheap,  like pure sugar. Not the best breakfast experience I've ever had. There are cute, hidden restaurants down the road, La Baita offers 10% off your bill if you're staying at the hotel. The staff are great and the food is even better. It's within walking distance so embrace the local wines on offer! There is ample choice of hotels around Lake Garda and there are certainly better ones.…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664156-d1095334-r512361215", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Tennis fun", "review": "A nice hotel if you want easy going tennis days. The service and the courts at the club close to the hotel were good.   From the more expensive rooms and from restaurant nice panorama view over Lake Garda.   No luxus or unnormalsuperb service experiences but except WLAN everything works quite well. The laundry took 2,5 days but if you are not in hurry no problem.   The driving up to the mountain is in \"an italian way\" very interesting. For a normal driver still not too challenging or at least no showstopper. ", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664156-d1095334-r506493255", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great hotel", "review": "Been there from 15 oktober till 22 oktober 2016. Great high view over the Lake garda. Good service, great food,  good friendly staff.  They will see me again for sure. We liked the area.  We love mountains. We also went to Sirmione in the south of the Lake, what was a nice touristic small town in the middle of the lake. Also went to the ferrari museum since we are carlovers. ", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664156-d1095334-r433513755", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Amazing view", "review": "First of all I want to tell that the pictures you can see  about the hotel are not real....the reality is much more beautiful. The view  is simply breathtaking.  Room was excelent. There are two categories of rooms, if you want a better room, make sure you book a superior room. It is a little bit more expensive, but is worth it.  Staff was always very friendly, when we were late for dinner, the kept a plate of food for us and always let us take food to the room if our daughter didn't want to eat during the dinner.  Only one remark: if you suffer of altitude -sickness, don't go to this hotel.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664156-d1095334-r391120502", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Best view ever!", "review": "This hotel has one of the best views you will ever see in your life, which will make you forget the fact that the facilities are a little outdated.  The swimming-pool is really good too. It's a nice car ride uphill from the Lake.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664156-d1095334-r374819960", "sub_review": {"Location": 5, "Sleep Quality": 4, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Best Garda lake view can be found from here", "review": "Service was friendly. Breakfast was good, you can squeeze your own orange juice or boil your eggs just the way you want them. Remember to try out famous Tremosine cheese! Nice restaurant can be found 200 m away from the hotel.  Downside was that the room didnt have any air conditioning - it was 26 degrees warm in the room around the clock. No shops near by, closest can be found from Limone, 5 km's away.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664156-d1095334-r293064254", "sub_review": {"Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Excellent stay", "review": "Having read previous reviews I didn't really know what to expect. The reality was much, much better. There are two roads leading to the hotel, one is a scream a minute, the other is not too bad at all for the area. It is up a mountain after all! The hotel could do with a bit of updating, but that is immediately forgoten when you look out at the view from you balcony. Breathtaking  -the lake, the mountains, the towns and villages like exotic jewels along the lake shore... The hotel staff were wonderful. We visited at the end of the season but they were as cheery and helpful as if it was the start. The food was good, with a choice every evening and the bar was a comfy place to sit and play cards or watch the entertainment after dinner. The Wellness Centre was very good, if a bit…", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664156-d1095334-r233651897", "sub_review": {"Location": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very very isolated! 2 star, not 4 star!", "review": "If you are looking for spectacular views and a quiet location in the middle of the mountains, this is a perfect hotel for you. This hotel seems geared up for walkers and hikers. The residents were mainly German.   The road leading to the hotel requires nerves of steel and makes the hotel difficult to travel from. It takes about 25 minutes to get from the main road around the lake to the hotel which is right on the top of one of the mountains; this adds quite a bit if travel time, I would definitely avoid this hotel when icy as the roads must be impassible.   The room were large and clean, but very very dated. 70's style. At least. The indoor pool was good and worth a visit.   The hotel kindly let us check out after one night at no additional cost, though we were booked for 5…", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664156-d1095334-r201750161", "sub_review": {"Value": 1, "Location": 2, "Sleep Quality": 3, "Rooms": 1, "Cleanliness": 4, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Great honeymoon", "review": "A wonderful location if you want to get away from it all - you do need a car and have to be confident driving on narrow twisty roads but its worth it for the fantastic views. Staff very friendly and helpful. Enjoyed the indoor pool and massages! Good menu choice each evening or a great Pizzeria 5mins walk away.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664156-d1095334-r179233634", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "\"J'y reviendrai\"", "review": "Personnel is very helpful. They always help you with a smile. Activities are wel organized. Rooms are clean but a little bit old fashion. This is compensated by the stunning view on the lake. Hotel is wel placed for lots of visits to the northern and southern parts  of the lake. For those who like both walking and swimming on holidays.  When it is to warm (38C°) in Tremosine, it is nice up the hill at hotel Le Balze, but therefore you need not to be afraid to drive up the hill on smaller roads. This hotel deserves its motto : \"j'y reviendrai\".", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664156-d1095334-r171442086", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Nice view, old-fashioned hotel", "review": "Hotel personnel is very helpful, and although there are a lot of season workers from Romania, they all speak several languagues fluently.  A pity they start addressing everyone in German, eventhough we are keen on speaking and learning Italian, being Belgians.  The rooms are old-fashioned, '70ties style, and might use some redecorating.  The beds must be renewed as well : it was horror for our backs.  We mentioned a problem with the electricity in our daughter's room, and the handy-man only fixed it on our last vacation day. Wireless internet is quite expensive (1 euro per hour) and only available in the lounge, not in the rooms.  This is so outdated !  The other guests were quite and respectful of ones privacy, eventhough the rooms' insulation and the balconies don't offer that…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664156-d1095334-r116301776", "sub_review": {"Value": 2, "Sleep Quality": 1, "Cleanliness": 2, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 2}]