[{"title": "Animation Team", "review": "The Animationteam is very nice! Rico Chico and Youssef are great animators! :) The food is good as well. You can choose on a buffet three times a day. The pool is nearby the beach. There is some time when they play music on the pool and there is also time for quiet chillout. The Animation team does his job very well. The people are friendly", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r722108783", "sub_review": {"Sleep Quality": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Good hotel near Djerba", "review": "Good hotel with 4* Advantages: 1)All inclusive 2)close to sea 3)warm sea 4)good water pool 5)staff can speak on 4 languages ,if you know english its good ,if french its perfect 6)every day you have different events 7)1,5 hour from airport Djerba 8)cheap country Disadvantages: 1)Local food is fat and “heavy”,please be aware,take some pills or drink alcohole for better digestion 2)only 15% of beach has pleasant access to sea 3)Also be aware that local residents(anyone)has access to all beach space(but not close than 3m from sea) 4)this is country of tips,so if you give sb 1-2$ you will have better service(this is like more advantage) 5)all goods in the markets has increased price (2-3 times),so prepare to bargain 6)check before arriving your room(you can have awful room but 4)point can fix this:) 7)in some days you can have +40° or more, but this is Africa.…", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r704541205", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Vincci Zafira Palms", "review": "It you want to experience safe and active holidays in Tunesian oasis, go to the hotel. The hotel provides all the comforts and the best animators- Rico Chico and Youssef will do their best to entertain you well! Zumba, ester sports and gymnastics made our days!", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r701924147", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Лучший отдых", "review": "I stayed in this hotel from 27.07.19 to 08.09.19. I want to express my great gratitude to the Animators. The guys ar e just doing well. Put out for all 100%. You feel at home. They dont miss you. Every day is a new show. Guys! I MISS YOU AND LOVE YOU! HOPE TO SEE MORE!", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r701826641", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Vincci Safira Palms", "review": "I can truly recommend the hotel to people who are looking for a great relax on the beach or by the pool.Everyone will find something for themselves - those who like spending their time actively will never get bored. There is a wide range of sport activities run by the greatest animators Rico Chico and Youssef - Zumba and other dances!!! Thanks to the young men our holidays are unforgottable and full of great moments.Go and check yourself!", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r701756431", "sub_review": {"Sleep Quality": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "We had a good Time !", "review": "I was there with a friend, and it was pretty good. We had a lot of fun, but it was also relaxing. We loved the animation team, especially Kays was very nice and motivated. Our room had a nice view, and the Service was always friendly.  The Beach was a little bit stony, but if you Walk a few metres there was a sandy beach.  We would definetly do this trip again !  The Photo Is from Our balkony.", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r694265108", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Great hotel with the best animation!", "review": "For me the best of all was animation, especially Kais and Max are animators, which I will miss to end of my life. There is a lot of exercises with animators, you will never be boring. Swimming pool was huge and clean, in the sea were unfortunately some algae, but except from this sea was really clean too. There was a lot of various food which I liked. The room was relatively clean, but to be honest there sometimes were forgotten to bring new soap to the bathroom etc. - but it's not a huge problem in my opinion. All in all I really recommended this place! Miss you Kais and Max <3", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r692773608", "sub_review": {"Value": 5, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Vaciations", "review": "Max is a great animator. He is kind and very professional. Good at archery and amazing Arabic teacher. The best animator from here. Great dancer:) beside animations was okay. Aerobic and Zumba was short but great", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r684574812", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Vincci safira palms", "review": "Dear Martyna,  i thank you very much for sharing your opinion about your holiday in Vincci Safira Palms.  We are happy to know that you enjoyed your stay with us.  We hope to welcome you for another stay in Vincci Safira Palms.  Best regards", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r615914073", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great holliday", "review": "We had a great time there with great thanks to our animation team who did an amazing job!!!  The food took a little bit of getting use to but we had some things we knew also so that compensated a bit. And everyone working there was very kind en friendly. We made some extra Friends taking this trip so for us of went very wel.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r615673051", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Aaaamazing", "review": "I'm excitedly impressed by the sea view .. the great atmosphere of the animation and the pool ambience😍😍.. and i really do enjoy the tasty foods even if the restaurent is somehow crowded 😛😅 .. thank you so much 💕✌", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r609965852", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Winderful holiday 👍👍👍👍👍", "review": "Hi , Thank you very Much for your opinion , i hope that we see you very soon here in your hotel VINCCI SAFIRA PALMS best regards  ", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r603956298", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Aminations amazing but food was bad", "review": "We enjoyed our vacation and I could recommend the hotel to everyone. Everything was great. Hotel staff is friendly and still smiling. The chefs, the waiters at the bars and the dining room, the animation team are all amazing. We did not have any problem, but I think that if any were so it would be resolved. Rooms smaller and cozy, but what do you need when you just go to sleep there. Everything was clean, cleaning took place every day, including changing towels. Breakfast, lunch and dinner excellent. The food was changing, and it was not always the same,  The perfect beach right next to the hotel, the beach was tidy, plenty of sunbeds at any time of day, as well as at the outdoor pool. We thank all the staff, animators, managers and the director for their work and effort in the…", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r602107515", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "For Hotel Vincci Safira Palms", "review": "Hi Petra , thank you very much for your opinion , and we hope that we see you as soon as possible in your second house VINCCI SAFIRA PALMS  best regards  Imed  General Manager ", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r595807676", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "I want back!", "review": "I have never met an animation team like there, they were amazing Nino,Sara, Speedy,Ali baba,Rico,Abdel,Willy,Aminos, Dino,Bassma, Najla and DJ Hazma. they create something special and they give every secon of their time for us! :DA lots od atractions and we walk always with the smile of our faces because of them !:D  Hotel is nice, personel kind, it was clean and the rooms was good. Pool was great and the beatch to, one this that was horrible ...food. They have to practice this part od hotel because food was not tasty, overcooked and tasteless. The drinks was bad too, nothind natural and good.  if you are looking for place to fun its a great opertunity but if you want to lay down drinking drinks and ate something good you should looking forward", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r595481689", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Hotel and staff - Zarzis", "review": "I remember my stay in the hotel very well. Food, rooms, bathrooms and swimming pools of a good standard. Animations in this hotel are run at a very high level, animators very nice and help. I remember very well animators Rico, Sara, Nino and crazy Aziz very nice team I highly recommend such animators!", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r593561617", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great vacation", "review": "Hi Dawid, thank you very much for your opinion and we will be happy to see again in your hotel VINCCI SAFIRA PALMS  Best wishes  G.M   ", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r593034901", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fail!!!!!", "review": "Thank you for all the Best moment i like the hotel the food the room and the Service i want to back again to tunisia and i really love all the animation team and  evenings comedy shows and specially Rico.", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r508493694", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "thief in the balcony", "review": "thank you very much Klaudia for your good opinion , and i hope that we see you as soon as possible .  Best wishes   ", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r506566866", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Nice but middle of nowhere ", "review": "This place is a fail beware dirty rooms poor service nothing is good, in the restaurant you have to stand in line forever not enough plates for everyone and nobody cares C'est la catastrophe un hôtel médiocre ne mérite pas les 4 étoiles service nul je conseille pas.... ", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r386237466", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Poor experience", "review": "We were in this hotel last October with our baby.  Check in was terrible we changed rooms 3 times, the first room was small and full of dust and the sea view was through a small window. The second room was not clean at all. In the third one people actually already checked in. After trying to talk to the manager which the receptionist refused they finally gave us a suitable room. The receptionist was not friendly at all very bad experience.  This whole story left a bad tast for the rest of our stay.", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r213950219", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Amazing", "review": "Me and my boyfriend wanted a cheap quiet holiday together it was our first holiday so we wasn't really expecting to much but when we got there the hotel was lovely and welcoming and very clean the staff are so friendly and made the stay very pleasent we enjoyed every single day and didn't want to come home we will defo be going back again ", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r181504833", "sub_review": {"Value": 5, "Location": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Relaxing week in the sun", "review": "Dear Guest,   We greatly appreciate the time you spent to share your recent holiday experience at our IBEROSTAR Safira Palms hotel, we are always glad to read that our guests bring back home some beautiful memories of their holiday among us.  Moreover we thank you for your kind words towards our staff, their kindness and helpfulness being our hotel's main strength we will definitely congratulate them all on your behalf for their contribution to your wellbeing whilst staying among us.  We are also glad to read that our hotel grounds were to your liking and thank you for your highlight on the cleanliness of our installations as this is an aspect of prime importance for IBEROSTAR.   Once again, thank you for your praising comments, we hope that you had a pleasant journey back home and look forward to welcoming you again at your earliest convenience.   Warmest Regards,  Online Reputation Manager IBEROSTAR Safira Palms", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r179093204", "sub_review": {"Value": 5, "Location": 2, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Not geared towards the English", "review": "Reading some of the reviews here I went to the Safira Palms with reservations, but felt that it was excellent value for money and we had a lovely week's stay. The staff (excepting those on reception) are incredibly friendly and helpful, and we didn't find the language a problem, getting by on their limited English and our very limited French. The animation team, as everyone has said, are excellent - for anyone who doesn't like \"organised fun\" they're not intrusive but their sessions were enjoyable. The evening entertainment wasn't particularly professional but it was fun enough and didn't last too long, meaning you could go to bed and not hear loud music. The pool area is large and the beach is fine - it's all kept absolutely spotless. We got sunbeds every day without a problem.…", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r179032167", "sub_review": {"Value": 3, "Location": 2, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "New to fully inclusive", "review": "Went here for a wee k in September, lovely weather, nice room, no kettle though. Location Is a lot to be desired as you are in the middle of nowhere. Maid service is fair but you room is never spotless! My biggest problem was the choice of food, if I was German or French or any European country other than England I probably would had have loved the food. Unfortunately I am not neither is my wife and chips and melon was all that she could eat.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r178323894", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Very good value for money", "review": "Just came back from a weeks stay here, a week was  enough because of the location .Arrived late at night got to the room 2 nice plates of salad and 2 bottles of water waiting for us which was a nice touch.Hotel was clean and the rooms cleaned daily,Food in the restaurant was good .The animation team were very active throughout the day..All the staff worked very hard all day..Beach was good.. a couple of negative points , the next morning my wife smelt something  nasty, it was the mattress which was a bit ripe (urine) ,complained to the reception ,the mattress was changed that day. The language barrier  was another sticking point , the staff spoke french, and German was the two main languages obviously apart from tunisian once you get there you will understand.. Overall I would…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r175747784", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Fantastic", "review": "Ive just got nack from 2 weeks here and I had an absolutely fantastic time the staff were ace anything u needed they saw to and the animation team were excellent Rico.Nino.Sam.Dahli.Chico.ChouChou.katy.selina.sylvia.Hachoo kept us entertained all day those guys work so hard and made the holiday awsome ....the location is pretty remote but beautiful  there's plenty of trips to go on and water sports ....my partner and I enjoyed ourselves so much we didnt want to leave and will definitely be going back we made lots of new friends from all different countries .The food was fab too and there was plenty to choose from lots of authentic tunisian food to choose from and of course burgers pizza and chips if your a fussy eater lots of salad and cold meats fresh fish so much to choose…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r173926759", "sub_review": {"Value": 5, "Location": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Not Bad but not 4star", "review": "We have just returned froma weeks holiday and although the weather was fantastic and the sea beautiful the Hotel on a whole was very tired looking. The reception staf were helpful when necessary, but the main staff in the buffet restaurant pretended not to speak English and practically ignored you. The waiters worked hard but most days organised chaos!! the food was normal buffet style all inclusive.The al a carte restaurant could not produce a menu to see if the food was acceptable for children so we didn.t book. The American stylr bar was non existant neither was the indoor swimming pool!! The  quality of service and drinks in the main lobby bar was poor and we ordered a mojito everyday day to be told tomorrow  we are still waiting!!!!!! Not good with cocktails and no…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r171723105", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Very friendly staff and a very good holiday", "review": "Dear Carole,   First of all we would like to thank you for your preference in selecting our IBEROSTAR Safira Palms hotel for your holidays and for the time you spent to write your impressions about your stay as it is our best way to know where we can still improve in our daily services in order to deliver unforgettable vacation experiences to our guests.   We took good note of your comments related to the service in our lobby bar and restaurant and will pass on your comment to our head of department in order to revise and improve and we apologize for not fulfilling your expectations during your stay.   Further we would like to point out that despite the fact that our hotel was built a few years ago, we do our utmost to take good care of it, maintaining all of the installations the best we can, nevertheless, we took good note of your comment and we commit to revise if we can renovate some of the areas.  On the other hand we thank you for your positive comment on our reception staff and are glad to hear that you felt well cared after when necessary.   Once again, thank you for your visit, we hope that you had a pleasant journey back home and to have the pleasure of serving you again in our hotels worldwide ensuring you in advance of our utmost care and dedication.   Warmest Regards,  Online Reputation Manager  IBEROSTAR Safira Palms", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r171651415", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 3, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "excellent holiday , i will miss it", "review": "I stayed at this hotel for 2 weeks with my family. We were given a relatively nice welcome and the men working at reception were polite. The room was exceptionally clean although the beds were hard and uncomfortable, causing a bit of a back ache... The food was okay there was a lot of choice and the waiting staff / chefs in particular were very friendly. The daytime actives were engaging and my daughter above all liked to get involved eventually. They were things such as darts, aqua gym, aerobics, beach volleyball, pool games etcetera... I have to thank the animation team above all, they were incredibly friendly and made you feel welcome. They got to know you and this made all the difference I'd say, without them the holiday wouldn't have been as good. A special thanks to Sam…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r171226558", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "friendly and helpful staff", "review": "i went to safira palms with my daughters(17/16yrs) on arrival we was not pleased with our room as it was small.so in the morning complained and was moved to a bigger room no charge,lovely location if your happy to stay on site..animation team were good very friendly/funny,i enjoyed every minute,sunrise was amazing directly oppersite hotel just popped out of the sea,food was very good lots of choice lamb beef chicken veal fish pizza pasta chips potatoes rice etc never went  hungry,lots of activities during the day. evening time i feel ended to early 10.30pm although the beach party was later, i would go back so would my daughters.nino haji josef rico cheeko dali and mo the life gaurd were fantasic i will miss them", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r170487497", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Very Good Hotel!", "review": "I stayed at this hotel for 2 weeks with my boyfriend (i am 21, he is 24) on 6th July 2013 - 20th July 2013. We were looking for a relaxing holiday but with great day time and evening entertainment and food.  The food was very nice and there was a wide variety of food. There was no bacon or sausages for breakfast and no pork at all due to it being a muslim country. For breakfast there was pancakes, fried eggs, boiled eggs, cheeses and hams, omelettes (cooked to order with a variety of optional ingredients), pastries, tea, orange, apple and various other juices and fruit. For lunch and dinner there was always a variety but common things such as rice, chips, pizza, pasta, salad appeared everyday with other alternatives such as Tunisian specialities, veal, and various other meats.…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r170114098", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "fab holiday", "review": "just got back from a family holiday we stay for a week and from the min we got there we were made welcome. we didn't get there till 1am on Sunday and after check in we're shown to our rooms and waiting for us was a plate of salad and big bottle of water. the rooms are a good size we had a shower and bath and the room over looked the pool. the staff even if they didn't talk English still try to help and would find some1 who could talk English. we sat outside for our meals and our waiter couldn't do more for us. as always in these hotels the food does get a bit the same but was still nice. I would back again nice hotel and nice staff ", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r165750111", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "verry good hotel with professional annimationteam", "review": "We were on holliday in this hotel and everything is great. Everyone works hard to give you a great vacation. To bad that some people have to talk bad about some annimators while this is not true. They are verry professional and don't drink. The show's are also verry nice and funny. For everyone who wants to go there. Don't be afraid, you will have a nice vacation. By the way, fun you have to make by yourself.", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r164364978", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Cockroach infestation, poor hygiene, insolent & prejudicial staff, dated rooms.", "review": "Negatives: 2 large cockroaches in 2 separate room on 2 different floors = a problem! The food in the dining room is all uncovered and for some unintelligible reason the dining room doors are left wide open, consequently the food & crockery have flies all over them!! On 2 occasions I saw a woman 'hygienist' taking thermometer readings where food had flies on it, I suggested that the doors be closed to the General Manager & the following morning they were but at lunchtime they were open again. Both my Mother & I had stomach upsets. The food choice was repetitive, poor quality (apart from the 36 hours the 'big' bosses were at the hotel), if you have an infant the choice is virtually nil & the highchairs are ancient, food is luke warm & greasy. The mini disco is at 8.30pm? Even the…", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r163168596", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Travel Agent review. Had a great week", "review": "I travelled out to this property through the industry and to write a report at the end of my stay to share with UK travel agents. From the minute we arrived at the airport in Djerba till the end of our stay, we had a great time. We checked in at around 0100am and the hotel was dead to the world. We got taken to our room which was extremely large and spacious with fruit and water provided. Lovely balcony and view. Aircon included, bath and shower. I do agree that the language barrier is quite difficult and mainly geared towards the French customers, but that doesn't mean its an issue! The service was amazing and all of the staff were friendly and smiling. The Manager Tarek was a very great asset to the team. The pool area is lovely, clean and spacious.  The beach isn't the best…", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r162811560", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Not for the British", "review": "I returned from this hotel on Saturday 18th of May after a week with my two daughters and infant granddaughter.We arrived at 1am by taxi reception staff friendly but poor English,shown to our family room which we paid Thomas Cook an extra £170 for  my daughter sat on the bed to undress the baby and a very large cockroach was at the side of the bed ,called reception and they caught it and removed it.We had requested a ground floor but were on the second ,so the next morning we asked to be moved ,the room we were shown just had one double bed ,so we paid another £100 and were upgraded to a junior suite on the first floor with a nice view ,the other overlooked the kitchens .That night returned to the room and another large cockroach in the bathroom again which they removed after my…", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r161470431", "sub_review": {"Value": 2, "Location": 1, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Enjoyed nice weather at a no-frills 4-star hotel", "review": "Dear Guest,  First of all we are glad for the time and effort you spent writing a review on your stay at our IBEROSTAR Safira Palms hotel as this will help us to improve our day by say services in order to ensure nice holiday experiences to all our guests.  We are sorry to hear that you didn’t feel well cared for by our waiters and bar staff as it is one of our most important features that they have a good contact to our guests. Therefore all of them are chosen according to a specific profile and are given appropriate training. This is why we can confirm that they aim to provide a personalized service, regardless of the origin of our guests, nevertheless we will pass on your comment to our head of departments in order to revise and improve on this specific matter.  Please receive our most sincere apologies for the inconvenience caused by the presence of some cockroaches in the room. We do our utmost to prevent this and usually can. Nevertheless sometimes due to the green areas and the climatology of Tunisia the eventual presence of insects is unavoidable. In the event of localizing an infestation in a room, our housekeeping department undertakes an in-depth cleaning in conjunction with an adequate treatment to minimalize the inconvenience and until the problem is not completely solved the room stays in quarantine.  On the other hand we are satisfied to read that our animation team did cheer up your holidays with us and that you felt well cared after by our friendly reception team.  Finally, for any upcoming holiday planning with IBEROSTAR, we suggest that you contact directly our call center where we can offer a personalized booking guidance to ensure that you make a reservation for a destination, hotel type and accommodation in accordance to your needs and wishes for us to deliver an excellent holiday experience for all the members of your family.  We hope that your stay was as pleasant as it could possibly be and to have the opportunity to welcome you again in our hotels worldwide.  Friendly Regards,  Online Reputation Manager IBEROSTAR Hotels & Resorts", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r157901491", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Not bad but...", "review": "As a professional travel agent and group planner, I have the following remarks : - it was obvious that the hotel was still in its opening weeks of the season. Not everything was up & running yet (only buffet restaurant open for example), not that smooth yet, staff were getting everything ready from winter (like the watersport equipment) etc. - really liked the layout of the hotel. Although not enormous, it gives the impression of openess and space - We knew in advance that the hotel is very isolated. Nothing around it. - Location of the beach right in front of the hotel is a big plus. The beach is not the nicest, but still OK. Lot of rocks so not the best swimming place either, but we enjoyed it anyway. Beach chairs & parasols availble for free. - Outside pools were quite nice…", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r144717875", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Excellent hotel and friendly staff !!", "review": "Dear Guest,  First of all we would like to express our gratitude for selecting our IBEROSTAR Safira Palms hotel for your family holiday’s as well as for the time you spent writing a detailed review on your stay as through it we can know where to improve in our daily services in order to deliver unforgettable vacation memories to all our guests.  We are sorry to read that you found that not all waiters were friendly with you but more with Tunisian and French customers, we can only imagine that it may be due to a language barrier making them feel more confident speaking French than English, nevertheless we will pass on your comment to our Maître in order to revise and improve on this point, on the other hand we are glad to see that you highlighted the friendliness of our staff in general meaning that they all do their best to make our guests feel welcome and well cared after regardless of their nationality.  Further we took good note of your comment related to the baby chairs and will do our utmost to arrange more of them by the restaurant.  We are glad to hear that you felt comfortable in the room we accommodated you in and that all in all you and your family had a good time whilst staying among us.  Once again, many thanks for your comments that we will take into consideration to achieve maximum customer satisfaction and hope to may serve you again in the near future in our hotels worldwide.  Kindest Regards,  Online Reputation Manager IBEROSTAR Hotels & Resorts", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r142974774", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Shukran Iberostar!", "review": "We have just returned from a week all inclusive at this hotel and can find very little fault with it. We arrived in the early hours after a 50 minute transfer from the airport. We weren't offered any food or drink which was a bit disappointing. We checked in and were shown to our rooms without any hassle.  Our room and bathroom were both spacious and clean, the bed was at least queen size, and on the whole it was perfectly comfortable for a weeks stay. The shower in our bathroom didn't reach the bracket, so we had to hold it whilst showering which was a minor inconvenience.  The food was fantastic - everyday there was plenty of choice. There was occasional repetition through the week, but because of the vast selection on offer, this was not an issue. There is very little time…", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r140913832", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Not worth 4 stars", "review": "Room and halls not clean, sticky floors. Dirty bath, poor shower facility. Ants in the room on ground floor. Food not worth 4 stars. Personell not at all friendly. Poor cocktails and drinks. Clean swimming pool but some of the chairs are too old and hard. There are better 4star hotels for this price, first and last time here.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r140584164", "sub_review": {"Value": 3, "Location": 1, "Rooms": 2, "Cleanliness": 2, "Service": 3}, "travel_purpose": "", "rating": 3}, {"title": "Good holiday but", "review": "Dear Jerain,  We thank you for publishing a review about your experience at the Iberostar Safira Palms and for choosing our premises to enjoy your holidays. We are very sorry that on this occasion your experience did not meet your expectations; please allow us to express our sincerest apologies. We continuously strive to meet your needs and desires; therefore your feedback is very important to us.  We took good note of all your comments and passed them to the involved departments in order to revise and where necessary adjust our services so they are completely in accordance with our demanding quality standards. Especially your deception regarding the culinary part of your holiday matters a lot to us. It is our target to open our doors to offer a wide range of dishes to sample the best recipes not only from Tunisia, but international dishes for all tastes as well.  In Iberostar we believe that the gastronomic experience during your holiday is very important and therefore we only work with professional chefs, using products of prime quality.  Further we aim to provide memorable holidays in comfortable and clean accommodation on great locations. In order to achieve maximum client satisfaction we do our utmost to supply a service that is characterized by guest orientation and personalized attention. Therefore we select our employees very careful and according to a specific profile. In addition they are given appropriate training to perform in a way that surpasses all expectations. We feel sad that on this occasion we weren’t able to make our goal.  In addition we would like to thank you for highlighting our spectacular and very well maintained swimming pools. It is pleasant to know you enjoyed this part of our hotel.  Once more we want to thank you for having shared your opinion, rest assured it will help us to improve. We hope to may receive you soon and surprise you positively offering a perfect holiday!  Yours sincerely,  Online Reputation Manager  Iberostar Hotels & Resorts", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r140518700", "sub_review": {"Value": 3, "Location": 2, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Taha", "review": "We have just had two wks at Safira Palms.We found all staff very helpful.Second day i asked for a softer matress it was replaced within the hour .Second wk i got chest infection and requested extra pillows because needed to sit up in bed they were brought to room at once .young girl couldnt speak or understand english but we always managed to communicate. The animation team were fantastic.We enjoyed the man playing music in lobby bar .We like vodka and tonic but most of the time they said they had no tonic but we could have sprite which is nothing like tonic .Afault i would find is that people were allowed to smoke any where even when you are eating .It would be nice if part of lobby bar was none smoking so you could listen to music watch dancers and be able to breathe. We…", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r140505615", "sub_review": {"Value": 1, "Location": 2, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Didn't live up to what I thought it would", "review": "hotel is good as a buliding only , food is very very bad , i expect more , allinclusive was bad ..............................................................................................................................................................................................................................................................................................................................................................................................................................................................................", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r140493301", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 3, "Rooms": 2, "Cleanliness": 4, "Service": 2}, "travel_purpose": "Traveled solo", "rating": 2}, {"title": "Relaxing holiday", "review": "We have just got back from our very relaxing holiday.  There were 4 of us [2 being teenagers] and we really really enjoyed it, A very very big thank you to our very dear friend ALI BABA, who took care of us, and was very caring on our trip to the sahara desert. Not only did he take us in his car,but gave us a very good tour of the island, so if you go to the safira palms hotel look out for ALI BABA by the reception desk, go on a trip with him and you will definatly have a good time. The hotel was very clean  and the staff very help full, a big thank you to mickey at the pool bar, all the staff work very very hard to look after your needs, cant fault  the hotel and the staff.  Kais is also a very hard worker and very helpfull, so thanks to him also. If you go to the safira palms…", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r139176367", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Very nice holiday", "review": "We had a very nice holiday apart from a few issues, When we arrived in the middle of the night we were greeted by an un co operative reception man that couldnt speak english, we were then took to our room which one of them hadnt been cleaned properly with empty cans of pop on the bed side tables from the previous guests ! The rooms we were put in wasnt what we booked in the first place we got told to go back to reception the next morning and when we did we were told to go back the next day to get the rooms we wanted but that didnt happen finally 4 days into our holiday the rooms got sorted (we do believe that this fault was partly co-op travels fault who we booked with but the reception could have got this sorted for us quicker and could have better manners and not been so rude…", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r138246067", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 5, "Rooms": 3, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Good holiday but standards could have been higher.", "review": "Like a few other couples on here, we choose this location for a nice relaxing cheap week in the sun and thankfully that is exactly what we got.  After a short bus ride from djerba airport we arrived at the hotel and were met by a group of Tunisian’s who proceeded to run around us in a sort of ‘organised chaos’ handing out forms for us all to fill in. No one really spoke English and we didn’t speak French so it was quite hard to communicate. Once we had completed the forms we were given our all inclusive bands and sent on our way.  Our hotel room was on first floor so we caught a lift and headed down the corridors to find our room. The carpets in the corridor were tired in places which gave the hotel an uncared for look. In fact, the whole of the living quarters probably could do…", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r137048182", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 3, "Rooms": 2, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Best holiday ever!!!", "review": "Dear Lee,  Thank you for describing with so much details our complete services and facilities. We are delighted to read that you felt welcome in our Iberostar Safira Palms. It is very pleasant to see that with you we have made our goal to offer a really good and relaxing holiday.   Nevertheless we have read your remarks on the quality of food and drinks with a lot of attention and we are grateful that you shared your opinion as this will certainly help us to improve. As we speak, our responsible chef and maitre are revising the procedures to ensure that our demanding quality standards are encountered and to guarantee that all palates will be delighted with our culinary offers.  Concerning the beds, we are sorry not to have been informed during your stay that you find them too hard to feel comfortable. It would have been a pleasure to provide you a cover-mattress to put on top of the basic one, in order to make it softer. For coming occasions we kindly invite you to communicate special wishes like this, because we want you to experience your holiday as enjoyable as possible, and it would be an honor to serve you according to your personal preferences.  On the other hand it fills us with joy to see you really appreciated the nice touch of the welcome attention we prepared for you upon arrival. Your positive remark on this issue indicates us that these kinds of details contribute to your all over experience and exactly that is our goal.  Further it is a delight to see that you are satisfied with our staff. In Iberostar we lay much worth on personal service with a clear orientation for client satisfaction, therefore we choose, train and school all our employees and the best reward is that our guests enjoy their performance. We will certainly congratulate the maid and the entertaining team and we are sure they will celebrate your compliments.  Once again we would like to thank you for your feedback which gives us the opportunity to make improvements and thus offer all our guests an even better service. We hope you will have an opportunity to return and enjoy our Iberostar Safira Palms again in the future.  Sunny regards,  Online Reputation Manager Iberostar Hotels & Resorts", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r134109641", "sub_review": {"Location": 4, "Rooms": 4, "Cleanliness": 4}, "travel_purpose": "", "rating": 5}, {"title": "Good value for the price", "review": "This holiday was fantastic we loved it! The staff were all really friendly and helpful even though they speak little English they really tried which was great,  our room was just right, clean and a good size. Pool was amazing a lot of the sunbeds were in the shade but we managed to get ones we wanted most days, the weather was great too not one bad day and was getting even hotter as we were leaving but wasn't uncomfortable as there was a lovely breeze, we went on a few excursions, they were good too but the quad bikes were the best definately recommended! The best part of the holiday was the animation team they were fabulous especially jo and zizou these guys spoke good English and made our holiday so much fun! Over all I loved my holiday and I'm so sad to be back! We will be…", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r133979677", "sub_review": {"Value": 5, "Location": 3, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Absolutely Brilliant!!!!!! 100% coming again.", "review": "Me and my partner arrived mid-June and have been here for 2 wonderfall weeks, when we arrived in the early hours of the morning we where greeted by the friendly receptionist who taken us to our room and we had to 2 meals awaiting us in the room ( sandwiches and water ) which I found to be a nice touch. We found all the employees to be very friendly and helpful. The Animation team are all nice and work very very hard, they arrange activities through-out the day e.g aerobics, volleyball, football, pool ball, archery, a creshe for the kids plus loads loads more. The beach is very nice the sea is clear and there's dozens of activitys to do on the beach including jet ski-ing, canoe, don't know what it's called but you get strapped to a boat and get life in the air by a parachute and…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r133090574", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Love this place!!! Can't get enough!!!", "review": "Dear guest,  In first place, Thank your motivating words: “  Absolutely Brilliant!!!!!! 100% coming again “. For us is very important that our guest feel welcome. Your positive Encourage words motivated us to keep on working with illusion and enthusiasms.  It will certainly help us to keep focus on customer satisfaction and fulfillment of our hotel standards.  We will continue working to improve your next experience with us.  Once again, we would like to thank you for your motivating words.  Kindest regards,  Online Reputation Manager Iberostar Hotels & Resorts", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r131405733", "sub_review": {"Value": 5, "Location": 3, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "I would highly recommend, everything about the hotel and entertainment team is A1***", "review": "My partner and I stayed at this hotel for two weeks in August/September last year and upon returning home, we booked to go back again 4 weeks later. We had fallen in love with the place. Then, we decided to go back yet again in May this year. As per usual, we had a fab time. The staff and entertainment team certainly make the holiday, they are the reason we continue to return! Absolutely lovely place. Lots of activities to get involved in, rooms are lovely, staff friendly, food nice and plenty of options. We are booking our fourth trip very soon and I absolutely cannot wait!!!!", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r131117273", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Delightfully Surprised", "review": "My husband and I have just spent two weeks at this hotel, we will definately be going back. The hotel, rooms, staff, food, location, sea, beach, and tunisian people are fantastic. The entertainment team made up 50% of our holiday, friendly, fun loving and their shows are brilliant. My son and his wife went here for their honeymoon last year and have just spent their first anniversary there as well. There is plenty to do and see and children are well looked after. You can laze the day away or join in as many things as you like. We are now booking again.", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r130692063", "sub_review": {"Value": 5, "Location": 3, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice hotel for a last minute getaway", "review": "This was a last minute holiday that we both needed badly and  the money we paid we thought we wouldn't be getting a brilliant hotel but how wrong we were.  Yes it is a good hour away from the airport and the road is bumpy but hey that all adds to the fun of the holiday. Its true that alot of the staff don't speak english but then again our french and arabic are none existent but we didnt let it spoil our holiday or stop the staff being just as attentive to us as they were to the French, Gremans and the other holiday makers of different nationalities. The hotel and grounds were immaculate from the restaurants to the pool to the room and the lounge area but what makes this hotel brilliant is the peace and quiet that we had for the whole week were there, infact it was so good this…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r129862689", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Mediocre on the Med", "review": "Let me first say that despite the upcoming issues, I had a thoroughly enjoyable week here. Despite the averageness of it all and the poorer points I suppose you get what you make out of it. The overall hotel is at best a 3 star, not a 4. There's barely a word of English spoken by the staff.  French or Arabic is the norm. Rooms were 3 star average, and ours was located at the far end of the wing adjacent to some chicken coops. Comunal areas clean, but not so much poolside.  Drinks - not too much to choose from when you can get the attention of the barman, and you can't get a drink after midnight. Entertainment is banal and bawdy, but apparently catered towards the Germans.  Still, I appreciate it's hard to satisfy the artistic palates of a multinational crowd.  The make up of the…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r126345877", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Dirty rooms! Out-dated hotel", "review": "Dear Guest,   Thank you for writing your review from your recent stay among us at Iberostar. Please receive our most sincere apologies for mailing to meet your expectations.  Feedback like yours is very important to us, so we know what we can improve to reach an even higher and more exclusive service for our guest. We will certainly take in our consideration and we will do our utmost to improve these points.  Thank you for sharing your experiences.   Yours sincerely  Online Reputation Manager Iberostar Hotels & Resorts", "date": "November 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r120674169", "sub_review": {"Value": 2, "Location": 2, "Sleep Quality": 2, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Definitely going back!!", "review": "I've worked as a Tour rep and I am used to the Iberostar hotels. Unfortunately this Iberostar is not worth the name at all.  Terrible hotel! People that are rating the hotel as excellent are definately not used to travel in 4 stars hotels. Rooms are worse than a youth hostal. We had to change 3 times from room.  We arrived during the night. There were long black hairs in the bedlinnen and even not a bottle of water.   Sunbeds are so old that you will have back pain at the end of the day! Beach is not nice at all, only big rocks.  Food is every day the same and very greasy  Not a 4 star at all.", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r120241191", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Brilliant Holiday and Lovely Hotel", "review": "I went away with my friend I just wanted a break to get away catch a tan and relax and I gained all this. The food was excellent the staff were lovely the entertainment gang was brilliant and the hotel was very clean. There wasn't much to do around the hotel but we knew that when booking I only spent £40 in the whole week and I didn't really need to spend that. I will definitely be returning next year and my daughter and her family are going. HIGHLY RECOMMENDED", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r120035315", "sub_review": {"Value": 5, "Location": 3, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Will not be going back!!", "review": "We arrived at the hotel quite late at night. We were taken to the restaurant which had been specially opened for us, we were given food and drink and when we got back to the reception they were waiting with our keys and taken to our clean room.  The hotel was lovely and anything you needed, there was someone there to help. The food was really good with such a brilliant selection, even with 3 fussy teenagers!  We had a really relaxing holiday and I would highly recommend it. The rooms and all over the hotel was very clean.  Plenty to do on the beach if you wanted to do it and lots going on around the pool area. Titi and the entertainment gang were lots of fun and we all had a fantastic holiday.  Some of the staff have trouble with the English language but they will then find…", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r120020500", "sub_review": {"Value": 2, "Location": 1, "Sleep Quality": 2, "Rooms": 2, "Cleanliness": 1, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Worst holiday of my life! Don't waste your money!", "review": "When we arrived at the hotel it wasn't nice and relaxing they told us to stand in the corner and was left there for 20 mins! We then had someone who took our suitcases who wasn't clean and smelt very bad!  Nothing run smoothly unless the boss was around! There cleanliness was terrible when we got a drink from the pool bar there was dirt around and stuck in the rim of the cup and after drinking it we became I'll and so did other travellers that we spoke to. There idea of cleaning the cups was rinsing them in cold dirty water.... No wonder why we was all ill!!  The food would of been okay if you like fish they had no variety so we lived of salad and chips!  The staff were friendly enough although there couldn't speak much English atal for example I asked for a coke with my dinner…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r119986779", "sub_review": {"Value": 1, "Location": 2, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "", "rating": 1}, {"title": "Fantastic Hotel, Fantastic Staff!!!!!!", "review": "I have just returned from a week away at the iberostar safira palms, what a lovely place. From the moment we arrived the staff bent over backwards to help, The Hotel was very very clean and decorated to a lovely tunisian style. There was always a waiter following you around......( but rest, they didnt want tipping). I travelled with my friend and our two girls ages 4 and 16, and found the range of activities for them great. The food in the Hotel was varied and very good and my party never had a problem with it or our tummies. The animation team (titi and guys) will go down in history, they were fab but never pushy. During our visit our girls celebrated their birthdays, the hotel was informed and they made it very special for them (decorated beds and supplied birthday cakes) at…", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r119749125", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Nice Holiday at the Safira Palms", "review": "Just got back from a week at this beautiful hotel. Had a very relaxing week with some lovely weather. We were given a ground floor garden view room but asked to change to higher level room with a sea/pool view. There was no problem with this so changed the next day. The original room was fine but the view wasn't too good. This cost us an extra £7 a day and was worth it. All the rooms were decorated traditional tunisian style and were clean and spacious. The carpets in the corridors need changing but everything else is fine and to a high standard. In our new room the fridge and hairdryer didn't work but this was sorted out very quickly. (note-the hairdryers were quite powerful, so don't bother taking your own). The food in the restaurant was varied, and of good quality and cooked…", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r119685319", "sub_review": {"Value": 5, "Location": 3, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "best holiday for a long time.", "review": "my girlfiend and i have been working very hard and just wanted a relaxing holiday in the sun. thats exactly what we got,when we arrived they took are cases off us,and showed us too the dinning room where there was so much food which was not the best as during the week half the hotel went down with stomach problems due to the food not being cooked properly.  the staff were friendly,the hotel was very clean,the entertainment was fantastic,(titi and co). there was so much too do,i.e. quard biking,golf,archery,that my girlfirend was good at. so many places to see,the star wars trip is a must. the weather was so hot. would def go back again.", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r119224198", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Everything we expected", "review": "My friend and I have just returned from a week at this hotel and we have nothing but praise for  it. It was exactly what we expected a quiet and restful location, clean, friendly staff, excellent  food and the local people are very welcoming to english visitors as I understand this is the first year they have accommodated the English. Although the main language is Arabic and French most also speak German and now over the last 6 months many of them are learning english so making ourselves understood was not a problem.  I would say that it was very much geared to couples and small groups of friends rather than families as there is not a lot to do outside of the hotel unless you want to travel into nearby Zaris or a little further afield into Gerba. The animation team kept everyone…", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r119182044", "sub_review": {"Value": 5, "Location": 3, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "not as bad as it sounds<dont be put off> 25 sept to 2 oct 2011", "review": "i was a little cautious about going to tunisia again but actualy liked the hotel they cant do enough for you  theres a large variety of food and yes some is a bit on the poo side but they do try hard to cater for everyone  like someone else said on here theyre not quite ready for the british yet .. they tend more to cater for french and german peole so they do struggle with the english language very basic understanding the rooms could do with a refresh to be honest but are fine as you dont spend much time in them it has it own beach and there are no charges for the use of sunbeds  i noticed while there that some people did have issues with stomach problems but me personaly and my wife and son had no problems at all  i did notice one big health issue and that was the bar staff…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r118872002", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "best holiday ever", "review": "My partner and I absolutely loved this hoiday and after 2 weeks still didn't want to go home.  The weather and the views are fabulous.   There are  so much activities and entertainment on offer including trips out and the beach was fabulous. Try a massage in the spa, it was brilliant.  Im a scouser and my partner is Irish and although the staff's english is limited,  they try their very best to understand us,  and we got on fabulously with them all and even taught them a couple of English phrases.  ALL the staff are very welcoming and friendly and smile all the time, especially Anis and Modiher, our lovely barmen.  Every member of staff always said hello and good morning and made us feel very welcome. They are a credit to their country. The hotel is very clean and the maids are…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r118841554", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Dont go...", "review": "This is the first time ive been awayand been ill, we went away on 11th to 19th, when we arrived at our room it was discusting looked like someone had just left the room (not something you want when you arrive at 2 in the morning) so we got another room. Got to our new room they had given us a family sized room was huge too big for us, so changed in the morning to a nicer room. food was ok for the first couple of days, then it began belly cramps, going to toilet, sickness, i have now been back home nearly two weeks now a nd still getting pains and suffering,   room where clean, pool nice, beach nice, entertainment team good.  Dont go if you want to get ill as this was a thomas cook holiday not good.", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r118669037", "sub_review": {"Value": 2, "Location": 3, "Sleep Quality": 3, "Rooms": 2, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Must have stayed at a different hotel", "review": "I have read the recent reviews & they could not be more different from our experience! Went to this hotel with a friend for a week returning on the 18th. The hotel was lovely. Our room was ground floor looking on to the pool. It was clean & the towels & bedding were changed everyday. The fittings in the bathroom were a bit tired but that was the only fault. Yes there is a language issue but we found all the staff very friendly & helpful & if they had difficulty understanding us they found another staff member who understood. The animation team were fantastic & worked really hard with plenty of activities if thats what people want. We had no issues with the food, my friend has IBS & she had no stomach problems when there. We did not have the salad or ice & as usual for counties…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r118476797", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "98% of Hotel were ill", "review": "Went to this hotel between 11th /19th Setember and most of the holiday makers were ill, either vomiting, stomach craps and sickness or both. I was ill for one day but my partner was ill for most of the week and after using up all are diacalm was no better and went in a taxi to the pharmacy, we complained to the rep Simon and the Manager but they didnt want to know blaming the heat, except when a young lady had her head on the table in the dining room the manager soon came over as this did not look good for other clients.In the hotel the glasses used in the bar and pool area are only swilled clean,and often used with out cleaning as i witnessed this, and often smelled of stagnent water. the hotel was ok but needed generally renovating in the room areas. The pools were great, and…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r118371228", "sub_review": {"Value": 3, "Location": 2, "Sleep Quality": 3, "Rooms": 2, "Cleanliness": 2, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Being ill is not fun!", "review": "My boyfriend and i returned from holiday a few days ago and are still recovering from the food poisening we got while at this hotel...  Such a shame because the weather was beautiful, the rooms were a good standard and the animation team were always up for a good time. However being ill for the whole week is not the way i wanted to spend the week, and we had no choice but to eat the food that was provided for us because of where the hotel is situated and being so far away from anywhere... we spoke to other people who had the same problems and it seemed going to the doctor was pointless as he spoke no english.. I wouldnt go back here and i wouldnt recommend it to anyone until they get their food sorted!", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r118356810", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Ok if you want to get ill", "review": "It was a lovely holiday, great value for money, language barrier was very poor for English! The rooms grubby round the edges and do pong a bit but overall fine, no complains. Pool and beach and bars great! Food was bad the same everyday and I found myself very I'll all week and don't really know what caused it! Overall the holiday was very nice if you can avoid the food poisoning! I did love it there!", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r118286034", "sub_review": {"Value": 3, "Location": 2, "Rooms": 1, "Cleanliness": 2, "Service": 1}, "travel_purpose": "", "rating": 3}, {"title": "Not yet ready for British visitors", "review": "My husband and I have already been to Tunisia a couple of times and stayed 4 star, so we travelled to Manchester from Scotland to fly here expecting the same standard.  unfortunalty this hotel is not yet there.  we arrived at 0230 after a 1 1/2 hour journey from the airport and found only one person on the reception to book us all in.  Our room had a bad smell but due to exhaustion we left it till the next day before saying anything.  as soon as we did, cleaners and the cleaning manager attended to make sure the room was clean.  the smell was traced to a drain outside our room which meant we could not sit outside or open our patio doors all week. saying this, the pool area, and beach, was clean and the rooms had a good clean every day with the towels and bedding being changed…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r118245212", "sub_review": {"Value": 3, "Location": 2, "Rooms": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "fantastic", "review": "we had read alot of reviews on this hotel, but thought we would ignore the bad comments and see for ourselves.  We arrived very early in the morning at the hotel and it was a little chaotic with only one man to show us to our rooms, the critism i would give would be for the hotel to have clearer signs for the rooms so guests can make their own way up there.  The rooms were quiet we didnt hear any of the entertainment, we wanted a really quiet relaxing week, and that is what we got,  the food was good, it did get a little boring eating all the time, as there is nowhere to go when you are there, but it was nice and a lot of choice.  The animation team who entertains everyone in the hotel were fantastic, all the staff in the hotel were friendly and did everything to make your stay…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r118048813", "sub_review": {"Value": 5, "Location": 3, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Big disappointment......", "review": "My husband and I decided we wanted a relaxing week away in the sun which wasn't going to cost the earth and was adecent star rating I went to the travel agent who recommended this hotel they did inform us It was the first year that English had been going there, which was fine but it did not prepare us for what we about to encounter. We arrived at the hotel around 10.30 pm and were sent to the dining area where they said we would have food out for us, there was a bit of bread and cheese... We then had to go to reception to get our room alocation, the reception staff barely spoke English and it was extremely difficultto communicate they were very rude because they could not understand when we spoke and would just dismiss you. We were shown to our room which was in the right hand…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r117918687", "sub_review": {"Value": 2, "Location": 2, "Rooms": 2, "Cleanliness": 1, "Service": 1}, "travel_purpose": "", "rating": 1}, {"title": "not go again", "review": "i am going to be honest and let you know what we found with the hotel.The first night we arrived it was nearly 11 30pm we was shown in to the restaurant for some food the only thing there was chips and bread and butter. then we was shown our room which was on the top floor we did not sleep all night for a extractor fan on the roof going on every three minutes it was so noisy so at 6 am next day we asked to change rooms which we did no problems.the pool was cleaned that morning and was not cleaned again for 1 week it was full of sand at the bottom.our beds was solid we ended up with back ache and feeling sore every morning.the hotel was not very clean you never saw the cleaners washing the floors. one cleaner wiped a spot of red wine up with a cloth and then moved a way so the…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r117705646", "sub_review": {"Value": 2, "Sleep Quality": 1, "Cleanliness": 1, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Great Holiday wish we had longer", "review": "well we have just spent a week here and its just what you expect relaxing and chilled and so clean and staff so helpful the team really try to make you feel really welcome, titi and coco will kept you in fits of laughter and its up to you how much you do or how relax you want it to be ....we had a few hiccups but the hotel staff and Simon the rep bent over backwards with all the help they could to resolve these, I think as long as you dont go expecting a package 18 to 30 but a chilled resort you will love it have fun and we cant wait to go again soon ...", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r117369614", "sub_review": {"Value": 4, "Sleep Quality": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Counting the days to return", "review": "I just had a very nice holiday in this hotel.  Everybody is there to help you in case of troubles and the manager always tries to find a solution in case of problems.  The animation team was super: young, always in a good mood and motivated.  They offered you activities from 10 tuill 12 and from 15 till 17 so you needn't to be bored. ALso the shows they did at night were very good. The food was good and variated.  The rooms were nice and cleaned every day. All the staff (reception, kitchen, cleaning, restaurant, bars and swimming pool) were very friendly.  I cannot wait to return to have another holiday.", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r117125796", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Beautiful holiday!", "review": "I'm a 15 year old girl who really enjoyed her holiday to tunisa. The hotel was absolutely beautiful with a lovely clean pool and an amazing view of overlooking the sea. Their was various types of food which was perfect as I am very fussy so there was always something there I liked. The staff were always very friendly and welcoming, especially to the English. The evening entertainment was very enjoyable and family friendly. The holiday was overall worth it! ", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r117098849", "sub_review": {"Value": 5, "Location": 4, "Rooms": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Beautiful holiday", "review": "I am a 15 year old girl who extremely enjoyed my family holiday to tunisia. The hotel was absolutely beautiful with a lovely clean pool and a view over looking the sea. The staff were all lovely and very welcoming, especially to the English. The man at the reception sorted us out with 2 rooms next to each other which was a great help. The evening entertainment was good for the whole family and very enjoyable! It was a well spent holiday.   ", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r117097707", "sub_review": {"Value": 5, "Location": 3, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "great location", "review": "Hotel was good, we were a family consisting of 2 daughters and husbands, a 8 year and 4 year and baby of 9 months. They were on the top floo - r good rooms Ours was on the 2 floor - very poor shower, we had to hold in in our hands to shower, the hose on the shopwer was far too short. Cleanliness only ok.   We found the staff quite rude and surly.  They spoke no or liilte english and did not really bother withfeven trying to be helpfull (I know we were in there country).  On the next to last night a lady gave out questionaires this was the only time staff showed any interest,and were looking over our shoulders when we were writing them trying to change our minds.   I understand that this is the first year English people went into this hotel.  I suggest that perhaps retraining…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r116842303", "sub_review": {"Value": 3, "Sleep Quality": 3, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Lovely hotel and location- lacked good evening entertainment.", "review": "The hotel and activities were great in general. In the room the shower was poor.  Evening entertainment was aimed at families and Did not cater for us being a young couple.   ", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r116706780", "sub_review": {"Value": 3, "Location": 3, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "", "rating": 4}, {"title": "Loved it, wonderful peace & quiet", "review": "Great hotel, amazing food, great place to go to get away from it all, don't go to this hotel is looking for excitement or for evening walks, there is nothing to do but just relax and totally unwind and go to bed early, it did exaclty what we expected so have a lovely holiday, we only stayed one week which felt like 10 days, to stay 14 nights would be too long for us so it was just perfect. At the moment the staff speak little English but they all do try, they do speak other languages mainly French so before you go remember to refresh you school French which got us by, this is the 1st year for the English within the hotel, by the end of the season I am sure more English will be spoken, this did not spoil our holiday and it is always fun trying to get across what we would like!…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r116378850", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Fantastic holiday, super accommodation - miss it already!", "review": "just arrived back from our holiday with two friends to Tunisia and the Safira Palms Hotel. First experience of an all inclusive and it was a great first encounter. Buffet restaurant always had lots of choice though sometimes the translations into English or French above the foods was lost! Soup, bread, pizza, chips, pasta and cheeses always there if you were uncertain on the other dishes.  The pool was a great size and the loungers were well placed, had to palce towels early though to reserve a spot! Beach was also really good with loads of space. Some seaweed in sea but temperature amazing compared to our seas here!  Animation team good at offering a variety of activities (if not a little anooying with shouting these out as they wandered around!!) But they were good at what…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r116059084", "sub_review": {"Value": 4, "Sleep Quality": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely hotel, great animation team", "review": "Arrived on late flight, offered food on arrival (basic bread cheese etc). Room on ground floor clean and basic. Fantastic pool lots of loungers but needed to put towels out early.  Animation team were excellent encouraged guests to join in although most of them struggled with their English as this is first year they have taken English mostly French, German etc.   Food certainly edible different meats, fish, lots pasta and chips. Bad points, reception staff spoke very little English and when something nasty was found in the pool (you know what I mean!!!) it took over an hour and a half for the pool guy to remove it (not good enough), but despite this overall good cleanliness. We found this ideal for a total relaxation holiday but there is nothing outside of the hotel except a…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r115751389", "sub_review": {"Value": 4, "Sleep Quality": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Best Ever Holiday!!!! Absolutely Brilliant", "review": "My husband and myself joined with another couple stayed here early of June this year. I was very skeptical regarding it's location according to Google Earth.  The coach trip from the airport was a long hour and a half, but when we arrived at the Hotel it was worth the journey.  The Hotel staff are all very friendly and if they couldn't speak English, we all muddled through.  The rooms were large and open and airy.  We had a room looking out onto the beach bar and the waiters even brought drinks over in the late afternoon while I was sitting out on my balcony.  All support staff were fantastic and they were all very friendly and helpful.  The food is beyond belief.  My husband complained most days at the evening meal as he couldn't try ALL the food on offer as there was just…", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r115674791", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A piece of heaven affordable and possible staff and managers helpful beyond words", "review": "Handicapped rooms bought us eya been to monster Tunisia many times but this hotel saphir palms zarzis is the best fab rooms spacious good Ramps door widths  The staffs and managers are great helpful and very interested in your wellbeing in there care all fun around the pool yes there are not many English but the fun was we all Mixed with each other I think that's a good holiday so English only speakers it's not a problem the ones who speak all languages soon help you this is prober Tunisia very remote granted but you can visit towns and djerba not far by taxi etc  It's closer to the sahara trip the entertainment in this small hotel is superb none less than too the larger hotels we recommend this holiday as 100 percent value and enjoyment for money will defo go back again the…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r115424235", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Lovely hotel and beach but outdated evening entertainment", "review": "Tunisia is a closed currency and the hotel only changes £20 notes - no other money  and you need to hand over the equivalent of £10 deposit for each beach towel so beware as there is no bank nearby. Travelled with parents and brother and his wife.  We had a great week lounging around the pool and taking full advantage of the watersports available at the private beach. 3 x ground floor rooms with private terrace were an excellent size and very clean with good quality bedding. The pool is free form and great to lounge in with either steps or vertical ladders to get into it.  There is a small paddling pool for children. There are plenty of sun loungers at the pool and on the beach. The staff are very friendly and speak French, German, Arabic and English.  Which was needed as the…", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r114686361", "sub_review": {"Value": 4, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "FANBLOODYTASTIC!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!  Miss it so much!!!!", "review": "What can we say other than superb!!!  We took our 10 month baby (our honeymoon) and was just amazing.  The food was fab, me being a fussy eater and having food poisoning in Egypt, I was a little worried, but had no problems..... the Manager is great, always makes time to say hello, see him in the restaurant cooking etc.  As for the animation team... well.... Momo, Titi, Joseph, Alex, Rico, Coco, Mimi, Mady and Touna were all fab!!!  The lads got you dancing in the evenings which was great and were just as entertaining by day.  The waiters were brilliant and as for our ChouChou... miss you all so much and cannot wait to come back and see you all again.  They made our honeymoon extra special and the way they were with our baby was amazing and I can tell you he is missing all the…", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r114419156", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Enjoyed our stay", "review": "We really enjoyed our stay at Safira Palms in August. The hotel area is beautiful and the rooms are spacious. Pool area is very nice. Beach is ok. Food at the restaurant was various and good. It was a bit disappointing that there were nothing to do or see outside the hotel area.  The animation team is great! They are the heart of the hotel – they took excellent care of us. And there were always something to do: aqua gym, beach volley, mini golf, dance courses and aerobics etc. Special thanks to Sami, Titi, Coco and Jo! :)  We spent our second week in Djerba (Club Rimel) – but enjoyed more our stay in Safira Palms.  Best regards, Couple from Finland", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r78361731", "sub_review": {"Value": 3, "Location": 2, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Hotellet lever inte upp till 4-stjärnig standard", "review": "This hotel was not worth the money and we are surprised it can have 4 stars. This hotel was not dimensioned for all guests. We had to wait in long lines for food, for plates, forks and knives, they didn´t have enough sunchairs, you had to go and book them very early in the morning like 7 o´clock, otherwise you didn´t have anywhere to lay down. The water stopped almost every evening and this was also a problem. We didn´t get the room we booked and the reception was not well organized. The swimmingpool didn´t have clear water - we suppose they couldn´t keep it clean. The only positive with Safira Palms was the show group.", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r75761655", "sub_review": {"Value": 1, "Location": 1, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 2, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "nice place where to relax, and enjoy the nice weather and pool", "review": "Customer satisfaction Personnel always showing good attention to the guests (and especially to their children).   Restaurant Food is very safe (it is even considered as their main factor in their policy). Food is varied for adults but not typical of Tunisian food. It is very nice for children, because they can eat pasta, pizza, French fries, etc... Couscous served in the restaurant is rather poor and not very tasty. You will probably be proposed a better couscous with extra charge of 14 euros per person, but we were said that it wasn't that better. The Tunisian soups as the other soups served in the restaurant are very nice. Vegetables are not the restaurant specialties (except aubergine which is very nicely cooked). When the restaurant is full, sometimes, a too long reaction is…", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r71813878", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 2, "Rooms": 3, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "never go back", "review": "At arrival  at night ther was a possibility to have something to eat, very nice gesture. Room was terrible so I changed to a suite next day for a supplement in euro;s. Breakfast ok, lunch ok, dinner ok, but never had a highlight. Nothing to do around the hotel, so you have to take taxis and excursions. Spa ok , but expensive, shops terrible. All inclusive worth the price.Zarzis is too far from everything, hotel is in need of renovation. Not Iberostar.", "date": "April 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r66206883", "sub_review": {"Value": 3, "Location": 2, "Sleep Quality": 3, "Rooms": 2, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Great hotel", "review": "Great place for a relaxing holiday , friendly people, the food was good (also local dishes) and a very nice swimming pool.  Much sport activities with friendly animators.   We enjoyed it a lot and will surely come back", "date": "April 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g3736153-d1117772-r62170040", "sub_review": {}, "travel_purpose": "", "rating": 5}]