[{"title": "The worst hotel i had the misfortune to have stayed at.", "review": "On arrival late night, no one spoke English, no problem, i showed my reservation and was given the key to our room, room 207 directly above the front doors to this hotel. On entering the room i saw instantly that there was an open electricity point right next to the key slot that you must use to make contact for all the electrics to work, be careful, next i saw a big chunk of plaster missing from around the top left side of the window, which by the way was double glazed but made no difference to the amount of noise that could be heard when trying to sleep at night from all the traffic passing along the very busy road outside. So morning arrives and time for breakfast, the breakfast was already plated and waiting for us when we entered the basement area where the dining room is located, yes, its in the basement of the building, on the plate was a 2 pieces of sliced cheese, processed, 1 piece of meat, could not tell what meat it was as it had no taste whatsoever, 2 slices of some kind of sausage, some olives, 1 slice of hard butter and 1 boiled egg, there was also an urn of tea so stewed i thought it was coffee at first and then the coffee itself was even stronger, and for the duration of our holiday, this did not change, the same every day, i did ask if any other food may be had and was shocked to be told no, i said do you not have cereals and was told i could have Kellogg's next day, then came our evening meal, starter was a very basic salad, mint, tomatoes, cucumber and cabbage with lots of spices to try and give it some taste, the soup, so watery i thought it was straight from the hot tap with some small amount of chicken slithers in the bowl for appearance, mains was pasta or rice with some kind of meat balls in it, i say meat balls but they where almost the consistency of rubber, dessert was 1 apple and 1 banana most days but strawberries were offered on 1 day, back to our room, the main fuse box had wires hanging out, not sure if they were live or not, shower cubicle was mouldy, toilet flusher was broken and the bed was only given 1 white sheet with 2 woolly blankets to go on top, these were both smelly and dirty, so i got another white sheet from the store cupboard next to our room to put on the bed, it was promptly taken away next day by the cleaner who made her only visit to our room all week, no towel change all week, right outside our door was the lift, bearing in mind that if you are in the basement and your room is on the top floor, then i hope you are fit as the lift does not work, that is a 6 floor climb, i hope you can speak or at least read German as this hotel caters for the German market and all signs are in German, now to the pool area, O,k, we were out of main season and knew the pool would not be being used, the sunbeds were dirty and cracked so watch your bits when getting on or off the sunbeds, also, there are toys and others things for the little ones, but all looked like they had been donated or indeed taken out of the rubbish dump, and to finish this review, the bar in the garden area has almost never got anyone there to serve and the furniture is knocked together from pallets, seriously, you could not make it up, best advice i could give for this hotel would be to book a week at Fawlty Towers instead. I booked this holiday on a British web site so you would think the hotel would also cater for the British but sadly they do not give a stuff about anyone other than if you were German, stay well clear and book a week in Swanage instead. Trip Adviser should have a no star rating as i feel this would be more suited for this hotel.…", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1126628-r358279409", "sub_review": {"Value": 1, "Rooms": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "What a dump!", "review": "A Port in a storm was how we found this \"hotel\". Faulty towers has nothing on this. the rooms were filthy, someones lipstick etc on \"clean towels\". Electrics dangerous.  Non working lift.  Non working old telly.  Food, what there is appalling. (raw boiled eggs!). Nothing renewed, no tomatoes even no cucumber no meat substitute, no juice.  Had to ask for milk, no staff. Uncomfortable bed and room stank of cigs and BO. Thank goodness we only had to stay one night, the good thing was that we had a roof over our heads. Beware if you book this one!", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1126628-r315291985", "sub_review": {"Value": 1, "Location": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Worst hotel we've ever been so far... ", "review": "To be honest: We booked our cheapest holidays so far. With that in mind we did not expect a great hotel with great service. But what we had got there when we arrived was shocking.   We had to change the rooms because the first room was so dirty. We had mold and ants in the rooms. After a night they offered us a room which was... Let's say... Okay.   We booked with half board so we went to breakfast and lunch... But only one time. The breakfast was as simple as it can get and the cleanliness was the follow-up from the rooms. So we decided to eat out of the Hotel and it was the best decision we could make. We just went into the hotel to change clothes and sleep.   We had a great holiday in Side but we would never ever book at least one night in this hotel again! ", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1126628-r304496944", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Basic", "review": "Take this hotel for what it is which is a basic tired looking premises. The Carna Garden next door clearly occupied both buildings at some point but the shared swimming pool is evidence that Elis has arrived recently. The rooms are clean but dated and in an average state of decoration, the beds are comfortable, the food is extremely limited in choice but tasty and well prepared and the staff are welcoming and friendly. The gardens adjacent to the pool are poorly grassed and the furniture is a mish mash of home made and cheaply purchased items. The bar was never staffed but the pool and sun loungers were excellent. It did what I needed which was to provide a base while I went about some business. The wi-fi extends only to the Reception area and it's a 30 minute walk to the old town centre but only 10 mins to a beach.…", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1126628-r273395453", "sub_review": {"Rooms": 2, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Was Ok Helpfull staff", "review": "Was transfer here by Lowcosthoildays from a dump  Good average small hotel was given a very nice room staff very helpful  Food was just ok would not do half board in Turkey again plenty of good restaurants nearby", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1126628-r170034761", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "not one of the best", "review": "stayed  at side Elis Hotel in july, got there late evening we were put in a room on the ground floor at the front of the building, we did not like the room so asked to be moved and was told we could but in the morning . The next day  we asked if the new room was ready and was told no  it was taken and we would have to wait another 2 days (he was rather rude) . So we got on with our holliday in the noisy room .Got moved 2 days later to a room ground floor overlooking the pool was much better ,the hotel  was ok, it was clean apart from our balcony the maid must not like going outside as it was never cleaned all the time we was there but she did a good job of the room .Yes the hotel is not near the sea , but you can walk there its not too bad to walk and there is a free bus to the…", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1126628-r144161296", "sub_review": {"Value": 2, "Location": 3, "Sleep Quality": 3, "Rooms": 2, "Cleanliness": 2, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Could have been nice", "review": "We got it very cheap and it could have been a very nice hotel, if the service had been a lot better. The half pension is a joke, the personel is sloppy and they send you to the manager for a simple question about which bus to take. The young Guy presenning himself as a manager, is behaving like a teenager that has been put in charge.. He spoils the atmosphere with his personality and noisy car that he apparently likes to blast off in front of the hotel, very often. They also don't take very much care about the outsider.   On the plus side, the rooms are nice and the clearing is very good. ", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1126628-r141330521", "sub_review": {"Value": 5, "Location": 2, "Rooms": 4, "Cleanliness": 4, "Service": 2}, "travel_purpose": "", "rating": 3}, {"title": "admirable service (as usual in Turkey)", "review": "If you want to stay away from the beach hotels..this is the one you have to choose. very small hotel located at the main street into side. take care about the mosquitos and try to keep your door/windows closed... employees are very kind and helpfully. unfortunately no parking available. You can leave the car at the street.", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1126628-r113894836", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 2, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}]