[{"title": "lousy and dishonest hotel", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r685272850", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "To wake up in Istanbul's historical heart", "review": "the hotel is not like in the pictures, the staff and hotel owner is very rude and only thinks of money, the room is not clean, the towels and linens are dirty and torn, the bathroom is very filthy, the television does not work", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r679315860", "sub_review": {"Value": 5, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Utterly disappointed", "review": "The flak this hotel has received I can say was very much tosh for the most part. For its selling points, let's cover the basics. The hotel should in every right be commended for its steal of a location, with the bulk of Istanbul's heritage sitting, very literally a hop, a skip, and short jump away, with the likes of Hagia Sophia and Sultanahmet Camii (Blue Mosque). What's more, is it's, easy to reach, the main road where The Grand Bazaar and Bosphorus pier would be only a 30-minute walk radius where one would only have to follow the map that is helpfully personalised and provided by the hotel (at no extra cost) down that main road or loudly marked metro-stop accordingly. With most start Bus tours easily within 5-minute walking distance as to mark the value of the hotel's location alone worth it. Secondly, the value paid for, I personally would say is worth to the penny. My girlfriend and I found, as university students, with much relief that a place like this could exist for our 4-night stay, what ultimately was paid for was a place we could safely and comfortably stay the night, that is what was exactly provided and arguably more. The view from breakfast does not disappoint, with a beautiful overlook of the Bosphorus toward Istanbul's eastern limb. Further the consistent breakfast that is daily provided for just an extra £2  every day would provide the essentials of a local Turkish breakfast for the morning. In the long run, meaning not every day necessarily has to be chanced on a restaurant breakfast that could be up to 29TL (£4 as of current exchange rate) per person. The hotel staff alone are knowledgeable, obliging, and actively looking to make sure all is well with the stay. The small acts of having your name memorised, the daily ever hospitable restaurant staff at the base of the hotel or happily explaining ongoing events (As my girlfriend and I were unaware we had arrived during the 'Bayram' festive period) helped build the experience that built The 'Eski Konak Otel' as such a major pillar to build our experience Istanbul as the cultural labyrinth it deserves to be experienced as. Can't help but recommend for like-minded travellers that love being instantaneously where lies Istanbul's, cultural heart. \"Either I conquer Istanbul or Istanbul conquers me.\" – Mehmed the Conqueror…", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r608916143", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Great place to stay", "review": "Highly disappointed. The room was falling apart, from the lamp ceiling, to pieces of the wall, curtains etc. The bed sheets and towels were very dirty. Decor is very old fashion (which in itself isn't the issue). Utterly shocked. Had to run away and find other accommodation. The guy who welcomed us was unfriendly. I am very sorry to say, this establishment isn't recommendable. Despite having checked in around 540pm and left the property half hour later, this establishment had no issue charging us full rate, which has left an extremely bad taste in our mouth. ", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r532260915", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "don't use this hotel", "review": "A friend booked this hotel for us to stay in for 3 nights out of a 6 night trip as we were travelling elsewhere . We were greeted by the manager of hotel upon rival and our bags carried up to reception  for us ( this is on 1st floor) we were given 2 rooms here and other room on 3rd .The room was great plenty room and clean and tidy bathroom and at the back of hotel . The breakfast was served on the roof terrace although a steep climb up to the terrace the views were stunning . Breakfast was the usual mixture of bread cheeses ham  fruit cereal and eggs . the Hotel itself is in a great area  for travellers wanting to visit sights around the city such as blue mosque and the sultanahmet tram station is also nearby plenty of shops restaurants and delis for everyones tastes a good pair of shoes required as the area has a few hills around it but would recommend this hotel the staff as great always on hand to help.…", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r529511496", "sub_review": {"Location": 4, "Rooms": 1, "Service": 1}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Perfectly situated hotel with a personal touch", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "January 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r453509995", "sub_review": {"Location": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Feels like home", "review": "My wife and I stayed here for about 4 nights during the new year and it isn't an understatement to say what makes this hotel so special is the day manager, Sofia, who never fails to accommodate your needs to make your stay as pleasant as possible. We loved every second of our stay, normally being the first guests up for breakfast in the winter cold while enjoying the daylight spilling in. The Blue Mosque and also Sultanahmet tram station is located very near and there are plenty of shops, delis and restaurants nearby the place. We actually even ended up walking all the way from Taksim back to the hotel on one of the days we were here (bring good shoes!).   An additional word from us is to make sure that if you plan to take a shuttle from Eski Konak to the airport, double check…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r422144038", "sub_review": {"Location": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice stay", "review": "We stayed in this hotel for 1 week and really like it. Small and comfort hotel. Very clean and homy. Very good location, close to tram and all attractions. Breakfast was good as well. Internet was very good in our room and on a terrace. Terrace has very beautiful view on a sea. Very pleasant to have breakfast on it. And the best of this hotel is Sofia. She is a soul of this hotel. She was very patient and helpful to us. Big thanks to her. We had really good time there. The only thing that you have to be careful is the guy in a cafe downstairs. This guy will try to drag you to his cafe every time you pass by)))", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r351192768", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Superb Hospitality & Conveniently Located Hotel", "review": "Nice hotel in Sultanahmet. We had a twin room. The room is spacious and recently renovated. Wifi work very good. The breakfast is served on the rooftop and is very comprehensive. Friendly and helpful staff. Make sure you visit the shop downstair they got some nice quality stuff in there. ", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r331153664", "sub_review": {"Value": 5, "Sleep Quality": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good loaction and friendly service", "review": "I would like to thank you for spending the time to write above revieuw about our hotel.I am happy to be acknowledged that you had a verry good stay with us. I have also informed my collegue with your nice comments. We are looking forward to see you at our hotel on your next holdays ", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r329849160", "sub_review": {"Location": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Great location but overrated", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r304660380", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "A very nice comfortable hotel", "review": "We stayed there for 2 nights. The hotel location is great as you are just a few minutes away from the main tourist attraction. Breakfast was nice with variety and staff were generally helpful when you could find them. We thought maintenance was the main problem in this hotel as we noticed many things broken or not working: bulb missing in bathroom,  switch in shower for tap/shower broken, batteries missing in TV remote, clock on the wall was dead possibly because the battery was dead too. Another big issue to mention: there was no lift and the hotel spans over 4 floors in a steep and narrow staircase which is not ideal when you carry a heavy bag. I recognise that most hotels in this old district of Istanbul must be the same due to the old architecture. ", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r297620995", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Value, great location  and great people. ", "review": "Everything is great, comfortable clean room, nice view from roof top, breakfast, you will feel very welcome from the staff. Location is a walking distance to blue mosque, haga sofia, food and bar. We had an enjoyable 4 days stay in Istanbul. Thank you Sophia. ", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r288138004", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Great location, great host, great view.", "review": "I would like to thank you for spending the time to write above revieuw about our hotel.I am happy to be acknowledged that you had a verry good stay with us. I have also informed my collegue with your nice comments. We are looking forward to see you at our hotel on your next holdays", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r285279894", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Extremely helpful staff", "review": "It was a weekend visit in Istanbul.  The hotel is modest but the staff  extremly friendly and helpful.  The food is ok and the view from  the terrace splendid! Conveniently located the hotel is a good place to stay and visit the city.", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r279078047", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "''Wonderful Hotel to stay''", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r279075216", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Worst experience", "review": "Thıs hotel ıs one of my all-tıme favourıte hotels ın Istanbul. The Staff ıs very helpful Polat,a young man supported wıth actıonable pıeces of advıces. Cleanıng ıs very excellent as well.Locatıon ıs perfect as you can walk to most Tourıst sıghsıhts ın a couple of mınutes", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r278359770", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Couldn't ask for more", "review": "I would like to thank you for spending the time to write above revieuw about our hotel.I am happy to be acknowledged that you had a verry good stay with us. I have also informed my collegue with your nice comments. We are looking forward to see you at our hotel on your next holdays", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r262207755", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great Location, friendly Hostess! The price is right!", "review": "The only good thing about Eski Konak is the location. We booked an air conditioned room but on our arrival we were not given the remote the first night and were told that none of the a/c works at the hotel. Since it was mid-night we opened the windows for some ventilation and tried to sleep but hardly got any because of the noise outside. Beds are hard which doesn't help. The next day after complaining to the owner sofia, we got the remote only for the air conditioner to trip continously all night which was the only better night. After the tripping of which they were made aware first thing in the morning,  at midnight when we came back it still wasnt fixed and we were told not to use the a/c. I am writing this review at 1 am because I am unable to sleep due to the noise coming…", "date": "February 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r253068445", "sub_review": {"Value": 4, "Sleep Quality": 2, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Worthy place to stay", "review": "We just concluded a 6 night stay at the Eski Konak hotel. We are leaving with the fondest of memories. The hospitality of Sophia and her staff, the housekeeping, room comfort and location made this the ideal value hotel for a stay in beautiful Istanbul.", "date": "December 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r243586604", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "it hits price and location, but that's it....", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "December 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r242740546", "sub_review": {"Value": 3, "Sleep Quality": 2, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Superb :-)", "review": "stayed here for eight nights and I really do want to be kind in my review because of one big reason....the lady who runs the place is amazingly nice and very good at making you feel exceptionally welcome and pointing you in the right direction....and our room was clean and well presented (though quite dated with linen that seriously needs to be replaced)....and it is in a super convenient location.....so there are the good bits.....unfortunately now for the bad.....the room smelt bad, like bad plumbing bad. we had to leave the bathroom fan on 24/7 to try and keep the smell at bay. the room was noisy. ultimately the quality of your sleep determines so much when reviewing a hotel and ours was interrupted on as many nights as it wasn't. super loud music blasting from the restaurant…", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r238088601", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "Sophia is a wonderful hostess", "review": "Overall a great hotel, Sophia and Bayaro are really lovely people and will look after your every need. The only problems for me where the steepness of the stairs and the room was quite small but everything else was excellent. Thank you for making us welcome and hope to see you again soon xx", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r234334111", "sub_review": {"Value": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Quaint Hotel in a great location", "review": "I would like to thank you for spending the time to write above revieuw about our hotel.I am happy to be acknowledged that you had a verry good stay with us. I have also informed my collegue with your nice comments. We are looking forward to see you at our hotel on your next holdays", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r231694414", "sub_review": {"Location": 5, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Value, location, cleanliness & service!", "review": "Sophia is a wonderful hostess and the breakfast is delicious. The breakfast is served on the open terrace where the view of the Sea of Marmara is spectacular. Comfortable and quiet room, good price, great location!!!", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r225775724", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Good", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r223376374", "sub_review": {"Value": 4, "Location": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great people", "review": "Plus: - Location - close to main objectives - Breakfast ok - Air conditioned ok - Nice terrase on the roof (although very hot in August) - Kind staff, especially the young lady from reception and breakfast room Minus: - Narrow and steep staircase - No reception area - Week light in the bathroom (impossible to shave yourself)", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r220833815", "sub_review": {"Value": 4, "Location": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great location and great value", "review": "I would like to thank you for spending the time to write above revieuw about our hotel.I am happy to be acknowledged that you had a verry good stay with us. I have also informed my collegue with your nice comments. We are looking forward to see you at our hotel on your next holdays", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r219261411", "sub_review": {"Location": 5, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Great people, great view, great location", "review": "We were short term looking for a stay in Istanbul for three days and got Eski Konak recommended. The hotel serves all needs of a short stay in Istanbul. If you are looking for luxury, then you are wrong, but value for money is extraordinary. The location is within 5 minutes of blue mosque, hagia sophia and metro station to further explore the city, Even the galata bridge is reachable by foot and then is the taksim square not far either. The rooms are small, and a bit noisy if something is happening in front of the door. But rooms are clean and include all you need. Highlight of the hotel is the rooftop terrace where the breakfast is served, with a stunning view on the sea. The breakfast itself is turkish style in buffet form and has everything for a good healthy start into the…", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r213859887", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Wonderful stay", "review": "I would like to thank you for spending the time to write above revieuw about our hotel.I am happy to be acknowledged that you had a verry good stay with us. I have also informed my collegue with your nice comments. We are looking forward to see you at our hotel on your next holdays", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r212746393", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Wonderful people and wonderful view", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r211680580", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Location Location Location Istanbul", "review": "We stayed five nights, two nights in room 201 and three nights in the ground floor room.   Firstly, Sofia, Dinar (?), and the other staff are marvelous. So warm and loving. We arrived very early after a 12 hour flight, and I was sick with a bad cold, and they took great care of me, offering tea and giving us a great room overlooking the street even though we were too early to check in. It was exactly what I needed.  The breakfast is the best breakfast we have had after 7 months of travelling, hands down.   The location is in a great area of Sultanamet -- easy walking to everywhere. The only downside is the restaurants can be very aggressive and pushy trying to get you into their place.   We can't recommend this hotel enough. We miss everyone already.   The 2nd floor room was…", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r210807442", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Small Space with Excellent Service", "review": "I would like to thank you for spending the time to write above revieuw about our hotel.I am happy to be acknowledged that you had a verry good stay with us. I have also informed my collegue with your nice comments. We are looking forward to see you at our hotel on your next holdays", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r209419025", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Excellent boutique hotel in the centre of Istanbul", "review": "The location of this hotel was excellent for exploring Istanbul old town, the main tourist attractions and the main shopping areas. All of the staff were helpful and efficient at all times, going out of their way to ensure our stay was fully satisfied. Breakfast consisted of a variety of local dishes and plentiful fresh fruit and was served on a delightful roof terrace with great views over the sea. The location is excellent with a large choice of adjacent restaurants and a small shop below the hotel selling groceries etc. Just awesome!", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r208838260", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great holiday in Istanbul", "review": "I would like to thank you for spending the time to write above revieuw about our hotel.I am happy to be acknowledged that you had a verry good stay with us. I have also informed my collegue with your nice comments. We are looking forward to see you at our hotel on your next holdays", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r208742135", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Very pleasant stay", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r204977322", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Everything was perfect...", "review": "Overall, we had a very pleasant stay at this hotel. The hotel is located close to lots of attractions: the Blue Mosque, Hagia Sophia, Basilica Cistern, so it offers a perfect starting point for sight-seeing. It is wise to reserve a \"standard room\", since the \"economy room\" might get you into one very small room with a window showing dirty dishes from the nearby restaurant (so, no view from the only window in the room), but we were told this should be solved in the near future. But, this was arranged with no problem, as the next day we got another room, which was close to perfect. Still the economy room, but bigger, with two windows, street-side view, much more comfort, very clean and this really improved our impression of the hotel.  Staff in the hotel was very friendly and…", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r204867756", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Delightful Staff", "review": "I would like to thank you for spending the time to write above revieuw about our hotel.I am happy to be acknowledged that you had a verry good stay with us. I have also informed my collegue with your nice comments. We are looking forward to see you at our hotel on your next holdays", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r204021490", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Ideal budget hotel with amazing rooftop view", "review": "Best in all aspects... Hotel staff was very friendly and helpful. Room condition was good and clean. Bathroom condition was working very well (toilet, water heater & hair dryer). Foods for breakfast was good with great view of the marmara sea... Hotel location was very strategic which in walking distance at the magnificent tourist place of sultanahmet area (blue mosque, hagia sophia & topkapi palace). The location of tramp station was also very near which can easily take us to another place in just few minutes. We would definitely come here again if possible in the future...", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r203519844", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great budget hotel", "review": "I would like to thank you for spending the time to write above revieuw about our hotel.I am happy to be acknowledged that you had a verry good stay with us. I have also informed my collegue with your nice comments. We are looking forward to see you at our hotel on your next holdays", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r201968503", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great location, great staff!", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "March 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r198284181", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Very good", "review": "Eski Konak Hotel is ideal if you want a budget priced hotel in a prime location. It's close to the Blue Mosque, Aya Sofia, The Hippodrome, Topkapi Palace, lots of good reasonably-priced restaurants (especially KOSK Restaurant!). Airport shuttle €5 to Ataturk Airport picks up from here too. Very enjoyable stay - the staff are so nice and helpful.", "date": "February 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r197941220", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Very good hotel", "review": "I would like to thank you for spending the time to write above revieuw about our hotel.I am happy to be acknowledged that you had a verry good stay with us. I have also informed my collegue with your nice comments. We are looking forward to see you at our hotel on your next holdays", "date": "March 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r197604353", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Wonderful Hotel!", "review": "Very nice hotel. Good location, close to square Sultanahmed, tram line, Aya Sofia is 5 minuts walking. Standard cold breakfast on the roof terrace. Room was clean and modern. Nice and polite staff. Many thanks to Sofia for help and answers for our questions. Sofia hello from Cyprus and Russia!!! ", "date": "February 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r196033985", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Cosy, clean and pleasant", "review": "I would like to thank you for spending the time to write above revieuw about our hotel.I am happy to be acknowledged that you had a verry good stay with us. I have also informed my collegue with your nice comments. We are looking forward to see you at our hotel on your next holdays", "date": "December 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r188793484", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "The stay was nice", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "December 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r188288476", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "a cozy frıendly spot ın a great tourıst area", "review": ". Sophia, the manager, is a very nice person who makes you feel very well. She is ready to help you all the time and provides all the information you need to make your stay in Istanbul really interesting. She has a very good attitude towards service. Congratulations.  The location of the hotel is very good because it is close to very interesting places and has  good transport. The only thing that I will not recommend to people who have problems with their legs is that the hotel has many stairs but it seems to be something that many hotels in the area.", "date": "December 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r188103155", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "We could not have stayed at a better hotel.", "review": "I would like to thank you for spending the time to write above revieuw about your accomoodation at our hotel. I am happy to acknowledged that you had a very good stay with us and you are happy for your experience I have also informed my collegue with your nice comments. We are looking forward to see you at our hotel on your next holdays.", "date": "December 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r187339631", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Our home away from home. ", "review": "Eskı Konak Hotel offers good acommodatıon and frıendly helpful servıce. It ıs located ın the quıet streets of old ıstambul. Close to tourıst attractıons,the tram, and wıthın walkıng dıstance to practıcally everythıng you need. The street ıtself and those around ıt offer many oftıons for eatıng and just havıng a good tıme. I found the staff extemly helpful rıght from the start. Even at home whıle makıng the reservatıon, I had many questıons that were answered ımmedıatly and promplty.  The room ıs small and sımple yet very clean. No allergıes from old carpets. Just plaın clean wıth a nıce vıew to the street.", "date": "November 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r187207892", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": ":)) That is the place!", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "November 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r186637265", "sub_review": {"Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Hospitality", "review": "I was there with my friend. We was very surprised , when we saw the room. it was so clean and in a friendly atmosphere. The place for breakfast have a terace and from there you can see the Prince islands (they are a far , but you can see them :)) ) The meal on a breakfast was very good and you can find evrything..   The personal and the manager are very very kind.  Just i want to say Thank you to all! Greetings from Bulgaria", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r185731759", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Nice staff, nice hotel", "review": "I would like to thank you for spending the time to write above revieuw about our hotel. I am happy to be acknowledged that you had a verry good stay with us. I have also informed my collegue with your nice comments. We are looking forward to see you at our hotel on your next holdays", "date": "December 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r182887314", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Very good hotel!", "review": "I had a wonderful time with my sisters and friends, I started to love Istanbul because of the location the hotel is placed and also for the hospitality it offers. I could go everywhere I wanted by walking ,which helped us to get to know the place better.", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r181909277", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Overpriced and run down hotel", "review": "I have very good memories from Eski Konak. Location is great to explore Sultanahmet area, only a few minutes away from the Blue Mosque and Hagia Sophia. Rooms are clean (mine was quite spacious too) and the staff was very friendly and helpful. It felt like home for a couple of days. The view from the terrace and the breakfast were fantastic as well. I recommend everyone to stay there!", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r181227917", "sub_review": {"Value": 1, "Location": 1, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Charming", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r175407446", "sub_review": {"Value": 4, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Great staff, amazing breakfast ideal location!", "review": "Great location, good breakfast,clean place...some rooms are qute tight. Wiew from a restaurant is great. Wery god place for young pepole as a older couples.great place for exploring sultan ahmet and old bazar area.... Nex time i ll spend   it there:-).........", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r171062775", "sub_review": {"Value": 4, "Location": 5, "Rooms": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Lovely hotel", "review": "The staff here are fabulous! They are willing to assist with bookings, transfers and answer any questions! They are welcoming and interested on every interaction! Our room is spacious, and breakfast on the rooftop terrace is fresh and delicious! The location is walking distance to major sights and on the main restaurant strip however is still quiet and private! Highly recommend and would stay here on our next visit to istanbul!", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r169873457", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Cosy little hotel", "review": "I had a really good experience at Eski. The staff were very really friendly and helpful, the room was clean with great air conditioning which so I was able to sleep well.  Location of the hotel was within a 10 minute to Sultanahmet. The breakfast on the terrace was a great way to start the morning. I would stay here again.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r165112290", "sub_review": {"Value": 4, "Location": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Great hotel!", "review": "I was plessantly surprised when I stayed at Eski Konak.  The rooms where nice and clean and we had a good aircon. My room was facing a brick wall, which was sad because it didn't let much light in. My parents room was facing the street and they complained about noise, so the wall is better. They had a lovely turkish breakfeast in their resturant on top of the hotel. The only minus was their terrass which was small and facing only the sea and not giving you a possibility to watch the mosques.  But overall a nice hotel with good service. ", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r159773021", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "A bad room experience", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "March 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r154184412", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 2, "Rooms": 1, "Cleanliness": 1, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "excellent", "review": "The hotel was not fully booked. But they gave us the smallest room of the hotel. You had to climb over the toilet to get under the shower. The bathroom smelled bad after moist. We left the hotel earlier because of that. Breakfast on the terrace was nice.", "date": "January 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r150345240", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great hotel", "review": "Just returned from an absolute fantastic stay at Eski Konak hotel. 1) We had a good sized room with everything we could possibly need inside e.g. dressing table, plenty of wardrobe space, small flat screen television, bathroom.... 2) The location of the hotel is perfect, couldent ask to be anywhere better, literally 5 minutes from all the main tourist attraction in Sultan Ahmet. 3) Our room was cleaned every single day without fail. 4) The Turkish breakfast on the roof top was lovely, so much choice to choose from, you deffinately wont be dissapointed. Overally great stay.", "date": "December 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r147048137", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Fraudulent Hotel - DO NOT STAY HERE", "review": "The Eski Konak is a great hotel, especially for the price. The rooms are basic but provide everything you need and are all very clean and are decorated in a late Ottoman style with lovely quilted bedspreads. And the beds are really comfortable. The rooms vary a bit in size but all are still much larger than you'd find in a typical hotel anywhere else in Europe. The owners and staff are all very friendly and very helpful. The breakfast buffet is great, with lots of fruit and traditional Turkish breakfast fare (white cheese, cucumbers, tomatoes, olives) and just about everything else you might want. Best of all it is served on the roof terrace overlooking the Marmara Sea. (The reviewer who provided the lengthy criticism of the hotel complaining that it is 'above a shop' obviously…", "date": "November 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r146008360", "sub_review": {"Value": 1, "Location": 4, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "amaizing hotel", "review": "This hotel is not at all how it has been advertised...  - The hotel (more like dormitories) is literally 'above a shop', for those of you who have a British sense of humour... yes it's exactly as you can imagine it. - There is no proper entrance/reception area. The reception table is below a set of stairs (cellar) on the first floor. - Once we arrived, the woman at reception was not there, we had to go down and wait on the street. then a guy from the shop (grocery) below called her phone and she came down to meet us. - The room itself was tiny, I mean the wall was literally 1 foot from the bed on one side and 2 feet from the wall on the other side. We banged the door against the closet as we tried to enter! - My wife and I were exhausted after our flight so had a short nap...…", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r145292628", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Terrible Hotel!", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r142003211", "sub_review": {"Value": 1, "Location": 1, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "DO NOT STAY HERE", "review": "Had a very bad experience with this hotel. Stayed here with 2 of my girlfriends and woke up on the first night to find one of the male workers had let himself into our room with a spare key at 3am. Needless to say we were terrified and didn't sleep after that. We left as soon as it was light in the morning but were still bullied and intimidated into paying by the manager.  Even before this all happened, the staff were extremely unhelpful, we had paid for a room with a sea view but got given one with a view of the junkyard out the back, rooms are really pokey and the roof top restaurant and bar isn't open as advertised.   They should be taken off trip advisor!!!", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r141859969", "sub_review": {"Value": 1, "Location": 1, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "not as advertised", "review": "This is the worst place I ahve ever stayed at. The staff are unhelpful and rude. I stayed here with 2 of my friends (all girls) and woke up on our first night with a male memebr of staff standing below my bed. He had let himself into a room where 3 girls were sleeping at 3am and was standing at the foot of my bed in the dark. We shouted at him to get him to leave. Needless to say we were terrified and did not sleep the entire night after having to try and put furniture infront of the door to make sure he didn't come back. In the morning we confronted teh staff about what had happened and were greeted by smurks and them getting quite agressive abiut us having the pay the full bill.   The whole experience was terrible and almost runied the entire trip. We ended up moving to a…", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r136950464", "sub_review": {"Value": 2, "Location": 4, "Sleep Quality": 3, "Rooms": 1, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Loved it!", "review": "this is not the hotel in picture on website.even though we were outside we could not find it.Its very small and cramped. Rooms were just big enough for the bed and nothing else .Toilet area is unbelieveably small about the size of a normal shower into which a toilet and handbasin plus shower were fitted .Breakfast is almost all fruit and a little cheese and salami..Very steep stairs to rooms.Even though they advertise car parking ,there is none you have to park in a private carpark 200yards away and they tried to charge 30e per night for our car.Staff were surley and unsmiling...", "date": "February 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r132900370", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Not great value for money", "review": "First of all, don´t expect luxury! The hotel is very simple, but: Location is excelent, rooms are very nice, spacious and clean, the hotel staff was amazing (Sofia was really helpful) and breakfast was very good. An excelent value for price. The only bad thing is that there is no elevator so you will have to carry your luggage along the stairs.", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r131633165", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Best breakfast ever had in Istanbul", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "January 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r129148589", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Really nice!", "review": "Very good location, nice decoration, amazing panorama. The breakfast is very good... and sweet! Our children loved it... The owner is kind and supportive.", "date": "March 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r128392550", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good value for money", "review": "Very good hotel clean and modern enough. Excellent staff very kind and did everything we asked for (changing the sheets, even provide as with some extra). The breakfast was varied, tasty and plentiful. Very convenient close to the most sightseeing (Hagia Sofia, Blue Mosque, Top Capi, Hippodrome etc). Only the rates were different, when we booked the price was 117€ (for three nights) but when we paid after arriving with the exchange rate being different we paid 123€. A piece of advice check with the hotel before arriving that the reservation is due because ours (from the site www.booking.com) have been gone! We finally, thank's to the kind owner, found a room next to the reception which I don't recommend because some times it's a little bit noisy. Generally I would recommend this…", "date": "March 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r125940541", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A great location in the heart of Istanbul", "review": "I loved the hotel for several things - its great location really close to Blue Mosque and Hagia Sofya, wonderful stuff - they were very helpful and welcoming, and cleanliness of the rooms - they were cleaned every day and we were given new towels every day as well. The size of room was not big but sufficient, well-equipped and well-maintained. The bed was very comfortable with good thick mattress and small but soft pillows. Just the way I like it. There however some details you should be aware of. There is no lift in the building but the guy from the reception did help me to carry the luggage up and down the stairs. The breakfast is rather basic but the breakfast room is located on the roof with a nice view on Bosporus. Another tip for those wanting to live in the Old City Area.…", "date": "December 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r122192368", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Excellent hotel", "review": "We stayed in this hotel for 3 nights in December. The manager Mrs. Sofia is very friendly and helpful. She speaks English fluently and really supported us to solve some problems we occurred with the flight company. The location is great: very close (5 minute walk) to Blue Mosque, Hagia Sofia, Topkapi Palace and the tram stop.  The rooms are standard size (just the bathroom is a little bit tiny) and clean.  The breakfast is quite good and served on the 4th floor terrace with a lovely view of Marmara Sea. Rooms are equipped with hair dryer, cable TV, and a high-speed wireless internet connection. There isn’t the elevator but all the hotels in the Sultanahmet area have not elevator. There is a mini market just below the hotel.  A nice gift you will find in the room after opening…", "date": "December 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r121445678", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great Value", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "December 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r120805680", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Great location, views, rooms", "review": "I stayed at this hotel with a friend for 3 days in 2009. The staff were really friendly and always helpful. They even kept breakfast late for us so that we wouldn't have to wake up early. The location is conveniently next to all the major landmarks in Istanbul. I never took a cab and was able to walk everywhere. Especially considering the price, this place was fantastic!", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r119769983", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Lovely Hotel and Helpful Management!", "review": "I have stayed in 6-7 different small hotels in this same part of Istanbul, and this one is in the top 3 for me based on charm, rooms, management, views, location, price.. pretty much everything that I care about in a small hotel. The breakfast is great, there's free wifi, and the people are nice. I go to Istanbul once or twice a year and I would definitely stay in the Eski Konak again.", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r115654986", "sub_review": {"Value": 5, "Sleep Quality": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Lovely friendly hotel", "review": "We stayed here for four nights after a long eight days in the black sea region. The hotel is very close to all historical attractions in Sultanahmet especially Haghia Sophia, The Blue Mosque, Topkapi Palace and Divan Yolu Street. The service is extremeley good, with people like Sophia and Ahmed along with his charming sister. The breakfast is good and the hotel ensured extreme care for us during our stay, including finding a parking for our van, fixing the A/Cs and providing a room (free of charge) for our several luggages for our late departure to our country despite being a big family group. I would difinitely stay here again If I come back to Istanbul. Thank you very much Eski Konak for the pleasant stay.", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r115425844", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Small hotel- Great location, spotless rooms.", "review": "Super location, very friendly and multi-lingual staff, who took a real interest in our visit and were extremely helpful.  Room was clean and decent size, particularly the bed! The hotel had all the facilities we wanted and needed, and the breakfast was lovely.", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r108752961", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Convenient, accommodating, trustworthy", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r106811057", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Enjoyable", "review": "We were skeptical that special arrangements made by e-mail would actually work out, but we were not disappointed.  The Eski Konak staff (particularly Sofia, the multilingual Dutch day manager) earned our trust to the point that we left luggage there during a side trip of several days to southern Turkey and Rhodes.  Although selection of this hotel was made by chance, its location turned out to be perfect and the accommodations fully met our needs.  A nice breakfast selection is served in a rooftop location (both open and enclosed seating) on the 4th floor with a lovely sea view, the only downside of which might be the several narrow staircases that must be climbed to reach it.  Although it is located in a busy part of Sultahnamet, we had no problems with noise on either the…", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r102593251", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "So hot as an igloo...!!!", "review": "Very nice little hotel with a terrace and gorgeous view right in the heart of the old town. Excellent service, very hospitable manager (thanks for everything Sofia!), made our first night in Istanbul a wonderful memory. Room was clean and big enough, but on the second day there was an odor coming from the bathroom. A top sheet on the bed would have made for a slightly more comfy sleep. However, at 50 Euro a night with a buffet breakfast and a fantastic location, this hotel is a great choice for the budget conscious traveling couple. Would stay there again for sure.", "date": "February 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r96865173", "sub_review": {"Value": 2, "Location": 4, "Sleep Quality": 2, "Rooms": 3, "Cleanliness": 1, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Very friendly and very good value", "review": "I stayed there for 3 nights! What an experience! First of all the hotel is not for handicap persons. The receptionist -very polite- but most of the times was a kid that he just knew how to say \"yes\" and \"wait\", so to call someone else that could understand me. I stayed by the reception on the first floor so I had some noise. My room was cleaned only the first day. The towels and bed linen were old! Very old. Full of hols. There was only one socket for your electronics.  They were even turning the wi-fi internet connection off at nights!!!! But the real problem was the cold! I have never been in a so cold hotel room. And people trust me, I jave travel alote in my life! I had to sleep with my coat as there were no blankets and I couldn't find someone to explain me the situation.…", "date": "January 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r96826915", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Excellent Value, Great Location", "review": "Thank you for leaving a review of your stay at the Eski Konak Hotel. I am sorry to hear that you felt cold in your room. Our central heating is always on (we never switch it off), and it can be controlled by adjusting the setting of the radiators in the bedrooms. We can always offer additional blankets too. There is a member of staff present in the hotel 24x7, either at the reception desk or in the lounge on the top floor, so it is a shame that you could not find us to help you on this occasion. With regard to your comment about handicapped guests, in common with most other hotels in the old city area of Sultanahmet, our historic building does not have a lift, and we always mention this when replying to enquiries from guests who mention that using the stairs might be a problem.", "date": "October 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r85046216", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Friendly staff, nice place to stay", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "October 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r84936515", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Enjoyable", "review": "This hotel is certainly worth your money, the friendly staff adds a lot of charm to this place, which is nicely located in the Sultanahmet area.", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r81570077", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Great stay at Eski Konak Hotel, Sultanahmet, Istanbul", "review": "When searching for a hotel in Istanbul I wanted a place that was clean, had hot water, good breakfast, in a great location and didn't have an over the toilet shower.  Eski Konak fit all these requirements and more.  The staff was friendly, there is free internet and a great view of the sea.  This is a small hotel with 8 rooms, more like a Bed & Breakfast.  I stayed 7 nights in the hotel.  The hotel isn't full service and isn't for Four Season's clientèle but it is a great value for mid to low priced travelers.  An enjoyable place in Sultanahmet.", "date": "April 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r62774440", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "bad bad bad", "review": "Note: There are two Eski Konak's in Istanbul. The one we went to is on this adress:   Akbıyık Caddesi, 44 34122 Istanbul, Turkey [--]  Great location, lots of nice restaurants in this street, everybody should try out Hayat Café, a small restaurant with very nice staff, and a chef that plays Saz (Turkish musical instrument). There are also several travel arrangers in the area, that offer guided tours of varying quality.  It takes three minutes of walking to get to the blue mosque, Hagia Sofia and all the other major tourist attractions. The breakfast is good, my favourites were yoghurt with honey, and the bread with Turkish cheese. You can sit either inside or outside during the breakfast, and the view from the outside area is a nice view of the sea, and the street with all the…", "date": "February 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r56108808", "sub_review": {"Value": 1, "Location": 4, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Good choice", "review": "Many thanks for your kind comments. Rest assured that there is only one Eski Konak Hotel in Istanbul. There are many hotels with the word \"Konak\" in their name, but only one \"Eski Konak\".", "date": "December 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r51225635", "sub_review": {"Value": 5, "Location": 4, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Perfact Location", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "October 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r48494334", "sub_review": {"Value": 3, "Location": 5, "Rooms": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Ideal place for Moderate Budget", "review": "The location of this hotel is just perfect. A 10 minutes walk from sultanahment tram stop amd only 5 minutes walk to Hagi Sophia, Blue Mosque and most Istanbul famous attractions. This is not a proper hotel , only 9 rooms available and have just a very small reception with no lobby area and public toilet. Our double room is at the back of the building on the 3rd floor with no view from window. The room is small but can consider adequate in istanbul.  Pretty new furniture, very clean and spotless bathroom .The double bed is small but comfortable and tv with satelite channels ( English) . The breakfast is served on the terrace overlooking the Bophorus, nice view but the breakfast is a bit below par. Typical Turkish breakfast with some cold items . The night view from the terrace…", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r46157229", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Well worth it!", "review": "Extream hospitality, clean, located centrally to all anenities and excellant location. It is a very good place for a moderate budget. We must say the Manager Cuma is good looking,speak very good english and very accomadating.  Cuma! We enjoyed our stay at Eski Konak and hope to be back again. We recommend this place without any reservation.", "date": "March 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r26791057", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Over before it even even began", "review": "I have just spent 3 nights at this hotel, booked through hostelbookers.com.  we had no problems with the booking or the payment!  the hotel is in a great location and was very warm with central heating,and extremely clean.  the breakfast was just what was needed and the staff were very helpful when asked.  great location to see all the major sights. If you're looking for  a cheap, clean and cetrally located hotel for a trip, this one will fit the bill", "date": "February 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r24677310", "sub_review": {"Value": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Little Gem in Istanbul", "review": "We booked this Hotel through Hostel a hostel booking website at a good price of 90 Euros for 3 nights, however 7 weeks prior to leaving they emailed us to say that they had made a mistake with the prices and since it was Easter  they were going to make us pay an extra 130 Euros or they would cancel our booking. We found this totally unfair and have since booked another Hostel at the same price we originally booked for. Hostel looked ok but would not be bothered with this one from they way they have treated us!", "date": "October 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r21617473", "sub_review": {"Value": 4, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Poorly run hotel", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "September 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1129022-r20800856", "sub_review": {"Value": 2, "Location": 5, "Check in / front desk": 2, "Rooms": 1, "Cleanliness": 2, "Service": 1, "Business service (e.g., internet access)": 3}, "travel_purpose": "Traveled as a couple", "rating": 1}]