[{"title": "Holiday", "review": "I have stayed here twice now as a solo visitor to side - the staff are welcoming and friendly and the accommodation is well situated in the centre of antique side. The rooms are big and clean with a cleaner that visits everyday.  The bathroom is more than adequate and there is always plenty of hot water - both times I have stayed I have been in a garden room so haven't been bothered by the noise from the street too much - although be warned there are bars up and down the street but mostly things close by midnight.  The breakfast is a Turkish breakfast but is more than ample to start the day - if you want a full English then there is a restaurant just opposite  The only down side to this place is that both times I have stayed the transfer bus has taken me to the sister hotel at the other side of Side - please tell the driver you need to be at the entrance to antique side near the museum. The bus Ian able to go all the way to the pension but the driver will ring the pension and some one will come and meet you.  This is a lovely place to stay and is near to the beach, shops and bars. It's a much nicer experience than the big impersonal hotels . For solo travelers - you will be made to feel welcome and many solo people use this hotel so it is easy to make new friends …", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1130863-r520108557", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Big rooms and good location", "review": "Perfect location a lot of nice bars. Rooms clean and big. Big garden fool of Flowers. Nice lounge. Old city is just in the corner. Breakfast is very nice, fruits turkish sweats included. You can do your Loundy. ", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1130863-r495296643", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "I was as at home in Side", "review": "I am happy that I stayed in Begonville hotel. Nice place, close to 3 beaches. There is a lot of shooed and cafeterias where you can eat and drink cheap. Also all fancy and special restaurants located close to Hotel, because location of hotel is very good. Old-antique city is just 35 meters from the hotel. Service is good and receptionist Sinan speaks very good english.  ", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1130863-r495291776", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent location and service", "review": " Very nice rooms and service. We are happy that booked this pension to spend 10 days of our vacation. Rooms are very cozy and clean, there is a big bar inside, open air caffe in garden fool of flower. Service is very well organized.  About 70 meters from beach and antic city. Bars and clubs are very close, but not too much, so it is very good for those who want calm vacation. Rooms has good furniture, and have private bathroom.   Highly recommended to stay here", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1130863-r495048871", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "noisy-but if you want to be in the centre of the old town good location", "review": "I want to separate my booking experience with the actual pension.  The pension--as a comparison to the many turkish pensions I have stayed in the room was bigger and cleaner than a lot of I have stayed in and likewise the bathroom was bigger than most ...with a separated shower alcove so everything doesn't get wet as with some turkish pensions.  There was plenty of hot water, but I was there in the middle of summer, so can't comment on other times of year.  The bed was comfortable. The reception boy and breakfast lady and her daughter were friendly (although none of them could speak a lot of english but that didn't matter to me as I knew some turkish words to get by and that is the whole point of staying in a pension to spend time with the locals and not in some a big inpersonal resort).  My room window faced the street with restaurants and so music played loudly at those restaurants until midnight and then the cleaners started the music again at 9am the next morning...so not quiet with pedestrian street traffic and speaking through the night.  quite a lot of the rooms windows face this street.  so if you put ear plugs in this may not be a concern to you.  You are in the middle of the old very very touristy town and if that is what appeals then great.  The breakfast was your standard turkish breakfast of tomato, cucumber, fruit, cheese, olives, bread and a pot of coffee/tea.  the booking experience--as a solo traveller, whilst I don't watch tv,but I like wifi in my room as I upload photos at night etc and liked to sit in the privacy of my room to do so. When I booked this pension on booking.com, they advised it (and priced it accordingly) for having cable tv, safety depsoit box and wifi in everyroom. this was not correct and after complaining to booking.com and their help, this wrong information has now been removed from their advertising.  The cable tv (one in the reception area where the safe deposit boxes are) and wifi is available around reception/garden area.- all they have to do is by a stronger modem that goes over longer distances and this problem could be fixed with little cost.…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1130863-r177736721", "sub_review": {"Value": 2, "Location": 3, "Sleep Quality": 2, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Lovely small pension, good value.", "review": "We stayed last year and would have done so again, but we found the street below too noisy early in the morning. It was a clean, large comfy room, good bathroom (for the area) and good turkish breakfast. It seems one has to ask for room cleaning in the area judging by our own experiences and conversations with other people. Loved the courtyard, the cat and the tortoise, lovely balcony and every one can hang the beach stuff out to dry. Lots of genuine Roman artefacts with plants in ! Feel a bit sad about the review by Hanna-Marie, it seems she may have just booked the wrong type of holiday. Of course there are no pools in small pensions, or tour operators, these are the local equivalent to the B&B. And in a Muslim country you will hear the call to prayer wherever you are. (i'm…", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1130863-r140495784", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 2, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A great place to stay", "review": "Hanna-Marie must be talking about another hotel or is being malicious.. Germans and harassed by Turks so what? As for the loudspeakers.. it's a muslim country, get over it or go back to Skegness..... this place is fab. We moved here after arriving at our booked hotel which actually was awful. The staff and facilities at Begonville are great - i have absolutely no issue with this place. The mosque is amazing and local shops stock good supplies for self catering holiday makers. Hanna-Marie's review should be ignored or removed?", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1130863-r137965903", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "My home away from home:)", "review": "A lovely small BB pension. Friendly people works there. Small garden with flowers and good atmosphere. Nice rooms with really good beds. Bathroom very good. The people working there are nice and very friendly and helpful. The breakfast is great.  Located in Side - close to the beach, restaurants and all that Side can offer :) :)  I sure will stay there this year too.... ::) I stayed at Begonville several times in 2011 - last time in October .", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1130863-r124257826", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "do not belive the reveiws! very dispointing.", "review": "in the description of the hotel is many lies!... we are very easy pleased people, but honestly i wouldn't let my dog go there. it was nothing we expected, the hotel is on a back street, when you arrive its basically a very out dated reception area, and a small garden area, that is it! .. there was no pool we were meant to get a kitchen area, which we just got a dingy unclean dark room, the shower was dirty some days you were lucky to get hot water. the full time we were their there was no cleaners in, in fact i don't think they even had cleaners. there was no rep to talk to, the staff barely understood English and were very unhelpful and not pleasant at all. we were the only English in there all Germans! the first night we spent looking for another hotel...  we tried to spend as…", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1130863-r119221722", "sub_review": {"Value": 1, "Location": 4, "Sleep Quality": 1, "Rooms": 2, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Perfect little pension", "review": "Really lovely little B&B in the heart of the old town. Great breakfast, comfy bed, excellent shower and run by a terrifically friendly couple. A minute from the beach and good restaurants nearby (I recommend Gul Restaurant for evening meals and Oz Adana for lunch). Excellent value, particularly for a single traveller.", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1130863-r118271912", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Very nice!", "review": "Quiet, clean and nice hotel, with staff who did their best to make our vacation the best. Recommend it deaply!", "date": "May 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1130863-r66891818", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "A real charming pleasure", "review": "\"During our holiday in Antalya, we took a short trip to Side and spent one night there, in gorgeous Begonville Pension. The boy that received us seemed a little surprised, cause we turned out to be the only guests there at that time. Also they were busy renewing a few rooms. Despite of all that, he immediately brought us to our room, a cosy, well furnitured, fresh looking room with private bathroom. I said to my partner; Let's not count on any breakfast tomorrow morning, but how nice was that; at 10.30 the boy came and called us for breakfast and what did we find? Under the almost fluorescent pink begonville tree he made a lovely table with Turkish breakfast on it. And that all for 11 pounds! It's amazing. The pension is lovely, picturesk and looks so cosy and colourful. It was…", "date": "April 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1130863-r63518003", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}]