[{"title": "Excellent Location", "review": "This Hotel is very well located. 15  minutes walking for centre Garda and 2 minutes from sailing club right on the lake shores. Many restaurants nearby. The rooms are old fashion but comfortable. The only remark is the breakfast as it is vey poor. The staff are kind. Prices for January very high.", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r554743480", "sub_review": {"Value": 3, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Unimpressed ", "review": "We booked in for two nights but only stayed for one. Although the rooms were clean, this is the nicest thing I can stay. The spa was worn, many things did not seem to be working properly, including sliding doors you had to squeeze around and it did not feel they had an attention to cleanliness. The shower in the room were tiny, so much so that it was easy to accidentally turn the water off while trying to wash and I even manage to knock the door of so it nearly fell on me while I was showering. The breakfast was adequate, nice mini donuts. The staff were fine with me, but there was a wait to check out, which the gentleman in front of me pointed out was not great and the staff member was frankly rude to him which I though was fairly unacceptable. All in all, I would not go back.", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r551932063", "sub_review": {}, "travel_purpose": "", "rating": 2}, {"title": "Family vacation in Riva Del Garda", "review": "Oasi has a great location, with a public beach directly behind it. The hotel needs some updating, especially the air conditioning in the room, it was very hot and didn't cool the room down much at night. The room was clean and large with a balcony that overlooked a camping area (which I was not expecting). The outdoor pools are tiny. The breakfast and staff were very helpful & accommodating!  For the price, I expected more, but Riva del Garda is absolutely stunning!", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r516730667", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Definitely 4 star", "review": "We have just returned from our stay at this hotel, the rooms were very good, public areas well presented and clean, food was excellent. The staff were very helpful and the location of the hotel right on the lake was just what we wanted", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r498325040", "sub_review": {"Sleep Quality": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Staff and food loose it down", "review": "After arriving late with a coach party very disappointed with food. Ask for alternative the attitude was take it or leave it. Again next night explained I did not eat certain food reception sorted for me. But restaurant staff had got a severe attitude problem towards me I ask a question and reply was ask him over there very nasty. Room clean . Bar expensive. If 2 plunge pools count as an outside pool? Outdoor pools never cleaned filthy. On a good note ideally situated and overall impression good staff n restaurant loose it down badly", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r496794950", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Good for a short stay", "review": "The hotel is located in a great spot right on the lake and within walking distance to amenities if you do like to walk that is. The parking was ample and free and wifi was not to bad. The hotel reception was friendly and efficient. the hotel itself is pleasant enough for a short stay but a bit dated. A good renovation will do this place justice. Breakfast was sufficient and we couldn't really complain as one can only eat so much. I would consider returning.", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r484980160", "sub_review": {"Location": 5, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Only for a few days.", "review": "The rooms are very nice and clean. The breakfast is okay, but not really good. The hotel has a big parking lot and is next to the beach and to the city centre. The hotel is good for wind surfing, cycling and hiking.", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r456325171", "sub_review": {"Value": 2, "Rooms": 3, "Service": 3}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Vacation in Garda Lake Italy", "review": "The hotel staff is very kind and helpful. The rooms are comfortable and well equipped. The hotel offers swimming pool, Sauna and SPA and the restaurant is one of the highlights.  The Hotel is very close to the Riva Del Garda downtown and has good access to the other cities (i. e. Limone). As potential improvement, the hotel could thing in a small area for the children have some fun, when the weather does not offer option for outside activities.  The Lake is fantastic, beautiful views, nice trails for tracking (walking and mountain bike) and many charming medieval cities in the surroundings.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r438445867", "sub_review": {"Sleep Quality": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Beautiful resort.. disappointing hotel.", "review": "Pool outside.. small and dirty. Pool inside looked cloudy.. spa deserted. Lake view room wasn't!  Mine overlooked a campsite.Food OK but odd mixtures. E.g trays of vegetables out at dinner but all cold or raw ! No takers surprisingly. Waiting staff worked very hard serving large German coach parties who ate lots! Buffet wasn't replenished Hotel dead after 9 at night.. Rooms spotlessly clean but air con didn't cool room so very hot at night. Riva is lovely and we'll worth a stay.. wouldn't go to this hotel though.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r424007620", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 2, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Average", "review": "Hotel looks good from the entrance,   Staff on reception are helpful.   Breakfast was good, but for some reason tables were reserved in the mornings for some rooms?    The rooms were basic and a little tight in space.  It was okay for a week but not sure I would stay longer in the hotel.    The showers really let me down,  changing temperature off their own accord, jumping between scalding and too cold.  Water pressure need to be improved and wish the wifi could be better too.xx", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r388321539", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Our first Visit to Riva and we will be back!", "review": "Another couple on a Harry Shaw coaching trip and what a good job they made of it, well managed as ever. The weather was not that great, but a lot warmer than England. The garden and roof area are great places to catch the sun and very peaceful. The food was good and service fine, our only concern was the billing process for drinks - the staff and management prefered to bill the rooms rather than taking payment each time - 4 out of 5 nights they got it wrong on one night it was £50 out and another time we were billed for our minibar drinks we had not used... Other that it is a well positioned hotel a few minutes walk to the lake and beach, plenty of other eateries \\ coffee shops & ice cream parlours nearby. The bus stop is right outside. The main town is a 20 minute walk & there…", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r382876336", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Tranquil and a great location - No complaints.", "review": "Stayed here for 5 nights on a Harry Shaw coach holiday, excellent location on the lake side, which is great for a promenade after one of the hotel's excellent dinners! Plentiful variety of good food at each mealtime. Clean and tidy throughout, lovely jasmine scented gardens while we were there too.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r382267550", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fantastic", "review": "Great location with grounds opening direct onto the lake - Friendly and helpful staff. Fantastic wellness facilities with an  excellent choice of massages and other beauty treatments.  Breakfast was trulely four star quality.. Rooms spacious and spotless with good bathroom facilites. Well worth a visit and we will be returning again.", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r366081125", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "fabulous!!!!!!", "review": "A dream place!  friendly staff!  best price!  only unfortunate that the food is not good  but the place is very very good!  I HOPE TO RETURN SOON AT RIVA DEL GARDA , WHY IS A WONDERFUL PLACE , WITH POSSIBILITY OF WATCH LAKE AND MOUNTAINS", "date": "January 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r342536230", "sub_review": {"Value": 5, "Rooms": 3, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Did not meet the expectations", "review": "We chose this hotel due to their sauna, the staff was very friendly to us. The shower place is very narrow but the water temperature is good. The double bed as two mattresses and is uncomfortable to sleep on.  The breakfast buffet didn't have any fresh juices only machines that delivers flavours mixed with water, fruit salad is composed of 5% fresh and the rest canned fruits. You can have a cappuccino but it's done with powder milk and flavour and doesn't taste at all, absolutely disgusting, all in all, there is a lot to choose from but the most is of low quality.", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r340451601", "sub_review": {"Sleep Quality": 2, "Rooms": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Definitely not a 4-star hotel", "review": "Definitely not a 4-star hotel rooms are simple and not very clean, The receptionist who received us was arrogant and tried to trick us when we wanted to take a bike he claim we have to pay for it, while another clerk gave it to us for free Definitely will not go back to this place", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r314204065", "sub_review": {"Sleep Quality": 1, "Rooms": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Hotel Oasi - lovely", "review": "We stayed for one night in early August 2015 in Hotel Oasi in beautiful Reva Del Garda the hotel is modern our room had a balcony with views of lake garda and we could walk to the town via a lakeside path which took approx 20 mins.  We didnt spend much time in the hotel as our time in Reva was short we had a lovely breakfast and on check out the gentleman at the reception told us we would leave our car in the carpark for the day  which was great and much appreciated and we would parking in general in Italy a big problem.  We would highly recommend Hotel Oasi.", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r303496385", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely friendly hotel", "review": "Visited here as part of coach tour with Harry  Shaw. Lovely clean hotel with friendly staff. As others have said pork on offer at every meal,but there are 3 choices of starter and main plus salads and pasta dishes. Access to lake direct from hotel and excellent  views.  Gala evening  on a Wednesday evening is very good. Overall can't  find anything to complain about.", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r296844915", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Disappointed ", "review": "Dear elaine1Nu,  we thank you very much for your kind feed back and to staying with us. We hope to see you again next year. Best regards Hotel Oasi Wellness & SPA Team", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r288862845", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good location, great value, tiny tiny room", "review": "First room we were given was occupied.  We were then given a room on the third floor (307).  The a/c was insufficient.  Never cooled the room properly.  The shower tap had a life of it's own.  Wouldn't stay on for any length of time.  Also it is situated such that it is impossible to turn around in the shower without hitting the tap. The TV didn't work properly either.  Kept switching itself off. I don't understand where the 4 stars it is awarded come from.", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r281581105", "sub_review": {"Value": 3, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "More 3 star than 4", "review": "Couldn't fault this hotel for location, cleanliness & friendly staff. We stayed on half board basis & expected authentic Italian food, what we got was pork 5 days out of 7, inedible vegetables it was truly awful. There were a mix of nationalities staying at the hotel so one would expect a varied mix. The breakfast wasn't any better. The hotel had no entertainment apart from one night when they put on a gala dinner (pork again!!) & a keyboard player. The only word I can use to sum up is boring. There was an indoor pool but so small that if there were 3 people in it you were bumping into each other & the spa & wellness centre had no atmosphere & the surroundings were dark, dismal & uninviting.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r277801029", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "rest and fun @ spa", "review": "Dear Sir,  Thank you for your kind review and thank you for the positive comments on the structure and staff . But we allow ourselves to differ from the notes given for the kitchen . The menu includes a buffet of vegetables and salads , 3 starters and 3 main dishes with a choise . In the menu there is always a course with meat (pork or beef),  one fish an one with  cheese or eggs or chicken or turkey . These are 2 of our menus of last week..  Macaroni bolognese style (with meat and tomato sauce) or Pasta with speck and nuss (with smoked raw ham and nuss sauce)                                                                                   or Cream of vegetable soup with croutons   Mixed meat grill in Soave wine                                                                                                                                                      or Baked monkfish in foil or                                                                                                                                                            Salted beef carpaccio with rocket and grana cheese   Tagesbeilage/  Contours of the day      Buffet of Dessert   Gnocchetti (pasta) with sausages and saffron sauce Rigatoni sicilian style (Tomato and Aubergines)  Cream of peas soup   Chicken legs with bear sauce  or                                                                                                                                                           Dolphin Fish Slice Pork Escalope with ham and cheese  Contours of the day   Buffet of Dessert  Of course we also pork, but you can find also other courses to choose.  We don't have a program of enterteinment, for our choose. We don't advertaise  this sort of program as we prefer to have relax in our hotel.  One time during the week we have music only to give the opportunity to dance.       We suggest to our guest to report directly at the reception if you have problem. After your departure it is to late too repair or avoid bad services.  However thanks for you suggestions.  Best regards  Ciro DI COstanzo", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r263378777", "sub_review": {"Sleep Quality": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great Recommendation from Tourist Office", "review": "This is a small and nice hotel on the Garda lake. It is very close to the beach and it is at the border to the cycle lane on the lake. From the rear gate of the hotel you can walk until the Riva del Garda city centre or ride your bicycle in front of an amazing landscape. The structure of the hotel is in a very good condition and allow you to access directly to the small SPA in the -1 floor. There is the swimming pool for adults and kids and the big hydro-massage tub. The cuisine is simple but with a very good Italian taste. Rooms are very comfortable and clean and the staff is very kind. This is my fourth time there and i surely will return to it.", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r212995058", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Fantastic", "review": "We arrived into town without any hotel booking & headed straight to the Tourist Office & they prepared a list of hotel options for us to read over as to what was available for the night.  We chose Hotel Oasi & it was booked for us straight away.  The hotel was less than 1km from the old town with an easy walk either along the lake (direct access from the hotel to the shoreline) or straight down the main road.  The room was clean, a little dated, but did have access to a balcony with views up the mountains.  The staff were helpful & breakfast was plentiful.", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r173554545", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Hotel OK, service very good, food not good", "review": "Great place, enjoyed the stay very much, I am sure we will be back to this hotel on our next visit to Lago di Garda. The staff are very friendly and go out of their way to be helpful to their guests. The location is also prime.", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r163533548", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good enough for a week's stay", "review": "I was with a group of 20 in a coach party. We had no serious complaints. The food was good and the beds were ok-ish - a bit too hard for some of the group. The staff on the whole were pleasant enough. One of the waitresses was rude on a number of occasions and the reception staff could be abrupt without actually being rude. But on the whole, the staff were okay. The hotel owner is pleasant although takes a hands-off approach, leaving the running of the place to others.  The hotel is in a very good location near to the Lake and the town is wonderful.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r161893424", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Very pleasant surroundings", "review": "Our coach party travelled from a hotel in France which was en route from South East England to Riva Del Garda. We were welcomed with a complimentary drink and then went to our rooms. Our room at the side had a part view of the lake from the balcony. The room was a decent size with twin beds, no duvets but sheets and blanket!. Tasteful decor, plenty of wardrobe space,TV and dressing table. The bathroom had shower, bidet, and w.c., ( the latter was situated facing very close to the opposite wall and was awkward to use for a long-legged male!) Hot water was not available for two occasions. Breakfasts were continental-style with cold meats and cheese, cereal, tinned fruit and yoghourt. The toaster was very inefficient, even after feeding the bread through twice. Evening dinner left…", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r130096312", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Great little Hotel", "review": "Having never travelled to Italy before was not sure how hotels would compare to other European countries.   This hotel is ideal for viewing the surrounding areas of Lake Garda, with plenty of restaurants bars and cafe's.  I stayed on a half board basis with continental breakfast and a choice of evening meal which was satisfactory.  The staff could not of been more helpful and were always extremely attentive.  The rooms clean and warm.  Would recommend this hotel who was holidaying ona budget since a fair price.  I should point out that there is a camp site next to the hotel which did not cause me any sleepless nights,", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r129438815", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 5, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Good Hotel; Very Helpful Staff", "review": "We stayed at the Oasi in September 2011 on a holiday with our sports and social club.  The room was of reasonable size and very clean.  We were very impressed with the restaurant; the breakfasts had anything a guest could require from english to continental style. The evening meals were varied and to a high quality.  The staff at reception were very helpful; I spoke to them before using the wellness centre, on using the internet and whilst resolving my account at the end of our stay.    The drinks prices were reasonable.  The hotel is immediately by the lake with stunning views and walks in either direction.  I would recommend the hotel as a base for exploring the lake.  There are many ferries to other towns on the lake which are a must  for the first time visitor; however the…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r127124910", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Lovely Riva hotel. Just as hoped for.", "review": "My wife and I stayed at the Oasi recently as part of a group for five nights on a half board basis.  The weather was superb.  The hotel is modern in style and has all expected facilities for an Italian 4 star with the exception of a proper outdoor pool. It has two small outdoor plunge pools and an indoor pool as part of the Spa. The shape of the hotel meas that 80% of the rooms have a side lake view with the rest having a full lake view or no lake view.  The 80% of rooms run along the two sides of the hotel and directly overlook a campsite on either side. All rooms have good sized balconies.  We had a standard room with a decent en suite and the fridge was a useful addition. Service at the Oasi was first class with all staff being helpful, polite and friendly.  The food in the…", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r108798599", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Beautiful surroundings", "review": "Having spent 5 days at the Hotel Oasi we really enjoyed ourselves.  The room was lovely, although I did miss a bath. We had a lovely view from our hotel balcony of the snow capped mountains and the walk to Lake Garda was minutes away and totally breath taking. The staff was ever so friendly and we really enjoyed Paolo and the night duty barman, ever so chatty. The xmas gala dinner with Donatello playing music was our highlight of the evening, it was so good that he extended his time by playing longer and even other guests staying at the hotel joined us mad Englishmen on the dance floor, what a laugh. Although the meals were good we enjoyed our last night of fish/escalopes were excellent.  Overall our stay was good and the only negative comment is that we would of liked to pay…", "date": "December 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r91380139", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "4-star value in a corner of Paradise", "review": "We travelled to Riva as a group of 4 (2 couples) with Consort.  Having been with Consort several times before, we were expecting a high standard - and got it!  The hotel was superb, having been recently refurbished.  It was extremely clean, rooms air-conditioned and the staff very helpful.  One of our party was a coeliac and could eat nothing with gluten and wheat flour.  Having told our waiter just once of the problem, he made a note and every meal was served with \"special pasta\" or \"special bread\" etc.  They could not have been more helpful.  Other holidays we've been on, we've constantly had to remind them of the dietary requirement.  Couldn't recommend the hotel more highly and the setting was superb - a little corner of Paradise, with a 10 min. walk into Riva where the…", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r87928161", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Business has never been so much fun!!", "review": "For all nature lovers Lake Garda is beautiful and a delight in summer. This hotel added to the experience.  This hotel is situated on the lake front. The hotel has an indoor pool and spa and has an amazing outside seating area which opens up to the pathway around the lake. After a long hectic day sitting outside with a  drink completely rejuvenates your mind.  The rooms also are clean and comfortable. We had a room with a balcony and an excellant view of the mountains. The balcony was provided with a table and 2 chairs, overall an awesome experience.  The breakfast in the morning had a wide variety of cheeses, meats and breads. They even had made to order eggs and their service was also good. The hotel staff was courteous and helpful, tehy all spoke fluent english and even…", "date": "June 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r87556930", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Good value hotel mainly aimed at package tour holidays", "review": "This hotel does what it says on the tin. It provides good value for money, near a lake (lakeside is a bit of an exaggeration since it is screened by trees) but it is aimed principally at package tour groups. The first night's meal is fixed, the subsequent nights you have a choice of menu but have to pre-order the previous evening. The quality of the food was more than acceptable but has been tailored to catering for a wide range of mixed Europeans. While we were there they had parties from England, Holland and Germany.  My wife and I had adequate clothes storage, good wardrobe and drawer space, for all our luggage (12 nights worth!). The decoration was very plain but the room was clean, comfortable and well serviced. This would not be the best choice for people travelling alone.…", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r80590415", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "This is not a Four Star Hotel", "review": "Having stayed in many 4* Hotels around the world and enjoyed excellent food and service the standard of the Oasi was not that of a 4* star hotel. No Porterage was our first clue to what we walked into. Our first meal in the evening was Chicken on the bone with Chips, hardly 4*. (I could have got better at my local fish and chip shop,) plus I do not eat chips! Not in Italy.  On our first two nights we were asked to leave the dining room (could not call it a restaurant) whilst we were still drinking our wine and it was only 9.30pm, just so the staff could get finished and go home.  No service from the bar was offered when sitting in the lounge area (front of hotel).  The only outside seating in the evenings was in the car park.  The plunge pools were not very clean.  As for the…", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r77386109", "sub_review": {"Value": 1, "Location": 3, "Sleep Quality": 2, "Rooms": 2, "Cleanliness": 2, "Service": 1}, "travel_purpose": "", "rating": 2}, {"title": "This is not a 4 star hotel", "review": "Having just returned from a 5 night stay at the Oasi I feel compelled to write and advise of my experience, which I will then try to forget, On arrival we were dismayed to find no porter, and I surpose this should have been an indication of things to come, no drawers in bedroom, view of a campsite and smells of one, no bathroom shelves, dirty outside pool,poor quality food badly cooked, lack of choice for vegatarians,charge to use internet. need I go on? you get the picture.How this hotel got 4 star rating is beyond my understanding.", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r77316726", "sub_review": {"Value": 2, "Location": 4, "Sleep Quality": 1, "Rooms": 2, "Cleanliness": 2, "Service": 2}, "travel_purpose": "", "rating": 2}, {"title": "Great hotel, right on the lake", "review": "Great hotel, on the lakeside in Riva and surrounded by plenty of other amenities - restaurants, bars, gelaterias, etc. Easy walk into either Riva or Torbole (nice lakeside walks). The service in the hotel is excellent, all the staff - particularly the management and the dining staff - were extremely friendly and efficient. We enjoyed HB and the variety and choice of food was very good with four courses nightly and two 'gala dinners' with live music/singing. (Kids loved these nights!) We had a very spacious room with double bed and 2 singles + cot and there was still room for all the luggage, kids games, pushchair, etc. There are two small plunge pools outside and a lovely swimming pool inside within a large Wellness Area.  Highly recommended hotel, we had a fantastic 10 days…", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r74999513", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Definitely NOT 4*", "review": "I hate to be negative about the Oasi which is in a good location right beside the lake, although between 2 campsites from where food smells wafted and baby crying was a disturbance. However the experience of our whole party left a lot to be desired. Air-con did not work and the temp was mid 30s There was no coolness anywhere. Sliding bathroom door jammed and they had to smash the lock to get it open. Towels were really thin, toilet paper as bad. One couple ran out of it and we nearly did. Food was really bad. We couldn't believe it. Fatty, bony, undercooked, overcooked, quite inedible on one occasion. The only good part was the hors d'oeuvres salads which we all filled up on because we knew we wouldn't get anything else decent. Some people gave up and ate elsewhere but when…", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r71914637", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 2, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "", "rating": 3}, {"title": "Good but not 4 star", "review": "My wife & I stayed at this hotel for one week on half board as part of a coaching holiday with Consort holidays.  The hotel is situated about 15 to 20 mins walk from the centre of Riva which has plenty of bars & restaurants as well as being a very pretty town. When we were there in July 2010 the temps were appox 35 deg & very humid. Unfortunately none of the bars were air conditioned hence everyone was outside making finding a table a problem most nights. Also if you are used to Spanish holiday resorts where you can find a place to get a full English breakfast almost anywhere & English bars abound well Riva is going to come as something of a shock. Riva is very Italian & caters for Italian & German tourists first, British tourists are in the minority. Also be careful of bikers,…", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r71108858", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 2, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "lovely hotel and staff", "review": "this hotel was a lovely place to stay on lake garda. i had a disabled friend with us who had an accessible bathroom etc all was good for disabled except the pool area. the hotel is very clean and chambermaids are very conciencious in their cleaning. the food although limited choice was well presented and cooked well. the hotel backs onto the lake and the town centre as well as torbole are within walking distance. there are a few shops and bars near by too.", "date": "May 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r66016242", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "excellent hotel, shame about the tour company", "review": "travelled with consort travel in august  2009,the hotel was excellent,the food,staff,facilitiesand location were all 1st class, unfortuately when consort say you arrive in riva del Garda in time for your evening meal on the 2nd day,what they dont tell you until you receive your final instructions is that you arrive at the hotel at midnight and sit down to a bowl of soup and cold buffet which is set out for breakfast,.the hotel was not to blame for our late arrival. We have travelled all over europe on coaches with several different companies and this is the 1st time we ever arrived as late as this.", "date": "August 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r52775400", "sub_review": {"Value": 4, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "just a lovely place to stay....", "review": "Stayed here in July of this year for 5 nights for the first time.  Of all the hotels I have stayed in in Lake Garda, I have to say that this is definately the best! The hotel has been completely renovated with a lovely pool downstairs which is very relaxing.  If you want something a little bit more exciting then you only have to step through the back gates and you are directly on the Lake with watersports galore. The rooms are fresh and all with balcony and fresh clean towels and ample bathrooms. I was quite surprised at some of the earlier reviews that said the meals were bland and uninspiring - I did not find this at all.  Each night there was a good choice of either meat or fish and a HUGE salad bar, but best of all everything was piping hot, which believe me in Italy is a…", "date": "July 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r45650131", "sub_review": {"Value": 4, "Location": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "nice hotel with good parking facilities", "review": "I have been in this hotel for one week in June 2009. My travel agency had a good deal: 550 euro for 7 nights including meals.  The hotel has a nice exterior and makes a good impression. Nice large lobby. I got a double room for solo use. Room is good, not too small, excellent shower. Bed not that good, too soft. You cannot turn down the airconditioning, only by opening the window. Nice balcony. Free parking with a lot of space.  Location is 15-20 minutes walk along the lake side to the historic center. It is a very nice walk along the lake. The hotel is situated at the lake border, you can walk to the beach which consists of small strips of grass, or small stones.  I did not like the breakfast, too basic for a 4 star hotel which the hotel is supposed to be. For the dinner you…", "date": "June 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r33339223", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "A Lovely hotel", "review": "I stayed at the Oasi for a week in May. The hotel is lovely, very clean indeed and in a great place.  There is access to the lake side which leads to path that takes you into Riva del Garda.   Its a lovely walk.  The bedroom was fine, it was a single room with a huge balcony and an excellent shower. Lots of cupboard space. There is a campside on each side of the hotel but I didnt find it annoyed or disturbed me at any time.   The breakfast was fine, I don't eat meat and found the food very boring at dinner time. On night the veggie option was fried courgettes and another night orange juice for the main course!  It is a 4 course dinner and as I only paid £60 for half board it was worth it.  Air conditioning isnt switched on until mid June which was a pain as it was around 34 - 36…", "date": "May 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d1133443-r33316754", "sub_review": {"Value": 4, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled solo", "rating": 4}]