[{"title": "Spain 2019", "review": "I stayed at this hotel for 1 week, room was very spacious, and clean.  Bathroom was compact, vent held in place with masking tape, tiles were grubby (water scale)  and the cutting for the fitment of the taps etc was so bad, not even grouted up - looked like a diy-er had done the tiling.  First 2 mornings room was cleaned as you would expect, pjs folded , glasses washed, after that bed just made and bin half emptied. Attitude of staff so arrogant- one day at 5 am and enquired if I could have some breakfast to take out , told “no” rather abruptly, no sorry we can’t do that, just no!  Majority of the fruits at breakfast were so overripe (apples all wrinkly, bananas all black) only good for baking.  Vending machine for hot drinks - water wasn’t hot enough to make tea, being a Brit, I like a cup of tea.  Had a meal in the bar/cafeteria one evening and had to wait almost 30 minutes, apart from that the service was good and food hot.  No literature in room about the area, and no literature available in English  Hotel was not busy, but any questions had to wait at least 10 mins at reception to be acknowledged…", "date": "November 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r728313974", "sub_review": {}, "travel_purpose": "", "rating": 2}, {"title": "Mr Andrew skinner", "review": "perfect hotel the staff are brilliant the position is ideal bus and trams right on the doorstep hotel is spotless and great value we will definitely be back food in the hotel is very good also bars and restaurants are nearby", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r714553601", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Anniversary", "review": "Dear Customer; Thank you for your comment, we suggest you enjoy our Superior and Premium rooms during your next visit. They will like it !! regards ", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r712387945", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Relaxing hotel...", "review": "Spent 6 day city break last week, thoroughly enjoyed it, rooms were clean we had all our requests met, high floor and quiet room. Food was nice enough, as expected after reading reviews although didn't try cooked breakfasts as continental was enough.  Bus stopped outside as well as tram which was two minutes away to take you to Alicante or 5 minute walk to catch tram to El Campello and change to to Benidorm Only down side was weather wind and rain", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r711337572", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Second visit - we love this hotel!", "review": "Had booked 1 night but ended staying for 3 nights once we got the lay of the town very close to beach less than 5 mins and the promenade is ideal for a long walk. Hotel is clean and reception staff very accommodating and helpful bar area clean and drinks not so expensive...  ", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r692320658", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Week in Alicante", "review": " The Hotel Castilla is in the San Juan Playa area . This we found was a rather quite area with a good beach and a long promenade . The Hotel itself was very clean  .We booked on a full board basis which we regretted . The reason was we found the Breakfast very basic . Not much choice . The lunch and dinner were three course meals selected from a menu . Again very poor choice. The meals were made worse by the restuarant staff who were really miserable , a complete contrast to the cleaning and reception staff who were great . This made meal times hard to tolerate . Eventually to the point where we ate out on many occasions . There are  plenty of places to eat in Alicante City .  We went via Tram quite often down to Alicante City . The Trams run every half hour down to either…", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r685520047", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Brilliant value for money, near the beach", "review": "Thanks for your comments, it is very important for other clients to read about the establishment they want to stay.  We greatly regret that we did not help you with your inconvenience in the restaurant, we would have liked to known it at the moment it happened to find a solution in real time.  Sorry for the inconvenience and we hope to see you again.  Enjoy the Summer  Kind regards ", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r680175513", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Enjoyable Stay", "review": "Just spent four days in the Castilla. Surprisingly great hotel. Room excellent , recently refurbished to top standard. Unbelievably comfortable bed. Lovely swimming pool and lounger area. Tapas were all delicious as were the Gin & tonics. House wines fantastic. Front of house staff super helpful particularly Jose. Bus right outside into Alicante 21& 22. Tram stop not too far away either. Food looked excellent from the restaurant.  We will be back for sure.  Try Boca de Mar restaurant about 100m from the hotel - superb food from friendly people ", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r680088694", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good facilities in a great position close to beach", "review": "We had three nights at this very nice hotel and generally enjoyed it very much. It does have one or two niggles but also many things going for it and we would consider a return visit.   Location – very good indeed.   You are a two minute walk to the wonderful and very long beach. This has a beautiful promenade and its full length is about 2 miles. There are lots of restaurants along the front and sun loungers available for hire at about €15 for two with a parasol.   The centre of Alicante is 8 km away and this takes about half an hour by public transport. The hotel is very well served in this direction with the bus stop immediately opposite and the tram around four minutes walk away. Both modes of transport are clean and very cheap.  Rooms – like many hotels in Spain they are…", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r675616978", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fabulous hotel and staff", "review": "Dear customer;  I appreciate your opinion, it is very important for us and our customers. We wish to have the pleasure of welcoming you again.  Sincerely, ", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r674969316", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "2nd Time Here", "review": "We had a great time 2 years ago so this year we thought we would visit Castilla again.Clean hotel,staff friendly and engaging.The breakfast isn't the best,but it suited me and my boyf as we spent the rest of the day out and about.Take a travel kettle if you can with you as the hotel doesn't provide this.Great place if you want to have a day by the pool,relax and not spend too much time in the hotel.Somewhere to crash and then make the most of your day..cannot rate the cleanliness enough of the hotel so clean!👍 They upgraded our room as well because we asked for double but got 2 singles,bed is extremely comfy.Met a lovely couple from Burnley ☺", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r670228176", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great for Beach and Tram", "review": "Dear Customer;  Thank you for your comment, we suggest you enjoy our Superior and Premium rooms during your next visit.   They will like it !!   Best regards ", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r668005141", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Decent value and well located", "review": "We live about 100 miles south of this hotel and popped up for a long weekend break. The room was on the top floor, it was clean and modern, comfortable bed and very large terrace. it could have had a couple of extra electric sockets instead of just one each side of built in headrest cum shelf unit. A bedside table or init at the side of the bed would have been useful instead of having to put things on the floor or struggle to put them above on a shelf.Breakfast was OK, scrambled eggs and some bacon were the cooked items and the usual cold meats and cheese. We went out of season and there were still queues for the toaster and coffee machines, I would think there would be a long wait in summer. Although we were 8 floors up we did suffer from late night noise from a bar/restaurant…", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r662455759", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great value with beach location but make sure you go on season!", "review": "Dear customer;  We have received various comments from you.   I appreciate your opinion, it is very important for us and our customers.   We wish to have the pleasure of welcoming you again.  Sincerely ", "date": "February 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r658976361", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A hotel we love", "review": "Hotel good value.  Excellent location near the beach.  Breakfast a bit dismal, lady working there from 7:30 am till 10pm, I’m not sure that’s correct in the free world, especially in Europe, no wonder she was a bit grumpy. Hope she got a break.  Reception very polite and helpful. Now, the restaurant is an issue, I hope they did not pay for its design, otherwise it’s a real shame. Clinical lights flooding the sparsely white plastic furnished room, white walls give you a feeling you should be in the operating room. The automatic doors opening wide, letting the cold air invade the entire restaurant, would be perfect for a stretcher to pass through, really, who design this space? The food is not remarkable either.  Nice pool to catch a few rays.  ", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r657640531", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Great value out of season; excellent location for quiet beach holiday", "review": "Got a good deal on rooms (I think you may get even better direct via the hotel website, but I couldn't make it work successfully so resorted to using a booking dot com company).  Eating out in the local area was cheap, with plenty of options to choose from; there's a local supermarket about 1/4 of a mile away, with local bakeries even closer, so we shopped there for breakfast things and snacks.  Rooms very clean and comfortable without frills.  Take a travel kettle and mugs if you like a cuppa; as with most continental hotels a kettle isn't standard in the room.  A fridge would be a  very welcome addition, but that's the only thing really that it was lacking. It's a bit 'city block' in terms of views and outlook, as this is an area highly focussed on tourism, however, the area…", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r657393024", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very clean", "review": "Clean modern hotel. Good condition rooms, lovely crisp bedding and modern bathrooms. No kettle or bizarrely I could not even borrow an iron for my clothes,  a first in all my hotel stays. So don't stay for business unless you want to look a creased wreck. Breakfast was basic and soon ran out of items when I asked for replenishment was told there was none. So a basic clean stay, hence 3/5.", "date": "February 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r654153705", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Feels like home.", "review": "Dear Customer;  Please forgive us if there was a product that did not have replacement but we usually replenish everything.  Comentarle that we can not leave an iron, if it was an accident the error is ours. We have laundry and ironing service.  Thanks to your comments, you are always welcome to improve day by day.  Regards", "date": "February 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r654037221", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Booked by easyJet due to snow at Bristol ", "review": "Thank you once again to all the wonderful staff at the Castilla. My wife and myself have always loved this hotel. Thanks to Alfonso and all the hardworking restaurant staff, housekeeping ladies wonderful and reception staff very professional. Special mention to Jackie who always makes us welcome lovely lady.", "date": "February 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r651042301", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Stayed due to canx flight", "review": "Excellent location, a short walk from the lovely flat long promenade. Extremely pleasant and helpful lady, Celia at reception, as was Alejandro at the bar, very friendly. Rooms and bathroom extremely clean and comfortable. Waitressing staff at Dinner were abrupt, miserable, and telling clients where to sit, in a dreadful manner. This was spotted by a grey suited lady, who after speaking to the staff, they were more “pleasant” to the customers. It seemed that they only wanted people sat at the least numbers of tables. Breakfast staff, and the continental breakfast were excellent. Would stay here again, but would not be inclined to dine in. ", "date": "February 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r649769121", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Lack of Management", "review": "We booked double room ( not twin ) one month ago , we inform Hotel about choice of the bed same day as booking, one day before arrival we receive a message that hotel cannot guarantee double room with one bed  ???? We have long discussion at check in and receive stupid excuses from receptionist about why we cannot have what we had ordered....  anyway at the end we got double room ... Manager of this place should be ashamed about his lack of organize a rooms for the  guest . There is never bad hotel its only BAD MANAGEMENT !", "date": "January 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r648482346", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Clive", "review": "Dear customer:  We want to apologize because the receptionist who attended you on arrival did not know that we had changed the bed, as we indicated you a day before your arrival. We always try to do everything possible to meet all requests, although sometimes it is not possible to reach them all.  But effectively, as you specified in your request, the room had a double bed since your arrival at the hotel.  Thanks for your comments. ", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r641451936", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Out of season very central for local public transport and San Juan beech.", "review": "Stayed for four nights over Christmas, room spotless, cleaned everyday and fresh towels daily. Staff all friendly and helpful. Enjoyed continental breakfast and evening meals Christmas Day special dinner was excellent. Will be booking for next year, many thanks to all the staff that made our stay welcome", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r638677508", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good well located accommodation", "review": "Dear guests;  Thanks you for choosing us, we have received several congratulations regarding the Christmas lunch.  Thank you very much for your company and we wish you a happy new year.  We hope to see you back soon.  Ana Sarmiento ", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r636298333", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Perfect", "review": "Mid November can be wet windy and cold, we had four very warm sunny days. Hotel is one street over from seven mile sandy beech and long promenade. Bus and tram stops a short walk away. From airport Bus C6 at no7 stop to board L4 tram to Playa San Juan/ Pl,La,Coruna. On half board we first lunched at sea front Burgerking, after which we bought large apples for lunch. The hotel room was a little tired but clean and comfortable with four English tv channels. The receptionists spoke excellent English and eager to help. Continental breakfast could be increased to full English for 3 euros. Evening meals were set three course, changed daily, served to your table. A choice of two starters, Main meal also a two choice usually fish or meat, but vegetarian available and puddings. WE WERE…", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r631264865", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Fantastic", "review": "Jose was the most friendly and helpful concierge. Very patient and a good laugh. The hotel was lovely, clean, close to the beach and other bars and restaurants. Perfect for our long weekend away with a group of girls. Would definitely go back!", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r631258327", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Conveniently located for beach and public transport.", "review": "Small room but proper king-sized bed; excellant bedside reading lights; balcony (side views); good wi-fi and TV (4 English channels); good breakfast buffet; close to bus and tram stops.  Some staff very polite and helpful. BUT no tea or coffee making facilities in room! (Queried this in advance and were told hot water always available from the bar. Yes but not told there would be a charge). Only one easy chair in the double room (plus one wooden desk chair) so uncomfortable for one. No tissues in bathroom; no TV channel listing in room. Worst of all during the 3 (of 7 ) nights, strong winds caused very noisey irregular metallic clanging from the ventilation shaft ( ? ). So sleep was impossible for much of the time. Change of room offered but could not be sure it would be any…", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r628429358", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Reception", "review": "Just back from Castilla Alicante, stayed there for 4 nights. The reception staff were fantastic, in particular Jose, nothing was a problem to them. The staff in the cafe bar were all very polite and welcoming. As for the restaurant staff, rather grumpy attitude at evening meal time. Whether they were unsure of English speaking customers, maybe that was why they looked so grumpy. The meal selection.. 2 choices for each course none of which were fabulous. The cleaning staff were fantastic, rooms cleaned every day to a high standard, very cheerful staff. The resort itself was very quiet, maybe as it was nearing the end of season, there were very few shops there and hardly any restaurants still open.  The beach was wonderful, it stretches for miles, clean, golden sand. Easy access…", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r626997629", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Enjoyable stay", "review": "This is a good average 3 star hotel. Comfortable beds, all areas kept very clean and an adequate breakfast. San Juan beach is a couple of minutes walk and the bus stop is outside on main road 21 and 22 takes you into Alicante.", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r626928671", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Lovely time", "review": "Just back from a mini break. Very well situated hotel, took C6 airport bus then tram line 4 which stops 5 mins from hotel. Also frequent bus service Nos22 and 21.  Hotel is older but spotless, lovely fresh smell when u enter reception, rooms were ready when we arrived at 1pm. We booked a standard room which was large, clean with a shower and bath, the furniture was more traditional ie dark wood but was fine and I can be fussy. Didn’t think I’d see the sea in a standard room but we did plus a view of the pool with afternoon sun on the balcony. All the staff were really nice and we enjoyed waitress service at dinner , made a nice change from having to jump up and down to a buffet table.  Shops, supermarkets etc close by. Lovely wide prom and fantastic beach. Found a lovely beach…", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r626620820", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Lovely hotel", "review": "Stayed here with my friend for 5 nights. Would definitely recommend.  2 min walk to a lovely beach , shops and bars around, nearby tram. Lovely shop that sells everything just across the road. Pool very cold , would be nice if heated.  Staff in hotel very pleasant. Especially Pablo in restaurant who served us coffee every morning and Jose from reception who we met on our last day but was a really lovely man.  Beds were made everyday and again, staff very pleasant.  Will return to this little gem for sure. Thank you for a lovely stay.", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r625374363", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Good hotel one block from beach", "review": "Very good choice out of season, with a value rate.  Spacious room and balcony.  Arrived at midday and happy to check us in early: on departure, we could use pool are and other facilities after checkout for rest of the day (as we had a late flight).  Great (and unusual in Spain) to have pool available in mid-October.  Cafe-bar with terrace good for evening drinks etc.  Varied breakfast choices and good value at 7 when booked with the room.  Didn't eat in the restaurant as the menu did not look too exciting but lots of other dining options within a short walk.  Free street parking, although the hotel has its own, with a fee.", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r624281610", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Extremely clean", "review": "Very disapointing to have no tea/coffee making facilities in the room. Even though I paid €140 to upgrade to superior double I was told by reception it is Not Possible to hire a kettle. We were told to buy coffee in the bar, which was €2.35 each for the smallest cup.  Breakfast ok, if you like continental. Restaurant lunch/dinner ok but very small portions, but price only €15 each", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r622932168", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Relaxing stay ", "review": "Dear customer:  Thank you for your comment, we understand that your services were in full pension to have that price of € 140 indicated. In our services we do not have tea / coffee in the room and cafeteria prices are very cheap 1.50 € coffee with milk.  Thanks again for your trust and your comments.  Cordialment", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r620105589", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Some highs some lows", "review": "Stayed in a superior room as we wanted a walk in shower. The bathroom has a hairdryer and toiletries provided ( they were replenished daily) bedroom was a good size and maid service daily was immaculately cleaned. The tv is very good has quite a few U.K. channels ITV&ITV2 . Paid extra for a fridge €8 per day but made good use of it! There is a safe in room but that is extra too. Balcony is a good size , our room had a side sea view. Pool area was fantastic ! Very spacious Clean pool and plenty of loungers available any time of day when we stayed. Breakfast is okay would sometimes seem chaotic when you walked in to be seated but was always greeted swiftly and there was always plenty of room. lots of continental options, fruit , cereals , yoghurts cheeses and pastries. There was…", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r612602385", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Lovely hotel. Perfect location", "review": "Stayed for five days and everything was perfect. Very relaxed and calm atmosphere. Room bright and clean, the maids did a good job. Breakfast had everything you need to start the day. Location is the best, just 2 min walk from beautiful San Juan beach. One tip..there is a button on the tv remote that change the audio on english programs that are dubbed with spanish.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r605304293", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Nice hotel in very good position!!", "review": "The hotel was nice and in a very good position next to beach, restaurants, shops! What i did't like was that they don't have a minibar in the room and the cleanliness of the room when we arrived! The toilet  wasn' t clean . I cleaned it myself.   The breakfast was more than a continental , they have one kind of sausages, some bacon and scrambled eggs but no vegetables ! They had only some mashed tomatoes (raw) for bruschette maybe and when i asked for a hole tomato they said it cannot be because this is a continental !   Beach towels costs 2€ each and if you want to change it , it will cost you 2 € every time.  The staff was helpfull ! I would stay here again but without breakfast included!!", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r601344584", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Beautiful beach and wonderful hotel", "review": "We fell in love with San Juan from the minute we arrived.  Hotel staff were really friendly and helpful.  Miles of golden sand just a few minutes away.  We thought the breakfast was very good, lots of choice and everything displayed nicely.  Yes, there is no fridge but you can rent one if you need it or upgrade you room.  Alicante is really easy to get to on the tram and a very kind Spanish man helped us work out the ticket machine. Alicante is gorgeous and very interesting - lots of museums , fantastic architecture and nice shops.  Two places nearby are worth a visit - just turn left out of the hotel  and a minutes walk away is the LOs Palmeros Lounge which does really  good food and has very accommodating staff.  Also, next door is the Oasis cafe which also has wonderful food…", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r599955249", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Lovely staff", "review": "Dear customer;  I appreciate your opinion, it is very important for us and our customers. We wish to have the pleasure of welcoming you again.  Sincerely, ", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r588498832", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Lovely sunrise in the Mediterranean Sea", "review": "Had a great time at san juan beach was great its very quiet in the evening .tram was a 5 minute walk away to alicante city which took 30 minutes Now for the hotel which was very clean staff were lovely and friendly and accomadating it was 2 mins away from the lovely beach the only dissapointing thing was the food in tge restaurant it was awful and i can eat anything so we had to pay for our evening meal in the separate cafe area which was cheap enough and lovely but not goid as we had paid half board ", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r587865567", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Nice hotel in nice part of Alicante.", "review": "My wife and i booked this hotel because we didn't want to be in central Alicante and we didn't want to stay in any of the main resorts like Benidorm etc. Turned out to be a pretty good choice, the area is what i would call quite traditional and you might need to have a phrase book handy or google translate at least as there's very little english spoken. The hotel is very nice and is spotless as is the pool area. They're always cleaning and the staff are very attentive.  The hotel is easy enough to reach on public transport from the airport if you do your research beforehand. C6 bus from the airport to central Alicante and then either the 21 to 22 bus or even better is the tram L4. Only thing i would say about the hotel is that it can be quite noisy a night and in the early hours…", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r585801926", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great hotel", "review": "Dear Sir,  Thank you for your comments on your recent stay in our hotel, it is very important for other customers to know your explanations. Your feedback  explains the area very well and clear.  We take note of the breakfast and we have been talking with the management, at the end of the week we will change it to a full breakfast buffet with a lot more variety.  Thanks again  Ana Sarmiento ", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r584629673", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Big room, good value for money but noisy", "review": "Just got back from a five day break, the hotel is spotless and the cleaners do a fantastic job. All the staff was friendly and very accommodating. The food wasn’t great with a choice of two meals and breakfast basic. On the plus side though there is a lovely cafe inside the hotel where we ate most days. The beach is just a few minutes down the road with clean sand and clear water. The pool is clean with comfy sun beds. ", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r581880751", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Short break", "review": "We stayed at the hotel for a long weekend while competing at the European Masters athletics championships. The location was perfect being walking distance to the beach and to the start/finish of several of the races as well as having good bus and tram links into the centre of town. The room was extremely large and very good value for money, the only negatives were that it was quite cold in the room overnight (even with a blanket) and there is no sound proofing so we slept badly - at one point it seemed as though someone was using a masonry drill to put holes in the wall at 2am! One other (minor) quibble is that we were charged 2 euros a day to use the safe in the room.", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r581419857", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "For Beach Lovers", "review": "Great hotel, great location, easily accessible to the beach and tram stop and buses for travelling into the main centre. Upon a request for a top floor room prior to our arrival the hotel was happy to accomodate such a request. Hotel spotlessly clean. Cleaning staff very friendly as were reception staff. Great value for money..would not stay anywhere else were we to visit again. One minor detail, kettle in room would be nice for that good old english cup of tea...great value for money. Thank you hotel castilla.x", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r578536169", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Golf trip with friends", "review": "Perfect location for any type of holiday...shopping, sun, beach, golf. Half an hour bus journey to city centre (€1.45) - stop outside the door. Most helpful reception staff, all problems treated efficiently and with a smile. No comparison between Spanish and Irish prices - for everything! Thank you for caring attention", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r568935391", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Repeat visit", "review": "Dear customer,   Thank you for dedicating your time.  We hope to see you soon.  Ana Sarmiento ", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r566258755", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good hotel", "review": "Repeat visit for us, the Castilla is a great,clean hotel situated near the beach. Breakfast basic but adequate. Bar prices ridiculously cheap E1.30 for a coffee and E6.00 for a bottle of wine! Ate at the hotel and was deeply disapointed on 2 occasions - very poor food,served cold and burnt. Would return again for the comfort and cleanliness and ease of getting to hotel - bus stop outside. We stayed in March and most local restaurants shut. San Juan is a very peaceful resort with a lovely,clean beach.", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r565985241", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Winter sun break", "review": "Dear Customer,  We feel sorry about the food was not to your liking. I transfer your discomfort to the cook and we hope very sincerely that these incidents will not be repeated.  Greetings and thank you for your comments.  Ana Sarmiento  ", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r562259389", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very good location", "review": "Hotel very clean, rooms cleaned daily, clean towels, shower gels, shampoo provided. Excellent position 5 minutes walk to seafront. Breakfast is continental, not good if you like typical English breakfast of bacon, eggs and beans. Very quiet at this time of year, most shops and cafes shut. Also brush up on your Spanish as not a lot of English spoken. We found it difficult to find decent food and if you can find it, it’s very expensive.", "date": "November 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r545409993", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fantastic", "review": "Great location beach 5 mins walk away. Restaurants Bars 5 mins walk away and yet a lovely quiet hotel with swimming pool which was cleaned every day. Good restaurant on site to. Lovely clean rooms well kept Hotel", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r544580428", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Not Peaceful Holiday", "review": "First day arriving the bar staff twice spoke to me in disgusting manner, actually snapping at me ?,when I tried to talk to them. Spent all my time and money outside hotel because of this. Reception (some ) seemed unhappy and unfriendly. Room at front of hotel, noise was unbelievable, trams, buses driving past every 20 minutes, at night cars and motorbikes with noisy exhausts driving past until early hours am. Hotel held wedding parties through weekend, people screaming and shouting till 4 am. Cleaning staff very good and efficient at their job.  If you want nice peaceful holiday, stay away.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r537803536", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 1}, {"title": "Great holiday location", "review": "Dear client, We are awfully that our hotel was not what you expected.  We will study all the negative points you indicated in order to avoid these kind of problems with other travellers. Kind Regards", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r536142045", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very relaxing", "review": "We stayed at the hotel during the Volvo Ocean Race weekend, so the hotel was quite full. I had requested a room with a view of the sea, and we got exactly what I had asked for, with the bonus of being on the top floor. The room had a nice balcony as well. The elevators ran quickly. We liked the shower, which was stall-style in the footprint of a tub. The hotel is about a block and a half from the beach, and 2 blocks from a tram stop, with the ride to the center of Alicante taking maybe 30 minutes. The staff was friendly and helpful, and their English was much better than my Spanish.. We bought the B&B package, and the breakfast was about average. There were plenty of restaurants and bars within an easy walk of the hotel.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r534336353", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "If you enjoy mediocre stay here", "review": "Dear client, Thank you for your nice review. We are pleased to check that your stay with us was satisfactory. Kind Regards", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r534271218", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Perfect location", "review": "We booked a deluxe room at a good rate that included breakfast. We were on the 5th floor with views(between the buildings) of the sea which is about 5 minutes walk.  The hotel is perfectly located with tram line and buses on main road if required.Plenty of restaurants along beach and inland,lots of choice and some really nice bars dotted around. The room itself was spotless and good quality toiletries provided with more added daily if needed. The breakfast had lots of choice,yoghurts,fruit,cereal,different teas,coffee,pastries,meats,egg and bacon.It also had a small selection of gluten free cakes/biscuits. I would say that the quality of the breakfast overall was questionable for example eggs flavourless,bacon mainly consisted of fat.Cereal cheap quality,however considering the…", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r533209104", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "unexpected menus.", "review": "Dear client, Thank you for taking your time and writing some lines regarding our hotel and the surroundings. We take note of your reccomendations regarding the breakfast  and we will try to do our best in order to improve it.  Kind Regards", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r532108563", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Poor quality ", "review": "Stayed at this hotel end of september to October.We found on our arrival in the early hours of the morning greeted by a very pleasant receptionist but was not given the full information of the local amenities.as we found later other guests were supplied with a local map bus times and tram stops.We wandered about the resort searching for information and felt quiet lost as this area is mostly spanish speaking.We also found a lot of the information offices had closed down for the end of the season and various shops and restaurants had closed down. which was very disappointing.Fantastic beaches and great weather made our holiday.Before i finish i will mention the hotel was very clean.We booked half board for breakfast and evening meals.Breakfast was cereals bread and scrambled egg…", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r530727749", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Very pleasant stay", "review": "Dear client,  We are so sorry that you did not enjoyed your stay with us. We will learn from your review so that we can avoid problems of this kind in the future. We apologize once again.  Kind Regards", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r528587036", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Short break. Would go back again", "review": "Glad we didn’t get full board. The breakfast was very poor quality and not much choice , waitress quite rude. The rooms old and not well kept. You could hear everything from room to room. We’re usually easy , but this time I wouldn’t recommend this place to any of my friends. ", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r527171354", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Ten Day Stay In September", "review": "Six us stayed in 3 twin rooms for our ten day stay for a friend's 50th birthday get away. The hotel was fairly spotless, the staff were always friendly, polite and helpful, the facilities were suitable and the location was within easy reach of bars, shops and the beach. Although this was counted as \"off peak\" we had temperatures around 30 degrees for most of our stay. There are bus stops just yards from the front door and tram stops a few hundred yards round the corner, where you could set off to Alicante City or Benidorm, with ease. The area is a bit more of a Spanish influence rather than suited to holidaying Brits, so familiarising yourself with all the basic phrases would be a bonus. After all, if you are abroad, why should everybody else speak English? ;-)  The rooms have…", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r526103998", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Attention to detail, improvement needed ", "review": "Dear Customer ;  We are happy to know that you have enjoyed your vacation.  Thanks for your comments .  We hope to see you again.  Regards", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r525045571", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Vacances San Juan ", "review": "Booked this hotel several months before traveling and arranged a late checkout before booking flights, hotel confirmed we could have a late checkout so proceeded to book late night return flights in order to enjoy a full last day in resort. I also requested a double bed in our room of which was also confirmed by the hotel prior to departing, we were also arriving in resort early morning so requested an early check in. All of the above requests were accepted by the hotel along with being advised of the respective additional costs.  Upon arrival on our first day we were told our room would not be ready until between 2-4pm but could change our clothes in the toilet of we wished, not a good start but we did change to more casual clothes and went out for the day and spent some time…", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r523362029", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Could not have asked for more", "review": "Nice hotel,  can be reached easily from airport by public transport  (like 40 minutes ) Upon arrival we were welcomed happily and as we came earlier they kept our luggage while we could enjoy the beach.  At the Reception we had all information about tram / bus / local map  The room was clean and had all the necessity for a good shower and rest after long day at the beach.  Talking about the beach,  very sandy beach of 3.5km long with loads of bistros and pubs to grab a bite.  Breakfast at hotel is very good. Open buffet with Bread,  fruits, coffee, tea, juices,  Spanish cakes and salami and bacon&eggs . Decent view from room balcony. Overall the hotel deserves the 3 star and we would recommend this hotel. ", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r518682603", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good choice close to the beach", "review": "Dear Customer ;  Thanks for your comments and for recommending us to other guests it is very important for us your opinion for which we thank you again.  Regards Ana Sarmiento ", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r517998837", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely 7 day break, just one issue", "review": "Went to this hotel for one weeks break in the sun. We love the location (Playa San Juan), beautiful beach and lots of eating out choices. Be aware this is a Spanish tourist area so there are no English, Dutch or German bars which suits us fine! The hotel guests are also mainly Spanish however the reception staff have good English and are very helpful. The hotel is spotlessly clean and the pool and sunbeds are hardly used, only one family tried to reserve beds (North Europeans, you can guess the country). Only one BIG issue is you cannot charge any food or drinks to your room, this was a constant complaint of all the other guest we spoke to. Having said that we will definately go back!", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r517289991", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Still a Nice Hotel", "review": "Dear client, Thank you for taking your time in sharing your opinion with other travellers. It is nice to check that in general you enjoyed your stay with us. We will inform the management regarding the negative aspect you have point out. Kind Regards  ", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r510865738", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great value.", "review": "My wife and I have just returned from a week staying here. This was our second visit to this hotel and I am pleased to say that nothing much has changed. The room and balcony were still nice and clean, the staff polite and professional and you still can't leave the breakfast room with a coffee! It's a minor detail and we really enjoyed our stay again here.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r504891154", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Nice people makes the difference", "review": "Pros : Location . 3 min walk to the beach. A few good bars/pubs/disco within walkin distance. ( kraken which is across the road was nice for relaxing evening drinks as we were in end of May it was not crowded ) restaurants, shops in area also. Bus stop is right in front of hotel. Rooms are decent size, high cleaness level, not very noisy. Dont know about AC as we didnt need it but they had. Friendly and helpful staff Cons: Breakfast is a joke. Very basic, pretty low quality, coffee couldnt drink it. But it was free in our offer. Anyway i tried it only once. With so many restaurants around its not worth the bad taste in the morning. Had dinner 1 night . Big mistake. Was breakfast's little bro. Matress comfy lvl 3/5. Pillows 4/5. If I could sleep with a herniated disc for 10…", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r504408016", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fabulous surprise! ", "review": "Dear client, Thank you for taking your time and share your opinion with other travellers. We take note of your comment regarding the breakfast an we will inform the management in order improve it.  Kind Regards", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r503646966", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Fantastic hotel ", "review": "This is our third visit to this great hotel,  we stayed for a week the end of June,  we had a great room on the 8 th floor, the rooms are big, great air con, big balcony,  the staff in the hotel as very friendly,  Jose is always wonderful on reception,  also the other staff on reception.  The beach is very close, the Mas y Mas supermarket is about a 10 min walk,  lots of bars and restaurants near this hotel, tram very cheap and a good way to get around,  it helps if you can speak a little Spanish,  we love this hotel, we will be returning again!  ", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r498827185", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Lovely place", "review": "Dear client, Thank you for sharing your opinion with other travellers. It is nice to see that you enjoyed your stay with us. We will keep working in order to make our clients´stay as pleasant as possible.  We hope to see you soon. Kind Regards", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r495034543", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Perfect for Beach Holiday", "review": "With mixed feelings I booked this hotel and very happy I was too that I did. When we arrived late evening, we were checked in swiftly and was very pleased with our room. After quickly unpacking, we strolled along the promenade (2 minutes away) and enjoyed a couple of vino's in a fab sea-front bar before returning to our hotel for a perfect night's sleep. The breakfast each morning was just what we wanted - all things continental plus scrambled eggs and bacon, couldn't fault it. A day on the beautiful beach then off into town (5 minutes stroll) for our evening meal. Although English is not spoken in the resort, we found the locals very patient with our bumbling attempts at ordering tapas, lovely people.  Each morning our room was spotlessly cleaned and beds made. We ventured out…", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r494537625", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Great location.", "review": "Dear client,  Thank you for sharing your review with other travellers. We are happy to  check that you enjoyed your stay in the area. We will do our best in order to make your next stay as pleasant as possible. Kind Regards", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r492401987", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "great base", "review": "Stayed in this hotel in May, 6th floor with a view between the buildings of the sea. Nice room, cleaned every day, on my last day an eye cream was left on my locker by the cleaner, it was not mine, so I can only assume that it was under the bed from the last occupant, toiletries very basic, ladies bring your own conditioner, little sanitory bags were only left for two day, I stayed 7, almost ran out of toilet paper on the last day!!! Breakfast okay, loads of fruit, but, very hard to cut up, fresh fruit salad would be lovely. Very slow to fill up croissants and meats.  Other than these small little quibbles this is a great location hotel, one block from beautiful beach, with lovely restaurants nearby. Bus outside 21 or 22 to Marina in Alicante €1.50 single ticket, Taxi €12…", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r492351977", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Good location, room for improvement", "review": "Bus and tram service access good for going into town, beach is 5 minute walk, good pool, staff are very professional and friendly, however made the mistake of using the hotel restaurant, could not eat any of it, everything was stale and tasted awful", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r491642917", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "IDEAL FOR A SHORT BREAK", "review": "Dear client, Thank you for your review. We are awfully sorry that you did not enjoyed the food in the restaurant. We would  thank you if could send us an email to this address (info@hcastilla.com) indicating us what you ate. In this way, we will study what happened and we will  improve it. Thank you. Kind Regards ", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r483834431", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Solid 3*", "review": "Spent 5 days with our 3 & half year old grandson. Excellent position only a few minutes walk to the beautiful sandy beach with plenty of play parks for kids. McDonalds & Burger King also at beach front along with plenty of other eateries. Hotel has its own small kids playground beside the entrance. Its pool to rear has plenty of sunbeds but no parasols when we were there. No kids pool and shallow end was 1mts deep so just went and bought a kids flotation ring. Room itself has three single beds with small balcony, table & chairs. Basic but adequate with safe deposit box (2 Euro per day), Air con control on wall but we didn't need so don't know if chargeable.  Breakfast was a good selection of continental with the only hot food being scrambled eggs & bacon. Would probably have got…", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r483601152", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "WELCOME TO MOSQUITO CENTRAL", "review": "Dear client, Thank you for your detailed review. It can be very useful for others travellers looking for a hotel in San Juan Beach. We appreciate your opinion and we will keep working in order to improve our services. Kind Regards", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r483122259", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "5th Visit and STILL Buzzing !", "review": "This not a 2* hotel trying to pretend its a 3*, but it is also not a 4* that has been under-rated.  It just a solid 3* and is all very basic but what it does it seems to do quite well.  Breakfast very limited, but in reality all that you need.  Short walk to nice beach and limited eateries.  It is basically quiet area, if you want more places to walk, shop and see then go to Alicante itself.  Buses stop right outside - 21, 22 go into Alicante; 21 direct, 22 round the houses.  There is an electronic board telling you when buses are due, which seemed quite accurate, so consider skipping the 22 if there is a 21 due as it may be quicker!  There is also the tram - stops are a short walk away.  It is on line 4, but the Costa Blanca stop, on Line 1, is also only a slightly longer walk…", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r482436781", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Short break ", "review": "Excellent location near beach and tram stop. Clean,friendly and an ideal spot for a break. Stayed for 4 days and couldn't fault it. The in house cafe is popular with locals too which is usually a good sign. Well worth the money. ", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r482002710", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good Hotel, Great Pool!", "review": "Dear client, Thank you for sharing your opinion with other travellers. Kind Regards", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r479471433", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Great for the price.", "review": "Visited here for a weekend with 3 friends. The hotel staff were friendly and spoke good English. We requested adjoining rooms which they had arranged for us and was really nice to be able to all be together still. The pool area is spotlessly clean and looked recently refurbished? Close to the beach and restaurants. The resort itself is absolutely beautiful although not many English areas. Would definitely stay here again.", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r479216528", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Clean,comfortable and near the beach!", "review": "Dear client, Thank you for taking your time and sharing your opinion with other travellers. It is nice to see that you enjoyed your stay with us. Kind Regards", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r473783536", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good, clean hotel", "review": "The hotel is a little bit tired and could do with a bit of modernisation to bring it into the 21 century,  but with saying that it is spotlessly clean, rooms are a good size with good size balcony.  The beds are comfortable but it gets a tad noisy in the mornings if like me your not an early riser      There's a pretty big pool with sun loungers, and a cafeteria area with a bar. The restaurant was disappointing. It had zero atmosphere and was basically just a plain big box room with undecorated tables. It's a shame because it looks out onto the pool and it really wouldn't take much to make it more appealing to want to eat in.   The area where the hotel is situated is very quite. It's close to the beach, around 50 meters. You can get to Alicante City Centre very easily either by…", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r472149910", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Typical 3 star hotel", "review": "For the low price you pay its a good hotel. You get exactly what you expect nothing less, nothing more. The location of the hotel is incredible good. The people are friendly. The hotel is definately outdated but still all is functional. The breakfast buffet is really simple, even eggs are not offered. But the restaurant/snackbar in the hotel has a good breakfast for a very reasonable price. For sure  a place i will go back to! For these low prices its a very decent place.", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r471915164", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Very good clean, comfortable hotel", "review": "Dear client, Thank you for sharing your opinion with the rest of travellers. It is nice to check that you enjoyed your stay with us. Kind Regards", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r468385942", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Wouldn't visit again", "review": "The hotel is very clean and the staff are friendly and helpful.  Our room was clean and spacious.  Exactly what we asked for when booking, with a lively balcony with good views.  We had a couple of minor issues with the room that were sorted immediately. We found the food to be reasonable, although the hotel is well located with lots of restaurants nearby. Would stay again and would recommend", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r461754877", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Average passing through", "review": "Visited recently. Whilst the room was ok, cleanliness was not of a high standard, just because it is a 3 star hotel does not mean a paying guest should expect 3 star cleanliness. The grout around the bath area was dirty and Would have benefitted from being re-grouted. The hand rail was not secured to the wall tightly so had anyone (someone elderly for instance) tried to use this for assistance out of the bath. They could have had an accident!!  Waiter in the restaurant was rude and clearly too I bridge to having to serve. We had to ask for plates for the bread, (which when we picked up to eat was stale!!) was stale, that he plonked on the table, he returned with saucers!!  He had a 'couldnt be bothered attitude'. At breakfast I went to take an orange and literally put my thumb…", "date": "January 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r461051677", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Solo visit for a friends wedding", "review": "Dear Guest, We really appreciated your feedback which is received with gratitude since our guests opinion in regards to your experience is very important and assistance to us. We are sorry that we were not able to fulfill your expectations, your feedback has been comunicated to the management department. Best regards.   ", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r459721391", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "OK hotel", "review": "Nothing exciting. Very average hotel located in San Juan beach. The rooms are adequate, some with balconies overlooking the city/ocean, but a bit on the older side. The pool was nice. The location is the best thing the hotel has to offer.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r445342395", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Lovely Visit", "review": "Dear client, Thank you for sharing your opinion. We will keep working in order to improve our services and make our clients stay as comfortable as possible. Kind Regards", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r445154352", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "never again", "review": "We just got back  from staying at Castilla last night after a weekend break. Our room was really comfortable and clean. Staff were really helpful and always had a smile. We loves this Hotel, the breakfast was fine, waitress was nice and polite. There was extra blankets in our room which helped because the winter month. We used the public transport with ease to get into Alicante and was really cheap fares. definitely coming back.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r439063742", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Great hotel", "review": "Dear client, Thank you for your nice review. We are happy to see that you enjoyed your stay in Hotel Castilla Alicante and the area surrounding. Kind Regards ", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r435826501", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Probably Not Again", "review": "Stayed here 2 weeks ago a break before christmas.we were put in an ajoining room heard everything going on next door!!!wouldnt give us ice to take to the room , we offered to pay for it.we had dinner once in the hotel,3course €12.50 reasonable yes dessert wait for it!!!!1kiwi fruit on a plate accompanied with a knife and fork.Breakfast staff no personalitys at all.Cafe staff not much better except for1 guy very pleasant with a beard sorry I foget his name.Would not recommend this place to anyone they cater for Spanish visitors certainty not from the UK.", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r435425760", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "great hotel", "review": "Beautiful hotel  staff lovely especially the gentleman at the front desk can't remember his name his second name Jose printed all our airline tickets so helpful thank you again for making our stay so pleasant   The Breakfast was lovely staff in breakfast area very helpful we are looking forward to our next holiday in this hotel Beautiful lunch served in bar every day This hotel is spotless a big thank you to the girls that looked after our room every day", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r433785308", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nice Hotel", "review": "Dear guest,  Thank you so much for your nice review.  It is nice to see that you enjoyed your stay with us. Kind Regards", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r429150990", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "BEWARE..... Don't do half board", "review": "We spent 4 nights at this hotel on a dinner, bed and breakfast rate.  The hotel is well situated with bus stop right outside the door, was 100 metres from the beach and had plenty of nice restaurants nearby.  The room was clean, was of a good size and had a nice balcony.  The bathroom was smallish but was clean and had a shower/bath which worked well. The dining facilities were good and both breakfast and dinner were more than adequate.  My only fault was that you could not leave the dining room with a coffee, which I found a little irritating, especially in the morning.  The staff were all very professional and polite and we would not hesitate to return", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r429095392", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Short Break ", "review": "Dear client,  Thank you for taking your time in sharing your opinion regarding our hotel. We are happy to check that you enjoyed your stay with us .", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r428775423", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Short break", "review": "The food , what little there was , was tepid & slung on to the table like someone would a frisbee. First impressions, the hotel is a typical 8 floor \" Costa 3*\"......a well presented building in an absolutely marvelous location. 10 out of 10. The reception staff and booking procedure was excellent. The bedroom large, clean with good bathroom & balcony. The Bed was extremely comfortable. Evening meal was a very poor menu and the two waitress's were rude ignorant and totally unprofessional. When the food arrived it was cold and consisted of two pork skewers & 6 fries (the other choice fish stew) which was launched onto the table with s Kurt grunt. Throughout the meal it was obvious that they were arguing (loudly) making the whole dining room feel uncomfortable. The quality of the…", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r428509931", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Clean, family friendly ", "review": "Lovely service, family friendly, kids playground in front of the hotel. Bus stop outside the hotel, very handy, 25 minutes to Alicante centre. Beach few hundred metres away. Clean. Room was serviced every day. ", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r428266178", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "nice location", "review": "returned just a day ago from here and was pleasantly surprised with the room balcony was of a nice size and overlooked the pool, there are high rise buildings around but this did not really affect our view.the room was clean and so was the bathroom although this could do with a bit of an update,the staff at reception were really friendly and helpful with questions that we asked. the only thing i would recommend is that a kettle and cups be put in the room. the location is nice the beach is lovely and most restaurants were open.weather was 26 degrees", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r427702831", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Ok for price", "review": "Dear client,  Thank you for your review.  We will inform the management regarding your suggestion. Kind Regards", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r427046560", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Satisfactory", "review": "I must say I was disappointed when I got my room mainly due to the balcony. It was so small I could not even fit a chair! My room was also quite small but this may be because it was for one adult only.  On one night there was a cockroach on the ceiling but to be fair, I think I was just unlucky as the rooms were cleaned on a daily basis. The location is great, only a few yards from the lovely san juan beach, bus stop right outside hotel and londres tram stop only 2 blocks away. The pool is also nice but with a lovely beach on your doorstep it feels like a waste of your time.  I recommend this hotel for those who plan to make the most of the beach and do some sightseeing around costa blanca. If you prefer to spend the majority of your day in the hotel you may get a little bored.…", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r427037713", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great Location but surrounding by high rise buildings!", "review": "Dear client;  Thank you for your comments, they are very just and it makes us happy to know that you enjoyed your vacations.   We recommend you, if you wants terrace in the next stay request double room for individual use, you will be fascinated  We hope to see you soon.  Regards Ana Sarmiento  ", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r425759875", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Cheap and cheerful and close to the beach ", "review": "We chose this hotel as it was inexpensive and close to the beach.   Breakfast was nice, plenty to choose from bacon, sausage, scrambled eggs, bread, toast, pastries (go for the chocolate donuts!), fruit, cereal, juice, tea, coffee, cheese, ham etc.  Room was a little dated but fine for what we needed. It was a good size, clean etc. We didn't find any English TV channels but that's probably a good thing! Free WiFi is available throughout the hotel and it was good enough to watch Netflix on!  Location was excellent for the beach. You can see it from the higher floors it's only a couple of minutes walk away. We had to walk a bit for a tram direct to Alicante but only maybe 15 minutes and you can walk along the sea front for most of it. Its mainly a residential area and but there…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r425208728", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Perfect location and holiday", "review": "We booked this last minute for a long weekend away in mid September. The hotel was great! Firstly, the location is amazing, you can see a part of the beach from the balcony and we were less than a 5 minute walk away. The tram stop was very close which we used to travel to the town and other parts of Alicante, in addition to 2 bus services outside the hotel. The pool was great and breakfast was delicious (pastries, Parma ham, bacon, egg, fruit and cereal). The rooms were basic but super comfortable, bathroom was modern and clean and I was impressed that all were cleaned daily!  Overall a very good experience and I would recommend it to everyone. We spoke to a couple who usually stay here, but decided to stay at Holiday Inn this year. They mentioned that Castillo was much better…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r425191815", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great hotel, only yards from San Juan beach", "review": "This hotel really has everything you could ask for.  Good size room, comfortable beds, good shower, daily clean, free internet, friendly, helpful staff.  The hotel is surrounded by bars and restaurants and is only 50m or so from the beautiful beach of San Juan. Only one minor complaint - no English TV channels.", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r424378630", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great location", "review": "Dear client,   Thank you for taking your time in writing this review. It will be useful for other travellers. We are working to have more than one English channels for our clients.  We hope to see you soon.  Ana Sarmiento ", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r423325807", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great Hotel", "review": "Hotel is about 200 metres from a fabulous beach.very safe for swimming.loads of amenities for children on or near the beach,skate park,climbing ropes pirate ship with slides etc.numerous cafes,also Burger King,McDonald's,if the children want the usual nuggets etc. Loads of restaurants near the hotel,also supermarket,bars.tram stop near hotel,bus stop outside the hotel,if yo want to visit Alicante or explore other parts of Valencia. The hotel rooms were grand,good shower and  air conditioning. Breakfast was disappointing,same every day,scrambled eggs,pale sausages,greasy rashers.coffee was good.would book room only when I return.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r423192381", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Bad food", "review": "The hotel and the Alicante beach was good and clean. I was satisfy with it, but the food was bad quality and poorly.The other guests doesn't like it too. If i go back again i don't pay for food........... ", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r422800758", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Good location and spotless", "review": "Dear client,  We are sorry that you did not enjoy hotel lunch/dinner. Our meals are homemade and we always try to do our best in order to offer good value for price and satisfy our clients demands. We apologize for not being able to achieve your expectations. Kind regards     ", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r422627138", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very good value and close to the beach and bars/restaurants", "review": "Location is great, the tram passes by every 30 mins from central Alicante, about a 20 minute journey. The hotel is very clean, well organised and our room was great, everything worked and daily cleaners did a fine job. We found quality and value in the hotel very good, in fact it was also a nicer ambience than most bars.   The pool was clear and a good length. Games and lilos are not encouraged but this was a sort of blessing for a lazy few days.  The beach, about 75m away was very good with clean fine (hot) sand and clear water. It is relatively shallow and very enjoyable.  All in all I cannot fault the hospitality around town (San Juan) and in the hotel.  Thanks for a nice stay.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r422469758", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great location value for", "review": "Dear client, Thank you for your nice review. We are happy to check that you enjoyed your stay with us. We hope to see you soon. Kind Regards ", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r419145216", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "FAB location!", "review": "My wife and I stayed here for a long weekend in September. The hotel is clean, the staff very polite and friendly and the bar very reasonable. The bus stop to and from Alicante centre is right outside the hotel. Breakfast was OK but a little pricey as an add-on the our room charge. It certainly excels as a 3* hotel and we would definitely return, albeit without the breakfast.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r413506476", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Excellent customer service, great hotel ", "review": "Fantastic hotel for the price. The staff were very professional and friendly, English speaking. Really enjoyed my stay here. The beach was a few steps away and the pool always had free sun beds. I couldn't recommend highly enough. I will definitely return. ", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r413319980", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Location, location, location", "review": "Fantastic position,50 metres from the beach, and there must be 50+ restaurants within 5 minutes walk. Pool was great, rooms were dated, and beds were very hard and uncomfortable, to the point by the 3rd night we asked for a change in mattress. Staff were much obliging however and it was no problem. Wi-Fi excellent, breakfast ok.   Good transport links, with tram and buses to central Alicante just outside hotel.  Staff were great too.  Would I stay again? Depends on other options but if you want a base to enjoy the plethora of restaurants and beach activities at your doorstep, you can't go wrong.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r412388041", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great hotel great location", "review": "Dear client,  We kindly apologize for the inconvenience with matress. We will try to do our best in order to avoid this kind of problem in the future. Thank you for your kind comments. Regards. ", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r404499664", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very clean and pleasant hotel", "review": "My name is Tom from Ireland. I stayed here in August 2016 with my girlfriend. We had a great week. Clean, very close to the beach, great variety at breakfast. Good Spanish tourist area on San juan beech, which is a great beech too. Staff very friendly and the cleaners done a great job all week.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r403519173", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Perfect holiday", "review": "Dear client,  Thank you for sharing your opinion.  We are happy to see that you enjoyed your stay in San Juan beach. Kind Regards  ", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r403484029", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "just a little bit more and they will received 3 stars from me", "review": "old, 2 lifts for all the hotel, very old ones.... only have breakfast there one day, the rest eat outside and was pay in advance for the 4 days. towels so small you need 2, and i can continue but enough.. will not recommend , no go back is the staff lear to smile or bee attentive  will be a bonus. every question is like you disturbe them.  to charge 2 euros for the safe a day is ridiculous.... is like to charge for wifi this day. is part of the service.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r399960975", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Lovely hotel, great location", "review": "Dear client, We are awfully sorry that your holidays in the hotel were not so satisfying as expected. We will have your comments in mind in order to keep improving the service to our clients. Kind Regards ", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r397305151", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Never disappoints", "review": "Stayed her for 1 week in june. Lovely hotel, very clean, great pool area. Hotel is a very short walk to beautiful beach, with great promenade. Had buffet style breakfast in hotel, good choice of food. Lots of restaurants close to hotel, although many didn't have a lot of English. Lots of local food and tapas. There is a bus stop into Alicante right outside hotel, and a tram stop just up from there. I would highly recommend this hotel, location is perfect, very spanish feel. Alicante city is 20 minutes away if you want busier nightlife, bus's and trams very regular.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r392197501", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Average", "review": "Dear client,  Thank you for sharing your opinion with other travellers. We are happy to know that you enjoyed your stay with us. Kind Regards", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r390457772", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Always good for me", "review": "Just returned from our second stay at this hotel on bed & breakfast basis.  Very clean & comfortable 3 star hotel with excellent location.  One block from a beautiful beach plus bus & tram stops outside the hotel for 25 min ride into Alicante town. Good buffet breakfast with plenty of fresh fruit & all the usual breads hams & pastries etc, Spanish style.  Cafe Bar has good choice of snacks for lunch & dinner with excellent service & pleasant area for drinks. Nice pool with plenty of sunbeds.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r389176089", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very lovely, tidy and pleasant...didn't want to leave!!", "review": "Came here with my boyfriend on our first holiday (7 days). Was a bit apprehensive having read some of the reviews beforehand. I must admit, I have no clue what they found bad with this hotel!  We emailed ahead to ask for a double room on a high floor and we got what we asked for.The bed was the most comfortable hotel bed I've stayed in and was well needed every night. We went with bed and breakfast and the breakfast was soooo nice! Pastries, doughnuts, bacon, scrambled egg, cereal, bread and rolls, meat, muffins - there was something for everyone. Served until 10:30 so we could still have a lie in every morning. The pool was always cool, which was lovely in the midday heat, although when you get in, it's freezing (so just go for it) and it had rather strange opening hours (10-3,…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r388057708", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Dangerous and non existent guest relations", "review": "Dear client, Thank you for your review. We are pleased to check that your stay with us was satisfactory. Kind Regards  ", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r387702926", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Lovely hotel", "review": "On arriving we were convinced into upgrading to a \"premium\" room which was fine. We got to the room where it was expectedly warm so switched on the air-con and went for a walk. Upon our return we found the air-con dripping over the floor making it slippery so reported it to reception who said they would send someone up. We went to the pool and returned to find someone had been in the room and installed a towel on the floor where the water was landing. I again questioned this at the reception where I was informed that this was \"normal in the summer\". I told them it was unacceptable as I had  3 year old who would be running about and it would obviously be dangerous. This fell on deaf ears. I then went back to the room and as the air-con had been running for some time now the water…", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r381645880", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very clean hotel in quiet location", "review": "Dear Sir,  We are sorry that your stay with us were not so pleasant as you wished , but sometimes airconditioning breakdown happens. We tried to sort it out as soon as possible. Because of that we offered you to move to another room that was the one that you inicially contracted. We had no other Premium room available , otherwise it would have been offered to you.   We apologize once again for the inconvenience . Kind Regards ", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r381120196", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Staying in ", "review": "Stayed here for 5 nights. Located 5 minutes walk from the beach. Really nice area. Not very touristy so brush up on your Spanish.  Transport into Alicante city is right outside the hotel. No 22 or 21 bus will take you into the city in 20 minutes.  Staff are friendly and room was nice. Although we had 2 single beds which wasn't ideal for a couple. Nice pool area and nice breakfast.  Would stay here again on my next visit to Alicante  ", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r380861258", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Great hotel", "review": "Just returned today from the castilla and what a fantastic hotel this is everything is spotless the food is lovely and always found something to enjoy at breakfast you can have back bacon and eggs cooked at the grill,rooms are spacious with plenty wardrobe and drawer space the maids are in every day cleaning and leaving fresh towels the pool area is relaxing and no need to rush for sun beds there was always plenty to go around a special mention has to be for Jackie she goes out her way to make sure your having a comfortable stay and nothing is any trouble for her,also thank you castella for the card and champagne on my husbands birthday.i cannot recommend this hotel enough well done to all the staff x", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r379117868", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Comfy hotel near Alicante", "review": "In May I went for a weekend break with one of my friends and we chose hotel Castilla Alicante for its good price and good location. It's around the block from the beach, 5 mins walking and you're standing with your feet in the sand. It's a very broad beach which was not overly crowded and mostly locals. Near the hotel are many small restaurants where you can have great tapas. Excellent way to practise your Spanish since they speak little English. 😊  The hotel is comfortable and clean. Not the newest but with fresh towels every day and the bed slept wonderful. Only negative point I could say is that the rooms are a bit noisy. You can hear the neighbors but also the bar across the street that's open until early in the morning. The hotel also has a good swimming pool.   Close to…", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r379082541", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "No frills but clean and comfortable ", "review": "Dear client,  Thank you for your opinion. Your review can be very useful for other travellers searching for a hotel in Alicante.  Kind Regards", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r378303837", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent stay will stay again!", "review": "We stayed here for only one night as we were travelling up to Valencia. For this reason I can't give a lengthy detailed review.   We found the hotel to be clean and the bed was comfortable.  The staff that we encountered were always polite and helpful.   The breakfast was okay,  pretty much the same as most places.   We sat by the pool for a couple of hours but didn't swim.  For what we wanted for the 24hours we were there then it was fine. I'd probably book again if the price was right and I was on another short trip.  I'm not sure I'd want to stay there for anything more than a few days though.    ", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r375398268", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Short break", "review": "I really enjoyed my stay here found the room very tidy and clean beds where comfortable. The views where amazing of the sea, very ideal as it is a 5 minutes walk to the sea. The staff where very friendly and helpful, service was fast and efficient. I didn't get to try the swimming pool but looked nice will try it next time.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r374658062", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Big Tower Block Hotel", "review": "Stayed for just one night.  The room was good, with a comfortable bed, average shower and bathroom.  The hotel is a tall tower block with a balcony.   The food was good for a tourist grade hotel, and offered good value for money.", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r373500334", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "2nd Visit", "review": "Dear client, Thank you so much for your nice opinion regarding the hotel. We keep working in order to improve the services provided to our clients.  Kind Regards", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r373366898", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lacking facilities ", "review": "We stayed for 9 nights b&b and had a great time using the hotel as our base to explore.Our room on the 7th floor was good with some seaviews,and the housekeeping kept it spotless. All the hotel staff were friendly,polite and helpful,Antonio in the bar was great and a big thank-you to Celia on reception for helping me to recover my mobile phone that I had dropped on the seafront esplanade.With great transport links bus and tram by the hotel it is easy to get either into Alicante City centre,or up to Campello,Benidorm,Calpe or Denia  and the prices for tickets are so reasonable ,especially if you purchase a 10 or30 journey pass.You can recharge these on the Tram ,Kiosks,or the main Tram stations .Thankyou Hotel Castilla for a lovely holiday", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r365236203", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Interesting", "review": "Dear client,  Thank you for sharing your opinion with other clients. We are happy to know that you enjoyed your second stay with us. We hope to see you soon.  Kind Regards.", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r363647831", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Close to the beach...", "review": "It should have kettle in rooms for hot drinks as most people have mentioned. Once restaurant closes there's no where to get one it should cater for us Brits incl fry up at breakfast. Brits don't eat cheese & ham for brekky. Won't allow u to take cuppa up to room from breakfast area I got chased by the waiter very funny indeed although I had paid extra for this. Won't use again. ", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r363418665", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Stayed here 3 times and loved it", "review": "Value for money is excellent at this hotel. Buffet breakfest is lovely with even cooked hot food. Location is the best aspect of this hotel as its literaly 3 minute walk to the beach. Staff here are very friendly and rooms are very clean & nice. When I return to Alicante I will certainly be returning to this hotel.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r362975509", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Great 3 star Hotel", "review": "Dear client,  We are really happy to see that you enjoyed your stay with us . We always try to do our best so that our clients feel like home. We will keep working in order to do it even better.  Thank you for your opinion. We hope to see you soon.  Ana Sarmiento ", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r360644736", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Flight canelled, extra few days holiday!", "review": "We really enjoyed our stay here.The hotel is in a great location and is clean and modern with nice large bedrooms and a decent size balcony.We only ate here at breakfast as there are many restaurants locally or an easy tram ride into Alicante city.We had a nice beach view and a lovely spacious terrace we also found all the staff very friendly.I would come to this hotel again if i am ever in this area.", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r359080379", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Holiday", "review": "Dear client,  Thank you for sharing your opinion regarding our hotel and San Juan beach with other travelers. It could be very useful for them. We are content to know that you enjoyed your holiday here.    We hope to see you soon.    Ana Sarmiento ", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r358471797", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Unpleasant hidden extras", "review": "We ended up here not by choice , but rather due to the French Air Traffic Controllers going on strike and our Ryanair flight being cancelled! We got here very tiered and depesperate for bed at 0430, after a day trying to get home! The receptionist at that time of night was very quick and efficient even having to take all out details and photocopy all out passports, there was about 40+ on our bus from the airport luckily we were first off the bus so can say how long others had to wait, but the lady was as quick as she could be. We were given adjoining rooms which was good for us as made sorting stuff out easier, the rooms had no fridges or cooking facility's but did have hairdriers in the bathroom. we had breakfast there which was fine, the bar served to order pizzas etc later in…", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r357493344", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "still here", "review": "Unhappy with evening food have let it go untill now but will have to speak to someone in the morning, had to send food away but with two more days to go might have to eat out and try for a refund for to days meals.", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r355386727", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Perfect location for a City or Beach holiday", "review": "Dear client, We are sorry to hear that dinner was not what you expected. We will keep working in order to improve the services we offer to our clients. Thank you.  ", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r352160897", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great value hotel", "review": "We have stayed at this hotel twice now (both off season) and we love it. I have mobility problems but everything was so accessible and the hotel staff helped with any request. The rooms were very clean and comfortable. It is only a 2 min walk to the lovely sandy beach of San Juan. Lovely palm trees and lovely authentic Spanish restaurants. The hotel also has a lunch/dinner menu if you felt like staying in for only E12.50 (includes 3 courses). This area does not have the 'Benidorm tourist' feel which is a welcome change. Some restaurants have ''menu ingles' if you ask but you quickly learn what the Spanish words are especially if you are used to ordering tapas.  If you want to escape the beach, you can be in the city centre of Alicante in 20mins either by tram (stop Londres 2 min…", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r349160378", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very nice hotel with good access to Alicante city.", "review": "Dear client, Thank you so much for sharing your opinion with other clients. We will keep working to make our clients stay as comfortable as possible. We hope to see you soon.   Thank you.  ", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r334448708", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "perfect hotel, poor food", "review": "A good looking, well maintained1960s hotel, one block from the beach. Easy parking outside. Friendly reception staff. We stayed on the seventh floor. The on suite room is typical of holiday hotels, king size bed, ample storage, balcony and good sized bathroom with plenty of hot water. This hotel is great value for the money.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r325544503", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great value for the money", "review": "A busy hotel with hundreds of guests on holiday. You notice that at breakfast time. Apart from that, clean, friendly, with staff willing to help you. The room was large and clean, with a large balcony with a table and two chairs. We could see the sea between two huge buildings, but San Juan is not exactely a desert Island. Parking for a small fee. Altogether a very agreeable stay with nothing to complain about.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r318343921", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "value for money", "review": "Dear Customer:  Thank you for your comments are very positive and we are grateful. The satisfaction of our customers are only nustros interest. Thank you .  Regards .  Ana Sarmiento", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r317769118", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Fantastic placement and good service", "review": "staff are friendly and helpful, rooms were a good size for 2, good decor and always clean. the WIFI is free and no complaints with the signal strength in the room.  breakfast was ok (continental type). the pool area was ok but had to move about or you ended in the shade the pool opens at 10.30am so no problem with people leaving towels on sunbeds in any case the pool area was never crowded plenty of parking spaces nearby if you were lucky you could park at the front door.about 100m from a tram stop (Londres) which was great for going into Alicante and easier than taking the car, cheap as well. the local area has bars and restaurants of which there is a good choice most of the other holiday makers are Spanish and you actually feel like you are abroad, nothing like benidorm etc.…", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r317687255", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Disappointed", "review": "Dear Customer:  Thank you for your comments.  With customer feedback know the beach area of San Juan perfectly and our establishment perfectly. Thank you .  We hope to see you again,  Regards .  Ana Sarmiento", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r316227780", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Excellent Hotel and surrounding areas", "review": "W visited this hotel in the off season just after the tourists went back to Work.   The Hotel is clean and has a good service level. The staff is polite and helpfull, but be sure to brush up on your spanish because only a few speak English.  The restaurant is good and so is the breakfast.  The placement of the hotel is fantastic - 2 minutes to the Beach. This makes fantastic morning trips running along the Beach in the sunrise possible. I imagine that the main road could generate some noise during the tourist season.  There are restaurants nearby so you need not fear going to bed hungry.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r315148182", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Quite basic but very nice hotel", "review": "Our first visit to this hotel, it is quite basic but very nice & modern the quirky art work & furnishings very nice!  The hotel is kept spotlessly clean and our room was cleaned beautifully  every day and smelt so nice and fresh when returned after breakfast. The staff are very friendly & helpful but many don't speak a lot of English so if you can speak a bit of Spanish it helps! But don't worry you will get by! I think they just appreciate it if you try to use a few words of Spanish - on that note ,  the area of San Juan is populated mainly by Spanish people  unlike places like Benidorm, and again knowing a bit of the language will help you .   As with most of the costa blanca restaurants did not seem to start serving much before 8.30-9pm most nights and at the time we went…", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r309646357", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A Lovely pool and simple room", "review": "Dear client,  Thank you for having taken the time  to share your opinion. It will help other travelers.   We are really happy for having met your expectations and we hope to see you soon.  Regards.  Ana Sarmiento", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r309435739", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good hotel near the beach", "review": "We decided to leave our apartment in Alicante town and head to san juan beach to get a different feel, and decided to stay at the Hotel Castilla.  I love to swim everyday and Hotel Castilla has a great pool to swim in. The room we had was spacious, quiet and comfortable, apart from the fact that on the 1st day one of the chambermaids happen to \"leave our door OPEN\" and we had over £7000 worth of computers in the room. That was very disappointing to us as we use our computers for our life. Having said that the man at reception was very apologetic about the fact and assured me it would never happen again, and it didn't . Thank God!  We travel all over the world so It's important in our eyes to deliver a true message to other travellers of what is good and what is not.  We found…", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r307865010", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "a great budget hotel near the beach", "review": "Thank you for your review.   First of all, let us apologize once again for the problem regarding your room´s  unlocked door. We assume it was our fault and the management took the appropriate measures so that it does not happen anymore to any other client.  On the other hand , we are sorry your stay was not as pleasant as it should have been  but we keep working to improve the service provided for our 3 stars hotel.  We hope to have the chance to have you with us in another occasion .  Regards Ana Sarmiento", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r292354638", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great value hotel", "review": "We booked this hotel last minute for a few days holiday of relaxing at the beach.  We got a taxi from Alicante airport which cost €35 and took about 20 minutes to get there.  We couldn't check into our rooms until 1:30 so we had a little bit of time to wander and explore the area.  We booked a twin/double bedroom and we ended up being given a larger room with 2 comfy double beds and a view of the pool and sea.  The room was pretty basic but met most of our needs.  There was aircon which was good, a balcony with a table and chairs a TV with a few English channels but most were in Spanish.  The bathroom was nice and big with a really good powerful shower.  Unfortunately there wasn't a mini fridge for us to keep our water in and although there was a safe you had to pay an extra…", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r292043851", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Enjoyable stay at this lovely hotel.", "review": "The first thing I have to say about the Hotel Castilla is about the amazing staff. From the moment we arrived and throughout our stay, they were all pleasant, courteous and friendly, in a genuine but understated way. The reception staff speak excellent English and make the effort to be as helpful as possible. It is a Spanish hotel catering mainly (but not exclusively) for Spanish visitors, which we loved. So don't choose this hotel if you like what a typical 'British' Benidorm hotel has to offer because you'll be disappointed. The rooms were spacious and clean, we had a huge balcony with an inland view and sea glimpse. It was very quiet except for the air-con, but it did its job in keeping us cool. Breakfast was included in our deal and there was a great choice, we had scrambled…", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r288420781", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "very close to the beach", "review": "I recommend this hotel because its location very close to the beach (5 min) and from other means of transport that can take you to the city of Alicante. Like other hotels in Spain, the wifi connection is very bad an you only get password and user name for 3 days in a row. We went in June and the hotel and the entire Playa de San Juan area were 80 percent full of old people.", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r286017804", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Far from Alicante, but near to the best beach of the zone", "review": "The hotel is situated right beside the beach in a quiet little village close to Alicante. The rooms are very clean and the wifi works good enough in all the structure. Breakfast is not included and should be payed apart, but many cafè are around the hotel at cheap price. Not suggested for a visit of Alicante buy in a perfect position to enjoy the beach.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r276079784", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "A pleasant hotel", "review": "Stayed here for 2 nights recently, room was basic but a nice size and very clean, we had a balcony with a view of the pool and the beach. Hotel is situated within 2 min walk of a lovely beach. Staff are very friendly and helpful, we'd booked bed and breakfast and the continental buffet breakfast was a nice start to the day without being ground breaking. The hotel is a little out of the centre of Alicante so was fairly quiet in the evenings but plenty of cafes, shops, restaurants and bars within easy walking distance. The centre of Alicante is about a 15 euro taxi ride away. Would definitely come back.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r274851395", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Absolutely Recommended", "review": "Hotel Castilla Alicante, to book a room:  For those wanting to know how to book it, this is how it went for me and it was painless. First I sent an email inquiring the room and when they replied with availability, they asked my credit card details so they can charge 25% of the total amount to confirm the booking. As I did not want to send anything via internet, I gave the details by phone and they did the charging of 25% on my credit card while we were still on the phone (!) and by then they confirmed the booking and confirmation was also sent by email. Upon arrival, they checked your passport and signature thoroughly before giving you the room. I am impressed with their tight and securely procedure and I must say it was like that everywhere I went in Spain.  Email address and…", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r271091233", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Brilliant Short Break", "review": "My husband and I have just returned from a 4 night break and we stayed at this hotel. I have to say that all staff were very friendly and nothing was too much trouble. The hotel in general was very clean and during our stay the reception area was being re-vamped, the end result was stunning. A short walk down to a beautiful beach and the views of the mountains took my breath away. We only ate breakfast in the hotel as we were out and about every day, but the choice was good, including eggs, bacon and sausages for those who like a cooked breakfast, and plenty of choice if you like the continental breakfast.   We used the tram service every day and found it a useful and relaxing way to get about. We found the stop at Londres was the closest to the hotel and it took approximately…", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r269633205", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Estupendo ! Por que ? 3rd GREAT visit in 12 mnths.....", "review": "Estimada clienta,  Muchas gracias por su comentario, como bien ,dice estamos mejorando nuestras zonas comunes, cafetería , recepción y restaurante , en breve estará todo terminado.  Espero que en su próxima estancia pueda disfrutar de todo .   Gracias por su confianza .  Saludos", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r263386844", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "These guys are the best", "review": "Hola buenos dias : I cannot believe that I been to this hotel 3 times in a year ish.... !!!! So, WHY? Well, where do I start..... ?  As usual the hotel stands out due to it cleanliness... Not sure if its me or whether Hotel Castilla spend more time cleaning the hotel than others but...  That's how it seems to me..... so fresh, so clean.... As always the interior is equal to the interior.... Yes, I've said similar before but what make it special to me is that the standard is CONSISTANT !  The same goes with the staff..... All I can really do is to confirm all the very positive things that have already been said... NOT ONLY by me but others......  Playa San Juan ; The Mediterranean sea kisses the ultra soft, clean sandy beaches overlooked by local people taking a walk along the…", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r244167525", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Perfect location and efficient hotel staff", "review": "Estimado Cliente ;   Muchas gracias por tu opinión es muy valiosa para nosotros .  Le esperamos el próximo 2016 .  Saludos   Ana Sarmiento", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r236623032", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Value for money", "review": "We visited Hotel Castilla Alicante in October for the third time in the last 5 years. Although we knew what to expect, friendly efficient staff, good clean hotel with nice facilities and walking distance to the beach the reception staff really went out of their way to help us. On arrival at about 11PM I had left one piece of luggage, a carry bag in the taxi, and as the taxi sped away I stood at reception explaining to the two gentlemen my predicament, I had no idea who the taxi firm were, no taxi number reg or anything. The reception staff told us not to worry they would sort it out. On coming down to breakfast the following morning we were informed that they had located the taxi and my bag would be returned to the hotel by 12 noon that day, sure enough it was and completely…", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r236418930", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Don't be put off by the basic interior decor!", "review": "As other reviewers have said, this hotel does cater mainly for older Spanish guests. But don't be put off - because it's in a perfect location, with clean rooms and great English speaking staff - and superbly low prices! We stayed for 2 nights on the 8th floor (with lift access). Our huge balcony overlooked the main street (great people watching!), had good sea views (lovely sunsets), and looked down over the pool. The inside of the hotel is very dark, and a bit basic - but the rooms are large and clean and comfy. We did have a couple of niggles: the safe didn't work, breakfast was very basic, and there weren't any extra pillows - but these were more than made up for by the fact that the bus stop into Alicante town is right outside; the tram stop is 2 minutes walk; the beach is…", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r236154948", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Delighted with this hotel!", "review": "We were given a warm welcome here, the hotel was spotless and perfectly positioned to enjoy the delights of San Juan and Alicante. Offers great value for money, our room was large with a seaview and a nice private balcony. Caters mainly for Spanish, but reception staff spoke good English.  They booked a taxi for us to take us to the airport, all done efficiently and with a smile. This hotel is unpretentious, does what it says on the tin and we'd not hesitate to return.  San Juan feels like a million miles from Benidorm, which we could see from our balcony. Probably best suited to a more mature clientele, at least out of high season. The place seemed to go quiet around 11pm but that suited us! Plenty of life in Alicante city, ten minutes away for those who want it.", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r236031443", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Perfect choice!", "review": "We have just returned from an 8 day stay at this Hotel and have nothing but praise. On arrival we were given a room at the rear of the hotel (for all day sun) but asked to be moved to a higher floor with a sea view. This was done without any problem at all and minimal fuss and we were given a room on the 6th floor with a super kingsize bed and lovely view of the sea and pool. I would recommend a high floor room simply because of the fantastic views. Outside the hotel has a lovely terrace set out with tables and chairs which we made good use of during the day and especially the evenings. As per previous reviews the drinks prices are very reasonable ( 1.75 euros for an enormous glass of Sangria!) so it was lovely to sit out on the terrace after our evening meal and chat with other…", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r235056238", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great Hotel and Location", "review": "Great hotel just 15 min's outside of Alicante, very near an absolutely fantastic beach. Eating places nearby and small shops for everything you will need for your trip. There is a bus stop right outside the hotel which is great for getting around, bus 21 and 22 are for Alicante and back to the hotel. around the corner is a tram stop. The hotel itself is very clean and great helpful English speaking staff very professional. The room was great large and very clean serviced daily. The breakfast was a little weak on choice for fine to fill the tummy. The hotels weak spot would be Wifi is not free it must be purchased 1euro for 1 hour, 4 euro for the day. Try to not to use taxis I booked the airport taxi as arrival was late no bus on after midnight, never showed and got charged 42…", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r234688148", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Clean, Tidy, Friendly - good 3 star hotel", "review": "Just stayed for 3 nights whilst property hunting and found this hotel was ample for our needs. Very clean and smart, and friendly -  my only ask would be that there is a provision of tea/coffee facilities in the room, no worries really, but would just be that final provision for your customers  Drinks from bar are keenly priced and very reasonable, and a good mix of brands  Good location with bus and tram outside the front door, your only 5 miles from the centre of Alicante but have stunning beaches for Sun Juan on your doorstep.  Airport about 30 mins away in traffic", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r234107290", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "feedback", "review": "Very clean and staff very helpful. I would recommend for a peaceful relaxing break and close to beach. I also enjoyed the pool. The cost of bar drinks were very reasonable. The beach was amazing, although woul dhave liked a couple more bars to choose from.                     ", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r233004295", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Delivers what it says", "review": "2 x 2 couples looking for a short sunny break close to beach in a clean hotel with modern amenities. Castilla delivered every thing we were looking for, the exceptionally hot weather was a bonus! Some Brits searching for an English breakfast were the only glum faces, it is Spain and is obviously very popular with Spanish holiday makers. Can't think of any downsides.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r229619333", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nice Hotel, good location", "review": "Stayed at the Hotel Castilla for 4 nights in September.  We arrived about midnight and were greeted warmly by the receptionist who was very efficient.  Rooms were nice, clean and a good balcony to relax on !  We only stayed Bed & Breakfast and there was plenty to choose from.  English cooked was Bacon and Scrambled Eggs, every day ! but there was plenty of other options.  Hotel is situated just across the road from the lovely San Juan Beach so is ideal.  We did not use the pool facilities as we went to the Beach every day.  Outside is a bus stop which we caught a bus to Alicante which cost 1.45 euro, coming back we got a taxi as it was after midnight and it only cost 12 euros ! There are plenty of Bars and Restaurants nearby. Would recommend booking a Taxi back to the Airport…", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r228989047", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Clean rooms  Comfy Beds Large balcony", "review": "We booked this on the second day in Alicante at short notice due to previous hotel was a building site  This hotel saved the holiday . Would definitely recommend this to others Its a big commercial hotel not particularly quaint and a tad clinical but very good value for money .  Very clean . Great service and  close to beach  Could do with a fridge in the room but close to 24hr supermarket  Double beds were great and very big", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r228969293", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "wonderful", "review": "Second time here and will be coming again. So close to beach and transport in to Alicante town. The best vodka,served in a super large glass with loads of ice. Staff helpful. Hotel spotlessly clean. Only negative is short pool opening hours.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r226895978", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Great location and value for your money", "review": "We happened upon this great hotel when we arrived in the area looking for accommodation at midnight 2 weeks ago. We were thrilled to learn that they had a vacancy for us, and we were given a very nice room on the 7th floor with a balcony. We had views of the coast to the north and south (between some of the other buildings closer to the shoreline) which we thought was great, especially because the room cost only €140 including breakfast. Breakfast was great - a very sufficient buffet complete with cold items and a few hot ones. The pool and surrounding deck were excellent, as was the hotel's location - I enjoyed a beautiful 5 km morning run along the coastal boardwalk, which was merely a 2 minute walk from the hotel's front door. A beautiful never-ending white sand beach is also…", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r219878422", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Great hotel", "review": "We stayed at this hotel for four nights at the end of June, we arrived at the hotel 11am we were able to store our cases, as to early to go to our room, we went back at 1:30pm and our room was ready. We had a twin room on the fifth floor, Big room, nice bathroom, lovely big balcony, the only thing missing from the room is a fridge, but there is a 24 hour supermarket just a few mins from the hotel, where u can buy ice for your drinks, the breakfast was good lots of choice, the staff in the hotel were very friendly, the beach is fantastic only a few mins from the hotel,  we will be returning to this hotel, great value for money  ", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r215906949", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Perfect for a relaxing escape but the wifi...", "review": "We love San Juan, the beach the restaurants and this hotel is just perfectly located, it would probably become our first choice whenever we want to escape for a quiet weekend on a Spanish beach but not for more than a week-end, because unfortunately we can't live without internet for too long and the wifi connection in our room wasn't just good enough for us with the signal going on and off all the time. Apart from that we were very pleased with the hotel, still think is good value for money and still thing we will definitely go back for another week-end", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r215198897", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "What do you want?", "review": "Have been back from this hotel for a week and would return tomorrow if I was able to!  We chose this hotel due to the location and the facilities. It is situated in St Juan just outside Alicante and as said before in other reviews handy for the tram and the bus. The Tram Stop is just up the road and is named Londres and the 21 and 22 buses stop right outside and the adult fare into or out of Alicante is currently 1.45 Euros – to return to the hotel the 21/22 bus stop is by the port. It does not matter which one you get as the route only varies through the residential part.  We arrived and we were allocated room 620 which is at the sea end of the hotel and has the huge balcony with sun in the morning (sun rise over Benidorm) and shade late afternoon. Very clean and comfortable…", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r214987735", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Cant wait to go back", "review": "Had a wonderful week at this hotel, very close to the beautiful clean sandy beach. Very quiet and clean room with very spacious balcony with sea and mountain views. Read previous reviews so avoided eating in restaurant apart from breakfast which was more than adequate despite not serving hot foods. Staff spoke English and by reading the guide in the room we were able to change the tv channels to English which a previous reviewer said was not possible. Would have liked wifi in the room but there were sofas in reception area where you could use the internet. Buses directly outside door and very cheap to Alicante. Although the Town was quiet when we arrived, towards the end of the week it started to pick up and more restaurants and shops opened. so would probably go a little later…", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r210606261", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Relaxation", "review": "Just came back from a week in hotel Castilla lovely clean hotel the room had balcony with pool an sea view. Wifi only available in one corner of the hotel in front of reception a bit inconvenient but ok. Paublo bar waiter very helpful. Marianne at reception also very helpful. Transport second to none bus tram right outside the hotel. Great for 20 minute trip into Alicante city or Benidorm if you want to visit more lively places. As Playa San Juan  is a quite place!! Has a beautiful beach on you're door step  some nice shops restaurants particularly the Indian restaurant very friendly staff great food. Its a great place to stay mainly Spanish speaking but a few Spanish words learned are nice to have an appreciated. Will we come back? Absolutely!!", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r209434812", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "amazing", "review": "beautiful - to the room, pool, staff, resturant.. everything was amazing, 'perfect' should i stay, stayed for only a week with my family, the kids enjoyed every minute of it.. will deff be staying here again!!", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r208809025", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "A little gem", "review": "Just back from 4 nights at this hotel.  For €160 its great value. The room was lovely with lots of storage space. It could have done with tea and coffee making facilities tho!  Everything was spotlessly clean and the staff were very helpful and friendly. Every one we spoke to also spoke English. We did not eat at the hotel but did buy drinks. The room had air con but we never needed it as the room did nit get that hot.  We were given free wifi whuch worked in the room. The pool area was basic and a little noisy from surrounding traffic but it was never difficult to get a sun bed and easy to relax in.  The hotel is a 2 minute walk to the beach front which is lovely. The beach is long and sandy, lots of children's climbing frames and outside gym equipment and a great atmosphere. …", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r208137286", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good value", "review": "I'm writing this review on behalf of my 64 year old mum and her twoolder sisters! They stayed here last week in a triple room and paid about 60 euros each for 3 days. They said it was really good for the money, very clean, not much of a view from their room though but had a small balcony. The beach was really close and was very clean. The breakfast was good, your basic continental breakfast, but everything you needed. About 30 mins on the bis to Alicante. The only real downside that they said was that none of the staff spoke English. They found it very hard to communicate as no one understood what they were asking and they didn't seem very friendly. But overall a great hotel for the price.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r205424300", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Perfect for beach holiday", "review": "Great location with number of shops, restaurants and a beautiful beach basically at the doorstep. 20mins to Alicante city centre by bus which stops just outside the hotel (No. 21 & 22). Rooms and the hotel in general are very clean. I would definitely stay there again. Good value for money . Hotel bar and restaurant lacked atmosphere and the food was poor, but it wasn't an issue as there are plenty of restaurants in the area to chose from. Breakfast was cold buffet only, very basic and same every day.", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r204339967", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Perfectly adequate for purpose", "review": "We shared 3 single beds in a room and used Alicante as a base for rock climbing every day for 11 days using a hire car. With half board accommodation this meant we didn't have to think about food during our trip. Breakfast was basic, but adequate and the evening meals were varied, but not special. The  3 beers for the price of 2 offer meant we didn't really stray from the hotel in the evenings, having been out far and wide during each day. Our room was clean, well serviced each day and facilities were adequate. We always take our own travel kettle and T bags as there are never any in the rooms. Staff were mostly friendly and helpful and some spoke very good English. The free Wi-Fi was a bit variable and suffered at busy times. The beach facilities and hotel pool would be very…", "date": "March 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r199428677", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "EXCELLENT VALUE FOR MONEY - EXCEEDED EXPECTATIONS", "review": "For €42/night my expectations were not high.....having said that, I was very pleasantly surprised....large, clean room, great balcony and very comfortable bed.....friendly and helpful staff who spoke English.....many restaurants nearby, all within walking distance.....decent sized pool with sun loungers....breakfast barely adequate, however, and why no hot water boiler/cup for tea/coffee in the room?......it is beyond me why hotels do not provide this latter facility.....no English-speaking TV channel which was a shame...only need one channel.....nice to wake up and know what is going on in the world....overall exceeded expectations at the price so cannot really complain to any great degree.....", "date": "March 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r199148049", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Exceptional value, enjoyable stay!", "review": "I booked this hotel for a few days relaxing break in March 2014.   The hotel itself was extremely clean on the outside which made a good impression, and this was reinforced on the  inside.  The reception staff were very friendly, professional and helpful,  My room was basic but very clean, nicely furnished and comfortable. The only drawback being no tea or coffee making facilities in the room.  I had breakfast and evening meal.  The breakfast was a continental buffet with a choice of cereal, yoghurt, breads, meats, fruit juice and a coffee machine, the coffee being really nice!!  The evening meal was waiter service and was three course with a choice of starter and main meal and a variety of dessert.  There was fish, meat, salads, rice, potatoes and vegetables.  All of very good…", "date": "March 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r198671645", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Value4£", "review": "I stayed mid November, I'm sure it would be delightful when warmer! The hotel is clean and pleasant, lovely staff, very nice location close to an enormous immaculetly-kept beach. A standard \"continental\" style breakfast, which is perfectly adequate. Excellent value for money.", "date": "November 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r188648609", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Pleasant enough for the price", "review": "I stayed at the Hotel Castilla Alicante in mid October. The hotel is quite a distance from central Alicante but is easily accessible by bus (number 22) or tram. The journey into central Alicante is around 8km and takes about 30 minutes. There is a bus stop immediately outside the hotel and the tram stops aren’t too far away either.  The hotel is rather large and generally clean without being exceptional. The rooms are a standard size with television (and remote control), moderate size bathrooms with plenty of towels supplied and replaced daily. Shower gel sachets are supplied too but are hardly enough for a proper wash.  Free WiFi is supplied in three day blocks via a temporary username and password. Once it has expired reception will issue you another one on request. All the…", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r187880481", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Very enjoyable stay", "review": "I cannot understand how people are complaining about this hotel. I have just spent 5 days there and the staff couldn't have been more helpful. The Hotel was extremely busy hosting guests for the IPC competition. Many of these were in wheelchairs and I saw nothing but  hard work and helpfulness from the staff. The restaurant was fully booked due to this event but staff ensured I was looked after and received dinner. After a slight hitch with my booking my room was changed as soon as a larger one became available after the event was over. It may be a little old fashioned but it is spotlessly clean in the Hotel and and around the pool area. This is a 3* premises and I found it very good value for money. Well done Hotel Castilla, I will be more than happy to return.", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r182856390", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Great Weekend Break", "review": "My Boyfriend and I have just returned after a long weekend at Castilla. We got there the Friday morning and the check in was fine - we had been allocated one of the more superior rooms on the 5th floor (502) which didnt overlook the sea, but if you leaned out you could see it from the HUGE balcony! The bed wasnt the comfiest, but have slept in alot worse and had a good nights sleep! The bathroom was fine - quite modern and the room was clean. The only problem with the room is the lack of English Channels! only BBC news... Its about 50m to the beach, just under a minuite walk and its the most gorgeous white sand beach...and it has a lovely promenade for a good stroll in the evenings. It is quite far from Alicante, but you can get a bus for E1.45. And there is a night bus at the…", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r182054244", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "terrible service, not a bad hotel", "review": "The staff were very unfriendly, although the hotel was not so bad. Other things that werent so nice - the breakfast was appalling and the shower gel were in pouches which weren't all that easy to use and the quantity was too little. Good things: The hotel is really close to the beach and if you have a car there's enough parking nearby.", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r180898257", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Very Clean and Efficient", "review": "We very much enjoyed our stay. The hotel is exceptionally clean and very convenient for public transport into Alicante. All staff were friendly and helpful, with excellent English spoken by the receptionists - especially the lovely Fran! We would happily stay here again.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r180453859", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "clean and tidy", "review": "clean and tidy hotel. Two small lifts, stairs ok to top floor, 8 floors. Friendly reception. 150metres from Londres tram stop. Only slept at hotel so no food review, plenty of food outlets nearby, beach across the road. No kettle in room. Bathroom ok but basic. Rooms at the end of building towards sea have a long balcony. Beach is very good, tram service excellent, town has enough for a day or two to explore, castle good, tram to Benidorm for day out not expensive. No complaint overall.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r179965311", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good value", "review": "Stayed here for 2 nights. Staff very helpful and polite. A clean and well run hotel. The pool area was adequate and suffers from shade from the building next door, but could potentially get very busy. However most guests used the lovely San Juan beach 2 minutes walk away. It would have been nice to have direct access to the cafe though. You can park in the street right outside. Getting to Alicante centre is no problem, just get a 21 or 22 bus outside the hotel. They go all the way to the esplanade, about 25 minutes. €1.45 each way. There is a nice cafe in the hotel which seems popular with locals so we didn't use the restaurant. Overall a pleasant and well located hotel", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r178916902", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Excellent holiday", "review": "This is an excellent hotel with very helpful staff who all speak a little English, some were fluent. I recommend that you stay in Alicante at the end of June/ beginning of July. We saw an excellent Fiesta in Alicante where they build amazing structure from polystyrene all over the city which they then set fire to at the end of the week, After they have doused the fires the firemen turn their hoses on the crowd as part of the fun. It really was fantastic. The very next night there were fireworks on the Alicante beach at midnight, this went on for 5 nights to celebrate the start of summer. They were without doubt the best fireworks I have ever seen. We used the tram nearly every day because it is very cheap, costing only 8 euros each for a return trip to Altea which is a 2hr trip…", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r168524703", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very satisfied with this basic hotel", "review": "Spent 4 nights in May. Great location, spotless, food reasonable, agree with the breakfast being very very limited, being one meat and one cheese, but for the price I consider it good value. Pool area while small is nice, although being so close to the beach this didn't matter.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r168002045", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good hotel at a good rate", "review": "We stayed here for a weekend in July. The hotel staff were very friendly, the rooms were clean and the bed comfortable. The bathroom was clean and spacious enough.  The rooms all have large balconies with (plastic) chairs, so you can sit outside.  The hotel is close to the beach and there are enough restaurants in the area to keep you happy.", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r167941477", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice location, nice staff but not a very nice building", "review": "The location in San Juan, Alicante is great. Very close to the beach and as far as I know all rooms have seaview. We stayed in 2 rooms and had a nice view from both of them. We you get a room on the left side of the building (beach side) at the end of the hall you'll get a big balcony with your room. They called that room a suite but eventhough it had a kingsize bed I wouldn't call it a suite. Rooms are not small but ain't big either. No fridge, no tea or coffee maker. TV and airconditioning are there. Decent bathroom but in one room slightly more outdated then in the other we stayed in. So I think some of the rooms have been re-done. Swimmingpool is nice and offers plenty of room the sit or lie down. It's got a restaurant/bar at the groundfloor and you can sit outside drinking…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r167742419", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Nice hotel!", "review": "We were nicely  surprised about hotel. We also were happy about the location- it is in more calm part of city but still good connection to city centre and tramps stop very close. The nice san juan beach just few minutes away. Rooms are big and balcony also. It's is really clean place and each day you find your room cleaned, towels changed. We really liked hotel terrace where we liked in evening to have a drink sit and check emails. Staff friendly, breakfast quite ok also. Like for 3 stars hotel is good I think. Reception were not most cheerful people ever but their English was enough good to explain you anything you ask or answer any questions. The parking of hotel is like 10 euros per day plus taxes. Overall nice hotel.", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r165925263", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Could be so simply improved", "review": "This hotel is a reasonably priced 3 star. It is clean and well located for the excellent beach and the limited attractions of San Juan. Easy to access from Alicante airport via the city.  With a few simple tweaks my lasting impression would have been so much more positive.  In general the staff were fine but one male and one female receptionists require retraining in customer relations. A smile and a friendly greeting on arrival is not difficult. Much preferable to a bark of \"You have a reservation? Passports!\" When there was a powercut in the evening, friendly reassurance was required rather than a waved away hand gesture.  To be told to turn the air conditioning down was not clever either since this was a major factor in the hotel selection.  Pool opening hours and shade…", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r165658839", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great Value", "review": "If you are a couple, the double-bedded room we were given was of excellent size and the bed must've been a double-king, it was huge and very comfortable, we would highly recommend.  All of the rooms look-out to the same view - unspectacular, but the service, staff and cleanliness of the hotel more than make up for it.", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r165341233", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nice hotel shame about the food", "review": "Hotel was lovely very near the beach, good local transport right outside the door of hotel.  The food was not so good, breakfast was the same every morning.  We were half bard, out of seven nights I would say three were ok.  WIne very good 6 Euros a bottle.   Staff were helpful.  Rooms were clean and comfortable no complaints.  Taxi from airport 35 euros.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r165018134", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Many good points", "review": "This 3 star hotel is very good value. It has many good points- and a few less than good.  The latter refers primarily to the bed and the pillows, which are incredibly hard,inflexible and uncomfortable.Also, the very well maintained swimming pool has rather limited opening hours (10.30a.m.- 3p.m. then 5p.m.-7p.m.). The breakfast is ample and satisfactory, except for the slowest toaster in Spain! Too many guests take food from the restaurant at breakfast, which is a shame and the hotel specifically asks guests to desist.  Apart from these points, the hotel is kept wonderfully clean and rooms are a good size.Ask for a pool view room if possible. Take your own toiletries as the hotel ones are minimal and not great quality.  The hotel location is a huge bonus. The bus stops right…", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r164526812", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Great location & hotel", "review": "I stayed here with a friend at the beginning of June and was not disappointed. Hotel staff speak good English and were helpful. Rooms were of a good size and clean. Lobby was nice to relax in late afternoons.    Breakfast in the hotel was usual continental croissants, yogurts meats etc and evening meal was set 3 course different each nite which was fine.    Gorgeous beach a very short walk away with loungers that you pay for for the day (4 euros each) plenty of bars and restaurants around to sample local food & sangria etc and the tram system which is close to the hotel was really easy to negotiate and cheap. We went to benidorm for the day and a return trip was only 6 euros.   All in all, a very pleasant stay would definitely stay again location was perfect for a nice chilled…", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r164429644", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Good overall, but not perfect", "review": "I stayed here for 3 nights (in 2 June, out 5 June 2013) and would rate it overall as pretty decent for the price paid and generally meriting its 3-star rating. I booked my stay on-line just a few days earlier through booking.com and the booking process was seamless and trouble-free. I was booked in on a b&b basis, although I did eat a lunch and an evening meal in the 'cafeteria'; apart from breakfast each day I did not eat in the main restaurant, so cannot comment about it.  The room: - I had a room with a partial sea-view which was quite spacious; it was almost at the front of the hotel. It had a double-bed (a 'king-size'); when checking-in and after ascertaining that I was alone (although I had paid for 2-person occupancy), the lady at check-in took some trouble to allocate me…", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r163113021", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Nothing special but nothing bad", "review": "We stayed here for 4 nights and it was perfectly pleasant. Nothing really went wrong but as we didn't spend much time in the hotel we can't say it was bad!   We never ate in the hotel so can't comment on the food.  Staff seemed ok, though again as we didn't spend a lot of time there we didn't have a lot of interaction with them.  Either we had a different bathroom to everyone else but I can't believe no-one commented on it! It has obviously been done up recently with nice black and white tiles and a rainforest style shower, it was great.  As everyone else has said, it is very easy to get into Alicante with the tram only a few minutes walk away. We did check out a night early, nothing to do with the hotel but we went to stay with the in laws in Gata further up the coast. We got…", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r162759220", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Food Poisoning? Rude...Arrogant member of staff for check in and out!", "review": "Hi, San Juan is a lovely area....Nice beach...Lots of nice bars and restaurants and very friendly people. And then the hotel.....We had paid extra for a double room with sea view,upon check in we were sent to a room with 2 single beds and a poor view,was then told it was not possible by the witch on reception to change to a double room,we complained and she eventually gave in and moved us to the room we paid for! Food was awful in the restaurant and I suspect I suffered with food poisoning from undercooked lukewarm food. Despite paying for half board we ate out as it was that bad! Last day we had a late flight back and enquired about a shower room to freshen up in and get changed in,we was told it wasn't possible and to use the toilets! Such a shame with this hotel as it does…", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r162412068", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Uncomfortable bed, noisy hotel, unpleasant staff", "review": "I would recommend the hotel management attempt to sleep in the bed in room 212, it creaked horribly everytime you moved and both my husband and I had quite bad neck/back aches the following day.  Both for the check in and check out I found the reception staff patronizing and always seemed to want to serve the peope behind me first. I had a bottle of cava and asked for it to be put in the room in the afternoon, we got back at 4 and cava want there so phoned reception, who said it woud be up immediately, an hour later still no cava, phoned again and the receptionist, no apology, said oh yes the guy wasnt here (the only one with legs I presume) we'll send it now. It hadnt occurred to him to call me and let me know it was delayed. Ive worked as a training manager for the hospitalty…", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r162240723", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "clean, quiet, great location", "review": "a really nice, clean and spacious room with a must-have for me balcony where you can just lounge on the chair and sip in a drink and puff a cigare. Housekeeping is very efficient and ladies do the job quickly and unobtrusively. Location is quiet, with few good bars just around the corner, 24h convenience store is on the same street. Beach is just a short stroll, with many volleyball facilities and on-beach working out and fitness equipment. Ole good McDoanlds is 10 mins walk. Had great time and would deffinitely come back.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r162218002", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "The hotel was quiet, clean, and located close to the beach.", "review": "The hotel was quiet, clean, and located close to the beach. My only complaints is that the breakfast was a bit poor. A lot of white bread, cakes, cup-cakes, jam and sugar, Bus stop right outside the main entrance that takes you to alicante sentrum.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r162216703", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Nice Hotel but", "review": "Stayed here Mid May. The Hotel is fine, clean, nice rooms, great location, but think twice before you book the Restaurant.The food was OK but not much of it and the choice was the worst I have ever encountered in a holiday Hotel. For a start the Restaurant only opened at 8-30 each night, there were only Two starters each night, one of which was always Soup, and Two Mains, one Meat and One Fish dish. We stayed for nine nights and the same three sweets were offered every night, breakfast was all cold food, again no variation. As I said Nice Hotel but eat out.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r162173178", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent base to explore from", "review": "Just stayed here at end of May 2013. In honesty couldn't fault much.  This is a great hotel to base yourself. The previous reviews about transport links are right with buses into Alicante outside the door (1.45 Euro each way). The (long) beach is a five minute walk with cafe stops along it.  One of the previous reviewers explained how to get there and their description was spot on - I've pasted this below (with a slight addition).  Outside to left of the hotel are plenty of shops. The 24 hour supermarket is great, and if you turn left again there are more cafes, a tabac and an ATM.  Breakfast is continental but good enough. Plenty to eat and drink. And the cafe bar prices throughout the day are good.  The rooms themselves do what they need to and have all the amenities. There…", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r162068264", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Good value", "review": "Stayed 5 nights in May and we paid less than £40/night for the room including breakfast so not expensive for what we got. Rooms were clean and comfortable with bath and shower but walls a bit thin, partial sea view from higher floors. Good efficient and cheap public transport was few minutes walk and the beach was a few minutes walk too. A lovely beach too! Friendly and helpful staff and a good selection of bars and restaurants nearby, In summary, a very enjoyable stay at a very reasonable cost", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r161320622", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Location!", "review": "This is a perfect hotel for people who want both the beach and the city of Alicante. It is a clean,nice hotel with a decent breakfast. well, we missed the egg and baco!. The hotel is close to the beach and you can easy go to Alicante city by tram - 1.45 e. We will return!", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r161245594", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "good 3* hotel, but POOR breakfast", "review": "My wife and I stayed at this hotel for eight nights in May. Generally the hotel is as a standard 3* hotel, I want to agree with most of reviews with good points, location - very close to beach and quiet place in a residential area of Alicante, staff very helpful, clean room, bus - in front of hotel to get to city center, tram - 1 minute walk. But, we booked the room with breakfast, which in my opinion was a mistake. It costs 6 euro, which I think it doesn't worth. It was the POOREST breakfast ever we had at a 3* star hotel. There's very little choice, there's no hot food at all, 1 type of ham, 1 type of cheese, a basket with fruits, butter, jam, some yogurts in the fridge, 2 types of juices, 2 coffee machines, muffin, some choice of cookies, toaster bread, rolls, 1 type of…", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r161098836", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Excellent value and location", "review": "Stayed for long weekend with 76 year old mother.  Rooms were simple but clean and all had balconies  (not much sun though due to direction they face).  Pool cold but clean and big enough to have a decent swim, with plenty of loungers, chairs and tables.  Breakfast was cold buffet and everything was fresh and tasty.  Tram and bus stops are right outside hotel and excursions are available (although we didn't go on any).  Beach is only one block away and the surrounding area is full of good restaurants and bars - average price for 3 course meal + bread+ wine was 13 Euros and a small beer and tapa cast E1.50.  Staff were quite formal but friendly and helpful when asked for information.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r161052656", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Perfect hotel in Alicante", "review": "We stay a few days in the Castilla Hotel in Alicante in the begin of May. It's a very clean hotel with a very friendly staff. The breakfast is good and the way to the beach is very short. The next time when we are in Alicante we should choose this hotel again! Perfect!", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r160350843", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Castilla, where is the chef?", "review": "Hello Chums! Well now, let's look at this hotel with the benefit of the healing quality of time. The weather in Alicante at the time Late April 13, was pretty awful and unseasonal, We did have a few sunny but windy days.  On arrival we were delighted to see our old friend Mr Chumley Warner on reception, much bustling and hustling saw us get into our rather bleak room. This is a 3 star hotel in a potentially 4* location. Room was clean, quiet and view over west side as all the rooms are. Staff I must mention were generally very good, most of the waitresses also.  Located on the tram and bus line and near the beach and shops could have made this an ideal hotel. The decoration of the dining room in black and grey window nets was an interior designers travesty and very dreary. The…", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r159602841", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Nice relaxing Hotel", "review": "My Husband and I stayed at Castilla for several days in February .......... we found the staff all to be so very friendly and helpful. The Hotel was kept spotlessly clean and tidy.  A special mention to the Reception staff for their patience explaining the tram services!! And also a special mention to the waiter Jose from Argentina - what a pleasant young man - hola from the Manchester City fans!!  The room we were allocated was a corner room with great views out to the sea..... kept very clean and the bed was super comfortable too, I would suggest asking for a high floor when booking...... there are two functioning lifts. Breakfast was fine - mostly continental but for the English pallette there was cereal and fruit, juices, toast and preserves, yoghurts, danish pastries etc…", "date": "February 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r157169172", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great place 20 minutes from Alicante 'central'", "review": "The main draw for me going to this hotel was the San Juan Beach which was a 2 minute walk from the hotel.  The beach is just miles and miles of beach with a wide walking/running/cycling area.  When going on the beach the first 50 metres deep is volleyball, football, basketball, children areas – all free of course.  Then the rest of the beach, as you get closer to the sea, is either plain sand for you to lay your towel on or pay 4 euro for a sunbed.  The hotel is in a late 70s tower block, one of many in that area which are predominantly residential.  It has had a makeover with a very nice reception and all areas were spotlessly clean.  Front desk staff spoke perfect English and were very helpful.  Bar staff were very helpful but as you’d expect with a lesser command of English. …", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r157016561", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice Budget Hotel & Excellent location", "review": "Nice hotel in very good location, very close to the sea and restaurants, but in same time is not noisy at all. Rooms are big and have some sea-view. Cleaning average, could be better. Breakfast simple, but sufficient. Staff is pleasant and helpful. l defiantly will stay there again, as budget traveler.", "date": "March 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r155413274", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great Staff & Location", "review": "Stayed here for a week in March. Staff could not have been more helpful with hotel staff getting special food for coeliac breakfast. Location is very good with tram /bus stops right next to it for both Alicante or Benidorm direction. Hotel basic but very clean with all staff very helpful.", "date": "March 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r154923072", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great Budget Hotel,Better Than Expected for the cost", "review": "My wife and I stayed here for 7 nights, we were looking for something reasonable but on a budget. The hotel & rooms are all very clean.  The reception is great and the staff were very helpful.  They arranged taxi's, showed us where and how to use the busses and trams, suggested places to visit and gave direction.  Couldn't have asked for more. Weather was a little chilly so didn't use the pool, but it was clean and we would have given a bit more sun.   Breakfast was great, good selection of food. Hotel is very close to San Jose beach.  It's a 30 minute bus ride to town for a couple of euros or about 15 euros for a taxi. Would definitely use this hotel again.", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r153355081", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Pleasant night", "review": "We stayed in the Playa San Juan, in Castilla hotel just for one night. It was a quiet, resting night in spite of the fact that people were getting ready for Carnaval that week-end. There is a tram stop nearby and you can get to the center of Alicante in 12 mins. The proximity to the beach is great and we'd love to come back again in summer.", "date": "February 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r144423765", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Exceeded Expectations", "review": "We stayed at Hotel Castilla Alicante for one week at the start of October, We were not sure what to expect but were encouraged by the good reviews on trip advisor. I can honestly say we were very satisfied, lovely clean hotel, nice room with balcony and use of the room safe for Eur 2 per night, the friendly and accomodating staff made us feel very welcome, in particular the staff on reception were so helpful, If we have one small quibble it is that the AC in the room was not terribly good and made little impact, so we were glad to have a sliding balcony door which we could open as required. Breakfast was plentiful and all in all added up to very good value for money. Easy access to the beach as noted by others and a choice of restaurants in the immediate vicinity. We will be…", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r142845304", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great budget hotel", "review": "We stayed at this hotel for a week towards the end of September.  The hotel itself is very clean - maid service every day and the staff are very friendly and speak good English. We didn't eat in the hotel so cannot comment on the food.   The hotel is not too far from Alicante itself and the local area is nice.  The beach is beautiful, very clean and impressive looking.  Would 100% come back to stay at this hotel again if I were to re-visit the area.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r142039731", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Hotel Castilla Alicante", "review": "Well deserves its 3 star rating. Spotlessly clean everywhere.Great pool, never crowded. The food was top class for the money, very Spanish but that's no bad thing, though I drew the line at cuttlefish. The hotel and indeed the San Juan area is very Spanish  - nothing wrong with that at all but a little Spanish goes a long way. The receptionists speak excellent English & very helpful too, although the waiters' English is limited but nice friendly people (apart from one). Hard to fault anything with the hotel really.  The tram service is very efficient & a good deal. For 1.40 you can get into Alicante & the lovely little resort of el Campello and day trip to Benidorm just 6.20. You can take the airport bus for 2.75 & get off at Luceros then the tram for 1.40 to Londres or La…", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r141540573", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A week of relaxation.", "review": "Having stayed there before I cannot fault this Hotel.Easy access to the town and only 2 minutes from the beautiful beach with golden sand and sunshine in the high 20,s in mid September. very Spanish and unspoiled with genuine Spanish food and great tapas..", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r141344613", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fantastic staff.", "review": "The staff were very very helpful, nothing was too much trouble. We stayed for seven nights & the room was cleaned every day. It was 2 mins walk to the beach & had plenty of restaurants & shops very close by. The bus to the middle of alienate stopped outside the door of the hotel. Only negative is the bed was a bit uncomfortable. Will def stay again!", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r141140758", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Lovely beach hotel", "review": "This hotel and its surroundings are a bit of a gem in this area of Spain. The local area, San Juan,  is mostly frequented by Spaniards in their holiday appartments and hotels are few around.  The features we most enjoyed were the short walk to the lovely beach, the pool, an abundance of restaurants nearby. Getting to the city by taxi is not cheap but not horrendous either. The tram is cheap but not very frequent.  I´d reccomend this to people with children or those who really want to relax on the beach and by the pool. Not so much for getting out and about too much. Our room was fairly large with a renewed bathroom. An extra bed was available for our children. The balcony sort of doubles as another room for when the children have fallen asleep which we thought was practical. But…", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r141096531", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "1 night stay location great for beach", "review": "stopped for 1 night september 2012. reason was the location, 100m from great beach. tram / bus links on your doorstep to alicante harbour etc. ate locally in one of the nearby restaurants. hotel room good . didn.t use any of the facilities but reception staff help full and friendly.. used hotel as a stopover for short journey to airport next day. would use again", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r140413246", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very pleasant hotel", "review": "Very pleasant hotel, clean, with friendly and helpful staff and situated just 2 minutes walk from the wonderful beach San Juan. Good value for money!  Breakfast was fine, continental, with good selection of breads and fruits.  I would recommend this hotel for those who need the sea and a quieter atmosphere.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r140012142", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely beach", "review": "The hotel is 2mins walk from a beautiful sandy beach, which has a few bars/restaurants along it, and a McDonalds. If you are after crazy nightlife, don't go here as it has a quieter atmosphere, yet there are still plenty of places to get a few cocktails in! Breakfast was average - there was a full continental and bacon/scrambled egg, and fruit juices. The pool was quiet when I went, and there were always sunbeds free as they can't be reserved here. Room cleaned every day, and all the staff were very friendly, allowing us to borrow a knife from the dining room to make lunch in our room for example!", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r138439310", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "First Rate Hotel in Alicante", "review": "Have just returned from an 8 day stay in the Castilla Hotel, Alicante.  This is an excellent value for money hotel.  The Hotel is located about 100m from the Playa San Juan, which is a long sandy beach, about a 15 minute taxi drive from Alicante Airport (€30-€35 for the taxi).   Rooms in the hotel are a good size and are cleaned every day.  There is a €2 charge per day for the safe in the room, which is not unreasonable.  Staff are helpful - we were able to borrow an adapter from reception and just returned it to them when leaving.  Because of its location, you can hear street traffic from time to time but it is not overly intrusive.  Also the floors in the rooms are tiled which means you can hear people walking in other rooms if they have their shoes on and you can hear…", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r131876380", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good hotel, near fabulous beach", "review": "Thank you very much for the comment Slatts 25, was a great pleasure to welcome you to our modest hotel on the beach, and we are very happy that I found everything to their liking. We look forward to seeing us in the future.   For any questions you know where you have a friend.", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r131543921", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Good family hotel", "review": "Just got back from 4 night break at this hotel and had an excellent time.  Hotel very close to fabulous beach.  Room was decent sized and very clean.  Balcony big enough and with view of the pool and the sea.  Didn't eat at the hotel as menu was limited but there was plenty of choice of restaurants and bars right by the sea", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r131287162", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "A nice Hotel next to a fantastic beach", "review": "A really good family hotel - reasonably priced, good sized pool, 2 blocks from the beach, restaurants close by, buffet breakfast was decent, beds pretty comfy, wifi only worked downstairs near lobby (but was complimentary), front desk staff were really great - always friendly and helped with any questions / requests.  If I ever come back to Alicante would happily stay here again.", "date": "March 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r126966745", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Comfortable & worth the money!!", "review": "Early this month I spend one week at this Hotel. It is nothing luxurious but it served my purpose of relaxing during the off-season period without the tourist masses. The Hotel is located just a few yards from the San Juan beach which is about three miles long, white sand and almost deserted this time of the year. Temperatures vary from 50 to 70 degrees, water is temperate and allows a dip sometimes. Prices during the off-season are excellent and services are adequate. There is a cafeteria but no formal restaurant. The Hotel is well connected with a very efficient tram passing just in front of it which will take you to anyplace in the city of Alicante or nearby beaches.", "date": "November 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r120853826", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good.", "review": "This Hotel is very good. nothing fancy, nothing luxurious but very well located and clean. mine (#502) was a very spacious room with a very large terrace. we have dined one night sitting on the terrace. Wifi works perfectly. Parking is really free and on site. The stuff is not so \"happy and friendly\" but it's ok. rooms are not overlooking the beach but i think it is better otherwsie they would be too noisy. maybe during thte summer this palce (the hotel, all the hotel and the San Juan plage) must be very \"crowded\" and noisy. In november i have enjoyed it, the beach is really beautiful.", "date": "November 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r120726903", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "One night comfortable stay....exceeded expectations for price", "review": "We stayed here for just one night as we were flying out of Spain from Alicant (had been staying in Valencia for the MotoGP). This was a cheap hotel but it far exceeded our expectations for its price. The girl on the reception was very helpful with directions to the airport, where to eat and where to park our hire car. The room was very clean, a good size, great hot powerful shower. We had a balcony, overlooking the pool and the sea a little way off. Definitely would come back here for a quiet family holiday. Not at all what I expected. Thought it would be roudy and common but it wasn't at all. Breakfast included and was good.", "date": "November 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r120347749", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very nice, inexpensive hotel", "review": "I found the hotel excellent. Room a good size and comfortable. Staff helpful & spoke English. Breakfasts excellent including scrambled egg & bacon. We had 2 dinners in the hotel and the food was fine. Our room was on the 8th floor (our request) and we had a side sea view from the balcony. Location great - near an excellent beach with promenade, lots of shops and restaurants nearby, quiet and felt safe, bus and tram to Alicante pass hotel entrance and costs €1.25 each way to town centre (20 mins). This isn't a buzzing town centre location, more residential which we preferred. Excellent restaurant Los Charros nearby for a special occasion.  The only problem we found was that the restaurants in the vicinity open for dinner at 8.30pm - 9pm. This is normal for Spain but later than we…", "date": "November 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r120260398", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "great location", "review": "A block away from the beach, a bus stop in front of the hotel, a metro stop nearby.  It was great to have a balcony with a table and chairs, from which we could sort of view the sea.  The staff was very helpful and friendly.  It was a surprise to us that there was not a fridge/minibar in the room, nor was there a hairdryer!  Also, although this is a beach town and the hotel has a pool, they do not have a towel service for use at the pool or beach! They do have a snack bar and restaurant, good but a bit pricey.  But there are plenty of restaurants nearby.  Wifi was a bit spotty.", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r119638294", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Quiet place and good value for money", "review": "Very nice hotel near to the beach San Juan that is quiet place and not crowdy like the beach in Alicante. Spacious rooms, all facilities inside exept hairdryer ( ask at the reception), various breakfast, cheep menu del dia for lunch and dinner, swimming pooll and other sport facilities ( SPA at a dictance of 500 m), friendly multilingual staff, good value for money for 3 stars hotel! I strongly recommend to all categories of travelers!", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r119575232", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "can't wait to go back", "review": "Chose the hotel last year when staying in the area. Great location, ideal for beach, shops and restaurants and local transport. Arrived about 10:30 in the morning and was lucky our room was ready.Reception staff lovely and friendly as were the rest of the staff. Nice clean room overlooking the swimming pool. Rooms were cleaned everyday and bedding/towels changed on a regular basis. There appeared to be more business people than holiday makers and very few families. Breakfast was good-nice range of food so could always find plenty to eat.  Excellent value in a great neigbourhood and close enough to Alicante for shopping and nightlife. Top tips learn some basic spanish not everyone in San Juan speaks english!               Use public transport from the airport - its quick,cheap…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r119351363", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Really nice hotel in San Juan Area", "review": "Couldn't of asked for a better hotel in the San Juan area than the Castilla Alicante. It is relatively easy to get to the hotel with public transport, but the taxi is relatively inexpensive as well. The room was quite spacious and had a balcony (i am pretty sure all rooms have a balcony). The room was very clean the entire time my companion and i were there and towels and toiletries replaced everyday. I'd also recommend the buffet breakfast because there is quite a bit of variety of foods on offer, including cereals, hams, yoghurts, hot food etc. The hotel is also in close proximity to quite a few restaurant so you will never go hungry. There is about 50m separating the hotel and the beach so you can easily walk through the side street to go there unless you would rather the…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r118782600", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Lovely hotel, lovely staff", "review": "Hi everyone,   I had a group of 44 work colleagues travelling to Alicante for a 'team-building' weekend from London. The prospect of booking anything for that many people is never appealing but Irene and Javi at Hotel Castilla were so so helpful in getting everything organised and very accommodating and patient as you can imagine you would have to be.   We had groups of people arriving throughout the day, the largest being 19 at once but check-in was not prolonged and despite saying check-in was at 4pm, all of our rooms were ready and people were allowed in from much much earlier.   Everybody's rooms were perfect for what we needed, comfy beds, clean, balconies with furniture, TV.   The pool was a good size and although the bathing area surrounding it wasn't huge the beach is…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r118403790", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "We will come back for sure", "review": "Our trip began with all kinds of problems, hours of waiting in Stockholm airport, lost luggage, but the professionalism of all staff, especially Jose Antonio from reception solved all our problems. The excellent room, cleanliness, sea views and excellent food made ​​our stay unforgettable. Thank you very much.", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r116483481", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "The hotel was good, the receptionist AWFUL", "review": "A particular person in the reception was very unhelpful. When he saw you in the reception, he kept doing his own things even for 10 min. At the end of our holidays, we asked for late check-out, which was advertised in the board of the hotel and the very first answers was: NO. when we said it was available as in the ad, he asked us for our hotel room number. then he checked and he asked: when will you pay ALL these charges, 545euros? And we said we didnt have any charge. He was looking the wrong room number. Everything from him was very disappointing. The hotel manager should do something with this person (Jose Antonio said in his label name) in particular.  The rest of the hotel was good, very close to the beach, the buffet was very varied and the rooms were good too. It was sad…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r116433911", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "not nice staff, not nice rooms...just Alicante", "review": "With my boyfriend drove in two weeks the whole of Spain, Barcelona, Madrid, Alicante, Burin, Valencia ... Valencia was the most beautiful:) sun, beach, old town,  in the hotel - not a nice Staff!!!  has a problem even finding a wine opener (you have to cope alone!!!!!) hotel building looks like a communist form  60s :/ Rooms-  dark and not nice, old  bathroom  with small windows. In the bath is a veil that looks terrible!!  In Alicante the most beautiful are the beaches ..  you can take a lot of sun  and swim of April!  I do not recommend this hotel...  In The city is a lot of small restaurants and good wine - great  to connoisseurs!!", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r116210723", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Great value for money hotel", "review": "Stayed here with 2 children on a super value half board package. Room was very clean but very basic, bathrooms nice, spacious balcony but with views of the back of the kitchen.....why the 5 stars then.....well it just did exactly what it said it would for an excellent price. Free high speed wifi, great breakfast and excellent waiter service dinner (very nice when used to buffets and helping yourself).Pleasant lounge areas and a great street side cafe. Easy walking distance to one of the best beaches in spain.", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r115051278", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Will definetely be back!", "review": "Fantastic location, good rooms with good sound insulation, best staff ever met in Spain - helpful,caring for the customers, extremely friendly and professional, reasonable prices in restaurant and bar. Excellent plumbing and amenities, super clean everywhere, quiet and clean pool facilities. An absolute must when visiting Alicante. Public transport by tramway or bus outside the hotel, cheap tickets to town centre 25-35 mins away.", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r112622798", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Got an excellent bargin", "review": "One of the on line booking sites had an excellent deal & the hotel matched the promotion even though we were a walk in. Mind you, next day (we watched as) a couple walked in & were told that the deal was an internet only promotion, they walked out their car, collected their laptop & proceeded to book a couple of nights & saved over 50 euro. Rooms were spacious & clean.  The pool area was over run by children attending a function on the only day we chose to use. But enjoyed watching the kids having fun. Didn't eat at the hotel as there were a number of places around the area, mind there were still alot of places closed. Take advantange of some of the bars/restaurants that offer a free tapas with your drinks in the early afternoon. Enjoyed this part of Alicante& Hotel Castilla", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r110149611", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent Value near to huge sandy beach", "review": "The Castilla Alicante represents excellent value for money, with a quiet location, excellent staff and spacious rooms.  The hotel is 3-4 miles from Alicante itself, but this means its adjacent to the huge long sandy San Juan beach that sweeps up the coast for miles.  There is a large bar area and an even bigger restaurant, but both were very quiet whilst I was there (May 2011). The breakfast had a comprehensive cold buffet plus serve-yourself bacon and eggs – the orange juice tasted like it was freshly squeezed – as you’d expect given they are grown locally.  The rooms were spacious, with a large bathroom complete with bath / shower and bidet, let down only by those nasty sachets of shampoo and shower gel and rather hard towels.  The free wi-fi worked really well, which was…", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r108933305", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Great food, great service, reasonably priced!", "review": "I have just returned from a three night stay at Hotel Castilla Alicante. It's approximately half an hour from the airport but can easily be reached by public bus which only costs about 4 Euros.  The hotel is perfectly situated out of the city centre and yet only 5 minutes from a lovely sandy beach. When you get tired of the sand, you can return to the hotel pool and 'catch the rays' on a sunlounger although the traffic noise can be a bit off-putting even though the hedge screens you from the main road!  The hotel rooms are basic but exceptionally clean, (take your own hairdryer) and my room sported a lovely balcony overlooking the sea.  Although I arrived at 12 noon, a couple of hours before my room was technically available, this was no problem to the Reception staff who were…", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r104658016", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Fantastic value for your money!", "review": "The hotel was great - nothing special, but suitable for our needs and for fantastic money. The hotel is clean, service perfect (receptionists speak English, they're very helpfull), location is approx 100 m from see, however a little bit far from the center (10 km). Bus stop is just in front of the hotel (1,25 €), taxi is around 12 €. Rooms are good, but when the weather is cold, the air conditioning doesn't heat that well. Breakfast was fine, however it's always the same, so I recommend the hotel just for a short stay (weekend getaway, business trip, etc.).", "date": "March 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r99489980", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "\"great value for money; highly recommend it for a summer location", "review": "Rooms are very clean and spacious. We had a lovely large balcony with some views of the sea. I would recommend this hotel for a Summer break as it is in very close proximity (right across the road) from a beautiful clean beach. However, the location for a spring break is not ideal as there is very little to do in the proximity as most shops/restaurants are closed because it is out of season. The tram and bus stop right outside the hotel and a tram journey is 20 minutes to Alicante city. However, the last tram leaves the city at 10.20pm and the last bus at 11.20pm so there is not much time to explore the nightlife in the city as taxis are approx €15. A taxi from the airport to the hotel is €40 approx. However, we took the shuttle bus to the city and then a texi to the hotel.…", "date": "March 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r60911421", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "If only all hotels were like this one.", "review": "If only all hotels were as good as this one, traveling to Spain would be even more delightful!  It is modestly classed as 3-Star but that does not do justice to the friendly and comfortable ambience of the hotel. There is a lovely open-plan bar cafe which has an outdoor street-side section for people watchers.  There are tasty snacks on the menu there all day. The resturant serves breakfast buffet, sit-down lunch and dinner serving from what we call a non-threatening menu; part Spanish and part northern European.  I must comment on the extremely friendly and knowlegable Receptionists who seem to know everything you want to know about!  For instance they changed out room for us last year (shower/bath requirements) on the spot and with no fuss. The rest of the staff are quietly…", "date": "June 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r58279191", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "The worst hotel we have stayed in for 40 years", "review": "Out of season we would not recommend this hotel to anyone. We, as the only clients on half board, were treated by an ever changing staff as an inconvenience. We were expected to eat in the hotel's public bar - the beautiful restaurant serving \"international cuisine\" Remain firmly shut during our 4 night stay. When we protest about eating in the bar smoking among members of the public on the first morning and supposedly having a buffet meal served by the bartender at our table, the meeting room was opened for us at each breakfast time but our dinners were always served lukewarm and of poor quality in the public bar in front of the flat screen tv.  We were advised by the receptionist the day before we were leaving to book our airport taxi in advance. She rang our room later to…", "date": "January 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r54400696", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Decent Hotel! Good Location!", "review": "We have just returned from a long weekend - 3 nights. The hotel was mostly fine. We were in room 811. It was a good size, clean, comfortable, had a nice large balcony, a sea view  and in a good location to go to the beach, take the bus into town, walk to the Golf complex for a night out etc. Our only issue was an annoying mechanical/plumbing type noise that started around 8:30 every morning.... it was quiet at night.   San Juan is very Spanish and is as would be expected of the Spanish people, culture and lifestyle. There are a lot of Spanish tourists there as it is a favorite local beach, with good access to Madrid, Barcelona and Valencia. There were language difficulties, but all you need is a phrase book and they appreciate if you try and communicate in Spanish. The area is…", "date": "October 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r46836172", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Very pleasant stay.", "review": "We stayed here for 5 nights for a short getaway holiday.  Large comfortable room with lots of storage space.  Nice and quiet and very close to the beach.  We didn't have a sea view but the rooms at the front did and it didn't bother us that much.  Very helpful staff at reception and the rooms were kept very clean.  Had a few language problems in the restaurant but we were in Spain and most of the guests at this hotel appeared to be Spanish so what the heck!  We will just have to brush up on our Spanish next time!", "date": "August 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r39750445", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Amazing holiday", "review": "Beautiful hotel, great service, walking distance to the beach. Great variety for breakfast. Clean room every day. Beach-absolutely amazing, long , clean, safe even for my 3 years old daughter. We would appriciate swimmingpool for kids and better playground in the hotel area.", "date": "June 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r37545981", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "great value,great hotel ,quiet location", "review": "stayed here 22-25 november . thoroughly enjoyed our stay. hotel was spotless room excellent with a v large balcony[think ours was extra big ask for room 102 or others ending 02 these seem to be at the endof the building.]. room cleaned every day ,checked in at at 11pm at night no problems.yes there are road works, and yes there isnt much to do of an evening but transport is so cheap we went to benidorm for the day it cost 3 euros each way. ate locally first night an ok meal in argentinian restaurant. 2nd night went into town centre. i would love to think that during the summer this would be a bustling little resort, but in november its quiet. this was nt a problem for us. my 1 tip would be if you can make time catch 2 buses back to the airport the number 21 or 22 into the centre…", "date": "November 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r22258487", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice  Hotel- terrible area", "review": "The hotel was clean and tidy, with very basic rooms  as expected for the cost. We didnt however expect our door to be opened in the middle of the night on 3 occassions!  The area isnt tourist based and english-speaking bars and restaurants are non existant in the local vacinity. The beach was nice and went on for miles. As it was October, there wernt many places open to eat, and those that were, usually opened at 8 or 9pm to cater for the locals. Overall, this could be a good place to stay in a few years time once the tram line has been finished, and the local establishments start to take on tourism a bit more as we felt like outcasts- only met 1 english family the whole time we where there!", "date": "October 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r21375945", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Excellent for short break", "review": "The Castilla discreetly hides itself away amongst the neighbouring high rises that sadly extend along the whole length of the otherwise lovely, wide and expansive St Juan beach.  Its seven or so storeys make it comparatively small and inconspicuous in its company, and the signage doesn't help, consisting of just one understated indication bizarrely on the side facing away from the town of Alicante.  If you don't know exactly where you are, you could very easily pass it by, so take a taxi from the airport (about 30 Euros), and try later to remember where it is!  The neighbourhood is largely residential and Spanish-speaking, with few other hotels nearby, but there are plenty of bars, restaurants and supermarkets within a hundred yards or so.  Several were already closed, though,…", "date": "October 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r21340231", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Poor Hotel and even worse location", "review": "We were meant to stay in this hotel for 5 nights (24th - 29th Oct) but only managed to last 3 nights! The hotel can only be compared to a 1960s hospital and the location is very poor. The resort is run down and deserted at this time of year. No decent bars/ places to eat and locals were very rude.   Hotel was very basic and on several occassions people walked into our room (despite it being locked!). Poor was also locked alday, even when it was 25C outside.  We decided to cut our losses and come home 2 nights early, dont go!", "date": "October 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r21338680", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Nice Hotel, Poor Area", "review": "The Castilla Alicante Hotel is very clean and the staff were helpful and friendly and the breakfast more than adequate.  San Juan beach was very quiet and a bit rundown.  Not sure if this is because it was out of season and maybe some restaurants/bars have closed now.", "date": "October 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r20696329", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Great Hotel", "review": "We stayed at the Hotel Castilla Alicante for a week in May 2008.  Hotel We got a taxi to the hotel from the airport ( 32 Euros) which took about 20 minutes. There are plenty of taxis waiting for you to use. Our room had a large balcony overlooking the sea & the room was very clean & spacious ( maid came in to clean everyday).  The hotel is situated about a 1 minute walk from Playa San Juan beach, which is a fabulous sandy beach about 6 miles long. The beach has European Blue flag status and it is easy to see why. Food We found that there weren't many English speaking waiters in this resort so if you don't speak Spainish you will have to point a lot! However if you are struggling there are a few more English speaking restaurants in El Campello & Alicante. Good restaurants we…", "date": "May 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r16405012", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good value", "review": "Castilla hotel   date sept 14-30 2007 Steve and Lyn  Oxfordshire England  We have just returned from 16 nights at the castilla alicante. The rooms were very clean and the maid service was excellent Daily towel changes etc. We stayed on the sixth floor and Had a side sea view across the road  past a couple of high rises.The hotel is in a residential area so do not expect pretty sea views etc, however the balconys are fairly large and do benefit from the sun most of the day. The beautiful 7 km long san juan beach is only 3 mins walk from the hotel and the 21 bus (stop outside hotel) will take you to ALICANTE or EL CAMPELLO for 1 euro. The nearest Tram station is COSTA BLANCA (left out of hotel and 600 mtrs along the av de costa blanca) The fair again 1  euro and connections to…", "date": "September 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r10045097", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "great location for quiet spanish beach holiday", "review": "we spent 6 nights in this modern, clean and friendly hotel, it is located near the beach and casual eating and drinking institutions. A knowledge of spanish is useful as there is little english spoken, the hotel bar provides adequate snacks for late breakfast and lunch and has a nice balcony for people watching ", "date": "August 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r8464200", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Clean, welcoming hotel close to beach", "review": "Great location, about 200m from the beautiful San Juan beach, a few yards to bus stops for getting into Alicante and within 2 mins' walk of several small local restaurants and shops. We stayed with a toddler and a baby and the hotel staff were all friendly and helpful over everything from broken glass on the floor (the toddler.....) to teaching a few useful words in Spanish.  Rooms, as has been said by others, were extremely clean, spacious, had sturdy furnishings (perhaps not the latest fashion but in excellent order, no scratches, missing screws or stains here) and were cleaned daily while we were at breakfast. The marble/granite floors and low railings on the balcony were not ideal for young children but I imagine most hotels round here would be similar and we had extra…", "date": "March 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r7239895", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Fabulous Find", "review": "We took a gamble to book this hotel but what a find!  Lovely clean, tidy, spacious.  Breakfast was lovely, best coffee I have tried!  Hotel reception spoke good english and was helpful.  Rooms lovely, nice balcony to enjoy sunset.  Located in residential part Alicante, which meant it was quite at night.  2 mins from gorgeous beach.  Pool was deserted during the day, again fabulous.  Huge supermarket, bars, restaurants etc 5 mins walk away.  Ideal location for a quite and peaceful hotel.  Got taxi from airport 15 euros, but if you have time, get bus from outside airport (E6) to Alicante marina, then bus (21 or 22) to directly outside Hotel.  Total journey costs 4 euros.  Bargain and you sightsee as well.  We looked at other hotels but this one was much more value for money.  Book…", "date": "September 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r6140399", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Clean, friendly and modern", "review": "The Castilla is excellent value for money if you're looking for a convenient, clean and modern hotel with friendy and efficient staff. We got a late deal and lthough it was slightly out of the centre of 'shopping' in alicante, the bus service was frequent and reliable and cost less than 1 euro to get into the marina and main shopping area hosting stores such as Zara and Mango. If you want a quiet, clean hotel, on the outskirts of the centre then Castilla is ideal. Be careful with Taxi's from the Airport, we got stung with nearly 40 euros but it should cost 25 max. ", "date": "April 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r4978150", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Clean and Spacious", "review": "This hotel is actually in San Juan Playa, not Alicante, so we were constantly taking taxis everywhere. It's only  2-3 minutes to the beach, which is nice to walk on at sunset, but during the day you have to pay for absolutely everything. 3 euros to sit under an umbrella!  The rooms were big and clean, with an outdoor deck with a table and chairs. The beds were really comfortable, too.   Lots of tourists stay here, and one night there were some really loud (possibly drunk) people in the room next to ours. I went downstairs and complained to the staff, who were very helpful and called them to tell them to quiet down.   The only bad thing about this place is the restaurant. For 12 euros you get stale plain breadsticks and plain, greasy food. Good food is very hard to come by in…", "date": "June 2005", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r4964644", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Nice hotel - good base to explore Alicante province", "review": "We chose the Hotel Castilla Alicante for a one week end of winter break. The hotel is set one block back from the Sant Joan seafront. There is a regular bus service into the centre of Alicante with the bus stop a couple of minutes along the street outside the hotel.   We were taken aback when we arrived to find ourselves in a world of high rise apartment blocks, most of which appeared to be uninhabited at this time of year. There was also a lot of refurbishment work going on. Having said that, we did find a local community around the hotel. There are shops selling fruit and vegetables, newsagents, banks etc. The people we met were quite nice, and it certainly helps if you can speak Spanish. The best local restaurant was the Rincon Alicantino, serving quality local fare in a…", "date": "February 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r4602634", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Good Hotel, Excellent Beach", "review": "We have stayed at Hotel Castilla Alicante a couple of times.  The hotel is above average, with nice rooms and decent service. The breakfast is OK (for Spain), and you can eat pretty well in the cafe attached to the hotel. There is a fair size pool, with a small seating area. However, the real attraction of the hotel for us is the excellent San Juan beach, which is less than a 5 minute walk away.  There is a reasonable selection of restaurants in San Juan. Bizarrely, many of the restuarants will not serve you coffee after your meal in the high season (as they are so busy), which I have never encountered before. Alicante is a 15 minute bus ride away if you feel the need to shop or eat somewhere a bit more adventurous.   Recommended - although be warned, this is predominantly a…", "date": "August 2004", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r4449745", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "very nice", "review": "I like this hotel located in San Juan around 8 KM from alicante center.  If you don't have a car to go in alicante center , the bus stop is one street at front the hotel.The staffs is nice , food are fine.", "date": "January 2003", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1168477-r1614373", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}]