[{"title": "Very Basic but cheap and clean in pleasant surroundings.", "review": "The room was clean but dated could do with a refurb, two single beds pushed together not a double, and quite uncomfortable but we only stayed 3 nights so put up with it.  The staff in Reception were very friendly and helpful. There was a small supermarket onsite where we were able to buy some basic supplies. All in all a cheap place to stay to see Lake Garda, pleasant peaceful grounds, bit of a steep hill to climb but we hired scooters so only had to do the walk a couple of times. Bring your own towels and bedding.", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d1170379-r720384038", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Nice surroundings, unfriendly staff, dated", "review": "The bungalow was not very clean when we arrived. Glasses and cigarettes were lying around the bungalows. The staff was not very kind, especially the lady who did the deposit control at the end of our stay. She was very unpleasant and not professional at all. She did not even say hello or goodbye, just looked at the place and said it was not clean enough, even though I told her, that we did not clean it yet (no one told us that the control is not just for the damage deposit but for cleaning also). Equipment of the bungalow was very poor and dated. Deposit for possible damage is 150 eur. If you do not clean yourself, it will cost you 58 eur. This would be a great place if they renovated the bungalows and if they hired professional staff. Cleaning of the house should be included in the price, so that place would be clean.   The location is very beautiful, each bungalow has its own private place between the olive trees and it is very intimate and peaceful.   There is a lot of room for improvement.…", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d1170379-r670880905", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "will do it again", "review": "מקום חמים באזור משגע ושקט. אווירה של רוגע ונחת. נוף מרהיב. בריכה נקיה ולא  עמוסה. פשוט תענוג  un endroit merveilleux et calme/ la vue est magnifique.  A warm place in a gorgeous and quiet area. An atmosphere of calm and calmness. spectacular view. Pool is clean and no Loaded. Just a pleasure", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d1170379-r639054952", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Deirdre Walsh", "review": "I was very pleased with our large bungalow to accommodate seven people. Accommodation was basic but spotless and the setting ie pool scenery first class.  Bed linen extra but we knew this before travelling and we loved the area. I thought the accommodation was excellent value for money and a great base to travel around, having a hired car was definitely a huge advantage. Would I book again, absolutely !!", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d1170379-r593105683", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Can EASELY be better.... they have started the season not really prepered", "review": "i have been in the bungalow and i have found many surprises here listed:  1- Two single beds instead a kingsize: after a quick complain they change our bungalow to another next to it and had a kingside bed structure with 2 single materasses on the top..... is it taking the piss???  2- Wi-Fi: is not in the bungalow but just in the recenption where you have to even pay  3- Blanket, materass cover, pillow cover NOT PROVIDED  4- Toilet paper, shampoo, soaps etc. NOT PROVIDED  5- Towels provided just ON REQUEST  6- PENALTY if the bungalow is left uncleaned.... it means you actually have to clean your bungalow during your holiday....... i can't believe it  7- Heaters provide only ON REQUEST with a sur-CHARGE  8- i have requested a lake view but they have not even bother to say: sorry we do not have  any available  9- Receptionists new and untrained  10- the Pizzeria in the resort makes awful pizza  11- the resort was overall left on itself. a real shame coz is large with good potential of being an amazing resort  POSITIVE SIDE  1- large bungalows for 2 people   2- free parking anywhere even next to the bungalow  3- very close to the town of Garda   4- GOOD PRICE…", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d1170379-r475091962", "sub_review": {"Value": 3, "Sleep Quality": 3, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Clean, comfortable and great location!", "review": "We stayed in a bungalow for 2-5 people which I believe is their middle range. I saw two other kinds of accommodation which were the small bungalows for 2 people max and the larger bungalows for groups.  The bungalow itself was situated all the way at the absolute top of the park and with us not having a car, this was quite a challenge every day. We did make a note on the reservation that we were not travelling by car, hoping they would take this into consideration, but they did not. When I asked on arrival if there was any chance we could be moved, they said they were full and therefore couldn't move us.   This didn't take away from the fact that the bungalow was absolutely lovely. Nestled all the way at the top meant having a great view of the lake as well as a small section of…", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d1170379-r421851054", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Easy affordable living close to Garda ", "review": "The check in for Parco del Garda is at the Hotel Marco Polo and starts at 15.00. We had to pay the cleaning deposit of 150 Euro in cash despite the info on Hotels.com.  Our apartment was located on the second floor and that was good because we could sleep with the balcony door and bedroom window open at night  There is no AC and no fans and although we visited in June we slept without bed covers.  The beds were quite hard except for the sofa/bed in the living room. The kitchen had most of the things you may need, but only three glasses.  You may use both the pool at Hotel Marco Polo and the larger one on the other side of the tennis courts. The restaurant by the large pool is open for lunch and dinner. Sun beds are free, but sun umbrellas are 2 Euro per day.  The hotel is…", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d1170379-r400127479", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "bugalow is big and nice for price, view is very nice", "review": "location is beautiful, nice swimming pool and gut restaurant, terrible way to lake, not gut for small kids in the stroller not wi-fi, in the kitchen is very old equipment, bathroom fine and equipped with a hair dryer", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d1170379-r397275209", "sub_review": {"Location": 5, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Not five star but perfectly adequate", "review": "Our first visit to Italy and to Lake Garda proved quite eventful even before we arrived but with hiccups in a delayed flight as well as getting our rental vehicle sorted out by hapless individuals we eventually reached our accommodation very late at night and tired from an exhausting journey. Our 'chalet' provided us with only the basics and it was very fortunate that we brought our own sheets, towels and, very importantly, toilet roll. Not having any of those could have proved quite a challenge! The rooms were cold but we weren't prepared to pay 50 Euros extra for central heating. I have read criticism of the accommodation and, yes, there are aspects that may not please everyone such as no toaster or electric kettle but we decided to make the best of it in the knowledge that we…", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d1170379-r396853484", "sub_review": {"Location": 4, "Rooms": 3}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Pool and Pizzeria", "review": "Garda is gorgeous. The Parco del Garda is a good value base from which to explore it. You can save even more money by doing your own cleaning and bringing your own sheets! The bugalows/villas and two-storey apartment blocks are nestled into tree lined terraces. There are play areas for children, a tennis court, a shop, and excellent pizzeria - which does take-away. The best view of the lake is from the hotel.  There is a sharp right hand turn up to the property from Garda. You can walk to the village, about 150 metres along the side of the road before you reach a pedestrian  crossing leading to steps down the lakeside.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d1170379-r389155435", "sub_review": {"Value": 5, "Location": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Don't go here!", "review": "My sister & I booked here to celebrate her 70th & my 65th birthdays  what a nightmare!! On arrival, at 10am, we were told our apartment wouldn't be ready until 2pm, but meanwhile we had to pay a local tax (which we were aware of) plus 150 euros deposit, in cash only, in case of damages! Before travelling I checked through our travel agent about the reports of having to pay for towels & bedding & was told that towels not bedding were payable (very strange anyway & we took our own!). However, when we arrived we were told that bedding was 10 euros each! This is a site that claims to have hotel, villas, bungalows & apartments but smacks of a 3rd rate camp-site! On arguing this point we were given our bedding free! We had to carry this whilst dragging cases up a steep, pebbly path!…", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d1170379-r387484859", "sub_review": {"Value": 1, "Cleanliness": 2, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "October half term...so quiet!", "review": "Family, half term bargain vacation near the great Lake! Avoid the crowds go half term to this pretty idyllic area. We stayed in one of the many quite large Bungalows/villas in the grounds of the Hotel. We over looked the large swimming pool...however this time of year its too cold for a dip only the ducks seemed able to get in. The bungalow was adequate and spacious for the 5 people it suggested it was amongst similar villa's nicely spaced out. Plenty of free parking. The kitchen whilst OK lacked basic essentials we enjoy at home. Not even any lighter or matches for the gas top. No oven as such, but a grill microwave. No toaster and no electric kettle. Another smaller frying pan would be handy. I suppose the only thing that annoyed us was having to pay for bed linen and towels.…", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d1170379-r326225306", "sub_review": {"Location": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Good location, nice pools, amazing garden", "review": "We were there end of April and it was really peaceful. You can park your car near your bungalow. Before you go, you have to cleane bungalow or pay for cleaning (expensive!). No wifi, only in reception (extra charge).", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d1170379-r271895666", "sub_review": {"Location": 5, "Rooms": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Amazing resort", "review": "I spend with my boyfriend one week in apartment house Parco del Garda last month. The resort has great location near the lake and the city centre. Apartment was nice and clean.In the resort are two big swimmingpools, restaurant, pizzeria, bar and shop. If I go back to Garda, I will stay definitely here again.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d1170379-r210698125", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Simple, but perfect for a group of friends", "review": "We went here at the end of September 2013 with 5 friends and stayed for one week.  The quality of the homes certainly matches the price. The houses are simple, but have everything necessary. There is a swimmingpool and it is very close to Garda. So perfect to walk and have dinner, or drive 5 minutes to Bardolino, which is better and more beautifull than Garda.  So for a group of friends, this is certainly a very good choice.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d1170379-r190837049", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Parca del Garda - tips for travellers", "review": "quiet setting, facilities all quite good - especially pools & restaurants; shop a bit limited but then we like to cook. IT IS a 15 minute walk from town - although there are buses & taxis etc. We went by train, nearest station is Desenzano, then completed by ferry -romantic! Staff spoke fair English, but everything is self-explanatory, e.g. you can check out on Friday, for leaving on Saturday. The map they give you is a bit lacking - neither the gfastest way to the lake side, nor into town are on it - just ask (or watch the others)", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d1170379-r74509425", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}]