[{"title": "6.0   Going downhill, sadly. Not up to 5 stars!", "review": "This is an historic building in a wonderful mountain setting. The food is excellent, with large portions and the restaurant has great views during daylight hours. There is a built-in music system in the lounge, bathroom & bedroom, which is a lovely touch. The sound quality is good too. The bed is comfortable. There is a log fire in the lounge, which is ready for you to light, if it gets cold. The scenery is wonderful and the location very good for visiting Antequera, The Torcals & Lobo Parque. The male receptionist was poor on our arrival, and was not friendly or welcoming. However, the lady on our departure was very friendly. There was a long wait for the bar steward, who eventually turned up, got us 2 drinks, then quickly disappeared. The waiter service was very poor on our 2nd night, forgetting our bread, appetizers & to light our candle. They too were not friendly. As a light bulb was not working in our room, I fetched one from reception & put it in myself. This is supposed to be a five star hotel. Why do the maids never check if all of the lighting works? All of the lampshades were burnt, due to having the wrong bulbs in them. The restaurant did not open on time, so I sat down, and the arm fell off the chair! The Wi-Fi was patchy, dropping out occasionally. The toilet paper is disgustingly thin and cheap. There was no free water or chocolate or turn down service. We booked a double bed, but got 2 x single beds, made up separately, and pushed together! The sound insulation is very poor. You can hear people walking, moving etc. very clearly.…", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r716340210", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Great place", "review": "Dear LuxuryExplorer01 ,  Your vision is the key to complete the satisfaction of our guests, and we are very grateful for your valuable time in leaving your comment on Tripadvisor. We regret your disappointment. All rooms are checked at the cleaning and maintenance level to ensure that everything works properly and if any anomaly is found, report to the corresponding department for repair. It is clear that on this occasion we have not acted as usual and we regret not having been informed at the reception in order to intervene so that you could have fully enjoyed your stay at our hotel. We have taken note regarding your comments of attention to the public and service by our staff so that it does not happen again.  We would like to welcome you again in the future, ensuring in advance our maximum commitment to make your next vacation experience at the Convento La Magdalena Hotel something unforgettable in every way.  Sincerely, Customer Support.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r712891808", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Slightly disappointing experience", "review": "The hotel is older and a bit tired but still a great place to stay in Antequera, Spain.  The room was large and clean. They had a room service menu but when we went to order our lunch we were told there was no cook - so we ate the chips from the minibar!! The dinner was fabulous - one of our favourites so far - the artichoke hearts and octopus were amazing!!  Highly recommended!", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r709298284", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Great getaway", "review": "Dear 508lynnl,  Thank you very much for taking the time to provide feedback concerning your recent visit at Hotel Convento La Magdalena. Your satisfaction is very important to us and we are determined to ensure that all of our guests have a rewarding stay.  Once again, thank you for your kind comments, and we hope to have soon the opportunity to welcome you back in our hotel.  Warm Regards  ", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r708856680", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Dinner", "review": "From the exterior ‘tis hotel looked fantastic. However once we got in the experience was slightly less grand. Overall the hotel lacked atmosphere and was rather tired. This could be a great hotel. The views are fantastic but the decor in the rooms and public areas is tired and the food is mediocre.. The bar area was like a cheap pub from the 1980s. Disappointing and definitely not 5 star as they claim. More like 3 star.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r705895385", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Great location for a peaceful break", "review": "Hotel is understaffed until there is a function on. Gave up on the bar service several times. Also waited 15 mins for someone to serve us in the restaurant one night, but the food was very good and plenty of it. We stayed for 10 days so the menu got a bit repetitive. The restaurant floor was braking up in places and needed replacing. Room was very good with a great terrace outside. Unfortunately the chairs and recliners needed cleaning before being used due to the large number of birds around.  Enjoyed the spa but no staff on duty so we were not able to have a drink as there was no milk or hot water. The spa area needed repainting also the windows needed cleaning.. The front desk and restaurant staff were very good,although at times they seemed to be doing at least two jobs.…", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r681196053", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Beautiful old convent ", "review": "Dear 97abl,  The team of the Hotel Convento La Magdalena, appreciates the confidence shown. Our goal is to offer all customers a pleasant stay and their comments, we are very useful to improve our day to day.   We will continue working to guarantee the best quality of our services.  We want to see you again.  Receive a cordial greeting,  Customer Support", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r680643649", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Beautiful but not quite 5 stars ", "review": "This hotel is a fomer convent and whilst conversion  has been done  very well, there remains an Ecclesiastical  feel to place ! Great tranquil location- tho not far from Antequerra town. Stunning architecture. Period furniture- traditional Spanish dark woods. It looks and feels like a Parador except the food doesnt quite match Parador standard. Lovely indoor pool. Effcient staff. But this is not a 5 star hotel experience-  then again pricing isnt 5 star rates either  and hotel offers great value. ", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r667348589", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great emplacement ", "review": "Dear Kingpaul100,  Thank you very much for taking the time to provide feedback concerning your recent visit at Hotel Convento La Magdalena. Your satisfaction is very important to us and we are determined to ensure that all of our guests have a rewarding stay.  Once again, thank you for your kind comments, and we hope to have soon the opportunity to welcome you back in our hotel.  Warm Regards , Customer support ", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r664496928", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Stunning place for a romantic break", "review": "A lovely location and building, staff were very nice and helpful, but more care on details needed for it to be truly a five star hotel. A few bits in the room, building and spa were simply not top notch: repairs to walls/ceilings/windows/tiles needed. Great views of El Torcal and lots of birds around. ", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r663481946", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Visit", "review": "We stayed here 2 nights only rooms available were 100 and junior suite 150 .certainly not 5 srtar food poor in restaurant no hot water in room first morning .staff helpful but not enough of them to cope .services provided re massage etc had to wait 24 hours to confirm as no readily available at hotel .she was very good when she did come ..", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r662544015", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Great views, food, comfort and peace ", "review": "Located 10 minutes outskirts of Antequera and part of a golfing complex. The views are stunning with El Torcal close by and surrounded by olive groves. The hotel has been converted from a convent and retained much of its peaceful ambience. The  bedrooms are very comfortable, a good size with lovely large bathrooms. Facilities are good and include a spa, nice indoor swimming pool, sauna and Turkish Bath. The restaurant serves excellent breakfast and the dinner ( we chose the €42 taster menu). This might sound a lot but include 3 glasses of good wine and 5 courses that are as good as Michelin star restaurants we’ve been to. You can also eat in the bar area. Parking is onsite and free. Wi-fi is also free and good speed.   The hotel has a large feel to it but only contains about 18…", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r659061887", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excelente ubicación, gran servicio - Great location, great service", "review": "Excelente ubicación, gran servicio. El personal y muy acogedor y amanble. Viajamos allí cada Navidad y nos sentimos como en casa. Muy buen restaurante y volveremos.  Great location, great service. The staff and very welcoming and approachable. We travel there every Christmas and feel like being at home. Very good restaurant and we will comeback.", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r652768924", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Not a  5* hotel", "review": "Arrived at 5pm and told no food available in any area of the hotel until 8pm. No internet for 3 hours and after numerous call men came to try to connect us amidst shrugs of \"but it is working in the corridor\" ...actually I didn't want to stand in the corridor to use the internet!! Went down to eat at 8pm, staff very good meal ok but certainly not 5 * . Back to the room for a bath to find no hot water...reception informed me that perhaps lots of guests used the water ...REALLY!!!  I have had better accommdation in a hostel on the coast. Also I expect the receptionists in a 5* hotel to speak numerous languages , not to say I will try...when I ask a question...thankfully  I speak some Spanish but not good for people who don't. Antequera Hotel was much better organised.....Magdalena…", "date": "January 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r648379805", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Lovely hotel ", "review": "If you are looking for a refined relaxing classy hotel away from it all then this is for you.   Beautiful building friendly staff. Room was lovely, clean, quiet witj comfortable beds.  Shower massive spa bath and double sinks.   As you walk into the hotel through the front courtyard classical music is playing.   We didnt use the spa but the pool was warm and clean.   Only thing I can complain about was breakfast was offered to us at check in €12 euros. We accepted however after only able to eat a round of toast and fruit juice. No fresh milk for coffee or tea, only long life oat or soya milk and no staff around to ask. We cancelled the next days breakfast.   We loved sitting around the lovely warm fire having evening drinks.   ", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r636343262", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Superb food and nice building", "review": "I was searching for the hotel we stayed at in Antequera when I spotted the Magdalena which was a sister hotel to the one I stayed at. We ate at Convento de la Magdalena one night. The food was great and the building very interesting. Would have loved to stay here and may well return some day. I'm sure it is every bit as good as if not better than the one in town.", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r635216766", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "What a shame- should have been a perfect stay", "review": "Location stunning. Convent amazing. Beds comfortable. Huge bedrooms.Lovely open fireplace in bar.Great for travelling with dogs. A few minor points like dust in bedroom and unemptied bins from previous.Also we were told spa was cold due to maintenance. But main problem was DINNER! Food cold. Bad service. No one seemed to really care or seem surprised when we left resturant and refused to pay. Then we cancelled breakfast and had a great one at a local bar for 1/8 of price! So really disapointing and feel really let down", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r631831297", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Hotel with potential but ...", "review": "We stayed one night in this hotel. The 5 « stars » symbols under the name of the hotel is misleading. It is off course no 5-star hotel. Staff with good intentions but understaffed. A bit old fashion kitchen. Infrastructure with lots of small problems : water came in our room during rain as well as through the safety door of the indoor swimming pool, showers not functioning properly, a cockroach in our room, restaurant at breakfast far too much heated, short of milk (we ordered at the buffet but without result), short of juice, ... To conclude: hotel at great location with great potential but too much shortfalls... especially when you create expectations with 5 stars under your name.", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r630228677", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Wonderful secluded property", "review": "This former convent has been wonderfully repurposed into a very luxurious, secluded hotel.  Our room was expansive, one space for a beautiful sitting area with a fireplace, and another area for the bedroom.  The bathroom was larger than most European hotels.  The common areas including the lobby, bar and restaurant, and indoor pool and spa were clean, fresh, and charming.  The grounds were beautiful making for pleasant walks, or just relaxing on one of the patios.  We thoroughly enjoyed our one night stay.  ", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r627263804", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fabulous Tranquil 5 Star Boutique Hotel", "review": "On the outskirts of Antequera on a hill side is this beautifully restored Convent. It is now one of the best Boutique Hotels that we have stayed in. Although we didn't get the chance to use it it has a really nice Spa.There is also a golf course to enjoy. But the things that impressed us most of all, are all that you want in a quality Hotel. A welcoming reception, great rooms with comfortable beds and good food. The breakfast choice is just sensational and if you are a bit of a foodie there is/was a set 5 course gastronomic evening meal including wine for only 42 Euros. WOW. This is a tastefully decorated hotel in good condition that is well located for touring the area.", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r625712163", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Wow", "review": "We stayed at the Convento for 2 nights. We were treated with utmost courtesy and respect by all the attentive staff. The setting is stunning the rooms are well furnished and clean. The facilities are great and the restaurant serves the best food that I have eaten in Spain.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r624740768", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Special place", "review": " My husband and I chose this hotel because of it’s great location and beautiful surroundings. As you drive up to the hotel you can see by the beautiful scenery that you are in a special place. The building itself, with it’s massive doors and 15 th century architecture brings you back in time. The view from your room is of distant mountains and miles of olive tree groves. Truly a peaceful place. When we arrived there was a wedding taking place, but in no way did it change the enjoyment of our stay. The staff here is always super helpful and friendly. We booked a standard room and it was very large by most hotel standards. The bathroom was roomy as well, with double sinks, a shower, and a separate jetted bathtub. We took advantage of the spa area. This area could use a little…", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r622632167", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Hermoso lugar! Beautiful!", "review": "The convento offers wonderful views on the surrounding nature. Room was very spacious. Price/quality ratio was very good.  I recommend visiting Antequera and the natural reserve of the Torcal (wonderful), if you like natural landscapes. We had a pleasant, relaxing stay.", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r581467761", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Two rooms with a suite", "review": "Estimada Elena,  Gracias por compartir su excelente comentario con el resto de usuarios de Tripadvisor.  Nos alegra que haya disfrutado tanto de nuestro hotel como de la bella ciudad de Antequera.  Esperamos volver a verla muy muy pronto.  Atentamente,  Hotel Convento La Magdalena ", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r580383838", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Anti Climax", "review": "Traveling with another couple, we were pleased to be booked in a large suite with adjoining bedrooms.  The suite was so large that it included a dinning room with a table for 8.  There is an attached banquet facility that used to be a church which could accommodate large groups.", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r578945764", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Group of 25 golfers and partners", "review": "Simply fantastic despite the worst weather in the area for years..... breakfast a royal TREAT..... food tasty and plenty of options... beer prices reasonable....  staff outstanding.... room problems including flooding sorted with a smile and promptly. Second visit will be back.", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r567716591", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Nice setting and good food", "review": "Estimado William,  Muchas gracias por compartir su excelente opinión con el resto de usuarios de Tripadvisor. Nos alegra muchísimo haber cumplido con sus expectativas.  Nos vemos muy pronto  ¡Hasta la próxima!  Atentamente  Equipo Hotel Antequera", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r566692936", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Romantic night for 2 - Ruined!!", "review": "We had a nice meal here on Sunday evening. The Convento de la Magdalena is in a lovely setting about 5km from Antequera but well worth travelling the distance. The food and wine were great and everyone thoroughly enjoyed their meal. Prices are reasonable for a 5 star hotel.", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r560627316", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": " Holiday", "review": "The hotel looked stunning on paper and I thought it would make for a lovely romantic Valentine's treat for my wife and I. Indeed when we arrived after dark it looked beautiful even mythical standing out against the surrounding valleys and hills! The romance stopped there! We booked through booking.com and requsted a double bed (obviously!) and much to my dismay we were presented with 2 single beds in a freezing cold and somewhat dated room! No others were available we were told, \"excellant start\" I retorted! Never mind, being the fun and positive people that we are, we were going to make the most of it! Dinner beckoned, so we headed to the dining room, it is in the Michellin guide after all! Negatives first; poor lightning, far to hot (actually we needed to warm up from our…", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r559608760", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Fabulous!!", "review": "Estimado Jon,   Sentimos mucho que nuestro establecimiento no haya cumplido con sus expectativas.  Hemos tomado nota de  todos sus comentarios para hacerlos extensibles a todos los departamentos implicados. No solemos tener queja alguna de nuestro servicio de restauración, pues siempre son buenas críticas. Intentamos ofrecer lo mejor de nuestros fogones para que todos los clientes disfruten de nuestro restaurante.  Sentimos mucho lo sucedido.   Gracias una vez más por sus comentarios. Nos ayudan a mejorar.   Nos encantaría que volviera, así poder demostrarle que nuestros servicios son excelentes.   Reciba un cordial saludo ", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r554543338", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Lovely setting , wellness area disappoints ", "review": "The setting is amazing. Entrance fantastic. A very tired 5 star establishment, we paid for an upgrade to have access to The wellness area... suite was huge with a nice bathroom but tired. Bed not so comfy and wooden panel rattled. Sauna did not heat up and steam room smelt, not a relaxing wellness area.. just in front of loud pool. Not worth the extra money.  We received misinformation about the tours.. carmina del Rey does not take 30 mins.  Wonderful run from the hotel on side of the hill.   Breakfast more pricey that other places we stayed at but great selection .. annoying being told to book at check in or more expensive if u go down without booking.  ", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r551851088", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great Location", "review": "Estimado cliente;  Ante todo agradecemos haya compartido su opinión con el resto de usuarios.  Nos alegra que le haya gustado el hotel y tomamos nota sobre sus comentarios de la zona de Spa. El equipo técnico ya lo ha solucionado y todo funciona correctamente.  En cuanto a la información del Caminito del Rey sentimos lo sucedido, pero nos resulta raro que haya sido información de nuestro departamento de reservas, pues todos enviamos los datos correctos, indicando que en coche se tardan 40 minutos aproximadamente.   Una vez más le agradecemos su comentario y esperamos volver a verlos muy pronto. ", "date": "December 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r551409062", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice place to spend a night or two", "review": "The hotel was great  for the location, room very nice, nice jaccuzi, almost with all you need (coffee maker) Breakfast and restaurant very nice, but please its a 5 star hotel , so don't go around with a trolley to clear the tables. No sight. Very good hotel when you have a dog, nice walking.Good restaurant, but at Christmas evening at 22u you had to finish your dinner, because the close that the staff can go home....to celebrate. So in the room at 22u30 nothing else to do. Refreshment of the Spa is needed.", "date": "December 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r549349631", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Very nice hotel!", "review": "We spent Christmas Eve here and took their Christmas package which included 1 nights accommodation, dinner and the buffet breakfast.  Both meals were excellent.  The location is beautiful, as is the building.  The spa facilities are great and the staff are helpful and friendly.  The reason why I did not give this place a 5 rating is that our rooms were both very hot and we could not individually control the airconditioning.  We slept poorly as a result.", "date": "December 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r548623961", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Peaceful Old Converted Convent", "review": "Estimada LeahSydney;  Muchas gracias por dedicar su tiempo a comentar su experiencia con el resto de usuarios. Tomamos nota de su comentario y lo haremos extensible a todo el equipo.  Esperamos volver por nuestras instalaciones.   Aprovechamos la ocasión para desearle Feliz Año Nuevo.", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r539395691", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Beautiful old convent", "review": "This hotel is feels as tho u r in the middle of nowhere but, in reality,  antwquera is not that far away. A former convent , the architecture is old and really impressive. The public areas are well furnished and the bedrooms are comfortable and stylish. Ensuote bathrooms decent size. Swimming pool is a lovely modern addition althougg the spa category/description is a little optimistic for what is actually on offer. Enthusiastic staff. Wonderful food at dinner. Breakfast somewhat disappponting- a little sparse. Great pricing for a unique property. ", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r534851615", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Weekend break", "review": "Remotely located hotel in the grounds of a golf course in the outskirts of Antequera. Old convent with original features in evidence throughout the building. Basic spa facilities with indoor pool. Excellent restaurant with tasting menu on offer for a reasonable price given the quantity and quality of the food provided.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r534242477", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Quiet Gem", "review": "We stayed here two nights as part of our organized bicycle tour through Andalusia. The room was wonderfully elegant:  quiet, clean, luxurious bathroom, and windows to be thrown open to the mountain views and fresh air.  Breakfast buffet was excellent, as was dinner in the bar one night with our group, where we were served rounds of tapas and Vino Tinto Verano.  Lounging on the lawn, we sampled dates from the palms, and visited the resident donkey and fowl up the hill.  Hiking and mountain biking are available right out the door, with a view of Antequera up the hill.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r530842315", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Dissatisfied ", "review": "This is supposed to be a 5* hotel but it lacked many qualities for this. The room was lovely and clean, unfortunately the air- con kept breaking down. When reception were informed he kept saying it had been fixed, it took them until our final afternoon to sort it.  The spa looked lovely until on closer inspection you could see it was very tired, with tiles missing in the pool and hadn't been cleaned for some time. The sun beds were mostly ripped and the jacuzzi was so hot it burnt your legs.  There was a lack of staff so if you wanted a drink there was often a long wait. Food was very hit and miss with most of it being off the menu.  What this hotel needs most is a lot of updating with the necessary attention to detail.  I must congratulate the lady on reception who , I think,…", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r529933718", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Older rooms but comfortable", "review": "We stayed at this hotel for one night as part of our cycling holiday. From the outside, it looks quite nice. We were assigned a junior suite, which was quite spacious with a cozy and good sized family room with fireplace. Our room faced the main courtyard. It's not a modern space, but the room was clean, minus some sticky spots by the door. Not a deal breaker as the hotel does provide slippers. The bathroom is spacious; however the shower squeaked when in use, and the soaker tub (which we didn't use) had a slow drip. Breakfast was unimpressive, with very little protein options and not a large spread. In their defense, breakfast was just being setup when our group entered the dining room - we had an early start that day.  We didn't have much time to explore this hotel and its…", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r529730077", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "coffee / lunch", "review": "Well,  how disappointing were we, after using this hotel for over 4 yrs, we took new friends up for lunch in the bar, we always have a sandwich or salad. But looking on the menu I noticed that the prices had doubled, the drinks cost over 15€ for 4 small lagers and a coffee. So we went down into Antequera to the Italian for lunch, we won't be back and I'm spreading the word.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r529541398", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Outstanding!", "review": "I stayed at this hotel is part of a biking trip in Andalusia.   This was the nicest property we stayed in, beautiful in every way. The building itself is old and interesting, the rooms large and very well appointed. Other facilities include a restaurant, bar and a pool/hot tub/sauna area. Bathrooms amazing!  We had one dinner and breakfast at the restaurant, both excellent.   The hotel is located on a hill with beautiful views of the surrounding countryside. One can sit out on the lawn overlooking the olive groves and city below.   While we were there, they were setting up for a wedding. This would be an incredible spot for such an event.    Very lovely, relaxing spot!", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r529342232", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "We were only there for the restaurant. Busy but we were still well looked after", "review": "We were a group of about 30, we were well looked after, the service was friendly and the room we were in was very nice. The food was good but not as good as the reputation lead me to expect, nice but not special. Lovely place but the food needs to up its level in order to match the surroundings and reputation", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r529086959", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Great place to stay", "review": "We spent one night here but could have stayed another. The property is well located close to Antequera and comes with great views. The swimming pool and spa facilities were well maintained and much appreciated after a day's sightseeing. The restaurant produced some really good food and the wine selection was broad and well priced", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r526885881", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Visited for lunch only", "review": "We called in to the Convento de la Magdalena for lunch after our golf had been rained off, yes, rained off in August! There’s no doubt this place is beautiful but I certainly think it’s let down by the quality of it’s lunch offering. We ordered ciabatta sandwiches accompanied by a glass of red wine. The sandwiches were ok though the bread was obviously frozen as served rock hard, most disappointing was the wine. You’d expect an establishment of this quality to serve only the best but it was very poor and most definitely the worst glass I’d had anywhere during my visit. When we pointed this out to the waitress she said they’d had complaints before, well why still serve it? The Convento de la Magdalena just oozes class, beauty and charm but is let down by the detail, shame as it…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r520644952", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Off the beaten track ", "review": "After a short drive through an increasingly beautiful landscape we arrived at the monastery. Seeing this marvellous facade, entering the splendidly decorated cloister already made us feel good about having chosen this hotel. Reception was pleasant and the room we were given adequate and spacious. Maybe the decoration not quite on the level of the antique part but not ugly. Our room had double doors opening towards a lovely vegetable garden and a splendid view.  We had an excellent dinner, served by a most friendly waiter and the next morning a lavish breakfast including all imaginable Spanish delicacies of superb quality.  After some relaxing time in the pool and steam bath we continued our voyage, feeling extremely satisfied with our stay.  Fantastic value. Highly recommend.  ", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r520482608", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "SO ROMANTIC AND SPECIAL! UNFORGETABLE. ETERNAL CHARM", "review": "Just came back from the most romantic week-end ever at this stylish hotel. My cousin celebrated his wedding there and we had the greatest time. The staff amazing, how they handled all our needs and made our stay really special.   Always with a smile and all kindness. The room was beautiful, comfortable and a big bathroom. Amazing views to \"La Sierra\". Peaceful place. Lady at the Spa was very sweet. At breakfast the waitress was very caring with us and the children. At the front desk the man that did our check- out Sunday at 4pm was very patient!!! He had to bare with a smile my rushing to get to the Ave on time. He did it with a big smile. Thanks!!  And a very special thank you to the best waitress. Georgina (Josefina) A truly proffessional lady!!!!  She help us with everything.…", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r502727531", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "A chance to stay in a convent", "review": "The hotel is in an attractive setting near Antequera. The walk into town would take an hour, along a beautiful country path. The hotel restoration is quite good and the spa functions well. The rooms were good. I didn't think the food was consistently  good. We had one good evening meal and one very so-so meal. There was a wedding until past 3am the second night we were there, but in fact it wasn't too noisy. Staff were friendly. All in all, a bit of a surprise the hotel has five stars.  Finally, there is really no need for piped music, in and out of doors, in a hotel attempting to create a tranquil atmosphere!", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r496941359", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Spanish hidden gem", "review": "This is a lovely hotel in spectacular scenery on the outskirts of Antequera. It is a converted convent which retains some of its original features and is a pleasure to stay in. The bedrooms are comfortable and quiet and some have their own gardens! The restaurant is lovely and the food excellent. Breakfast was very good and the staff very pleasant and helpful.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r493205460", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Not 5 star", "review": "Very nice location . Big clean rooms with large bathroom . Super good restaurant Only staff at reception speaks English  Treatments in Spa are not at all professional . Spa is not to recommend  All day long the guest have to listen to the same sad funeral music , as well in the bar , restaurant , corridors .... We did not understand why they want to make the guest feel sad in such a nice place They should stop playing the same sad cd all day long . No luggage service , no drinking water in rooms . No water boiler for tea or coffee  ", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r492629409", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Fab hotel and surrounding,staff and restaurant let in down", "review": "We visited this hotel for a special occasion.The Convecto is in a beautiful setting and an excellent building.Check in was very efficient.Room was lovely spotless clean.Air con was poor.Bar was understaffed,and when restaurant opened,they used staff from bar.Good menu but my potatoes were raw!!!When we explained to staff,she shrugged her shoulders and said \"sorry\" it was never mentioned again!! No compensation,or explanation from restaurant manager???If you do eat here,order your drinks in restaurant and take them through into bar,once you have finished your meal.Poor really for a hotel that claims to be 5*!!!We won't be back!!!", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r492160054", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "A magical place in Antequera", "review": "This hotel is nested on the hills just above the city of Antequera, in between el Torcal and the city itself. Its location allows a breath-taking view of the surrounding  landscape in a quiet and isolated spot, almost magical al night. The hotel service was very efficient and its catering service was very good. We had booked a regular room, but when we arrived we were offered a suite for only 20€ more. The cost of the room included spa and breakfast. The suite was really nice, with a classical touch, coherent with the overall structure, that is an old convent. I enjoyed the stay very much, except for the spa. This clearly necessitated some maintenance work.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r491925159", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Relaxing visit with Dog", "review": "Set in some stunning countryside, with great walks and absolute quiet except for birds and insects. Staff were courteous and professional, all spoke fabulous English. We had a garden room which was well appointed with lovely bathroom, separate shower, all very clean. Perfect if you are travelling with a dog. We walked into Antequera which took just over an hour. Had dinner in the restaurant which was delicious , definitely recommend and go back for the value for money it proved to be ", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r491320590", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A relaxing place", "review": "Staff was very helpful and nice, particularly at the reception. They arranged tickets for El Caminito del Rey, gave us directions to help us move around, arranged a snack when we couldn't take breakfast. Breakfast was excellent and dinner, although with only four options, was adequate and provided a balanced Mediterranean diet. The service could be extremely slow when they had more clients, though. Antequera is a lovely city, worth visiting.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r489206637", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Special place worth the stop", "review": "We were on a cycling trip with Trek travel and spent two nights here. Employees were especially courteous. Beautiful public rooms since a renovated convent with great views. Golf is close if you like that but also a very nice natural walking/running trail overlooking Antequerra. Great breakfast buffet but no dinner. Rooms very large bathroom with working jacuzzi tubs.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r485645528", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Location and food are remarkable", "review": "La Magdalena is located in a breathtaking mountain area. It claims  to have 5 stars and the location is indeed 5 stars. We will certainly come here again but there are a few things during our saturday to monday visit the last weekend in april that not really match the 5 stars: The room we were asigned was room 101 - first floor.  There is no view as the only window (40x40cm) is under the ceiling. We directly refused this room and had instead room 0002. The 0001 to 0009 is a part of an extension to the original Convento. Charming room, doors to a small kitchen garden perfect views (to the south), bathroom with whirlpool. It is a little remote to the mainbuilding but we accepted it- and enjoyed it. Soundproofing was however not included in the construction. We could hear room 0001…", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r482735759", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Terrible experience", "review": "We booked a 2 day stay in this place in February via booking.com to 4-6 May. One day before the stay the hotel sent us a message cancelling the stay due to overbooking. They tried to put us in other hotel (with less quality, but from the same company) for the same price we paid to Convento de la Magdalena.  We called the costumer support of booking that told us that they never should contact us directly, without contact booking.com first. The booking.com costumer service was amazing and gave us other options with similar quality and payed the difference from what we paid to stay in convento de la Magdalena to the stay in the new hotel. This is not how we expect to be treated by a 5-star hotel. We do not recomend at all.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r482450089", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "A sense of peace and tranquility", "review": "My husband and I stayed initially for one night in April then was due to move on to stay at a different hotel for the rest of our break. However, after arriving at the 2nd hotel there was no comparison to this one and ended up returning for a further 3 days as we enjoyed it here so much. On the 1st night we had a mini suite with two double beds, very comfortable, good quality bed linen and pillows. Beautiful bathroom with wonderful toiletries and a jacuzzi bath. The following nights we were in room 101 as they were fully booked but they did inform us that this room had no windows but it was still a beautiful room on split levels. The spa area is beautiful - pool very warm. The steam and sauna is on a timer which didn't seem to get hot enough quick enough. The surrounding area of…", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r480400051", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "An interesting experience", "review": "A unique experience staying in a former convent.  I kept imaging what it would have been like to be a resident in this place when it was a convent.  I found it a little creepy, but interesting.  The bedroom was a little small, but then there was a separate sitting room (this was a nun's apartment, but was it for 1 or 2?) where it was easy to stage our bags.  The bathroom shower was a little small, but definitely was adequate and functional.   Roosters in the morning started at 4:30am (we had a room facing the entrance) and someone kept hitting their snooze alarm--they were relentless!  Overall, I'd say I was satisfied with our 1 night stay, but probably wouldn't have wanted an extended stay.", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r478450170", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great location, relaxing, value for money, friendly service", "review": "Stayed 4 nights with a family in two connected double rooms. Located few kilometers from the attractive town of Antequera in a relaxing natural surrounding. Interesting building, a former monastery. Room was fine, with direct access to a nice garden. Very good breakfast, excellent choice. Dinner was also good, choice for vegetarians is somewhat limited,  service is a bit slow, but very friendly. Pool area is well maintained, it is not very big, but for some reason was not actively used and we had it for ourselves. Overall, much recommended.", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r476273351", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great away from it location, peaceful and great value", "review": "We stayed with our adult daughter for 3 nights in March, weather was OK, so didn't need air con or heating.  We were given 2 bedrooms with a shared lounge area which was really nice. Breakfast was excellent, mainly continental with wide selection, but will cook to order. We ate there one night at the bar and had drinks, pricing was very good. The hotel is remote and peaceful with good facilities, if you want to travel the region it is a reasonable base but be mindful that some roads can be a bit rough.   Only complaint was the music that kicked in at 9am and ran to the late evening, it isn't needed and adds nothing.  Scenery is stunning", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r471445979", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Not a 5star hotel", "review": "What a disappointment this hotel was. It is listed as a 5 star hotel and it is most definitely not. The room we were given was ok. The shower had seen better days and was difficult to operate. The decor was tired looking and it seems that some investment is needed. The duvet on the bed did not have a cover on it. It was between two sheets.   We were booked in for half board and there were no clear suggestions of what we were able to eat for our evening meal or what we could order off the menu. The food we chose and served was disgusting. We never got our desserts as they were too busy serving 3 large tables who arrived. The dining area was cold and draughty and this was made worse by a diner opening  an outside door we presume so that they could smoke indoors. Breakfast was not…", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r469643024", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Want to experience a night in a five star coffin?", "review": "Booked with British Airways to stay in a standard double at this establishment for the two nights of the 12th and 13th of March 2017. Upon arrival we were given the keys to room 101.When opening the door and finding a light switch, a must given this room has no windows, we climbed two flights of stairs to the creepiest bedroom we have ever experienced in over 55 years of travelling the globe. 'The hotel is full' we were informed and as we had already pre-paid were transferred to their sister four star hotel down in the town which is a very basic coaching stop over. Unless you want to experience what life in an air less coffin must be like DO NOT even enter room 101. How we would have got our heavy suitcases up into this strange medieval loft will always allude us, and my wife is…", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r467576764", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Reservation was not honored", "review": "My husband and I had reserved a room for a 3 night stay, together with our dog who had been approved by telephone.  To our astonishment, upon arrival we were informed that the hotel was fully booked and that we had been re-booked in Hotel Antequera in the town.  For obvious reasons we found this totally unacceptable.  Obviously I cannot grade the Hotel Style and Amenities etc. as we were turned away.", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r467312440", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Dreadful lunch", "review": "This review is for the restaurant.....it doesn´t appear to be listed separately on Trip Advisor. We went for lunch on Sunday with friends. It began with a badly chipped wine glass. Our starters were mediocre at best. Mains were dreadful. Thin & cheap cuts of ´steak´delivered to us on cold plates.   The plates were wheeled into the restaurant on a trolley which was ignored for 5 minutes or so by the serving staff. When delivered to us the food was cold. We complained & received a nod from our server.I complained a second time and our food was removed with apologies. New dishes were brought. The best part of the meal was the desserts. This place is supposed to be 5 star. It isn´t. The main dishes cost €20 + and are no better than an average menu del dia at €8-10. Bread sticks…", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r463278118", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Ian Banks", "review": "We did visit with friends from Malaga who have stayed previously. I have some very positive and negative things to say. Firstly the setting is magnificent and the old convent very impressive. The hotel restoration is classic thoughtful and well done. We enjoyed both breakfast and dinner in an elevated position over the valley and olive groves. This is a worth the stay for this alone. Also staff friendly and obliging. It is not 5 star though. In fact they do not charge 5 star. The rooms are unevenly heated  our kids room was only just warm enough. The key cards kept deactivating and ment frequent trips to reception. Worst of all the rooms on the lower level are connected by a hall that is below freezing in winter. The sauna is in disrepair and one room we saw stunk of mold. These…", "date": "January 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r453988266", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "December Visit ", "review": "Stayed here for the weekend for a wedding ,this was a gorgeous hotel set in a lovely location with some amazing views but a couple of small details let it down a little, the hotel itself is beautiful with some stunning features,the rooms were nice enough and spacious but don't have any Tea/coffee making facilities and the lighting wasn't the best it was very dimly lit ,also the robes they have available were very badly kept and the ties were cut on the ones we had so you couldn't tie them up if you wanted to go down to the pool area/ spa in your bathing suit, also the staff were lovely and attentive but at times there didn't seem to be enough of them like at check in there was only one person handling around 20 people checking in at once so there was a long wait and at the bar I…", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r444196068", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Peace and Tranquility", "review": "Beautiful, peaceful location, very friendly and helpful staff. We had a junior suite with a comfortable bed, sofa, mini fridge and TV. The restaurant offered a good choice of food that was of a high quality and reasonably priced. There was a lovely log fire, perfect on a cold, wet November night. Excellent breakfast.", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r443439284", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "LOVELY STAY", "review": "We stayed for a weekend with friends! Do choose if you are 4 the rooms 203-204 that come with a lovely salon to share. The staff is friendly and eager to help, breakfast is very good and parking very convenient. Do not miss the SPA, remember to book at front desk in advance.", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r440109223", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Loved it!!", "review": "The hotel is absolutely beautiful! It is located approximately 10 minutes from town, in a very quiet and serene setting. The service is top-notch, and the breakfast offered was simply fantastic. The rooms are very comfortable, and the bathrooms are large and very clean. I highly recommend this hotel.  The spa does not quite live up to the hype. I would not call it a spa, but rather an area with a pool and they call in a masseuse when a massage is scheduled. The sauna and Turkish bath were both not functioning.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r433393372", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Not a five star hotel", "review": "Went with friends to celebrate a 70th birthday. From arriving we all thought wow what a superb peaceful and stunning looking place. We checked with reception that our table for 5 people at 8.30 was booked and was told yes. We all decided to have lunch in bar area which was superb. After lunch we all went down to the spa. And had to ring reception to have all facilities switched on. The sauna didn't work and the steam room was cold.   The bed rooms where clean and comfortable. But in our bathroom the walk in shower had no shower head holder. The plugs in both sinks and bath did not work.  Arrived at the restaurant for our 8.30pm booking to be told we didn't have a booking but was seated and ordered food and bottles of wine our rose wine we kept on asking for as was in a cooler at…", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r430039786", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Excellent", "review": "Superb location, outstanding food, reasonable prices and fantastic service. Have not stayed there yet, this was a lunch with friends, but planning to stay next year and take advantage of the many facilities available.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r429399370", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "We only went there to look at the hotel, but Wow!", "review": "We were staying locally at Casa Magel in Valle de Abdalajis (near Antequerra) and had heard about this former convent which has been converted into a 5-star hotel. Well, wow, what a sight it was, an amazing building with the skeleton of a 16th century convent now turned into a beautiful hotel.  We wandered around the building and eventually decided to stay for  coffee and dessert. We were not disappointed as the coffee was lovely and the desserts fantastic. Although you would expect the price to be a little on the high side, as the saying goes - you get what you pay for - and the quality was first class.  We will consider this as an option for staying in the area in future as the prices don't look too bad for such a quality hotel. Well worth a look if nothing more.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r426695387", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Interesting historical hotel in a pleasant setting", "review": "This hotel is located in the highest part of Antequera, beyond the golf course. It's hard to reach if you don't have a car, but the atmosphere is idyllic as the hotel is surrounded by hills, valleys and olive plantations. The hotel was an ancient cloister and it has still its fascinating frescoes and structures, such as the original chapel. The entrance is grand and well cared, the hall is a bit vapid, but the room is very big and charming, with original colors and pieces. In the hotel you can find a beautiful spa, with sauna, turkish bath, Jacuzzi, herbal, tea and coffee room, and a nice outdoor garden with views of the valleys. The breakfast is nice but cannot be compared to the whole rest of the experience. The price is also reasonable for the beauty of the place.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r425684573", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "The most beautiful, stunning and amazing place can't wait to go back :-)", "review": "We got married in Antequera and had our afters in La Magdalena we stayed there for 3 nights and it was beyond amazing!  It is steeped in history and located in the most beautiful setting in the mountains.  The staff are so nice, the food is awesome and the rooms are absolutely gorgeous.  All our Wedding party commented on what an amazing place it is and said they will never forget it and a lot of them want to go back.  When you see it yourself you will know what I am talking about go and enjoy it :-)", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r425554595", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great place to stay. ", "review": "Superb venue. Views were incredible. Pool with outdoor area was lovely  Very clean accommodation, great breakfast and evening meal in restaurant.   Would highly recommend and if in area again would definitely stay here.   Antiqurra interesting place to visit too we found the underground car park, just as you come into Aniquerra was very handy and not expensive. Dinner in the bull ring interesting too ", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r423715150", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent Hotel", "review": "A really enjoyable stay in a quiet and friendly hotel,  the room was comfortable, the staff were friendly, the meals in the restaurant were really good.  All in all an excellent hotel and great value for money.  I will be back ...", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r422918818", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Outstanding and Unique", "review": "This Hotel is set in a wonderful peaceful location.it has a wonderfully appointed Spa with pool. The rooms are beautiful and many have an outdoor private garden, which grows organic tomatoes, herbs and vegetables. Patio doors lead you from your bedroom to these private gardens. However the highlight for us was the Restaurant ....the food is incredible...try the duck or steak....yum !!! Overall the value for money is super and they do nice deals with Antequero Golf Club, which is a challenging course. The staff are lovely and Antonio is an understanding Professional to his fingertips.  This is a unique gem.......just go and book it!!", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r421597506", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A Jewel In the Mountains.", "review": "We stayed with friends at La Magdalena on a two night, two games of golf break. The hotel staff are amazing, very welcoming and helpful. We initially called in for lunch one day and decided to stay for two nights! The lunch was delightful and convinced us that dinner would be an even better experience. The breakfast , buffet was excellent and the chef was fast and very good . We came back after a hard days golf to enjoy the pool, sauna and steam room all of which were good. Then we had a gastronomic experience which to be truly honest was the best food we have eaten in Spain to date. The tapas were delightful. The entrees were varied and interesting and the mains were delicious. Ample portions and beautifully presented. There is a very good wine list to appeal to every palate…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r420917146", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Magnificent location & product", "review": "Beautiful location, magnificent food, friendly staff. We booked for the golf at nearby Antequera but we would return for the quality & beauty of the hotel. RThe food was superb & truly 5 star quality at affordable prices", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r420551854", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "About to return for the third time", "review": "We cannot visit southern Spain without staying at  the Convento, always spot on. Majestic surroundings with food to match, Antequera is full of history, try to visit Lobo park if you get the chance and learn things you never knew about wolves.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r415862424", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Staff need management support", "review": "We thoroughly enjoyed our two weeks at the Hotel Convento de la Magdalena.  Our Junior Suite was spacious clean and well serviced. The breakfasts were excellent with a wide choice of local produce and we had dinner there three times which was enjoyable.  The town of Antequera is a 10 minute drive away and worth visiting. We spent many evenings there enjoying tapas.  Our greatest disappointment was the golf course as it was in disgraceful condition. Only the greens had been watered and the rest of course was a dust bowl which made it virtually unplayable.   During our time at the hotel we never saw a manager. The staff are left unsupervised and unsupported. They did their best and on the whole did well but there were a number of times they would have benefited by having somebody…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r414947054", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Disappointed!", "review": "Spent 2 nights with a group of golfers. It was organized for us. Hotel is in a beautiful location set amongst mountains and olive groves. Very peaceful, but in need of renovation!  Our room had a separate small sitting room, bedroom was dark, very small windows. Bathroom was nice with a jacuzzi bathtub. Shower didn't work as the faucet to turn the water on was broken and missing! When I complained- couldn't change room as hotel was full. Reception promised to fix it for the next day. It didn't happen as they didn't have the part! At least the jacuzzi bathtub worked.  Spa was not great! It needs TLC. I almost burnt myself in the shower before using the pool. The cold water button didn't work. The other shower didn't work either. The water in the jacuzzi didn't look clean!  Inside…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r413719702", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Let down by beds", "review": "Lovely hotel. Great setting and a gorgeous building. The bathroom was great and room nice. However the beds were dreadfully uncomfortable so we didn't have a good night sleep. Also it desperately needs an outdoor pool. The restaurant was lovely and breakfast great", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r412586608", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Total peace and relaxation", "review": "If total peace and relaxation is what your after then this is the place for you.  Off the beaten track, but only 10 mins to beautiful Antequera.  Lovely room and hot and cold buffet breakfast was amazing.  Spa with treatments available on Saturdays at a reasonable price.  You must explore Antequera, it's 30+ churches and the Moorish castle and Dolmens.  Plenty to keep you busy.  Book the Caminito Del Rey through the hotel, or you won't get a ticket, it is truly breathtaking!  El Torcal is another must for a morning out, plus a day sunbathing and swimming in one of the lakes around Ardales.  Stayed for 7 nights and would recommend wholeheartedly to other couples.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r411904531", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very rural,stunning landscape,would make an excellent wedding venue", "review": "Three night stay,lovely breakfast,excellent restaurant ,beef tataki superb.not expensive. They opened up the catacombs for me,very interesting history. The walks are amazing as is the wildlife particular the birds. Lovely old town of Antequera 15 minute drive. Car is a must. An excellent venue for a wedding", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r403931432", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Undoubtedly, one of the best  in Spain!", "review": "Difficult to know where to begin this review, so let us begin with..... magnificent,    then move on to exceptional and finish with stunning! Magnificent building which as the name indicates was a former convent and which incorporates the original church and cloisters into this modern operation. We chose this, to us, fairly local hotel as it features on our \"bucket list\" of hotels to visit and a special birthday made it an appropriate choice. Exceptional accommodation. We chose to splash out on a suite for our stay,  which proved to be enormous but modestly priced for what was offered! Furnished in traditional Spanish style it was beautifully appointed with a sitting room, huge bed and large sized bathroom fitted with a jacuzzi and double shower cabinet, Terry bathrobes,…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r400813492", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Brace yourself Rodney - men at work", "review": "This old, well very old building has been converted into a hotel/ spa with a restaurant. It is on the outskirts of Antequera. Little hint. If you are travelling from Valle de Abdalajis/ El Chorro on the A343 and you are using your Sat  Nav then it may send you into Antequera and then do a recip on yourself. I should of had courage in my conviction. Just a few clicks after Lobo Park on the A343 there is a small sign(Hotel Convento la Magdalena) that indicates a small road off to the left that appears to go nowhere. Well this is a new road that has been built and sat nav (mine didnt) doesn't know it. It saves about ten mins off your journey.  The building is beautiful and take some time to wander around the outside and also the inside. The owners are still in the  process of…", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r400374725", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Beautiful location", "review": "This hotel is located at a magnificent location. The rooms are beautiful with good facilities. Not sure this is a real 5-star hotel, however, the prices aren't 5-star as well. So the price-quality is in a very good balance. The food was delicious. The employees are very friendly. This hotel is perfect for a one night stay and I can truly recommend it.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r391293729", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Unexpectedly wonderful", "review": "Stayed here for one night on the way from Malaga to Córdoba. We arrived late to see the most stunning of buildings lit up. It was magical.   Having arrived at 11 and the restaurant was closed but the staff quickly rustled up some sandwiches and gave us some lovely cold beer- which cost almost nothing.   The whole place was full of history and character. Our room was really large and spacious and simply appointed walking out onto a terrace. Once we could see the view in the daylight it did not disappoint.   There is a charming restaurant and a love indoor pool and jacuzzi. The su loungers outside were really nice-shame we did not have time to relax.   I wish we had had the chance to stay longer. I'd recommend for couples, golfers, cyclists or those on a spa weekend.   The staff…", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r385841099", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Unbelievable", "review": "When we came for a romantic week,  we didn't expect that the room would fall apart?  The shower was broken, the music didn't work, the bathtub didn't have hot water, and then it broke so you couldn't get the water out.  There should had been a spa and massage. The pool had dirt all over, the tyrki bath was not on, the only thing that worked was the jazussi.   We were so disappointed!  But then we went to the hotels restaurant, and WOOW THAT WAS 1st class!! really good, amazing food.", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r385482213", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Amazing!", "review": "Hello Mrs Stephanie,   I appologize for all the incidence that you had with us, i'll personally invistigate your case so as to let all in order.   Would you like please let me know your full name and surname, arrival date and room number.   Best regards   Adel  Front desk manager  ", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r374707364", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent Historic hotel outside town", "review": "Stayed 2 nights here with my wife. Very nice staff, good breakfast and dinner. Location is about a 12 euro taxi into Antequera. Beautiful hotel. Really first class all the way. Interesting building with old chapel, courtyard, and crypt. Comfortable beds, rain fall shower head, jacuzzi tub with view of orchards. Sad to leave such a magical place.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r373096616", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Surreal", "review": "Located in the country side just outside Antequera this former convent has large rooms, many with their own separate living area. Traditionally furnished the rooms are very comfortable and the bathrooms spacious. There is an indoor swimming pool and spa on site. A golf course next door. You will no doubt have a car if you choose to stay here. Service and food was extremely good.  ", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r370761553", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Not 5*", "review": "Great location in mountains. Large lovely rooms (104 room was really nice). But it is a strange experience! It is really good value as it includes steam sauna and pool in room price, and has an excellent breakfast (fresh omelettes made to order and really large variety of food). Great views across the valley from the dining rooms. Fantastic for walkers and cyclists. But it is old and desperately needs updating. It has these massive rooms for weddings that when not in use look peculiar and haunting. Tip- speak to reception before heading to sauna/steam as they need to be switched and need 45min to be set up. Basically it all needs a revamp and all public spaces need a desperate re think. ", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r368496092", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Looking for somewhere special?", "review": "What a wonderful two days we had here. The hotel was wonderful and quite unique. It was previously a convent. Lots of character  The setting in a valley of olive trees with the mountaIns was stunning and so serene. The staff were friendly and helpful.  Dinner was excellent as was the breakfast. If you want to get away \"from it all\"  then I would highly recommend it.", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r365832576", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fantastic base for exploring Granada, Cordoba, and Antequera", "review": "If you want to stay in one place and explore the delights of Granada, Cordoba, Ronda, and Antequera (Alcazar, El Torcal, Dolmens) and want to be out in the typical rolling countryside of olive groves, then you can't do much better than this comfortable hotel. We spent 5 nights there and dined there one evening, which was very good. The view from the dining room is magnificent, overlooking the olive groves and mountain range. Breakfast was great with meats, cheeses, omelettes, cereals, fruit, bread, croissants, and other pastries. The receptionists and bar staff were very friendly and attentive. There is a lovely easy 9km walk from the hotel into Antequera along the south side of the valley, which has a very gradual descent. Note: Google maps thinks this is a wiggly road that you…", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r359850767", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "One night stay", "review": "A lovely tranquil hotel a few km from anteqeura .beaufiful room, bedding , towels . breakfast excellent. Will stay again .we used the spa we were the only people in it that day.not all of the equipment was functioning so that's a downside if that was your main reason for visiting. The hotel is in a fantastic ,atmospheric location but our sat Nat sent us to a dirt track and then a path which was confusing . Take the A 343 to get there ", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r357296303", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Grand but needs some TLC", "review": "We enjoyed a one night stay here in August for me, my husband and teenage son. Firstly, the good points; the building is magnificent, truly breathtaking and in beautiful surroundings. It is handy for the golf course where the two men went off for the morning to enjoy a round. The nature is stunning with plenty of wildlife including mountain goats who were climbing the rocky terrain, truly a sight to behold. The staff were extremely pleasant. The beds were large and comfortable and the bedroom and bathroom were absolutely enormous and spotless. If I wasn't being picky, it should really end there but there were a few minus points which is why I can't give it five stars. Firstly, we arrived after our check in time to discover that our room wasn't ready and after being told it would…", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r330407087", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Beautiful Property", "review": "Beautiful secluded property with great views and amazing architecture. Large rooms but could use a little more light. Fantastic bike riding in the area and a short trip to town. The dinning room has a wonderful view of the valley and the sunrise so the view breakfast is stunning. ", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r321534498", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "beautiful property with great views", "review": "This old property has been well converted to a very comfortable and attractive hotel.  Whilst it is clearly in need of some extensive TLC, I will happily forgive this for the sheer pleasure of being is such beautiful surroundings.  The restaurant and spa areas are much later additions and do not suit the architecture of the original building.  However, they serve their purpose pretty well.  The rooms are varied but comfortable and quirky with a very original feel.  Well worth a visit if you want something a little different in Spain.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r320635649", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Loved the place", "review": "The hotel itself is as beautiful as the mountains around it. It's a relaly romantic place and I couldn't recommend it more, my partner and I loved it so much that we got married here :)  I would recommend renting a car if you're planning on staying here as it's not walking distance to the town. There's a great trail that loops around the hill next to the hotel and leads back to Antequera, takes about 1-2 hours.  The restaurant is a bit expensive but is fantastic, and you can also order food in the hotel bar which is also really good.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r320570893", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Genuine 5 star property", "review": "Beautiful hotel located in rural area outside antequera in beautiful rural setting.   Rooms large , spacious, nicely decorated, among the nicest I have stayed anywhere.   Great breakfast,  dinner just a bit below 5 stars.    Hotel is isolated but that is part of the charm.   Pool and spa.    Highly recommended", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r320352990", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "16th Century location for quiet 19th century romance", "review": "Because this hotel is situated somewhat off the beaten track, it is not easy to find, by car. The navigation coordinates listed on the website of the hotel seem not to correspond with the reality. Eventually signs point you in the right direction, but even then perseverance is needed. Just when you think you are lost, you can see the hotel in the near distance perched on a hill above you. Secure private parking is available in the basement. The English speaking staff in the reception was professional, very friendly and most helpful, so it did not take long before we could take the elevator to our room. The room has a nice size with typical Spanish’ decor. There was just enough wardrobe space for two in a cupboard, which also hides a pin code operated safe, with easy operation,…", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r320138552", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A little heaven on earth", "review": "We were looking for a quiet retreat and couldn't have chosen better. Surrounded by the Torcal rocks formation and olives you will find this convent a peaceful retreat with heated pool looking at the gardens and mountain views. There are only 21 rooms so make sure to reserve on time. The personal is very kind and helpful and the breakfast buffet Superp, try the omelette with anything you wish for, it is a hit, the bread from Antequera has a homemade taste and texture worth the try.  The restaurant has the same view as the pool.  Our room was looking to the gardens and everything was to our complete satisfaction, you will also find pool towels, cap and flip flops at the room. The chapel of the convent is used for weddings or events and in the night you may hear Gregorian songs…", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r314490830", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Rural Luxury in Andalucia", "review": "This imposing hotel, full of history and set in the country just outside Antequera, offers luxury accommodation and fine cuisine at a really reasonable price. The Junior Suite we occupied was spacious and offered the luxury of a spa bath which, after a long day's travel, was very welcome. Dinner was of a high quality though service was slow and the meal took over two hours to complete. The breakfast buffet was, I think, the finest I have ever seen with so much choice, all fresh and tempting - very impressive. The staff were charming and helpful and the setting is stunning. Though the hotel is self-contained and has everything available including a Spa it is situated only 10 minutes from the wonderful town of Antequera. If you want a treat I recommend this hotel and I am sure…", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r313480392", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Beautiful romantic setting", "review": "This place is totally amazing.  The rooms were all so unique and huge.  I had a room facing the huge courtyard and each morning I had the pleasure of hearing the rooster wake up the donkey (Magdaleno was his name) and then he would do his little heehaw thing!  So cute!  The views are breath taking.  It is about a ten minute drive to Antequera but perfect location for relaxing.  The day we arrived there were three weddings at the hotel.  The breakfast buffet was vast!  You could have about anything and everything, fresh fruit, cheeses and meats, fresh juice, eggs, pastries...just a beautiful spread.  The staff was extremely kind and helpful.  This place was my favorite out of my two week visit in Spain! I was traveling with a cycling group so we visited several hotels and this…", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r313357027", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Stunning Retreat...", "review": "This hotel is tucked away in the middle of 'nowhere' with stunning views of the mountainous landscape. Formerly a convent, the hotel has very modern rooms and bathroom facilities with wifi access. Had the most amazing salmon salad at arrival and enjoyed their generous provision of toiletries, spa slippers, sewing kit, shoe polish and other thoughtful bits and pieces. Breakfast was nice with champagne for those who are that way inclined. I enjoyed my stay and hope they keep up the standards.", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r310539400", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A spectacular setting in Antequera", "review": "The Hotel is an old convent at the foot of the Torcal national park in Antequera. The setting itself is worth it. You are surrounded by olive groves, spectacular mountain range and the only noise comes from roosters and donkeys! The restaurant is good, and breakfast excellent. Don't expect real luxurious rooms, but for the price and setting, it is a must in this area. I highly recommend it.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r308604963", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Friends wedding", "review": "We stayed here for 2 nights for a friends wedding. The hotel is in the middle of nowhere however the surroundings are beautiful!! The room we stayed in was lovely and clean and we had a little vegetable patch thing outside our room. The bathroom was stunning with a massive shower and lovely bath. The room was very cosy and clean, the only downside was the two twin beds that had been pushed together. Breakfast was amazing- probably one of the best we have had and the staff were so good. Only negative experience was when ordering food at the bar. It is overpriced for what it is. On the first day we ordered a chicken salad and chips. The waiter only bought over dry chicken and chips and when I queried the salad he said he would bring it over ( no apology). It took 30-40 minutes to…", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r299787289", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Wonderful wedding venue", "review": "My son recently got married here and our entire experience was excellent. He and his future wife visited before the wedding to make arrangements as she knew of the hotel via family links in Antequera and as soon as they visited knew it was the venue for them. They were very happy with the attention to detail of the staff at all times.  Family and friends from England and Ireland as well as from Spain stayed for 3 nights. The location is amazing, very good breakfast buffet (special mention to Maria who was very friendly and helpful) I did not eat in restaurant but others did and were very happy The pool area is very nice, the rooms clean and well equipped but mostly it is the ambience and architecture that make this hotel so wonderful The actual wedding ceremony held in the…", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r297669731", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Nothing Works", "review": "Recently stayed here as part of a Backroads Bike trip.  Worst hotel on the entire trip by far.  Our room (101 I think) was very weird, it had multiple levels, making getting your bags up and down the stair difficult, but it was not spacious. The only window in the room was 13 feet up in the air and was about 1 foot by 1 foot. Tiny, allowed in almost no light ,and there was no circulation.  Our AC broke, the toilet stopped flushing, the hairdryer broke, there was no hot water - even a little stool in the bathroom had a leg fall off. The room smelled musty - probably because there were no windows. Furniture was ancient.   Staff was . . . disinterested. Both at check in and when going to the bar, I had to wait several minutes while employees finished cellphone conversations.   The…", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r284780384", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Great stay", "review": "we had a lovely stay at the convento after it had been recommended,  the room we were given was a suite which was a nice surprise and a great standard.  The breakfast was very good everything you'd expect and the restaurant was excellent.  the location is beautiful and ideal if you like being away from everything.  Antequera is not a far drive and is a lovely town to visit.  we relaxed at the pool area but didn't get around to using the spa facilities.  Great stay & would recommend to those who like luxury and quiet times in a beautiful setting.", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r279944249", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "El Torcal and the hotel", "review": "Certainly the hotel is not close to anything but you can use an old roman path and be in Antequera cuty in less than 45 minutes. The sorroundings areas provides the peace that you need for meditation. The spa has small issues, such as the sauna did not work properly or the cold bath has not stones for feet massage, but you can sit outside in a very incredible enviroment, fresh also on summer time. The roons are clean with all facilities, includingan hidro massage bath.", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r277568546", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Lacking soul", "review": "There are so many things to like about this hotel. Great setting, really lovely room (junior suite), jacuzzi with an amazing view, decent food, but it just lacks a soul - which is sad seeing it is an old convent. The man on reception offered us little else than a basic check in - many other places we have stayed in Spain have sat us down, provided us a welcome drink, given us a map and shared enthusiasm about their hotel and the local area.  Not here.  We opted for half board - dinner and breakfast. Dinner was lovely in a room with a lovely view but the service was nothing special. Breakfast had a wide selection of the expected usual goodies. I enjoyed a terrific soak in the jacuzzi with a glass of wine and a wonderful out look - the highlight of my stay but even that was…", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r269080920", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Could be paradise but lacks maintainance", "review": "Recommended for rural relaxation. The outdoor architecture and the public spaces are thrilling! You really feel the convents atmosphere. We had a big room with a \"personal\" garden that was very pleasant.  The hotel has all the facilities for a 5 star yet half of them are poorly maintained. It feels the places' glory has passed.   That said, the price for what wa've got was amazing and so was the mountain view breakfast.", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r265917084", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "My personal garden in a beautiful country setting", "review": "Our room faced out on our personal garden, and then over a valley and El Torcal mountain, covered in clouds the whole time we were there. I walked out of the door and picked a ripe strawberry. Very nice. We ate two breakfasts and two suppers. The breakfast was quite good: fresh rolls, cheeses, hams, fruit; you could request eggs fixed the way you wanted. Good coffee which you make yourself to your own preference.  Suppers were good, not outstanding and wines were good. This hotel is quite isolated, so if you don't want to eat there, it is probably a15-minute drive into town. I found it a very comfortable place to relax during a multi-day bicycle trip. There is a beautiful gorge below the hotel and a nicely maintained footpath, which I followed about a mile and a half along the…", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r265273759", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely setting but significant drawbacks!", "review": "The best thing about this hotel is its truly amazing location - set in an olive tree decorated hill overlooking the impressive surrounding landscape. It was breathtaking!  However, the hotel itself had some more noticeable drawbacks. It has to be said that the rooms themselves, being as we were on the lower level, were very good - beds were great, WiFi could vastly be improved though. The rooms were spacious and the bathrooms clearly a focus feature. There, everything was modern and the door directly into the garden was an initially underestimated benefit. But outside the rooms the whole place itself was rather confusing. The character of the hotel, being a converted monastery, was as expected fabulous but in its hotel format there were a few problems. The set-up, through narrow…", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r264086755", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Escape from reality", "review": "We live in Villanueva del Trabuco and visit Antequera quite often and sometimes walk to this hotel and have a coffee, and decided it would be a nice treat to stay there for the night. When it opened in March we booked a room. We were not disappointed, the room was really nice and peaceful. We paid a visit to the spa which was very relaxing and then had a good meal in the restaurant.", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r261656187", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A moment to reflect ...", "review": "We took a suite, beautifully decorated and laid out.  Fantastic private spa bath with everything you could need for your stay.  Well stocked mini bar and a choice of pillows!   The Spa itself was clean and welcoming, I took advantage of the treatments on offer whilst my husband played 9 holes...  To top it off we had a excellent meal that evening, the breakfast was again plentiful and a vast selection of breakfast items, even champagne!  The staff were very helpful and can't wait to come back again ;)", "date": "January 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r248968117", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A piece of Heaven", "review": "Firstly, use the Grid Reference supplied by the Hotel for your Satellite Navigation, or you may never find it! It is outside Antequera, up in the mountains, down a long driveway. There is only one signpost, and that is right at the entrance, so, chances are that you will drive straight past and have to turn around. The drive is narrow, twisty and unlit, so driving in the dark could be 'exciting'.  When you approach the hotel, you are greeted with a breathtaking sight of the hotel amongst the mountains, looking spectacular.  You will not believe that this is the 5 star hotel that you paid so little to stay at.  We were in Room 001 (had hoped for 007), which is at ground level, but -2 from Reception, passing the Gym, Pool, Zen Relaxation Area & Beauty parlour. These rooms all have…", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r237764161", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Heavenly location, few drawbacks", "review": "This is a stunning location, breath-taking, which makes up for a lot. Breakfast (delicious - meats and cheeses, breads, fresh hot food if you wanted, fruit, and make your own coffee which is a bonus, keep it coming!) had a divine view across the gardens, the Hacienda and the distant hills. And the music is hilarious - at first you think it's religious, but eventually reveals itself as monks covering such luminaries as the Beatles, Robbie Williams and the Pet Shop Boys.  Our room was lovely, even though someone insisted on breaking bricks under our window from 8am.  Gorgeous spa bath, although water takes hours to run and is tepid. Shower much better. Bed(s) nice (sadly, few are doubles), aircon powerful, plenty of space for everything. One wonky cupboard door which was a pain as…", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r227844262", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Beyond peaceful", "review": "We live in the vicinity and know the hotel very well. We book occasional nights (usually a Sunday, towards the end of each month) to really relax and unwind. The hotel is just so peaceful, the beds are amazingly comfortable and it makes a wonderful retreat, away from home. Cannot recommend it highly enough.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r224260786", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nice 4****", "review": "Nice rural location, if You are looking peacfull place to stay. If you want to go to eat to town, you need a taxi. Our room was very nice, but lack of the power of the aircondition ruins the nigth. It was too hot to get good nigth sleep.July and out side temp was more than 30 degrees C. Bed was OK. The spa was small but clean. For the awerage person the sauna was too hot and dry. They should drop the temperatura to 80 degrees C. Turkis sauna was not like it should be. Bar service and check in/out was very good. This hotel is more 4 stars than 5.", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r220218357", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "WHAT  AN  ESCAPE !!", "review": "All the writing and photographs will not come close to actually being there....finding it is part of the feature.....when approaching and you see nothing other than stunning scenery with a Golf Course adjacent, you have to stop and blink for the double take. The Convent is set in an absolutely stunning location and you can actually walk to the town of Antequera approx one and a half miles, by way of a path that runs along the side of a mountain overlooking part of the golf course and several valleys which has a priceless tag for beauty.  The Convent has been superbly renovated, the facilities include a Spa, Sauna, Steam Room and Swimming Pool with a Jacuzzi style relaxer.  Staff are on hand to help,advise which also makes for a happy stay.  Sadly.......unless you experience a…", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r210425555", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Peaceful and beautiful", "review": "This hotel is just wonderful. Lovely old building, with lots of interesting and beautiful spaces to while away time. It is so peaceful. The rooms are furnished in keeping with the old building, but with very large modern bathrooms. Great Spa, which I had all to myself on both occasions I went there. The restaurant is fantastic, and not too expensive ( less than Parador prices). The service from all the staff, from reception to restaurant and bar staff was superb. Would highly recommend to anyone who wants a peaceful stay in lovely surroundings. Only 10 minutes drive from centre of Antequera, but felt like a million miles. Best breakfast I have ever had in a hotel. All hot food cooked to order.", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r207390929", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Magnificant Hotel in a peaceful location", "review": "We stayed here two nights as part of a cycling holiday. It was pristine with some stunning aspects but we felt that it had lost a little of the authentic feel in the restoration. The public rooms were grand and the restaurant had fab views over the valley and beyond. The Restaurant food was very good too. The breakfast was excellent - it was difficult to think of what else they could do! The rooms were good with an outside area that was your own. It had the feel of being over thought - the bathroom was complicated and the shower needed an instruction booklet as it was too difficult to work out in the few days we stayed! The pool area was way too hot - better ventilation needed. This could be a great place just a few areas to think on! Service was good but a little detached.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r207058863", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Convento magdelena Antequerra april2014", "review": "Stayed  overnight  24/25 April 2014. Was a bit worried about earlier posts on here..... Not easy to find, quite a way outside of Antequerra, you need a car... head for Eroski supermarket on Seville road out of town. Signposted from roundabout by Antequerra Golf  hotel with statue of golfer on it. Just keep going up and up! Using our  sat nav took us on a dead end up an unmade road and had to back track down to roundabout!! Arrived  mid day,  the hotel had a very, very  busy conference day with over 200 guest for lunch, but they made us very welcome. Nothing was too much trouble to get us into our  rooms and  make sure we had drinks and snacks despite the hectic time for them. The spa &  pool were very, very clean, not too busy, but could do with a few more sunbeds or seating…", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r204315858", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Needs a Five Star Overhaul", "review": "We booked a two night stay based on what seemed to be an excellent offer for a 5 star hotel. I must emphasise that I have been as objective as possible in this review, basing my comments on the room itself, the staff and the location.  Without being too discourteous I am obliged to say that I cannot believe that the hotel deserves a five star rating. There is no doubt that the hotel is housed in what used to be a splendid Convento and much money has been spent on its renovation. It just needs to spend a bit more money and it does need to employ staff who either have previous \"five star\" experience, or who have been trained to that level. That is clearly a management responsibility and needs to be addressed by management.   Perhaps my first comment sets the scene. We arrived at…", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r184444421", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "What a dump!", "review": "My first room had a rainhead shower, but no hot water. So, I was moved to another room, which had no rainhead shower, instead offering a nozzle with a fixture that had broken off the wall. I asked for another room and the surly, unapologetic clerk told me there were no other choices. Avoid this disaster. ", "date": "November 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r183644440", "sub_review": {}, "travel_purpose": "", "rating": 1}, {"title": "Lovely hotel", "review": "We had a 2 night stay at the hotel Magdalena.  It was rather difficult to find as signs ran out travelling up the hill out of the town of Antequera which was well worth a visit for a pretty small town and lovely tapas. Beautiful surroundings and gorgeous hotel to look at.  A little tired inside and could do with some maintainence and updating in places. The spa was nice and we had to ourselves, however we were unable to use the jacuzzi as it was rather cold. Food was overpriced, Antequera itself was easy to get to for dinner and more advised. Staff were friendly and helpful. Very good for a golf hotel.", "date": "November 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r183549168", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Average", "review": "Magdalena is a strange place. I wish I had stepped back in time to be reminded of the convent , instead I felt like I was in 'The Shining'. It could be amazing, but modern furniture and features have been added which means the charm has been lost.  We had a pleasant enough stay,  but there are little touches that really let it down. The air con does not work. I had to ask three times before anyone would take a look. I was told it was working, but it is a small puff at best. Be warned if going at the height of summer! Now I know it is an old convent, but it also says it is a 5 star hotel with air conditioning!    I also find that 5 star hotels don't usually have to ask guests not to remove food at breakfast or to take the bathrobes. The bathrobes were old and scraggy....so for…", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r177980397", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Lovely peaceful location for a good hotel", "review": "This hotel is set amongst olive groves with lovely views of the surrounding countryside, just a few minutes by car from Antequera. Our Junior Suite was very spacious and comfortable. The hotel is spotlessly clean. We thoroughly enjoyed using the small spa. Breakfasts were extremely good - an enormous choice of quality food. But the hotel only rates 4 stars in my opinion. The evening meals (we eat there twice) was very limited and not the full lunchtime menu as we thought. The sun loungers were mostly falling apart and only a few available. The level of English from the staff was limited. Also, while some staff were excellent there were examples of exactly the opposite. I thought the hotel was very good in so many ways but definitely not a 5 star establishment. Recommended but…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r175490982", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent Hotel in a lovely setting", "review": "Situated outside Antequera, this hotel is set amongst olive groves with lovely views of the surrounding countryside. We had a Junior Suite which was very spacious and comfortable. The whole hotel site is spotlessly clean. A spa is available and we thoroughly enjoyed using it. Breakfasts were very, very good - an enormous choice of quality food. Why only rating it 4, you ask? The evening meals (we eat there twice) was very limited and not the full lunchtime menu as we thought. The sun loungers were mostly falling apart and only a few available. The level of English from the staff was limited. Also, while some staff were excellent there were examples of exactly the opposite. Don't get me wrong, I thought the hotel was very good in so many ways but definitely not a 5 star…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r175477463", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Best place to rest and relax", "review": "Hotel location is far from the town. Not easy to get there by car if you are new to the area. From downtown to the hotel it is 15 euros by taxi.  Hotel is luxury, breakfast, service and rooms are all perfect .  Indoor swimming pool was amazing", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r175026641", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Lovely relaxing hotel", "review": "We stayed at this hotel and found it to be a really lovely relaxing place to stay. It is quiet and understated and in a beautiful location. The breakfast was quite frankly the best I have ever seen or eaten and nothing is too much trouble for the staff. Ask for directions to the pilgrim route and you can walk or cycle to antequera. A really lovely find.", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r172699341", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Magnificent Convent-converted Hotel with magnificent view of mountains", "review": "I stayed Hotel Convento La Magdalena in June 2013 for 3 nights for holiday. It seems that the hotel is built for people staying and playing golf at the near-by golf-course. I didn't go to play golf, but enjoyed my stay.  Pros: (1) It's originally convent, and converted into a hotel. Naturally, the building is beautiful. (2) Room is pretty large, and comfortable. The rooms are nicely furnished. My room was on the ground floor and I can walk out to the garden area from my room. (3) Staff are very nice. I was pleasantly surprised that staff at the reception can speak decent English. (4) Pool (small, not for serious swimming) and the garden outside the pool is very pleasant. (5) Food is very good. So you actually don't need to go out. One day we came back very late, and the…", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r170511192", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Gorgeous hotel/ staff need \"motivating\"", "review": "Positive: Great location with stunning countrysideviews, comfortable room  lovely old monastery building and the restaurant is good.  Negative: Spa area is bit tired, reception staff less than motivated given this is a 5* hotel (indifferent and unhelpful at best!)", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r165851127", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Peaceful location - away from it all", "review": "Lovely hotel very peaceful and quiet. Well away from the main town a car is essential, not too easy to find but just follow the golf signs and its not too difficult. A fantastic rustic building full of character. Staff couldn't be more helpful, restaurant food and service superb as was the breakfast. Spa facilities were also good, overall a good stay, would certainly come back. Best option is the half board.", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r163911826", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Quiet hotel with peaceful surroundings", "review": "Staying at the La Magdalena for two nights, half board was a pleasant experience. The hotel, ex convent, was exceptionally quiet, with only four diners in the evening. The staff were charming and helpful. Wanting to visit Torcal to see the limestone rock features and no tourist guide leaflets available, front of house manager gave excellent directions. Our room was a junior suite, which was quite large, and overlooked the front courtyard. I would have preferred a room at the back of the hotel as the views are stunning, but as our main reason for being in the area was to play golf we did not ask to change rooms. The food, both in the evening, and at breakfast could not be faulted. My only small niggle would be that it seemed a shame that the pool area was completely enclosed,…", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r163879970", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Golf Accommodation", "review": "It was pleasure to visit Antequera , I stayed in 5 star Hotel Convento La Magdalena it is situated on  outskirts of the city of Antequera. Lots of facilities are there like good restaurants, bars and terraces. Excellent food and beverage and also golf and its accessories, pleasure to see green fees with exciting weather.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r162930068", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Amazing place,", "review": "if you want desconet, this will be your best choice. Locate in the mountains, with amazing views and greats activities around. Prepare yourself, it has a lot of birds, quite nice to heard them. We enjoyed a lot our stay.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r162474758", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely remote hotel, away from tourist area and simply Spanish.", "review": "Get away from it all here. Perfect views, quiet location. Car essential. Would benefit from outdoor pool but indoor pool and small gym which was quiet at all times of day although we went early season! A couple of issues in room which were attended to immediately by very efficient staff. Would recommend if you are looking for quiet retreat in perfect location.", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r158372032", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Stunning view, beautiful stay.", "review": "This hotel (ex convent) is located in a stunning location. Rooms are beautiful and and the food is good. People are welcoming and very nice. I am looking forward to go back. It is very close to Antequera and the park of Torcal which are both worth visiting.", "date": "March 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r155649443", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent experience", "review": "The hotel is a almost completely restored old convent. It is situated in the outskirt of Antequera in a stunning valley and surrounded by montains. The atmosphere is excellent and the enviroment welcoming. We ate at the hotel restaurant twice and the food is very good.  The location is also ideal for people that like outdoor activities such as trekking in natural parks (Torcal and Lobo) or cycling. I would definitely recommend it.", "date": "February 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r155631092", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "an absolute must", "review": "I lived very close to this hotel and would visit every week end to chill out after a weeks work, The ambiance is mind blowing , the food is amazing , and the staff are all lovely people. Then there is mark the pianist who plays in the bar who would always play my requests of jerry lee lewis. If 10 stars were available then this hotel would deserve them.", "date": "March 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r152268352", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Stunning building. Rooms ok.", "review": "The hotel is not very easy to find. The road follows the golf course for a while. Being there after some heavy storms, the road was in a very bad condition and the small bridge over the torrent before the hotel had collapsed on half its width! Yet arrival at the parking lot was just amazing. This convent, what a building! The lobby and main reception room, a chapel, are equally impressive. The room was ok though we had to take an unfriendly elevator serving the kitchen as well. Did not try the food but prices were high for the region. Advice: use the road from the North through the olive trees rather than the South road along the golf course. Quicker and more scenic.  ", "date": "December 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r147155870", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Quirky!", "review": "We have been coming here since it first opened and have fallen in love with the place.  Yes, it has problems but we always seem to be able to forgive them.  We have had terrible meals here but it is improving.  We have had water pouring in the windows whilst there has been none coming out of the shower!  The value for money is astounding with the golf package.  It is not a 5 star by most peoples standard but we adore it.  The surroundings are beautiful, the building is sublime.  Come here with an open mind and you will love it", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r146519147", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Slightly bizarre", "review": "We booked to play golf on a good deal from Sunshine Golf.  The recent floods meant that the course was not at its best and the hotel is not really on the course, it's about 5 mins drive away and you can't see the course from the hotel despite the website giving you (at least me) the impression that the hotel was next to the course.  How this hotel survives is a mystery. Only 9 guests were there when we were there and we were outnumbered by staff who are fine - but must be bored as what is there to do all day? We only had breakfast as the place lacked life with so few guests and strange Enya type music played most of the time. No pool available due to repairs.  Had more of the feel of a retirement home about it than anything else, they need desperately to get more guests but…", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r142804948", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "A pleasant stay just mins from our house in Andalucia", "review": "It is marketed as a 5 star hotel, and it is in many ways....  but could have a few improvements, on the food, very promising start - we had the lunch de luxe option which is pretty dear for the area at 45 euros pp. It began very nicely, we had an appetizer of jamon serano with a topping of a quail's egg on their lovely light crackers. Next a smoked salmon starter which was delicious. We had a special of the area which is a layered apple, goats cheese and pate in the form of a terrine, yum, one of my favs. Then, octopus and potato with tiny shrimps but it was so salty, it overpowered the dish. The cod was truly awful...it smelled rather off! We ended on secreto of pork which again was good but so oversalted. With wine and coffee 107 euros, so far from cheap. In truth I think the…", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r138988438", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Please stop the music!", "review": "This lovely hotel in a labyrinthine old convent in the countryside near Antequera should be a haven of peace and tranquility, but it certainly wasn't that when we stayed.  In the large esplanade in front of the hotel we were greeted by music blaring out from speakers mounted on the outside wall facing towards the hotel.  What music best suits Andalucia on a hot summer afternoon? You've got it in one: American big bands from the 1940's, often fronted by a loud singer. This started before breakfast and went on until almost midnight.  And there was no escape, it was everywhere, even on the terrace restaurant for al fresco dinner.  What a pity and what a relief at dinner when the music finally stopped towards midnight.           Apart from the music everything else was excellent. …", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r138690173", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Best in Andalucia", "review": "If you are looking for a quiet and relaxing vacation, this is the place. The building is an old monastery renovated for comfort and spacious hotel rooms. Excellent value for money. Surrounded by golf course, the whole place is so quiet you would sure feel like your are in a real monaster. However, if you are looking for action, this is not a place. Quite far from town, you would not find any meaningful activity around the hotel except for golf.", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r137704493", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "No complaints", "review": "stayed one night as needed a place close  to Malaga airport and the price offered seemed to good to pass up. It is certainly out of Antequera and it definitely needs a car to reach. Location was not a problem for us on this visit. IT is very well -signposted. The building was very striking, especially the interior cloisters and chapel area which appeared to have many original inscriptions. But the rooms must be an upgrade on what the nuns were provided with. Restaurant looks over open country and provided excellent evening meal and extensive buffet. Very helpful Spanish waiter despite his limited English was witty and attentive. Other staff we met also gave excellent service. We did not have enough time to sample all the breakfast. Would certainly recommend this hotel even if…", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r129820797", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Best Golf and Hotel Deal in Spain", "review": "I was recommended this deal - 1 round of golf at Antequera Golf and one nights B&B at the Hotel Convento de la Magdalena - by Sunshine Golf in La Cala de Mijas for 64 Euro per person Sunday to Thursday. This is definitely the best golf deal in Spain. We arrived on Monday 16th April at the hotel around 1230pm and were checked in immediately (thought this was great as most hotels won't let you in until 4pm). We played golf at 2pm and then went back to the hotel for a swim a drink and then dinner. The service was superb lead by the maitre d and his team and the food was fantastic!! The next morning breakfast was again brilliant with an amazing choice from cereal to cole meats to hot cooked food. The bedrooms were of a very high standard as you would expect from a 5* hotel. Loved…", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r128496801", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Lovely", "review": "We were invited to stay for 5 days for a friends wedding. The hotel and grounds were beautiful. The food was lovely, especially the food at the wedding itself. The staff were very friendly and helpful. A few improvements could be made- our room really smelled of damp when we first arrived- not sure if its a good thing or not, but you got used to it!? and they need to change the music that is played outside, maybe add a few more tracks to the cd! I know they have not been open that long so are still working on projects in and around the hotel.... but they really need to get that outdoor pool done! A great break and a lovely wedding!", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r127805694", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Nightmare", "review": "Had a one night stay at this hotel which is definitely NOT a 5 star.  A beautiful setting is the last of the good news.  It is understaffed, miles from anywhere and the food is awful, microwaved garbage.  The staff that are there are nice people but are constantly apologising for a lack of knowledge and ability.  Should have realised from the price that it was not going to be top class but other people on this site made it sound quite good.  Perhaps they went to a different place to me!!!!", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r127761020", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Beautiful location & building but lacking warmth", "review": "Did an overnight treat in a suite. The room was nice enough but nothing special. There were a few areas where maintenance was needed and it could have been a bit cleaner (fluff under the bedsides tables etc...) The hotel was pretty empty and therefore didn't seem to be fully staffed. We waited ages to be served at the bar - my husband gad to go and find a waiter from the restaurant. The spa (which was the reason for staying here) was also in need of an upgrade. Missing tiles in the pool, pain flaking off the walls, no therapists present...shame as we fancied a massage. The restaurant was OK but I was disappointed when the waiter said that the chef could only make a risotto for 2 people minimum - it didn't state this on the menu.  In summary - expensive at Euro 150 per night and…", "date": "February 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r124854217", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Lovely hotel spoilt by piped music, flashing lights and poor information", "review": "Our stay at this splendidly located and restored convent was spoilt by incesssant piped music outside and in some areas inside the hotel. Also impossible to 'blank out'. was a continuously flashing red light from the smoke detector above the beds, and a blue ligh in the hallway that reflects on to the beds from a mirror. The  information booklet describes 7 pillow fillings that are available, but does not explain the unconventional controls for the bath or shower, or how to access english-speaking channels on the TV. Nor does it mention the delightful 5 or so km.pathway to Antequera. Piped music is availalable in the bathrooms but the shower appeared to provide only hot to very hot water: no warm or cold There is no clock in the bedrooms, or incredibly even in the vicinity of…", "date": "December 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r122714328", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Excellent experience", "review": "The hotel is situated in a lovely place, far from everything. Great meal - try the Millefoile foie and the Sea brass. There is a donkey called Magdalena, try to ring the Convento bell, he will come :).", "date": "December 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r122327492", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "location,location,location, NOT! but excellent otw.", "review": "Located about 5 miles west of Antequerra, an old but unremarkable city, this is a renovated old convent in a great location for daytripping to Granada, Cordova and other sites around. The setting is remarkably pretty, pastoral with surrounding hills covered with olive groves.  The facility is a huge building with a gym,sauna,steam room and pool. It has a bar where lighter fare can be eaten and a formal diningroom, very large, with plate glass windows on the west side overlooking the hills. The food in both  places is passable and not terribly expensive. A very complete breakfast buffet is available with someone there to cook a hot breakfast for you. All service throughout the hotel was cheerful, friendly and most efficient. The reception staff all speak very good English and are…", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r121497982", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Excellent hotel", "review": "We held our daughters wedding celebrations at the hotel over the weekend of 1 October. The setting of the hotel is stunning in the Andulucian countryside just outside the very attractive town of Antequeria away from the tourist  areas.   The accommodation was excellent, the food outstanding and the staff could not have been more helpful. The guests stayed in the hotel and its sister hotel the Golf. This part of Spain is still very reasonably priced-a place to be recommended whether for a meal, holiday or party.", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r119378236", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Perfect for a relaxing holiday", "review": "A lovely, comfortable hotel with friendly, helpful staff and great food. The perfect  get-away retreat surrounded by olive groves and mountains. Highly recommend a junior suite with its own terrace - well worth paying a bit extra. The pool was perfect and very quiet, and relaxing after a jacuzzi on the lawn was idyllic. You do get moved out on a Saturday night to the sister hotel in town if there's a wedding, but this was well organised, even though the other hotel (Antequerra Golf) was far too busy for our liking. If you want peace and quiet, away from it all, then this is the place to go.", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r118656457", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great!", "review": "A wonderful place to relax!  The hotel is beautiful, with a very nice and complete SPA area, and the surrounding grounds with olive trees are gorgeous.  The breakfast was AMAZING and the service outstanding. Would come back anytime!", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r118649428", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "NOT 5 STAR!!", "review": "At arriving at the hotel after travelling 12 hours we were told there was no room service available at 11.30pm in a 5 star hotel. there was excrement on the floor in my room, the fridge did not work, there was a wasps nest on my terrace, my bath tap was broken,the running machine was broken, as was the steam room, there was no outside pool, the spa was filthy dirty, we were served raw chicken 3 times at dinner. absolutely poor management in fact through complaining the whole time the manager never actually turned up once, beautiful building with potential very badly ran none of my grievances were taken care of", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r116954672", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "This Hotel is worth a trip to Spain!", "review": "We have stayed in this hotel for just two days and regret we could not stay longer.  The hotel is an ancient monastery which has been recently renovated and converted into a hotel, located in an extremely quiet area surrounded by a golf course.  You can taste the history of the place enjoying an excellent service at the same time.  The town of Antequera is just a few km away.  The restaurant is superb, closed by a window with a stunning view on the valley.  The food is very good, and the service excellent.  I would strongly recommend it.", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r115833175", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "This really is value for money!", "review": "169 euros each for 3 nights B&B and 3 rounds of golf is astounding in itself...but I also have a suite and the most gorgeous room, ever. Food is 5 star, service is fantastic. With only 21 rooms it is quiet, but I like that! Have explored most of the convent, my fave o far has to be the little stairwell into the catacombs...off for. Gin and some more exploring!!", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r114792366", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Stunning Location, Superb hotel", "review": "We stayed at La Magdelena with a group of twelve friends for six days. The rooms and spa facilities were excellent.The rooms were  extremely well appointed with excellent complimentaries,robes and slippers. The only downside is that the rooms do not have any tea or coffee facilities as we already knew this most of the group brought travel kettles. Each evening apart from one we had superb service and food in the stunning panoramic dining room, on the one occassion when the service and food was poor the evening was salvaged by Fredricko who was excellent and even furnished the whole group with complementary cocktails. We played golf at Antequera and received excellent attention from the professional Karl Adams. The course is not easy but enjoyable and was in good condition. We…", "date": "October 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r85168573", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "A splendid hotel and experience", "review": "I stayed only 1 night at the convento la magdalena with my boyfriend to celebrate my birthday. It was the perfect choice! A special offer for september meant that  our stunning  double bedroom, buffet breakfast and spa came to 90 euros  for both of us..... which for a 5 star hotel was incredible good value for money.Courteous staff, large, clean and luxurious rooms and bathrooms, a well maintained spa and a stunning breakfast display, I cannot praise this hotel enough. It gave  us a  chance to  experience 5 star  accommodation which we normally can't afford!  It is  quite isolated, so you will need a car to travel to Antequera and there is nothing else around in the immediate vicinity.. but  we were quite happy to stay at the hotel and enjoy the spa area and eat at the hotel's…", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r81304514", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Poor quality food and service", "review": "We went to try the hotel's restaurant on a recommendation.  The place looks to have a stunning setting, but we struggled to find the restaurant. It appeared that we had to dine outside, and could only choose from a very limited menu, all of which was prepared on a barbecue. No other dining options were given. The staff seemed friendly, but were a bit lacking in their attention, had to ask for the wine list a few times. We chose a pretty expensive bottle as a treat, which the waiter brought to our table, shook it about quite a bit while opening, then, when poured, unceremoniously  plonked the cork back in and put it on the table. We were expecting a little bit more care and attention from a 5-star location. Similarly, we thought that bigger glasses would be provided for us to…", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r73210101", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Hotel closed without notification", "review": "Arrived, with my 90 year old father for a stay over Christmas. Hotel door was locked and I was made to stay in pouring rain whilst I insisted to reception, through intercom, that I had a reservation. My father fell over entrance steps in dark and bruised his arm. When we eventually were allowed in we were told they thought we were intruders (!) and then a series of lies, including  that they didn't have a reservation for us and that the hotel was full. In fact the hotel was empty and there were no staff. I showed them proof of booking and insisted on having a room as it was 1.30 in the morning. Woken at 2.45 by manager of sister hotel, telling us to go there. We refused to move in the middle of night. Woken by deliberately banging doors and loud music pumped into our room at…", "date": "December 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r65462353", "sub_review": {}, "travel_purpose": "", "rating": 1}, {"title": "A magnificent experience in a stately building steeped in history", "review": "We were treated like royalty from arrival to departure. Every member of staff we met was friendly, polite and helpful and spoke English. We were given a suite with two bedrooms, lounge, dining room and sitting room. The whole place was spotless, the bedrooms were roomy and comfortable. The dining had superb views over the mountain valleys. The food was excellent and service first class. Plenty of choice and a good wine list. Prices were very reasonable - more in keeping with a four star hotel. We paid €75 (Euro) ppp night for dinner, bed and breakfast. The hotel is isolated in the mountain side but only five minutes drive to Antiquera. The only downside for us was that there was no tea/coffee making facilty in the bedrooms but then that is probably the same in most Spanish…", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r45645105", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "If you like peace, this is the place", "review": "Arrived on Tuesday 8th Sept, booked for six nights. Excellent reception. Pleasant and charming. Immediately apologised and said that unfortunately on Saturday night the hotel had been booked for a wedding and three hundred people were expected. We were welcome to stay but there was going to be a band playing all night and we probably wouldn't get much sleep. They had booked us into their sister hotel the Antequera Golf and in compensation upgraded us to a suite. Having stayed in Paradors all over Spain and on several occasions having the same problem with weddings, never have we been compensated in any way but been left to lump it, this was pretty good. The room we had in the Convent had a view towards the tennis court. But no problem only had to ask, given room next door with…", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r45606408", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A pretty place", "review": "This is a very nice hotel. I would recommend it to relax for a few days. It is far from Antequera town center, so it is not the best option to visit the town. However, the hotel facilities are good and modern, with the asset of this being a historic building. Great spa, with nice views of the mountains from the swimming pool. We had dinner at the barbecue restaurant. I was surprised by the good prices for a 5* hotel. The food was good and the service attentive. The only problem we had during our stay that it took the waiters at the restaurant more than 30 minutes to bring us the check after we requested it. We asked for it several times but they failed to comply. My recommendation to the management is that they should improve the organization of the restaurant. Other than that,…", "date": "August 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r38024379", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "outstanding hotel", "review": "I stayed here for one night and as i pulled around the corner to see the Hotel in the distance for the firdt time, i was blown away! it is the most stunning view. And i was not disappointed once i walked into the reception. The staff are ALL amazing, they do not know the word \"NO\" and went out of thier way on every occasion to deliver the WOW to us during our stay. We stayed in the biggest suite in the Hotel which had two main bedrooms, a hugeliving area with three dining areas. The rooms are amazing and the overall cleanlinessand comfort is second to none. The actual hotel is so beautiful you do not want to leave. We also had breakfast which was lovely.Overal the most amazing place to stay.", "date": "July 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d1202227-r36479976", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}]