[{"title": "Quiet comfortable and cheap; great kindness; exquisite breakfast - Tranquillo, confrortevole economico.", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "November 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r724907322", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Brilliant location and very friendly and helpful staff", "review": "Small hotel, very very nice, right in the heart of Sultanahmet, very close to Hagia Sophia and the Blue Mosque; despite its centrality, the area is quiet and, at night, very quiet (the nightlife in Istanbul is elsewhere). The rooms are small but very comfortable, furnished with good taste and all the comforts available. Noteworthy the particular kindness of the staff that welcomed us, the willingness to listen to our needs and to provide information. A special mention for breakfast: a wide choice between sweet and savory and between traditional Turkish products and more international foods is its special characteristic. Breakfast is served on a terrace offering a breathtaking view of the Bosphorus. I think it's one of the best hotels I've ever found in terms of quality and price: I would highly recommend it.…", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r715844422", "sub_review": {"Location": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "Great location and friendly staff ", "review": "A small hotel in the old part of Istanbul makes this an excellent base for a sight seeing visit to this lovely city. The bedroom was comfortable with plenty of cupboard space and room for two people to move around in. A fridge and free safe in the room as well as air conditioning helped make this extremely well priced hotel a gem of a place to stay. Tuhin and Aydin were helpful and welcoming and the lovely ladies who served breakfast all helped make this an extremely enjoyable place to stay.", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r676301320", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Pleasant hotel in historical Sultanahmet with very friendly service", "review": "The Kaftan hotel is a a great location to see the main sites in Istanbul. Ruhin and Aydin are fantastic so friendly and helpful staff members. Breakfast is good but I wouldn’t advise eating right near the hotel. Venture out where you get more choices and better priced restaurants. The rooms are small but good value for the price. One negative it can be noisy at night with current construction works etc. Not a bad hotel for a few nights stay to see the main attractions in Istanbul old town. ", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r663313919", "sub_review": {"Value": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice staff, nice hotel", "review": "Stayed four nights at the Kaftan hotel. Smallish double room but quite sufficient in terms of comfort and cleanliness. Nice bathroom with a good shower. Buffet breakfast served every day in sunny conservatory with lots of different things to eat, including hot options and local pastries and fruit. Can speak very highly of all the reception staff who went out of their way to help us, pointing out points of interest on a map and making several calls to book restaurants and a hamam for us when we asked. Location excellent - only a 5 mins walk to the Blue mosque and Hagia Sofia. Plenty of places to eat (and buy top Turkish delight too!) in the area.", "date": "January 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r647373890", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Very good location, nice staff!", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r646327794", "sub_review": {"Location": 5, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great first stay in Istanbul ", "review": "The location of the hotel is excellent for tourists. Few minute’s walk you can find all the main interesting places. The city tram is also few minutes’ walk. With the tram T1 has the contact to the Metro. The bazar is also very close. A lot of small or bigger restaurant also in 3 minute’s walks. Two  \"supermarket\" are at the next corner. The buffet breakfast international and a little Turkey.  The staff is very friendly. A big advantage of the hotel a small garden when you can find coffee and tee all the time. This is the smoking are too.", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r632926878", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Nice place in the heart of Sultanahmet", "review": "I booked this hotel far in advance and got a great rate.  The front staff go above and beyond to make sure you are comfortable. The guys are so kind and relaxed that you feel more like a friend then just a guest. Easy to walk to the tram and historical sites. They also provide you with lots of information to make your stay interesting and enjoyable.  Thank you ", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r631032092", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Good price but quality lacks", "review": "My husband and I stayed here for 3 nights. The rooms are small (~12square metres)  and old but clean. Beds are super comfortable. We came there during the renovation period but we never heard noise (but we usually stayed in the room only at night, and 1-2 hours during the daytime. There’s a tiny wardrobe too.  Staff was very friendly. Food during the breakfast was ok, not a big choice and the same every day, but for 3 days it’s fine. Restaurant view just took my breath away,  absolutely stunning. Location is perfect, all sights are very close. I recommend this place. ", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r575693572", "sub_review": {"Location": 4, "Sleep Quality": 4, "Service": 3}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Fabulous little hotel.", "review": "It was my fourth trip to istanbul and I decided to stay at Kaftan because of the good price and the location. It was quite hard to find and the rooms are really small the wifi does work on free will as it seems and it was quite hard to get good connections on that. Breakfast was regular Istanbul style but nothing special. It is about 10 min walk from next tramstation but close enough. Staff was friendly and rooms clean. Still next time I spent some extra Lira and go to another place.", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r573237955", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Turkey vacation ", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r573166001", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great Hotel, Poor Wireless (In My Room)", "review": "Good hotel in the very heart of sultanahmet.  Walkable distance to blue mosque and hagia Sophia. Lovely restaurants nearby. Rooms were nice and clean.  Would love to visit again and definitely recommend people . Value for money with decent accommodation ", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r570047493", "sub_review": {"Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "A place in which you will definitely return!!!)", "review": "Loved this hotel, so close to the main square yet so affordable. I booked a last minute single room and was very comfortable. Free coffee in the terrace garden and breakfast was nice given the size of the hotel. Only downside was my room (103) had no WiFi coverage despite being located 20 metres from reception. It would work if I sat on the dressing table so had to borrow a chair from reception to do my work which was annoying hence the lost star. Receptionist was very helpful at all times.", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r560685579", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Amazing experience in an old Istanbul hause", "review": "A great place to stop in Istanbul. We can say endlessly what amazing guys work there. These are exactly the people who love their work.All the fears of staying in a strange city have fallen away, because there was help in any issues.The location is wonderful, all the sights are very near in walking distance. Do not hesitate to book this hotel.I will definitely come back to Istanbul", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r553803993", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Value for money!", "review": "The hotel was lovely. The street, the view and its only few minutes away from Blue mosque. It was like living in an old Istanbul house. Clean and friendly staff. Highly recommended. I will definitely stay in this hotel next time when I go to Istanbul. It was my first time but it won’t be the last. One down side which I cannot blame hotel for this, I think, there were guests smoking in their room that I smelt smoke on night. ", "date": "December 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r551077887", "sub_review": {"Value": 5, "Rooms": 3, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "your seccond home", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "November 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r544073644", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Istanbul Tour", "review": "we stayed with my mom and sis 5nights there,everything was perfect,in the morning for breackfast we had a lot of options,breackfast menu was perfect,delicious cake ,and waiters are so polite,welcoming us with smile very well.when the reception (aydin)said to us GOOD MORNING.Really was the best feel during the day.(his nice face)really nice guy. the room was clean,everyday they were cleaning our room.so quite,relax,close to public transportation and main sightseeing.how can i say PERFECT.by words i cant explain. during the evening i could use computer and also evening reception(i forgot his name)guide me a lot for everything... free tea and coffee always was available. if i came back to istanbul again,i will stay in my second house again. thanks for everything.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r542140277", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Recommended hotel to stay. ", "review": "This was a nice cozy hotel with great breakfast. We stayed at Kaftan for 3 nights. Located at the heart of the city, very close to many attractions like Blue Mosque, Hagia Sophia, Topkapi Palace, Islamic Art Museum, about 10 minutes walk to tram line & many more. Staff was very welcoming, friendly & helpful. We booked kaftan through booking.com, so were able to get great price. Good for budget travelers! If you are  planning to continue with your journey to explore more cities in Turkey ask Kaftan staff for Before Travel Agency contact.", "date": "November 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r541510038", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Comfortable ", "review": "Staffs are friendly, breakfast had a variety of foods, and a cozy room though its abit small.  Hotel also located within a walking distance(8 mins) to Blue Mosque. There are cafe/restaurants,gift shops & minimarket nearby the vicinity.  ", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r538642386", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Vacation", "review": "We loved staying here. The room was rather small but comfortable and the caretaker at the reception was very warm and friendly. The breakfast buffet was very good with a wide variety of dishes and a great view of the sea. The main entrance to the hotel is a little difficult to negotiate. The hotel does not have a lift and has a narrow, steep  staircase to go up the floors and the breakfast area. This can be a deterrent if you have bad knees and if you are carrying heavy bags. ", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r531802376", "sub_review": {"Value": 4, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Clean friendly hotel", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r530380099", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Satisfied!!!", "review": "Helpful and friendly staff and only a few minutes walking to the blue mosque and also the tram station. The room was exactly as pictured and every evening when we got in the cleaning crew had put our messy room into perfect order making it inviting and cosy.  ", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r528370483", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Simple & Good Hotel", "review": "Very nice hotel!!! Very kind and helpful staff!!! Nice spot near sultanahmet square but very quiet at the same time!!! Nice and big breakfast!!! Romantic decoration! Just not that good sounds insulation!  ", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r521612467", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Excellent hotel in historic centre", "review": "This hotel is very simple with old furniture and decor but very clean and calm. The location is perfect in the heart of the old city and close to many restaurants and coffee shops. The staff are very kind and supportive especially Rohan in reception.  The breakfast is repeated but very good and more than enough as a breakfast meal and the view in the restaurant is fabulous. Rooms are very small and the delivery charge from and to the airport is very high. In general it's good and the price is reasonable.", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r517723874", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "very nice hotel", "review": "The hotel was superb: clean and comfortable room, friendly and helpful staff, delicious and diverse breakfast, convenient location. Hotel's manager told us about all important places to visit and gave a lot of helpful information about Istanbul. Location is perfect: it's easy to walk to historic sites such as Hagia Sophia or Topkapi palace, and there is a tram line nearby. Excellent price/quality ratio!", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r517313966", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "nice hotel, good breakfast, average room", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r513028718", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Enjoyable Stay in the heart of the city", "review": "it is a nice hotel in the sultanahmet old city area. for the price it is okay. however, our room was on the ground floor, a bit unattractive and noisy - one could hear people talking outside, but for three days it was ok. breakfast was good on the rooftop terrace, loved the orange juice ", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r505741492", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Good value and a great staff", "review": "I had good time in here eventhou was only short stay in Istanbul, the place is centrally located, close to the public transport, the breakfast was quite huge selection for small boutique hotel like kaftan and nicely overlooking the sea.The room was clean and comfortable quite small, but is big enough for myself. I like to hanging around their garden as they also serve coffee and tea for free too. The staff was also very nice.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r505369651", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Feel like home away from your country", "review": "Excellent hotel! Well located near the main cites of Sultanahmet area, and a short walk from the tram for connections elsewhere. In a quiet neighborhood of mostly hotels / residences, very peaceful. Staff is very friendly and helpful, rooms are well decorated, excellent showers, and a nice little back garden. The breakfast is impressively diverse and expansive, Turkish deliciousness, and served in a sunny room with great views of the sea and city. Highly recommended", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r489870397", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Best hotel to stay in Istanbul", "review": "The small but beautiful Hotel in the heart of Sultan Ahmet.The room was clean and with the amazing view of the sea. Breakfast on the rooftops. Especially for the stuff it worths to stay. Thanks Ruhin and everybody!!! I never felt myself away from home. Now i know where to stay in Istanbul !", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r474924011", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great place to stay in Istanbul", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r448594018", "sub_review": {"Value": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Thumbs up", "review": "A great small hotel with good breakfast, Loved the location, walking distance from Topkapi Palace, Blue Mosque & Hagah Sofia. 5 min walk to tram station sultan Ahmed.  Staff best one I have met so far, all of them met with smile and took care of all your needs during your stay.  We stayed in Grand Family room, it has one queen , 2 double and a sofa sleeper, this is the largest room they have and there are only 2 rooms of this type, unfortunately both rooms are in basement without any window, if that is important for you.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r416107348", "sub_review": {"Location": 5, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "go go for it ! you`ll love it", "review": "I was immediately impressed with the decor of this charming boutique hotel. Although it's not easy to find (we were actually walked there by a helpful local) it is in a good location. I can't be certain that all of the rooms are the same but ours was neat and clean albeit quite small. The breakfast is adequate and is taken on the rooftop affording a splendid sea view. There's also a nice little courtyard where guests can sip a complimentary tea in peace and quiet.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r415974995", "sub_review": {"Sleep Quality": 5, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Classy and quiet boutique hotel", "review": "Hi everyone! a 4 days transit in istanbul where i has a 2 nights stay in Kaftan hotel (20 - 22 August 2016 )and another 2 nights stay in Spinel hotel ( see my other review which will come next ) .  location : the driver of the private shuttle i took from Attaturk airport dropped me just in front of the hotel. It is so close to many restaurents ( not cheap fast foods ), 10 minutes walk to Hajja Sofia and the sultan ahmet tramway stop ( think of buying an Istanbul card, it will be so useful to you for the transport within Istanbul ) 20 minutes walk to Topkapi palace and the Gulhane park.  Reception and staff : fast check in. the 2 men in the reception are kind and very helpful. I was always greeted with a smile .they both speak good English. Something I really liked in them is…", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r382391513", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Grest breakfast and location", "review": "I booked this hotel once in February and liked it so much that I returned for an extended stay in June. After staying at over 25 different hotels all over Istanbul, I can say that Kaftan is my favorite. The staff have been very kind and helpful to me, especially after I broke my foot. They accommodated me with a new room on the ground floor and assisted me on a daily basis with ordering food and pharmacy supplies, as well as with doing simple tasks. The hotel itself is beautifully decorated with Ottoman details and has a pretty garden area with all day tea and coffee supplies. My room was lovely and bright and had two big windows with colorful flowers hanging just outside. The location is quiet yet very close to the historical sights of Sultanahmet and there are many good…", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r375789452", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "NICE    !!!!!!!!!!!!!!", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r359464622", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "vwry pleasant stay at kaftan", "review": " my wife and i stayed there for a week very recently. very very nice ,friendly and helpful staff. every one of them. and the breakfast full of choices and plenty no matter how much you are going to eat or where you,re from.  i would recommend to any one. single of couples. if i,m ever back in istanbul again, i would def. stay there again..... ", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r358519452", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "my favourite in Istambul", "review": "Had a very pleasant stay at kaftan hotel. We really enjoyed the sea view. Breakfast had great options. Best location to stay if you want to do sight seeing without getting tired as it is steps away from blue mosque. Great staff and service provided.", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r354998538", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "good location, nice staff", "review": "Hotel Kaftan is a well located hotel .Close to every beautiful touristic places. Nice rooms and kind staff. The breakfast is varied and the view from the restaurant is a very good start of the day.  I was in in this hotel one years ago, and i will go after 2 weeks again. I", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r353124997", "sub_review": {"Value": 4, "Sleep Quality": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great Location Hotel", "review": "The hotel is well located near the Blue Mosque, Ayasofia and Topkapi palace and from the hotel you can easily reach by walk the big bazar. The room was big enough, clean, also the staff is nice. Breakfast was part of the price, big choice but not enough sweet food in my opinion.", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r351588633", "sub_review": {"Location": 5, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Really nice staff, but too noisy", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r350083883", "sub_review": {"Location": 5, "Rooms": 3, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Amazing hotel with great rooms and breakfast.", "review": "What I liked most about this hotel is the location, really close to SultanAhmet and Hagia Sofia. The room was small but clean, and the staff was very nice and helpful to us. The only problem with this hotel would be the noise and the breakfast that was pretty low quality (we skipped it in the hotel most of the time and went to eat outside), but still the restaurant has an amazing view on the sea.  Prices were reasonable", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r348854225", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Beautifully finished rooms in a great area", "review": "It's a small hotel but size &a designs of the rooms are amazing. I think they really spent a lot of effort on the design of all spaces. Rooms and common areas's design is really cultural.  Furthermore they have the classic huge Turkish breakfast which is what I heard typical to Turkish people. That's cool to have that huge breakfast with perfect view on the roof top where they serve it  About location; it's central, located on the main touristic/historical parts of Istanbul.   It's a small hotel but pefect for travelling istanbul due to its location, rooms and foods (especially breakfast)", "date": "January 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r339561195", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great breakfast with a view, didn't hold our room", "review": "We were extremely happy with our experience at Kaftan Hotel, the rooms are lovely, beautiful gold finishings, depending on the room you get they can be quite  but for the price you get them at you are definitely getting a great deal!  The hotel is located within walking distance of the Blue Mosque,  Hia Sophia, Grand Bazaar and plenty other food and shopping areas. Heating is very comfortable in the hotel and rooms are very clean.  Breakfast is lovely with a great view  of the bosphorous straight. Highly recommended  this hotel!!", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r329113889", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "My first \"terrible\" review on TripAdvisor", "review": "Overall the hotel was good, very clean and hospitable reception. However we booked a two bed room and they booked it to someone else, so I had to share a queen size with my buddy. Not the worst, just not what I signed up for. Within easy walking distance of all major sights.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r326153711", "sub_review": {"Value": 1, "Cleanliness": 4, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Great stay, excellent service!", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r324542831", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Friendly and helpful staff", "review": "They offer good quality service, comfortable and clean rooms, location is really good and prices are conveniently affordable. Breakfast is very well served, regarding also a wide variety of food...it is more like a brunch. Definitely recommendable!", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r320362873", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "nice hotel", "review": "The room is a bit small but cozy and clean.  Breakfast is nice.The hotel had the best location it is 4 minute walk to Hagia sophia,basilica cistern, blue mosque. A lot of restaurants and shops around the area. Staff are friendly and helpful especially Ruhin.  The hotel doesn't have a lift. The breakfast is served at the roof top with a winding stairs. If you have an elderly with you who has a knee problem or having a hard time in going up and down in the stairs. Then this hotel will be difficult for them. But if no elderly in the group. Then this hotel is perfect.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r317306960", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Location", "review": "Booked a room for my parents' wedding anniversary getaway. They liked the hotel very much. Great location (just a couple of minutes walking distance from St. Sophia’s Cathedral and Blue Mosque), clean and cozy rooms, nice personnel, good breakfasts. ", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r315332555", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "The Best", "review": "Very well located, walking distance to most interesting historic places. nice, friendly and helpful staff.  Should have more tv channels available, and air conditioning on breakfast area. Overall very nice place to stay.       ", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r312826834", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Simple and beautiful", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r311307346", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Brilliant hotel ", "review": "we stayed 7 nights,the room was little small but clean and nice. we passed a good time in the hotel.the breakfast was very good and the staff was great and always smiling mainly Aydin. Farid Best regards       ", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r309246426", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Clean and well-located", "review": "We stayed for only three nights but loved it. In a perfect location in the old city it means most sights are in walking distance and if not then the staff are happy to help with directions. Breakfast was very nice and the room to eat in had lovely views. The rooms were beautifully decorated and immaculately clean. We had a very nice view thanks to an upgrade offer of the sea. The outside garden area is a nice place to chill out in the evenings. Lots of pamphlets with information in the foyer which provided us with a good few trips and tours.  Upon arrival we were given a great map that we used throughout our stay In the city. Free wifi is also a plus!!  Would recommend to anyone. Great hotel for good value. ", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r307069136", "sub_review": {"Location": 5, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent in all standards", "review": "Came here after spending two night in another hotel. The receptionist/manager was very friendly and made sure the room was clean before we checked in. He was very helpful all around. The hotel is small, but clean and very well located. Would go back again.", "date": "December 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r305447362", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Lovely little courtyard, charming decor, good location & excellent breakfast with view of Sea of Marmara", "review": "Great Location.  Polite Staff. Major attractions are in walking distance. Free breakfast is the best so far in any hotel !!!!  Also, rooms are excellent. We were group of friends and the room decor were excellent", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r304549131", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Good for value!", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r292015927", "sub_review": {"Location": 5, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very good place", "review": "The staff was really friendly and helpful. Our room on the first floor, very noisy - seagulls, noise from house work next door, etc. Very small room but clean. Good breakfast on the terrace with a decent view. Our room was a non-smoking room but people smoke all around so sometimes it was annoying for people who prefer to breathe. Fantastic location!  The food in Istanbul was good. Our last night we were lucky to choose The Cozy Garden for dinner. I know it is in a tourist area, but the food was amazing and so were the staff.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r287126547", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "wonderful place", "review": "The location is very good - only 5 mins away from Hagia Sophia and the Blue Mosque. Very nice, friendly and helpful staff (especially Nemat :)) Free breakfasts on terrace with great views on Marmara Sea. Overall, a very nice hotel for a good value", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r279907384", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Perfect for families, groups, couples, and backpackers!", "review": "Location is perfect!!-closed to Topkapi palaanbul -Hagia Sophia-Blue Mosque-Hippodrom-only walk 10 minutes!!-Grand Bazar-15 minutes-down to Marmarasea-10 minutes!!-It is a very quiet place-only Muezzin is calling in the morning from Blue Mosque-but i love this sound in the morning!!. Rooms very clean-perfect!!-It was the second time i spent my time in this hotel and i was very surprised if i came back this time, because the rooms-the garden terrace was completely renovated!!-I only can recommend everybody this hotel-i never had anything to complain-The stuff always friendly-if you have any problem-they help you!!!!-thank you stuff for this nice 12 days now-and 20 days 6 month ago!!!-I will come back-thats sure!!-price-performance relation is very good!!!!c", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r278583145", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "The stay was just ok", "review": "We had a group of 10 stay for 9 nights and it was just what we needed. It's off the beaten path of traffic for noise level, but it's still close to walk to restaurants and all the major attractions. The staff is what really takes this hotel to the next level. As there are not too many rooms, they get to know your name quick. There is always someone there available to help give directions, airport shuttles, extra blankets, etc.. As I have stayed in other hotels in Istanbul, I guarantee you this is not always the case. Some reviews complain about breakfast, but it is very comparable to other Turkish breakfast at similar hotels. Don't expect American or European food! I would recommend it to middle-income families, groups, couples, and backpackers. People expecting cruises, mini…", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r273315220", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "It is OK", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r272465294", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Great location is not everything", "review": "Ok hotel, location is great. Prise was ok. Staff are nice. Room is medium size, has old style. Breakfast was great. They kept my bags after check out.   Make sure no construction behind the building. After 10:00 am to 4:00 pm", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r264542828", "sub_review": {"Location": 4, "Sleep Quality": 2, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good service", "review": "Positives: Excellent location. Just 2min from Haghia Sophia by walk. All highlights in walking distance. Stuff was nice. Room seemed to be renovated recently. The breakfast was ok but I would prefer a larger variety because after few days it was really boring to eat the same stuff.  Negatives: Walls are made of paper, we could hear every single word and noise around us - very annoying. There was no cleaning during our stay, they didn't even take the trash out. We dind't get any towels on the 2nd day and had to ask for them. Room was extremely small for 2 people and quite dark (2nd floor, street view). It was renovated, but the renovation was kind of shady. Large gap between wood tiles and the wall on the floor. Painting streaks still visible on AC control. The sink in the…", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r264199563", "sub_review": {"Sleep Quality": 3, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Generous hospitality, great value", "review": "The staff is very kind and helpfull, this and the good location close to Blue Mosque and Hagia Sophia are probably the best things. Also breakfast, which is included, is more than correct and they keep refilling food until breakfast time finished, but then, a lady picks everything up at light speed.  Our room was tiny but clean.", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r261187154", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Perfect location, friendly stuff and small but clean rooms", "review": "We  booked three nights and stayed nine. Murat, the manager, not only maximised our comfort and convenience, he also assisted with flight complications and airport shuttles. The breakfast buffet served by Gulsen is sumptuous and she always greets you with a smile. Rooms are clean and comfortable, wifi is excellent and position is perfect.  Highly recommended, Tony Christy, Australia, March 23", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r258505216", "sub_review": {"Location": 5, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Perfect location, friendly stuff and clean rooms", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "January 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r252795815", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Perfect location", "review": "Hotel is few minutes walk distance from Hagia Sophia, Topkapi and Blue mosque so hotel is placed at perfect location. Stuff are very friendly where I must mention that breakfast starts at 8 am but they make me coffee every morning around 7 am. My double room was small, but double room of my friends was normal size. Our rooms were cleaned every day.", "date": "January 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r252645753", "sub_review": {"Value": 5, "Location": 5, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Small but very good", "review": "Perfect location, just a few minutes walking from the must-see Istanbul landmarks. Small but clean and pleasant rooms. Friendly, helpfull and kind staff, great breakfast with very nice view on Sea of Marmara. Overall a very pleasant stay.", "date": "December 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r249680808", "sub_review": {"Sleep Quality": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Doesn't worth value", "review": "The location is really good, just a couple of minutes walking from S. Sophia. The rooms are kind of really small, but clean and everything works very well.  The breakfast is good and with a certain choice of different thinks. The guys at the receptions are friendly and helpful.  Overall a very pleasant stay.", "date": "December 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r248622705", "sub_review": {"Value": 1, "Location": 4, "Rooms": 1, "Cleanliness": 3, "Service": 1}, "travel_purpose": "", "rating": 1}, {"title": "Excellent breakfast and good location", "review": "Even thinner wall than any other hotels i've stayed. Definitely didn't worth. I could hear every voice and even the words from front door. Smallest room (though the rate was most expensive) among the hotels i stayed at Turkey. Breakfast and the location was nice. ", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r243808423", "sub_review": {"Location": 5, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Nice hotel for weekend journey", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r241629706", "sub_review": {"Value": 3, "Sleep Quality": 4, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Unexpected satisfaction", "review": "Small hotel with not large rooms. But if you decided to visit Istambul center for few days and you don't need luxury, but fair price, Kaftan is absolutely perfect. 1 minute from embankment, 3 minutes from Hagia Sophia.", "date": "November 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r240884321", "sub_review": {"Value": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent highly recommended hotel in Istanbul", "review": "This hotel is better than you could imagine at first sight. It has quite small rooms, but they are adorable. It's very clean and the beds are comfy. Most remarkable is the location, the breakfast and last but not least the staff. Totally value for money and highly recommended.", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r240061677", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good", "review": "We stayed here with our 2 little kids in October. We spent 5 nights at the kaftan Hotel. I really didnt expect much because of the very low price i paid but i was surprised when we were shown to our room! It was cozy, bright and clean with a modern touch. Bathroom was very nice and clean too fully tiled with a bathtub hence easy to give kids a bath.   Housekeeping was good, with bedlinen and towels changed everyday along with general cleaning. Turkish breakfast on the terrace with a nice view of the sea but dont expect western breakfasts as there were no cereals either but lucky for me i had already taken cereal boxes for my kids. The ladies serving the breakfast were very sweet and lovely! A big thankyou to them! Wifi was free which was great as we could keep in touch with…", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r239573472", "sub_review": {"Value": 5, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Great location for a short stay", "review": "Very good location. Walking distance to Sultanahnet,Hagia Sofia Service at reception is excellent, very friendly and helpful people. Good breakfast on top floor terrace with view on the sea. Clean rooms.  Best location for the price !!!!!!!", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r239295697", "sub_review": {"Location": 5, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "MY BEST HOTEL IN ISTANBUL (about all, price and location)", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r238888758", "sub_review": {"Location": 5, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Good location; bad service.", "review": "Yes, so close to Sultanhamet, and so quiet !  very friendly and helpfull people - you can have any regrets to go there. very good breakfast too, on the top with view on the sea. Clean rooms, everething is good for me.", "date": "November 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r237631371", "sub_review": {"Value": 3, "Location": 4, "Rooms": 3, "Cleanliness": 3, "Service": 2}, "travel_purpose": "", "rating": 3}, {"title": "Best location in historic Istanbul", "review": "Stayed one night at this hotel.  The room is ok for its rate and the shower is good; the breakfast is also good with a remarkable view from the terrace. However, the service of the front desk staff (daytime shift) is just bad if not terrible - he is arrogant and not helpful and provided limited information upon enquiries; the worst part of my stay was that he questioned my wife rudely and for why didnt we book the airport shuttle via him when the shuttle bus came to pick  us up at the hotel (the price quoted by him was higher than the one we eventually booked for). All in all, if you don't care about service and just want a room to spend a night at reasonable cost, this hotel might be a choice for you. Good luck.", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r234361082", "sub_review": {"Location": 5, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Affordable, good location, excellent breakfast.", "review": "Location, location, location. Walking distance to Hagia Sofia, Blue Mosque, Top Kapi Palace. Service at reception is excellent. Owner offered us free deserts on first day which was really nice gesture. Full Turkish breakfast on top floor terrace with view of the city. We will definitely come back next time we're in town :)", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r234070148", "sub_review": {"Sleep Quality": 3, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Kaftan Hotel --Leisure, comfort and good service", "review": "Thank you very much Mrs.Souraya. We are nice to meet you and hope to see you again.", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r234034299", "sub_review": {"Location": 5, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Very good air conditioner and location", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r231859729", "sub_review": {"Value": 4, "Location": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "Near main attractions-far from real city", "review": "Very good air conditioner made me fresh even the last summer was so warm.  Room is quite small its better to stay out more. The area is very nice. Easy to go everywhere you want to go. Staffs were very friendly and helpful.  It has nice view during the breakfast. ", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r230819192", "sub_review": {"Location": 3, "Rooms": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good value for the money", "review": "Kaftan hotel is a small hotel, very near to the blue Mosque and Ayasofia.  Room: it was very small, the bed mostly occupied the room. it was so small that a chair could not even fit in the room. Otherwise it was clean, airconditioned, the bathroom was very nice and we had plenty of fresh towels.  Breakfast: It was very nice too, not your typical english (assuming you're there to try the local cuisine). everything looked fresh. On the downside, there was not much of variety.   One thing that disturbed me was that they did not have an iron to lent me, which i find it odd.  Location: a lot of people say that the location of the hotel is its strongest point but i disagree. Sultanahmet is a touristic location where the businesses offer their services to tourists and only. You will…", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r229541860", "sub_review": {"Sleep Quality": 5, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very nice Hotel!", "review": "The Hotel is located almost 10 min walking from the main attractions in Istanbul and 15 minutes walking from the tramway With considering the price of Hotel , the service is very good The room is a bit small but it was OK for us as we didn’t spent too much time in Hotel, The breakfast was also good , need to mention that the breakfast room has wonderful view to the sea  In overall, I highly recommend everyone to stay in this Hotel and I will definitely chose this hotel in my next stay in Istanbul Hope I was fair in my review.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r226889259", "sub_review": {"Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "everything you need from your hotel", "review": "The location is perfect to visit the city, to take a bus, a taxi etc. The receptionist are very nice, very friendly and helpful. Our room was furnished with a turkish style, very nice! The only one bad point is that our room was near the reception and it was noisy.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r221722812", "sub_review": {"Value": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good location", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r218724249", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Affordable and well located", "review": "It was the first visit to Istanbul .. i lived a  nice experience ...The staff who working their are friendly and they help us a lot ...especially when my father get tiered... Big Thanks for reception staff Thanks for Ruthin Velihan without your explanation we couldn't reach our place Thanks for Araz ZeyNalov wish you the best    And also I will not forget the lovely smiles:):):) from Neriman and Aydin  ... Their smail with their words \"\"good morning and how are you today\"\" ...  This give you another shiny and worm day  Wish to visit istanbul again ... inshAllah", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1204926-r208869195", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled solo", "rating": 3}]