[{"title": "Great view but the worst place ever", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r685914003", "sub_review": {"Sleep Quality": 2, "Cleanliness": 1, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Not acceptable", "review": "The location was good with a great view of the sea but the room itself was terrible, the power plugs are out of the wall making it not safe at all, the refrigerator was not working,  the bathroom has a bad smell, the room size was extremely small, no place for the bags and no closet too.  After we returned and gave them a bad review on booking, the hotel took all the ,money from my card and blackmailed me to delete the review in return for the money.  It was a terrible experience.", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r668686893", "sub_review": {"Location": 2, "Rooms": 1, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Good price. perfect location", "review": "No hot water, dirty, room was at terrible condition, good staff, good location. Our services was bot good , we had no hot water to take shower until next day. the room was dirty as seen in the pictures. No mirror , no fridge.", "date": "January 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r646902141", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Not what we expected", "review": "We stayed for 6 nights, and it was a satisfactory visit. Staff was very friendly and very helpful. Breakfast was good compared to the price-the omelet needs to be hot. Although the room was very small, still it was cleaned daily with clean towels and bathroom slippers changed on a daily basis. The hotel is a two steps away from Marmary satation and only two minutes walk from Sirkejy metro station. Also it is nearby to most of Sultan Ahmet attractions. All in all, the hotel is a perfect choice compared to its price.", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r605081592", "sub_review": {"Location": 5, "Sleep Quality": 2, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Great view and breakfast ", "review": "Our room was small, very smelly, and the hotel has no elevator, so you have to climb some very narrow steps. Bathroom was very small, you have no place to put your things down. The air conditioning is exactly above the bed, so it is unhealthy placed. Also, if you have more electronic gadgets with you, there is only one place you can charge anything, and that's in the bathroom! On the other hand the location is excellent, and the breakfast was good, but we had an overall negative impression of our stay. We only stayed 2 nights, if you stay longer I would not recommend this hotel.", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r601353747", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Terrible Service & Irresponsibility", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r573603580", "sub_review": {"Service": 1}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "quite ok", "review": "We booked the Hotel, but they could anyhow cancelled our booking & rented out the room without inform us, while we reached the Hotel, we can't get to check in. The receptionist just very rude & told us that your booking was cancelled, and said their friend could offer other hotel room for us, but higher rate.  Beware, this kind of irresponsibility Hotel will mess up your trip, you will end up and to find another Hotel last minutes with higher rate.", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r518229219", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 2}, {"title": "Turkish holiday", "review": "The room is quite dirty and the air conditioner runs very loud. Hotel location is next to train station and next to a lot of street food, and it takes 20' walking from the hotel to some tourists spots of istanbul. ", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r435394532", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Mini room with view of bosphorus in (single or double room) 5th floor", "review": "It was very nice place which situated      near the famous historical places. Very friendly staff, very helpful. Mr. Merwan is very polite, kind and professional person. Wanna back in next time! Thx a lot for this great turkish moments! ", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r390682170", "sub_review": {"Sleep Quality": 3, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Not grand but a budget hotel", "review": "Pro: breathtaking view of bosphorus strait and brigde, eminonu pier, roof of sirkeci train station, galata bridge and tower. close to sirkeci tram stop, eminonu pier and marmaray sirkeci metro stop. lot of restaurants serve mainly turkish cuisine and fast food. I love the location which is in between Sultanahmet and Taksim area - the hotel is easy to find Good turkish breakfast with simple variety of menu. Friendly staff and very helpful. Clean room. There is a small market close to the hotel which can cater the basic tourist daily stuff (water, fruits, biscuits, cigarette, ...). Also moved to a single room in 3rd floor, more space and really designed for a single bed.   Cons: the room is mini with super mini shower box which I don't think that guests with big size can fit to…", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r365945706", "sub_review": {"Value": 5, "Location": 4, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "THE DREAM OF A TIGHT BUDGET", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r352282171", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "good hotel in istanbul", "review": "Amazingly close to everywhere, the Bazaars, two Mosques, we took from the Airport the train that leaves us in Sirkeci, a station in front of the hotel, shopping places everywhere, Restaurants, the services of the hotel are A plus the breakfast buffet delicious, booking a tour or a shuttle bus was so easy, the housekeeping are helpful and friendly,our room was very clean, even thought the hotel does not have elevator, the personal of the hotel help us with the luggage, we felt safe in the hotel and the surroundings, we enjoy our stay, Yamil and Mariaje  from Miami.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r343433054", "sub_review": {"Value": 5, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Close to everything", "review": "location location location. this hotel is located in the main attraction district. the staff very help full and the view from the hotel is amazing. u can save lots of money staying there and its easy access by train and metro. from air port take metro to aksaray stop, than walk about 5 mintues to tramp stop and than its about 10 minutes to sirkecie stop. and than ur about 3 minutes to door step of hotel. use their public transportation. its very cheap.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r270671179", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Good, cheap basic  accommodation.", "review": "Close to everything near tram stop, Eminonu transfer boats. The rooms are very small, need maintenance, smelling bathroom, no elevator. Nice breakfast good coffe. The staff is extemely friendly and helpfull. Overall is not worth this price as there are many cheaper same quality hotels in the surrounding.", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r269857652", "sub_review": {"Sleep Quality": 5, "Rooms": 3, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good value", "review": "This was booked by a friend. It turned out to be a clean, very reasonably priced hotel with an extremely helpful staff. Emir, the manager, gave us great help and advice during our stay. The lady cleaning the rooms was a delight, speaking good English and making sure we were comfortable. Good breakfast provided. Good free Wifi. The hotel has lovely views of the Bosphorus from floor 3 and above but no lift - rather challenging if you are unfit. The towels and bedding have seen better days  but are extremely clean with mattress covers etc. Bathroom very basic with erratic hot water. The position was central with easy access to trams, train and ferries (all within walking distance). Surrounded by restaurants. All in all good if you haven't high expectations of luxury, travelling…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r255871546", "sub_review": {"Location": 5, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Good value for money + New decor", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "December 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r245639087", "sub_review": {"Value": 4, "Location": 5, "Rooms": 3, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 3}, {"title": "very good location", "review": "We used Room 102 for a very short stay. At 80 TL = 40 CAD, I thought the location, the front desk service and room quality were good value for the money. A hostel for 2 people would have probably cost more and provided less.  The pros first: 1) Excellent location just behind the Sirkeci train station. 2 min max to the Sirkeci T1 tram stop. 2) New decor - cheap but clean and brand new. 3) Small fridge, work desk, flat screen TV 4) Hardwood floors, 2 nice beds, 2 comfy armchairs, snow white clean towels and bed sheets, disposable slippers 5) Windows that open and allow a nice breeze (as long as you don't mind street noise and some car exhaust) 6) Lots of electrical outlets to charge our various gadgets 7) New toilet and washroom fixtures - very clean tiles  The cons: 1) Very small…", "date": "November 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r241671501", "sub_review": {"Sleep Quality": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "the right place for tourism💛 !", "review": "The hotel is close to the main attractions. Most just a few minutes walk. Located in the metro maturity behind the hotel. Bit noisier than average, but not annoying! The staff is nice and helpful. The breakfast is not plentiful, but a few days bearable point. (3 kinds of cheese, two kinds of sausage, + butter, jam, honey, etc ...) The main building has no elevator, there are 6 floors. In the second building (as opposed to 10 feet) on each floor of a room and the elevator. They are more spacious. The reception desk is always free tea and coffee for guests! Overall, I recommend to everyone for a few days in Istanbul for visiting! good WIFI in the rooms too.", "date": "November 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r239969913", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Tiny broken room", "review": "a very calm hotel in the middle of the old city of istanbul . Sirkeci its like the heart of istanbul! all the historical famous places are here !  perfect atmosphere with amazing restaurents , shops ! this hotel have a very modern simple room style , with a perfect view on the sea and the old city . room cleaning service is very good ! the breakfast is simple . all the workers here are gentel and helpes you with everythings . the hotel is very near to Marmaray Metro Station , to the  TramWay , and to The sea ! the blue mosque, ayasophia and grand bazar are few meters from here ! under the hotels there is alot of stores , markets , and the streets never sleep !  i spent 9 days here ! it was perfect 😃! ", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r212043539", "sub_review": {"Value": 2, "Location": 4, "Rooms": 1, "Cleanliness": 4, "Service": 4}, "travel_purpose": "", "rating": 1}, {"title": "Do not go there.", "review": "Clean teeny tiny room with a semi broken toilet, three curtains missing and no door on the shower. 5 foot bathroom with toilet, sink and shower. Friendly staff in great location.  Ok breakfast a d free wifi", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r206651907", "sub_review": {"Value": 1, "Location": 5, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled on business", "rating": 1}, {"title": "Do not go there.", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r206578126", "sub_review": {"Value": 1, "Location": 5, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 2}, "travel_purpose": "Traveled on business", "rating": 1}, {"title": "bad experience", "review": "Never do not book this hotel over the net. They will  CHEAT  you. The hotel is terrible! I do not know if there are inspections in Istanbul, who gave them permission to work? We booked through the net, Shuttle from the airport is should be  of the hotel. But, at an airport - no one came. I  phone called  four times in the hotel and after 35 minutes, came the dirty van. Now, the next of surprises: He ADVANCE PAYMENT  and AFTER  payment, he said that there is NO FREE ROOMS  in the hotel, regardless of what we had booked. Can you imagine how they perfidious cheat and lie. Now, you'll see why! The man told  (without excuses) that they will send us to another hotel for one night and so we have to walk to another hotel, located approximately 300 m,   on the steep, the aggrieved…", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r205294571", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 2, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled solo", "rating": 1}, {"title": "Worse ever experience ", "review": "Very good location is an advantage only. Dirty, small and noisy rooms. There were no table, no safe box, no mini bar and no tea-kettle in the room (however it was specified in web-site information). Once I returned in the evening and the door in my room was widely open. It was open the whole day long, the cleaning staff had just forgotten to close it. Poor breakfast.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r204837342", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Excellent Location BUT ..... You must read this !!!", "review": "We booked the hotel a month earlier however when we arrived on 1st May night after a long flight, we were told that our rooms have been cancelled as unable to charge our credit card. It was totally unacceptable as I booked rooms for other locations using same credit card and didn't encounter such problem. We were transferred to their sister hotel known as Pelikan hotel in Aksray and asked us to share the room. I suspect the rooms were given to walk in customer with higher rate and they gave lame excuses that my credit card not working. The best part, I confirmed my arrival one day before via email and they replied said rooms are ready. How can they do this. Going to take action with Booking.com for having such unreliable hotel under their list ", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r203857543", "sub_review": {"Value": 1, "Location": 5, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled solo", "rating": 1}, {"title": "Clean but tiny - good service", "review": "I checked in this hotel on 20 Apr and I checked out on 29 Apr. I was assigned the room 101. There is no table in the room. That was very unconvince when I need to use laptop. The Room and shower room are small and I felt very noisy because my room second floor and same side with the main gate(lobby)at the first floor. I couldn't have good sleep for the whole stay(total-9 nights). Some of the staffs they speak loudly in the midnight and forget their guest may be in sleeping or are resting. Wi-Fi is sucks , instable. I even could'nt make a video phone by SKYPE. This is the most worst experience I ever had.", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r203379548", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 3, "Rooms": 2, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "BUSINESS TRIP IN ISTANBUL", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "March 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r197585343", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Very close to everywhere", "review": "i was in istanbul for business all alone, i felt very secure with a very nice and helpful team the location is great ,exacttly what i need even from airport i came bysubway and tram ,and 2 minutes walking distancefrom tram to hotel      ,the hotel  bedroom small but very clean  i dont think you cannot beat for this quality price i will be back and they are speaking english it is not all the place in istanbul", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r191796656", "sub_review": {"Value": 4, "Location": 4, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Good Location", "review": "I have chosen this hotel coz I wanted to be close to bothbthe old city and to the galata area and ferry docks. They breakfast was good. The receptionist sadat was very helpful and  speaks good english. ROOMS ARE SMALL. NO ELEVATOR.", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r180823688", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Shannon Owens", "review": "We stay at this hotel in August with two kits It is close to everything Compare to other hotels in Istanbul this was the best location Best view good people work there we never have any problem with them They try to help us any questions we have I recoment this hotel and next time I go to Istanbul I will stay in this hotel", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r173215367", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Bad experience", "review": "This hotel rocks! it had an awesome view from the fourth floor. The last time I came to Istanbul I stayed at another hotel and it was nothing compared to my experience at Esen Hotel. The staff was very friendly and exceeded my expectations. The price wasn't expensive and the service was perfect. I would recommend this Hotel to anyone staying in Istanbul it's been a great time comfortable and cozy.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r163009194", "sub_review": {"Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "ESEN HOTEL THE WORST HOTEL IN ISTANBUL.", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "March 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r156601523", "sub_review": {"Value": 1, "Location": 1, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Good and cheap place to sleep", "review": "I booked my hotel 6 months ago i arrive there and guests are still in the hotel i booked. The Receptionist said to me \"if you want wait in another room until the guests are out\" He Offered Me A 4 Beds Room But I Was 5 Persons. The Rooms Were Extremely Dirty and Too Small. I refused the offer he gave me. i said to him i want the room for 5 persons not 4. ( I booked the 5 Beds Room 6 months ago). then he told me to come after 3 hours and he promised me that the guests will be out of the hotel. so i have a little wonder around istanbul and when i go back after 3 hours he told me the guests are still in there. then i waited till mid-night i go to him again he told me the guests are still there you still have to wait for them to go. because of this i had no where to stay so i had to…", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r147491824", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 3, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Disappoitment", "review": "This hotel is enough for sleep, eat breakfast and visiting all day city. Sirkeci is good district - there is a lot of restaurants, very close is ferry and tram station. U can walk to Hagia Sophia or to Kadikoy promenade (half hour by slow walk). Rooms are very small and crew is specific, but everyone are very friendly and fun. Air condition is working, rooms are cleaning everyday. The most important is price - this hotel is really cheap. I paid 70TRY by night with breakfast. It's good place to visiting museums and old Istanbul.", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r143326530", "sub_review": {"Value": 2, "Location": 4, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 2, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "My booked room not available – relocated to a hugely inferior hotel with no compensation or apolology", "review": "Location was good, but room very, very small. You hardly could move as luggages filled the narrow space between wall and bed. Water was flooding on bathroom floor when you used shower, toilet or sink. No place to hang your towel  and the shelf fot tooth brush etc. was broken. It was impossible to shut the window. So the street noise filled the room. Breakfast and staff was ok.", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r142427458", "sub_review": {"Value": 1, "Location": 4, "Sleep Quality": 4, "Rooms": 1, "Cleanliness": 2, "Service": 1}, "travel_purpose": "Traveled solo", "rating": 1}, {"title": "Don't open that door...", "review": "I was left sitting in the lobby nearly two hours before being told my room had been overbooked (I booked some 6 months ago). The manager took me to the nearby Sirin Palas hotel which had a very down market reception area, but he assured me my room was every bit as good as the one at his hotel. This was untrue – the Sirin Palas is a no-star place for visiting low income Turks from out of town, not a tourist hotel. It lacks the finishes and features shown on Esen's website. It was inferior to the $us15 backpacker joint  I had stayed in the previous night, forced by an earlier than anticipated arrival in Istanbul. My Sirin Palas room had no aircon, fan or insect screens on the window so it was a choice of being either stuffy and hot or bitten by mosquitoes. The roof of an adjacent…", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r140523637", "sub_review": {"Value": 1, "Location": 5, "Sleep Quality": 2, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Was ok", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r129796069", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Do not book", "review": "Very centered hotel, with rooms ok but for the price I paid I guess it was not so bad. Very centered hotel, with rooms ok but for the price I paid I guess it was not so bad.", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r129683783", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Central and quiet, helpful staff", "review": "I booked this hotel in January, confirmed my booking three weeks before we were due to stay there.  I was already away when I received an e-mail saying the reservation was cancelled, as the hotel was closed for renovation.  This e-mail was clearly sent to a number of others. They made no effort to find alternative accommodation for us, when it was clearly not our fault. We had to find another hotel in two days, luckily I did, at considerable extra cost.    Whilst we were in Istanbul my partner and I went passed the hotel and he went in to ask if they had any rooms and they did. At 60 euros a night we had booked at 35 euros a night. The hotel was clearly open.  To add to this the hotel have charged me for one nights accommodation which I am now trying to get back. What a cheek…", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r129272819", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Suddenly cancel booking", "review": "Good value for price, I had a small single room, all basics were covered. The room, at the back of the hotel,  faced the railway station, and was close to Sirkeci metro stop. If you don't have heavy luggage, you can take the metro to the airport, thus saving money! Breakfast included, and typical of such hotels in Istanbul: more than adequate. Clean and safe hotel, ideal for solo woman traveller. Staff very kind and helpful. No shower recess in bathroom, but one manages!", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r128873571", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "economical staying", "review": "We were booked this hotel, received a confirmation. Suddenly, some days later, we received a letter from hotel that sounds something like \"we are really sorry, but we decided to renovate our hotel so cancel your booking\"! I think that respectable and good-service hotels never make such action!!!  Please, think before make a reservation in that hotel!", "date": "January 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r122977966", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Excellent& Cozy Hotel!!!", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "December 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r122373415", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very nice Hotel", "review": "Hi,  i was last week with my fiancee in Esen Hotel in Sirekci for 6 nights. I was actually several times in Istanbul, for shopping, holiday, business trip, and was very impressed of this cozy nice hotel close to Grand Bazaar (Capali Carsi) and also to the historical sights of Istanbul. So I take this opportunity and want to write some positive points and impressions of this great location. First of all as I mentioned before, the location of the hotel is splendid. Further the staff was very helpful starting from the reservation til check out process, everything was going smooth and without any circumstances. The rooms which we stayed for 6 nights was spacious, clean and modern equipped with air condional, flat tv, nice bathroom etc. All in all, I would book again if i travel once…", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r120799543", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Avoid this hotel", "review": "Will go to Istanbul, I can recommend a very good hotel very clean rooms and excellent breakfast in a hotel, overlooking the Bosphorus and the staff is very good, very nice people live anywhere close to the hub location.within walking distance of historic sites.One of the very attractive as the price of hotels.", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r119764722", "sub_review": {"Value": 1, "Location": 3, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "BE CAREFUL", "review": "I was booked in for 5 nights in this hotel but left after one night!  Room; The double room was no larger than a double bed with a foot wide space down one side of it. The window opened no more than 3 inches nether did the provided wardrobe and my wife and I discovered that if one of us wanted to stand up then the other had to sit on the bed. (See photo of room width)  Bathroom; I wont even go on and describe the dismal state of the tiny filthy bathroom..!   Noise; Every noise from people moving in the hotel, their rooms or flushing toilets resonated up the wooden stairs which made for a terrible nights stay / sleep.  Overall opinion; AVOID THIS HOTEL! Its a complete rip-off,  spend a couple more Euro's and stay elsewhere. As an experienced traveller I would describe this hotel…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r117280115", "sub_review": {"Value": 1, "Sleep Quality": 1, "Cleanliness": 1, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Not very good", "review": "Let's start with the positives, Friendly staff, great WiFi coverage throughout, great location next to all main attraction (walking distance Ayasofia, Blue Mosque, Topkapi Palace, Trams/train.   Negatives, New building is great in all aspects, Old building... well this is another story. 6 floors (no elevator), deteriorated rooms, bathroom was leaking, walls chipping. For myself not fit for staying even @ 45 euros a night. Have had excellent rooms with similar price.  Youngsters may cope but for couples over 35 don't think so...    So be careful, NEW BUILDING. Also there is no garage parking unless you pay further down the road..", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r116433793", "sub_review": {"Value": 2, "Sleep Quality": 1, "Cleanliness": 4, "Service": 2}, "travel_purpose": "Traveled solo", "rating": 2}, {"title": "A thoroughly dismal stay!", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r113864958", "sub_review": {"Value": 2, "Sleep Quality": 2, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled solo", "rating": 1}, {"title": "Deceptive, arrogant and extremely rude staff", "review": "I stayed here for a few nights at the end of a long trip. I was prepared for pretty barebones accommodations but this was truly something else! The first room they showed me had someone else's clothing and food in the closet. It turned out to belong to a staff member who was staying in the room. I asked for a new room and they 'upgraded' me to a room with a queen bed. I was initially quite pleased about this until I took a good look at the bed. The sheets didn't fit it and so they'd strung two twin sheets across the bed and the sheets had dozens of holes in them. There was often water on the bathroom floor and little black worms would congregate in it. I had to ask specifically for this to be cleaned up. The bathroom had been poorly maintained and the shower door fell off its…", "date": "March 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r101089343", "sub_review": {"Value": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "I don't advise to go to this hotel.", "review": "We arranged for this hotel to hold our bags for 3 days, book a hotel shuttle and provide day use upon our return from central turkey.  Before leaving Istanbul, we agreed on a price with their receptionist named Hamdusena, with a signed receipt.    Once we returned from our side trip Hamdusena had more than doubled our price, explaining that he had sent a more expensive shuttle for us (without informing me when I phoned from Kayseri to confirm our shuttle).    At first I did not refuse to pay the price, but simply requested that he consider a discount since there had clearly been a mix up on their end.  Hamdusena would not let me open my mouth to even explain why I was upset with their rediculous increase in price.  After not being able to speak for nearly 5 minutes I simply…", "date": "January 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r87815810", "sub_review": {"Value": 1, "Location": 4, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled solo", "rating": 2}, {"title": "not advıseable for women", "review": "I booked a room last year,the single room is very small i hit my head during sleeping tow times,no elevator curved stairs,breakfast i can't even call it a breakfast just bread and tow more cold items. You can't close the bathroom's door and the most annoying thing was the smell of cigarettes all the time. I only spent sleeping hours and maybe tow hours during the day to change clothes and wash up. what makes angry the most is that they raised their rooms prices,I payed 20 Euro for the night,but while I'm searching now for hotels in Istanbul I found it 30 Euro. I don't recommended for any one.", "date": "November 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r86203247", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Dirty, smelly rooms with violent staff, avoid at all cost!", "review": "the actual locatıon of the hotel ıs great, ıt ıs central to most of the places tourısts want to see. However, I would not advıse you to stay there unless you have a man wıth you. My frıend and I decıde to do a 2 nıght stay, fırst nıght no problem, but 2nd nıght was a dıfferent story!!! we had a member of staff tryıng to force hıs way ınto our room. It took both of us to push hım out and get the door closed, he then loıtered outsıde the door and only left when we threatened to call the polıce!! next mornıng he came runnıng after us grovellıng and apologısıng for hıs actıons, but no amount of apologısıng wıll persuade us to ever stay there agaın.", "date": "October 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r83206895", "sub_review": {"Value": 1, "Location": 2, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Extremely disappointing - run away", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "June 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r71109761", "sub_review": {"Value": 1, "Location": 3, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Clean Budget Hotel in Central Location", "review": "One of our friends booked the place completely randomly. Before we actually arrived in Istanbul, I had checked the reviews on trip advisor and it looked pretty bad. Once arrived in the hotel, it was even worse. The rooms are ridiculously small. Don't even think to fit two people in there. On top of that, the wallpapers are peeling, the bathroom has broken bits and parts and all in one, it makes you want to run away. One exception: their 2 rooms presented like \"presidential suite\" on the top floor. Don't be fooled though, they will tell you it's for 4 or 3 people and there's no way more than 2 people can stay a night without asphyxiating (it's boiling hot, in the summer).  The breakfast is absolutely scandalous. We didn't get to eat anything, and all the clients in this hotel…", "date": "June 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r70228073", "sub_review": {"Value": 3, "Location": 4, "Rooms": 3, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good valu for money and grat location", "review": "Our room had 2  red velvet chairs and 2 beds.  Very sunny and bright.  The beds were comfortable we stayed on Level 2 so no water views but views of the railway station.  Windows opened and also had use of the airconditioner at night all included in the price. Typical Turkish breakfast olives, tomatoes,cucumber, boiled eggs, sliced meat, jams and bread.  We were able to access the hot water for tea and coffee in the evenings. Great cheap eat restaurants all around in surrounding streets.  Opposite is a supermarket.  Walking distance downhill to Emininou Port area.  Helpful staff. Enjoyed our stay.", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r63253314", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Beware: Dirty, Smelly, Noisy, Shoe box triple room. Stay Away!!", "review": "Rooms pretty clean, great location, nice service. Air-condition and WiFi in the hotel. Rooms were cleaned daily, when we were leaving there was no problem to order taxi to the airport. Breakfast served near reception which is the only disadvantage. We couldn't pay with a card as terminal was broken?!", "date": "April 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r61626316", "sub_review": {"Value": 1, "Location": 2, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Very good value for money", "review": "Beware: Dirty, Smelly, Noisy, BUGS, Shoe box rooms. STAY AWAY!!  I Booked a \"Family Room\" for myself, wife and two children (2 and 11months) one month in advance. We arrived to find the room was not ready. They then gave us what seemed to be a single room crammed with three singles beds. They took the third bed up from the basement whilst we were waiting downstairs.   The room stank of cigarette smoke; all the bedding was not clean and also stank of smoke, sheets were and pillow cases were clean, pillows stank of smoke too. There were no quilts just blankets that were smelly and caused me to itch every time they touched my skin.   They put two single beds together witch did not fit together well ad hence gap in the middle. The third bed was crammed in leaving very little space…", "date": "November 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r48510219", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "good location thats all", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "October 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r47109431", "sub_review": {"Value": 4, "Location": 5, "Rooms": 2, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "There has to be better", "review": "when we booked that hotel we didnt find a review about the hotel so we toguht its a new one & we saw the photos on its website & it was very good for the price double bed  standard 38 euro which was very cheap  first the room is so small the bathroom was too small that if you use the toilet you have to put  your legs  inside the shower area  there weregerman  cockroach in the room ,when we reached there was no pillow cases or towels & when we asked the manager he said that they are in the laundary ,we asked him to change our room & he said that the hotel is full& we can change it in the second day & he did which was a littile better the breakfast is very poor the towles & sheets worn out  & noisy at night because its near the tram  if you are the kind of person that doesnt care…", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r40012415", "sub_review": {"Value": 3, "Location": 4, "Rooms": 2, "Cleanliness": 1, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Basic Hotel in Great Location", "review": "At first glance, not a bad deal. We paid $55 USD per night. However, we were given two twin beds instead of a double, the internet did not work and we were rarely spoken to by the staff.   The worse part was the bathroom. The shower leaked, attracting worms and insects galore.   Perks: nice buffet breakfast included, beautiful view,close to tram", "date": "August 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1464950-r39874512", "sub_review": {"Value": 4, "Location": 5, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled solo", "rating": 3}]