[{"title": "Internet ", "review": "I am currently staying at the Adalya Resort & Spa, I researched this hotel on trip advisor, YouTube and their website ensuring the hotel facilities . (Internet)To my horror when we arrived to be told wifi only in the reception area (free) but we have to pay to have wifi in our room price of 3 euros per person on each devices daily. I challenged the management asking why this is not place on the hotel profile? why wait for your customers to arrived to be told three euro for each devices daily . I will strongly advice anybody looking to booked this hotel please call the hotel first get clarity on theirs facilities (advertising incorrect information) also speak to your booking agents to double checked what you are paying for !!   I am happy with the staff they are wonderful, beautiful room can’t complaint food ok so far (day 5 )  Indoor pool close, bad accident last year  causing indoor pool to be closed.  …", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g6536761-d1487044-r613056328", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "It is good in its category", "review": "The location of the hotel is good, just a park walkway from the sandy beach. The hotel is very clean and well maintained, the staff are very nice, they work a lot. The choice of food and drink is adequate and satisfying. The beach is a bit crowded, but the pool area is not. Half of the guests are about German, and here's a small problem. Everything about them, services, informations, entertainment, etc. It was like a German hotel. Overall good.", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g6536761-d1487044-r522160616", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Fantastic hotel ", "review": "I previously posted a detailed account of our 2 week holiday but I neglected to add that this resort is for Germans . I was the only non German speaking person . Although not really an issue but the announcements , tour guides , activities and staff only speak German .  Some bar and restaurant staff could speak English but very few . My daughter in law is German so not a problem but without her it would have been difficult to organise tours etc ", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g6536761-d1487044-r399422525", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Nice vacation - full beach", "review": "We have stayed as a family (2+1) ate this hotel as a main summer vacation. We had a nice 11 days vacation. The first impression was bit confusing, but after few days we get used and we can consider the vacation as quite good. The hotel has some negatives and some positives.  positives  - spacy rooms  - animation team is friendly and always positive  - clean beach  - turkish night food  negatives  - german only speaking stuff (except reception and animation team). Does not understand basic english spoken requests.  - beach bags - only for german guests? looks like that. We saw couple of guests with hotel beach bags, but we did not found any in our room  - mini club - extra payment for t-shirt painting and some other activities. Looks like tiny budget for animations.  - ultra all inclusive is not so ultra. foreign alcohol for fee  - small beach is full. During afternoon hours you will have problem to swim in the sea because it is overcrowded…", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g6536761-d1487044-r339166085", "sub_review": {"Value": 4, "Location": 3, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "ten day stay", "review": "excellent hotel with every amenity available.all staff very helpful in all ways possible from welcome to departure.cannot fault any facility used and would happily return. our room was on second floor and had lift facilities available.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g6536761-d1487044-r321302469", "sub_review": {"Location": 5, "Sleep Quality": 3, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Fantastic hospitalty", "review": "We stayed twice at this hotel. Design is nice and rooms are comfy and spacey. Food is great and beautiful,  wide range of choice, Service is all for you. Staff is really friendly, helpful, quick. Beach is wide and clear with sport activities. I can only recommend it for everyone.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g6536761-d1487044-r290320870", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "great holiday 15th to 29th april at adalyam", "review": "My daughter and myself stayed at this lovely hotel for 2 weeks. The food was very good as was the service, hotel kept immaculate. We had a great time. The animation team were fantastic, lovely shows, dedicated and friendly people, they enhanced our hol. We rate this hotel 9 out of 10 and highly recommend it, not too big. The one point missing is cause of men trying to chat up my daughter constantly, otherwise great.", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g6536761-d1487044-r269789422", "sub_review": {"Value": 4, "Location": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great place for a holiday", "review": "We have spent a 7 night holiday at this resort and got back last week and we came back home full of good memories. The hotel is quite small for the resort standards which was a bonus as the atmosphere at the hotel was more relaxed and you could actually enjoy just lying by one of the pools or have a nice quiet lunch without having to listen to people screaming around you.  The rooms are a good size and really nice and freshly decorated with wooden floors and every room had a balcony with a view of the sea. We didn't think it was possible and even though we got a room at the furthest corner of the hotel we were able to see the sea.  It is a great place for families with small children or older couples with grand children (not a party hotel). Also the evening entertainment was…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g6536761-d1487044-r167367930", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "We loved our stay", "review": "We travelled with a German Tour Company, and were not surprised that this hotel caters the German market.  This should not put off any other nationality!    The Hotel was clean and tidy throughout our 12 day stay.  Our room was a decent size and always cleaned.  There was a small balcony which was more than adequate for the family to sit have sundowners on.  The activities for children were excellent, and our child learnt German as well!! There is a private beach area outside the hotel about 20m.   The stand out was the food which was outstanding throughout our stay.   Always extremely fresh and well presented.    Transport to Side was via local minibus and cost about a euro.  The minibus stop is only 50m behind the hotel.  In short, this was a wonderful stay and as it was all…", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g6536761-d1487044-r115678771", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "amazing!!!", "review": "just arrived back today and felt the need to write this. after looking at hotel after hotel on trip adviser i finally booked grand hotel art side for a 10day holiday for myself, husband and 4year old daughter.  we arrive early hours of the morning and when checking in were told we would be staying at the sister hotel down the street,, i wasnt sure about this but the guy assured  us that it was the better hotel, golf buggy arrived to take us down and he was right although a smaller hotel it was lovely and right on the beach. we had requested an early checked in with our tour operator but the hotel had no knowledge of this, we went for breakfast and when we came back they had a room for us that we used till 2pm when our room was ready ,, and at 2pm it was. the rooms are lovely,…", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g6536761-d1487044-r72988437", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Wonderful holiday", "review": "We make reservation for Adalya Resort and spa which offer Ultra-all inclusive package at  their hotel with Alltours which includes airport transfer to and from the airport.    We arrived late at night and was greeted by Mr. Abdullah the receptionist on duty that night.  Check in was fast and smoothly. we were given list of all the services included in the AI package.  There were a midnight soup at the Hiva restaurant with some cold salad for the late arrival.  The hotel is beautiful and small compares to hotel besides it which is Kamelya World.  It is good for people who like small group of crowd and more privacy. The hotel has it private beach and beach bar which served snacks and drink plus the fantastic fresh made crepe with sweet or savoury fillings made by Aisha and another…", "date": "March 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g6536761-d1487044-r60088990", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}]