[{"title": "Golf and relax", "review": "Room is ok, but kitchen has poor equipment.  No toaster, no kettle, no coffee maker only dated espresso maker.  There is Nothing to clean kitchen, you need to buy it. They dont do dishies so you have to buy all you need for that.   But It was nice quiet place.    The most dissapointed thing was Food in the clubhouse.  After playing 5 hours you need something decence to eat.  Food was so tiny and bad taste that it almost made me crying.", "date": "November 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r723464755", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "luxury apartments at reasonable prices", "review": "Great accomodation, pools, restaurants, grounds, staff and position. Need a hire car to explore and get provisions. Adjacent to 18 hole golf course. Interesting, international clientele. Lovely, well cared for gardens, Great for families.", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r719824218", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "No service", "review": "It’s dinnertime, no other customers, three camareros, but no service to clients. Unbelievable poor  service. Not friendly at all. This is suppose to be hotels restaurant and unluckily this is the only one in this area.  Maybe they can then choose, who to service.", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r718881466", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 1}, {"title": "Recent Coastal Golf Travel / BarV GS visit to El Plantio Golf Course", "review": "I would just like to thank David ( the Course Manager ) & his staff for all the effort they made to getting our group off on time, with having to wait on buggies returning they worked tirelessly to avoid a delay, secondly the group all commented upon the layout of the course and it excellent condition it was in a testament to the staffs hard work, we will look forward to this groups next visit...with hopefully a lot more to follow :-)", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r716719671", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Disappointing ", "review": "This was our second visit and sadly we were very disappointed. Unfortunately the place seems to have deteriorated since our last visit. Last year we advised that I am gluten free and was assured that there were many options, we tried it once and were offered a baked roll still in the wrapper and a chocolate cake, not really equivalent to everyone else’s options! It could do we a very good clean in the rooms and the sun beds were very dirty. We had a problem with a down pipe which we reported three times, no one attended the room to investigate, it was making such a loud noise after the rain that we had three nights of little sleep, when we raised this on departure we were told that booking.com would deal with it, when we showed the receptionist a picture of the dust in the room she offered us a refund of one nights stay immediately!  Very disappointed and will not be returning. …", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r711458631", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Good value option for a few days", "review": "Hotel was out of town but there is a bar and a few mini bar options in the fridge for arrival. I would suggest booking a high floor as our room was on the ground without much sun and smelt damp.  Pool area was clean and spacious and good food options in the bar. Order food with plenty of time as we did get forgotten a couple of times and service slow but worth the wait as food is good. Good self catering options although a few cheap things could do with replacing as looked grotty and could be done for less than £5", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r710987806", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "What a Gem! ", "review": "After looking for weeks for a hotel and ideal destination and price we stumbled across this beauty!   Not far from the town however we are so glad we got a hire car! GoldCar from the airport pre booked absolute perfection!   15 minute drive from the airport, plenty of parking we managed to get the spot outside our apartment most nights! (€4 per day for the underground parking) otherwise free! Hotel staff very good English very pleasant and helpful!   There is no kettle in the room so if you like a cup of tea bring a travel one or like us boil of the hob!   Both pools are large, very clean and well kept. Both pools have sectioned off areas for small children. Plentiful sun loungers at this time of the year!   Apartment was beautifully spacious, little dark in the rooms however…", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r707880704", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "One night stop", "review": "Absolutely blown away by this place, so clean, comfortable, spacious and modern apartments, every where was spotless and staff were so helpful. We were a group of 18 and they made sure one apartment was ready for us to use on our arrival.The service at the restaurant was excellent and the food was very good and reasonable. The children loved the pool. Would definitely stay here again", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r706539976", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Great appartments", "review": "Huge apartments, very comfortable and clean, 2 lovely pools and great view over the golf course. 10 minutes from Airport and 20 minutes from Alicante. No aeroplane noise despite proximity to the airport, it was in a very peaceful location.", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r705645282", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Bad service -bad hotel rules- badly cleaned", "review": "I was not happy with my stay with my family there, the room was cleaned poorly, nothing was cleaned really, just put a new blanked on the bad, the service at the restaurant on the hotel was really bad and took a lot of time just to order a coke. The rules at the swimmingpool was stupid and confusing, sometimes the staff just took the towels off the sunbed if you went away for a bit and put it in a box behind the desk, really confusing and bad rule, it did not happen everytime or to everybody, just sometimes to somebody, kind of confusing?", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r697439110", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Relaxation holiday.", "review": "What a fantastic hotel.  The accommodation itself is beautiful, clean, modern and very roomy.  Staff are so friendly and try so hard to make your stay as pleasant as possible.   The food at this hotel is amazing and to a very high quality, the sheff obviously knows what he’s doing and has a very good team around him. I was blown away allot of the night we were sereved dinner.  I would love to come back with the family instead of just my partner and play golf!  You must hire a car if staying in this resort, we paid 15 Euro’s for an under storey car park which kept the car cool. Worth it for the week. The hotel is close to the airport but a drive to anything else nearby. You would need a car for a trip to a grocery shop as the nearest is in Alicante. No shop at the hotel for…", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r696836478", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Hidden gem", "review": "Excellent Hard to fault anything close to airport and Alicante. Rooms very spacious,2 pools really nice all staff brilliant. Golf course nearby . You do need a car  if you want to get about. Taxi to Alicante 8mins 15 euro", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r694197038", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Lovely place but no amenities ", "review": "Beautiful resort! It is a bit of a ride in a taxi to Alicante so be prepared for around €20 each way.  Resort is nice and breakfast is well worth money.  Appartment was nice but were given no dishwashing tablets, coffee, tea, beach towels,soap etc... which is a bit annoying.   Apparently could also do with a paint and lots of marks on walls and beds.  Altogether a nice place and very helpful staff. Would come back!", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r693750275", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Mixed", "review": "The apartment was clean and had enough space,issue is that the on suite bathroom the door did not fully close with the toilet right behind it! Room 604 Parking under cover cost 4euro and was. Tight getting the car in The grounds were lovely and the pool are looked nice. Breakfast was included in the price and was alright although the    cooked food was not very warm. For me the biggest issue was the staff,went to the bar and ignored , asked if we could take the drinks back to the room and had to have plastic glasses and the waiter forgot the order,again went to bar and he had the order in his pocket!  Good location for airport as the guide says 10 minutes", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r687023319", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Great overnight stay!!", "review": "We picked this resort as it was close to the airport for an overnight stay and early flight home. We ended up at the golf course initially but were directed further down the road to the resort. We were allocated room 815 which was exactly what we wished for, sunny balcony, private and a nice view. We were amazed at the size of the apartment (two bed!!) all mod cons and really enjoyed our stay. We went for a meal at the restaurant and it was ok, but the menu was not to our liking, but it was a nice atmosphere around the pool and the service was fine. Minor improvements could be made but overall a really good resort, near to the airport, and very quiet apart from the occasional swish of a golf club!!", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r686189798", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely place ", "review": "Stayed here with my daughter for a three day mini break. Was lovely and the pools were good and great to have the childrens pool.  Restaurant food was lovely...burger especially! Should do child portions though!  Staff in restaurant and bar were nice and great with kids! Rooms clean and well equipped.   Will return ", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r685132803", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Such a lovely park, great swimmingpools", "review": "This hotel is situated in great nature. It is a setting where you can play golf, but also the rest of the park is great with beautiful flowers. They offer spacious appartments with a terrace. They all are but seconds away from a pool. Breakfast here is great and Staff is kind. Parking is free and easy near your appartment. It is a short drive to Alicante.", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r677896671", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Upgraded", "review": "Hi i stayed in this resort last night. On arrival we were allocated a ground floor apartment. There was a musty smell coming from dishwasher.My friend discovered a dirty frying pan in it. We returned to reception with said frying pan abd Ana staff member was horrified...She upgraded us to a penthouse apartment with pool views room number 522. Then a fruit basket and bottle of wine arrived. Very happy with service and wilk stay again.", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r677561835", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Scenic golf", "review": "First time here and we will be back! Well laid out and maintained course with good signage to help you get around. Some good challenging holes made for an enjoyable visit. Friendly staff at reception and the bar made us feel at home.", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r677545984", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Amazing", "review": "We have discovered El Plantio Golg Resort Hotel in   2013 and after we started in 2015 to went each summer till now   And again we will go in August also this year . Just to certify that we really appreciate this hôtel appartement that it become ouf second house! The team is smiling, welcoming, helpful. In five years we have only a problem last year because pool had a leak and needed to be fixed . The team offered to us breakfast for the rest of the stay . We live Alicante and especially this hotel", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r676904864", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Outstanding service", "review": "Very friendly and helpful staff, especially Francesca at reception. Clean, spacious and fabulous breakfast. A little hard to find as Google sends you the wrong way but keep going and its worth it! Great stay!", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r669377697", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Golf ", "review": "Was here with a group of friends. Nice hotel but the food was Ok. Close to the golf course still 800 metres to the club house. Friendly staff and good service. Apartments and gardens is nice and cleane. ", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r667676967", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Fantastic place ", "review": "We came on a Family holiday and we loved the place. Very spacious, huge rooms. Nice and decently clean. The Postiget beach is just a 10 minute drive (5 km) and the San Juan beach is a 20 minute drive. The apartment has all the utilities needed and a shopping centre (puerta de Alicante) is just 5 minutes away from the resort where you can find Carrefour and Mercadona to buy your groceries. The swimming pools are also great. Loved it and we'll most definitely come back. ", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r666942066", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Nice apartment hotel complex", "review": "The pros: - modern building complex, well kept - really spacious apartments (minimum is 2 bedrooms, full kitchen, living room, terrace) - surrounded by tropical gardens and a golf course - nice staff - two outside pools - close to the airport and the cities of Alicante and Elche  The cons: - forget about your preferences; hotel policy is obviously not taking anything in consideration (what we planned is what you get; if you ask, be prepared for the standard  reply that \"the hotel is fully booked\") - the soundproofing is totally absent: you will hear everything your neigbors are doing: talking, walking, sneezing, TV, you name it and you will \"enjoy\" it as well - the pools aren't heated, very few chairs  - the rooms are superficially cleaned (dust under the beds, crums left on the…", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r666867747", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice hotel disgusting food", "review": "We stayed here one night as it’s close to the airport. The hotel and rooms are nice enough but the food here is shocking, which is a problem when you’re in the middle of nowhere. The burger was inedible. Like a hockey puck with stale crumbly bread buns and dry as the vegetation in southern Spain. Potatoes were sent back as they were salty enough to kill a slug and the pasta was over cooked enough to eat with no teeth - or mouth. The risotto was over seasoned and covered in foam. Utter rubbish, even the waiter looked embarrassed. Shame as it’s a nice place and the staff are friendly. If you’re gonna stay here bring your own food or take a taxi into Alicante. It’s that bad.  ", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r657881052", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Spacious apartments, large pool, near airport", "review": "For those with a car, this is a great and convenient place for the airport and the city centre. We were upgraded to a 3 bed apartment. Lovely large pool but as visited in Feb couldn't use it.   I recommend that the management provides a cleaning kit per apartment as this is now standard in all apartments. Great that cleaning service is provided daily.  Very helpful and polite staff. I recommend it!", "date": "February 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r656353880", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "First class accommodation", "review": "Four of us stayed here for the first time & although we played the resort golf course, we based ourselves at the resort & played other courses in the surrounding area. We were quite surprised at the high standard of the accommodation. Our unit consisted of two bedrooms, one ensuite, lounge, dining room, well equipped kitchen & a laundry room. There are two swimming pools, a bar & restaurant & secure parking adjacent to the apartments. The resort is a 15 minute taxi ride from Alicante airport. The course clubhouse is about a 10 minute walk from the apartment. The food in the bar & restaurant is high quality & the service is efficient but pleasant & friendly. We are already planning a return trip with friends.", "date": "February 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r655075370", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Golf is decent, accommodation nice but food is appalling ", "review": "Ok so let’s start with the positives: the golf course is nice, and the accommodation is large and clean. Unfortunately it is massively let down by the food service. Breakfast is mediocre, and the breakfast staff is unhelpful. Crazily the actual apartment complex restaurant is closed during lunchtime and one cannot even get a drink. The dinner service is also distinctly underwhelming. Food is lacklustre and tasteless and altogether poor.   This is a real shame because the actual resort would have a lot going for it if it could step up the service. If you are prepared to travel into Alicante for food, it’s a great place to be, but unfortunately it’s a 20 minute drive to the nearest eatery, and it precludes having a drink with food.   Sadly this can’t really compete with the other…", "date": "February 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r653430477", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Very Nice Clean and trustworthy ", "review": "The apartment was great had everything we needed everything worked perfectly fine and all appliances and equipment was very clean  The restaurant was reasonably price and it was good food  We had a great view We took taxis into Alicante and worth the travel.  Would recommend this hotel ", "date": "January 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r653065129", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Lovely resort!", "review": "We stayed here at the end of January/beginning of February. The resort is a 10-15 minute taxi journey from the airport. I would say probably about 30 minutes away from the centre. The apartment was really spacious. It consisted of 3 double/twin rooms. One being an en suite. There’s kitchen facilities, cooker, oven etc. There’s also laundry room. The views from the balcony was nice. I would stay here again only if we end up playing golf as I prefer to stay in the city centre. We didn’t get the opportunity to do so this time.   Perfect location for golfers. ", "date": "January 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r652922742", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great value and location for touring the area", "review": "We booked a 5 night short January break and chose El Plantio as our base. Great apartment , spacious and clean.  Staff very helpful and accommodating.Easy parking near our room and a great location if you have your own car, as only 10 mins from airport and also the downtown  Alicante.(A really lovely city) Neither my wife of I are 'Golfers' but the course looked spectacular and well kept. On-site restaurant was undergoing  refurbishment, so couldn't comment on that as we self catered from nearby supermarkets 95 mins by car) for breakfast and some evenings when not eating out. Electrical equipment in room for self catering was good , but would benefit from a complimentary 'welcome pack' of dishwasher tablets, cloths and maybe salt, pepper and olive oil ! Not sure if  in busy…", "date": "January 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r647737555", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Not a savory experience with this hotel, unfortunately", "review": "Apartment seemed passably clean upon check in, although crumbs on kitchen counter and sticky coffee table were off putting. Nowhere is property listed as self catering, so when we heard it had a full kitchen, we expected at least the basics. There was a dirty cutting board (not stained, literally with old food on it) and an old immersion blender, but no kettle, coffee maker, wine opener, nor soap/sponge/towels- anything- to wash up with. Still, we only had a one night stay, and the beds seemed fresh (the only thing that I feel like was actually cleaned) so we brushed it off. The room was chilly (off season, heater took some time to warm space), so decided to take hot shower to warm up. Alas, no hot water, and the discovery of dirty hand towels, greasy mirror, makeup on floor,…", "date": "January 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r643876906", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Great Course medium difficulty", "review": "Very good inland course 15 minutes from Santa Pola Great restaurant in a nice setting my only negative is don't waste your money on the driving range very poor quality range balls Ralelatively flat can easily do with a Trolley worth a visit if you are on holiday on the coast only 5 minutes from Alicante airport easy to find", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r641398859", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Great place except", "review": "We have stayed many times and like this resort.   However, the WiFi internet is always terrible.   Tv reception is also always terrible.  The hotel itself is well presented and well maintained. Come on plantio get this technology fixed!", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r639640917", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Not the best place with a group of friends", "review": "Our room's was perfect but the city is far away. When we was coming to this apartment we came with 2 taxi, but when we wanna go to another place the receptionist call us 3 taxi and when she call them she tell them that we are going to the air port when we said that we need the 2 taxi and we are going to the city center. we would not say if we were talking in another language but spoken with them in Spanish and they did not understand what we wanted. so we are disappointed.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r630904097", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Outstanding facility; Really Hard to Find", "review": "El Plantio Golf Resort is an outstanding facility and excellent value even for one who doesn't play golf.  The rooms, suites really, were spacious and clean, the view of the pool and grounds was really nice, and the breakfast also was very good value.  Considering Europe prices, this was a really good deal.      The one downside is that it was REALLY difficult to find and doubly so after dark when our flight arrived.  Be sure you have extremely precise directions that take into account the various roundabouts and road number changes.  Even with a GPS in the car, it took us to the wrong place (to a small road next to one end of the golf course, far out of sight of the hotel facility itself), and the signage on the roads was inadequate.  I'm not sure we ever would have found it if…", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r628682468", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely rooms disappointing food", "review": "On arrival our 3 bed apartment for just the two of us was impressive. The rooms are large, modern and have a beautiful balcony which for the price we paid was brilliant. The hotel was quite quiet, always lots of sun-loungers available and the staff are generally helpful. There are two large pools, a kids play area and access to the golf course for those wanting to play. Now the not so goods, the food became a bit of a dreaded part of the day for us. Neither of us are fussy eaters but fried octopus, cured tuna soup and raw sardine salad were a few of the meals on offer with the half board package. Breakfast was nice but always cold - however with growling bellies after not eating much dinner we overlooked what would normally be unacceptable. The place is a little isolated and a…", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r620806766", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Initial problems but resolved professionally by manager", "review": "Beautiful location and nice open course (attached is a view from our balcony). We stayed as a family and the pool facilities were excellent.   We had our boiler breakdown (these things happen) during the day which meant no hot water and although the initial response from the staff was inadequate with a general lack of communication  (it was past 9pm before we could bathe the kids). The saving grace was manager mr Munoz’s response. He dealt with it professionally; showing empathy and accurately analysing how the issue could have been handled and provisions for the future.   Overall we would come again and found having a car was invaluable for visiting the surrounding areas. ", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r620641107", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Lovely but a few problems ", "review": "Absolutely beautiful hotel, we stayed in a 3 bedroom apartment for 2 of us but it was fantastic and cleaned without fail daily.  We found the restaurant pricey at €20 per person for breakfast so we preferred to eat out a lot and went to Alicante city daily which was beautiful and had a lot of restaurants catering for all taste buds.  It’s definitely a relaxing holiday unless you enjoy the golf side of things and staff aren’t the friendliest unfortunately however we would definitely return.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r618277133", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Just 1 night but will return ", "review": "This resort offers very spacious 3 bedroom apartments, with 2 clean bathrooms, a well equipped kitchen and large lounge/ dinning room area. Set into the extensive ground of the golf course, it is quite. It’s close to Alicante airport and makes a peaceful respite before the hectic bustle of the airport.  The apartment comes with a washer and dryer.  The restaurant offers a good selection of food on the lunch and dinner menus. We enjoyed Excellent salads, pizza and fries from the lunch menu all at very reasonable prices.  The restaurant overlooks the very large swimming pool and its staff are friendly and helpful.  ", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r617696673", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Disappointing ", "review": "Firstly, the pool and the pool area is brilliant. The receptionists and the staff are friendly  However  The food choice.. never really known anything like it. NOTHING at all for vegetarians. NOTHING. Then the choice of food is most odd. As you can see one night we had the choice between fish or duck. Quite unique options and not to everyone's taste. The food itself wasnt that bad, but not great either. On the last night I just went without.   The air con in our room did nothing but blow warm air. Night's were very sticky. The rooms are nice and dark though with the shutters. There were weird stains on the sofa that I wouldn't fancy knowing what they were.   One of the waiters called Jesus was ironically our saviour and tried to look after us, but sadly you can't polish a turd. ", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r616744877", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "It's OK.", "review": "Myself and my husband stayed here for a period in the August / September time.  There are some good and bad points about this place. I'll start with some bad...  I'm not sure that the staff know whether it's a hotel or apartments, the staff are some of the rudest people I've met and can be very unhelpful.  We asked for an extra pillow and we're told this was not possible...the hotel is virtually empty, so we went and bought some, as we found it quite hard to sleep with what was provided. The beds are quite hard and mattress protectors aren't used, there were some stains on the mattress which, I tried to forget whilst sleeping in the bed! A fire alarm had started going off during one of the nights, we had contacted reception and was told to take a walk up there to explain...OK…", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r616126244", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Fantastic Resort", "review": "My partner booked this hotel for four nights at the end of August. I wasn’t sure what to expect but the self serviced apartments are fantastic. They are so clean and spacious and the resort is only 4 miles from the airport and only a short drive from Alicante City. The swimming pools were so clean and really well maintained. There were always sun loungers available and the resort staff were absolutely brilliant. I will definitely be staying at El Plantio again. ", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r615070363", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nice apartment resort to stay", "review": "Very nice resort with fully equipped rooms. Beatiful resort area,looks like a very nice tropical park with fancy trees and shrubs. Very well manicured. Rooms are comfortable and nicely designed. Reasonable price at least in September when we stayed there for 4 days.would love to return", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r614284442", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "WONDERFUL HOTEL", "review": "What a great hotel close to airports shirt car ride to all amenities including beach shops and attractions staff behind bar and at reception were absolutely amazing so friendly so helpful and always greeted with a smile such wonderful views we ventured up the nearby mountainside of an evening to watch the sunset which was spectacular picturesque hotel with great facilities and clean rooms a must for all travellers to this area ", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r614258559", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Our second visit - unfortunately not quite as good as the first, but still good", "review": "We've just returned from a second visit to El Plantio.  Whilst this is still a very nice place to stay, this holiday wasn't quite as enjoyable second time round  Firstly - whilst we were on the upper floor of our two story apartments, we believe there was a sun terrace on the roof above our apartment.  This meant that every night and into the early hours, we were disturbed by the sound of furniture being dragged across the tiled floor.  We appreciate that the nature of tiled apartment means neighbouring noise cannot be helped, but it gets a bit tiresome when you are woken every night by the same noise.  The apartments equipment is somewhat limited to - you can borrow Kettles and toasters from reception, but tea towels, oven gloves and oven trays are non existant.  You can buy…", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r614070572", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Very nice and spacious place to relax", "review": "Apartments are very big and you can feel like at home not like in the hotel. Restaurant, golf course ,mini golf , kids playground are available. We had direct access to the lovely swimming pool from our terrace. Kids mini golf does require some improvement as it is nothing special. I would give a 5 stars if only golf course would be available for hotel guest. Unfortunately you have to pay and for me who never played before i couldn’t see a reason to pay for an hour or two to try the game unless you are a golf player who intend to play all 18 courses. Would definitely recommend El Plantio golf resort and will be back there on my next trip to Alicante. It takes around 10 min by car to the Alicante city center.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r613899331", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great apartments, but very isolated", "review": "Lovely large modern apartments on a very green area around alicante. We stayed for 4 nights, we had previously had a week in a villa in Javea and had a taxi to this resort. I thought that there would be a restaurant or a shop that was walkable - even if it was a mile or so away. Trust me you definitely need a car for this resort. We managed with one taxi trip into alicante and stocked up on food and drinks, like others have stated the taxi that takes you to alicante already had 8 euros on the meter and cost 20 in, the return journey was only 13 which is more manageable. The restaurant on site is reasonably priced but limited in choice, after 7pm it turns into a La carte which is very expensive for small portions. Drinks are quite reasonable.  Overall a good few days in the sun…", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r613859178", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "So beautiful & immaculate ", "review": "This is such an amazing resort. Staff are extremely kind, helpful and extremely good with children. Rooms were always left immaculate and cleaned everyday. Two big pools with plenty of loungers. Only a few slight fault - evening entertainment/back round music is a major missing issue. I understand that it is a relaxing resort but due to the distance from everything it would’ve added to the atmosphere. Otherwise an amazing resort in which I’ve been twice. ", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r613527695", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Poor service", "review": "Girl working in the reception poorly coordinated everything for us. Did not tell anything about the city and how to get there when we asked, then on the leaving day we booked taxi and she booked in on the other address that we told her, for the wrong address we had to pay more for the taxi.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r613417806", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Poor Welcome followed by Worst Service", "review": "We booked this resort after reading the excellent reviews on trip adviser. We received no information on arrival, Rooms not cleaned, followed by poor restaurant service. I have stayed at many Spanish hotels, and I rate this the Worst😟 ", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r611953499", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Stop over after a late night arrival", "review": "My family and I (2 young boys) stayed here for 1 night after a late arrival at ALC airport. There was plenty of room in our immaculate 2 bed apartment and it was really close to one of the pools. Breakfast was buffet style and there was plenty of choice for kids and adults. Eating next to the pool meant our boys were itching to get in though! We would definitely go back as all staff were friendly and efficient.", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r605420240", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Great place to relax with the family!", "review": "A perfect location- short distance from the airport and a five minute drive from the main town. Spacious and well equipped apartments. Two large swimming pools and a play area for the children.  We would definitely recommend this resort to other families.  We have two young children and they were entertained all day in the  pool area with other children.  We will be visiting this resort again soon!", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r605324045", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Nice hotel, calm and kids-friendly ", "review": "We booked this hotel as we wanted an apart-hotel close to a golf.  We liked it very much. It is close to Alicante and the swimming pool is great!  The only thing we missed is a decent coffee machine and an electrical cattle", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r602710293", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Green hotel, big apartments with big pools (in remote area)", "review": "This hotel is a green oasis in a remote area next to the airport. It's about 10 minutes from the airport. The gardens are very green and there are about 5-7 complexes with apartments. We had a family apartment which was clean and spacious and a big terrace with pool view. The hotel has a golf course so if you are golfer you will be on the court with your hotel.  If you are not a golfer it's a good place to extend your holiday for some days while next to the airport or as a stopover (it's next to the highway to the south of Spain). I think staying here for a week or more might be a little boring because there is not a lot to do in area. Alicante is about 15 minutes drive and there is a big shopping mall within 10 minutes drive.  The hotel has 3 big swimming pools with sun beds.…", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r601058907", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Great!", "review": "Well priced, modern, we'll equipped apartments. A choice of swimming pools and secure underground parking offered at a small cost ($4).   It is slightly isolated so a car is a must.   Very helpful reception staff.", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r597060097", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "A nice stay in june - off season", "review": "We had booked an apartment 134 m2, very nice. The only negative was that they only have a table for two at the terrasse, we were 4 travelling together. We asked for more chairs, but they could not help. Good helpful staff, nice service. A nice area with an excellent pool, it has to be the biggest pool I ever seen at a hotel. Almost 50 metres long. Good for families with kids. When you live here you need a car, then you are more mobile. We loved it, we could also book it again.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r595157664", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Disgusting lunch", "review": "Disgusting lunch menu, and the problem is there is no other place to eat out here.  White trash fast food lunch. I’m so sick of all these Spanish restaurants selling only nasty American fast food. And coming up with things like “it’s what they want” NO!!! It’s because almost every central restaurant is fast food. Probably to squeeze most money out of tourists.", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r594264246", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Nice apartment hotel", "review": "This is a nice quite apartment hotel close to the airport. The apartment was clean and very comfortable. The outdoor area is nice and the pool was good. There is not a lot to do other then golf bud that is the main purpose of the hotel and then it works lovely.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r590691659", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Nice break just outside Alicante not only for golfers", "review": "A little oasis of green at 5min from the Airport. Well located for visiting Alicante or Elche. Two beautiful swimming pools surrounded by nice garden. Fully equipped apartments/rooms. Perfect for a break and visit to Alicante.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r590477757", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Great hotel", "review": "Very nice hotel and golf course. The rooms are very spacious and fine. We stayed there and played golf for one week and the food was included. Very good food and good service. The breakfast is very good. I have been to this hotel three times and I am always very happy when I leave. If you like to go downtown to have dinner or to a bar you are only 10 minutes with a taxi.The rooms are very clean and the beds are very good. The resort is near the airport which is great. The garden is nice and clean, enough of chairs and benches for everyone to sunbathe.", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r590357297", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Great stay ", "review": "Booked as part of a flight and hotel package. Close to the airport, though fairly remote so a car will be recommended. The apartment - 3 bed - was spacious. The bedroom configuration was not as advertised however, we had two rooms with twins and one room with a double rather than one king, one queen and four single beds. The kitchen could be better well equipped with more pots and pans; we opted for self catering. There is an oven and microwave. No toaster nor kettle, we did ask for a kettle and this was brought. An ironing board but no iron! Our apartment had a sun terrace and we were happily not facing the pool directly which does attract noise. There is a TV thought endless channel hoping required to find the English speaking channel. It would be useful to have a channel list…", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r590159978", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Definitely recommend ", "review": "My friends and I stayed at the resort for two nights . We’ve got upgraded for 3 bed apartment which was very spacious ,clean with well equipped kitchen . Pool area was nice , breakfast good enough . People who work there are really nice and reception is very helpful. We had a chance to change our stay for late check out for a really good price of €35 only . You just can’t say anything bad about this place. Resort is very close from the airport and to get to town . I would recommend to have your own car if possible cause to get a cab every time you want to go out will cost you quite a bit of money.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r588900016", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Excellent", "review": "Just arrived home from a one week stay at El Plantio.   Could not fault the place at all, it was immaculate, rooms cleaned every day.  We stayed in a two bedroomed apartment which was very spacious.  Like other reviews, you definitely need a car as there is nowhere to walk to, and also the kitchen has all the appliances you need to self cater although there is no kettle - did not bother us we just used a pan to heat water for tea and coffee.  There is a bar and restaurant which was reasonably priced and the food good.   Staff were very friendly and helpful.  All in all a really nice place to stay if you don't mind driving everywhere.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r588250656", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Great for a couple of days", "review": "Stayed overnight as we decided to extend our stay in Alicante by a day. The rooms were big and good value for when we went. There’s a nice pool area and the restaurant and bar is  very decent too. We didn’t play golf, but I’m sure it’s very nice. Only issue is that it is quite remote so there is not much else to do. Very good for what we wanted, but I would think you wouldn’t want to stay much longer than a couple of nights. We have young kids and I’m sure they would have gotten bored if we’d stayed longer. ", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r586513770", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Apartment size is the only good thing about this hotel!", "review": "Apartments are spacious which is the major selling point here. However the rooms need a good, proper clean. We stayed in 401 on the ground floor. Just a small table and two chairs on balcony/ patio area, nothing to sunbathe. Didn’t spend much time on there as flys are everywhere due to the over grown bushes/ plants. Not enough utensils in the kitchen. slow drainage in shower and sinks. Sofa looks like it needs a good clean. Hated sitting it on it! People have obviously been sat on there after being on the beach/ pool and suncreams have stained it.  Quiet location however the rooms are paper thin so you can hear everything!!!!!!! Our last night we had a group of girls next door and we didn’t sleep at all.  No welcome pack/ info books in the rooms which is a shame. Nothing to show…", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r582943411", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Fabulous", "review": "Stayed a couple of nights there,fabulous roomy apartment,set in lovely gardens,with two great swimming pools,including children's ends in each pool.Nice breakfast,small bar,and the staff,in particular Ana on Reception could not have been more helpful.", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r581936770", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good for golf vacation", "review": "Really good place to stay at when golfing. Great golf course and nice staff. The apartment was nice with a great view over the golf course. The staff was very nice but the food during lunch and dinner could be so much better! El Plantio is very close to the airport and Alicante, max 5. min drive in a taxi.", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r579105170", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Golf vacation par excellent", "review": "Really good place to golf and the hotel is clean and tidy. The apartment was spacious but it lacked some kitchen equippments and the bed er slept in was á little worn out. But over all friendly staff. The golf course is moderatly difficult with a few memorably holes where nr 13, 14 and 17 comes to mind. ", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r578161687", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Average", "review": "The hotel grounds are pretty and the rooms are nice in appearance but there are several lacking factors that lower the grade of this hotel.  The lack of comfort of the sofa, the poor choice and quality of TV channels and the terrible WiFi let the plantio down.  I would suggest only staying if the rate was comparable to budget hotels but certainly not at the regular rates.", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r575750210", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good for a game of golf and near to Alicante Airport", "review": "Only stayed the one night as I was dropping someone off at Alicante Airport the following morning and we decided to have a game of golf the day before. The room was massive with 3 bedrooms, a large lounge and a decent sized Kitchen. We had an evening meal in the restaurant which was OK but somewhat expensive. The wi-fi was good and I paid a small fee to extend my stay until early afternoon. The only negative thing I can think of is that you need a car to get around. No bars or restaurants in the area. The resort is near Alicante Airport and therefore ideal if you have an early flight in the morning", "date": "December 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r571725263", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Good place to stop over before or after a flight", "review": "Spacious apartments on a golf course, near to the airport.  Outside sitting area and excellent breakfast. Washing machine and dryer so that you can do your washing before you leave for home.  Need more utensils and a kettle if you want to self cater. We always stay here as it is convenient and so relaxing", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r568448320", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good resort at reasonable price", "review": "Have been twice in the last few years. Facilities and apartment were excellent, marred only by a group of British young people in the next apartment partying until early morning. Security had to be called to shut them up but we got a huge basket of fruit from the management for the inconvenience. Apart from that it was very enjoyable", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r562751735", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Quiet Relaxing week", "review": "This is a superb place if you want a quiet relaxing short stay away from it all. It was perfect. Although there was only two of us we had the luxury of a three bed appapartment which was spotless and fully equipped (could have done with a sharp knife for chopping, but maybe this was health and safety issue). The resort itself is in beautiful grounds away from the hustle and bustle of Alicante but close enough to visit in a car (which we found a necessity) Two lovely pools", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r561848039", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Just short", "review": "Came on what could only.be described as a good price holiday for family.  Wifi offered was not really available stayed in room 721 and wifi was poor.  Shower head that did its own thing, toilet door that would not lock, bar not open during day (might be time of year) small things I know but if you want to be high end they need sorting.  Having said that the room was very large good quality and cleaning spot on.  Terrible neighbour's 712 you know who you are noisy horrible people. But that is not the hotel's fault.  It really is nice place. Needs a shop. Is quite close to Alicante Centre but you need a car.  It is a nice place just silly little things to make it spot on ", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r560699518", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Lovely apartments", "review": "Spacious 2 bed apartments close to the airport (15 Euro for airport taxi) About a 10 minute walk to the golf course - no shuttle Course was rather poor- both greens and fairways Club house nice with lovely food  Disappointed with the ‘restaurant’ at the apartment, we booked as half board. The facility was basic, limited seating and cold. The menu was very limited for a 7 day stay", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r557170576", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Bargain", "review": "Came for a cheap 5 day golf get away with 5 friends and were pleasantly surprised the apartments are spot on the golf course is lovely and not to expensive 10 minutes from the airport and 10 minutes from the town centre will definitely be returning", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r556601391", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Great Location. Excellent Apartment. Lovely Short Break", "review": "Just outside Alicante a large golf complex with excellent apartments. Very spacious 2 bedrooms and 2 bathrooms. Beds great and cleaned every day. Lovely large balconies and we over looked the golf course. Great view in mornings. On site restaurant but we did not use this. Lunch at the golf club down the road was lovely.You Do need a car to get about from here. Alicante is 10 mins drive away.The minor issues were no information or maps available on the complex and please put some Mugs in the kitchens for morning tea!! A dish cloth and tea towel would also be useful.", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r554899207", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Superb", "review": "Very well located hotel, approximate to airport and very close to Alicante city. Superb apartments worthy of many five star hotels.  Golf, swimming, walking and great shopping in nearby Alicante. Rooms were large and comfortable I could not fault El Plantio.", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r553654046", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Short break", "review": "Just returned from relaxing get away for a few days.  Solo trip so chose this resort and it certainly ticked the box for safety. But a little too safe if that is possible. It is completely remote.  However nice time had wandering the walking paths in the hillside opposite and round the golf course. Had lunch in the club house was lovely. The apartment I was in 116 was close to reception as I requested. Lovely apartment.  2 bedrooms 1 ensuite, bathroom with full size bath. Kitchen dining area lounge. Over looked the pool area.  Renovations and tree cutting was going on while I was there. Didn't bother me as they need to do it sometime and it's good they maintain.   I booked a taxi on findtransfer  website. Was expensive at €64 return. However the cars were elite and the drivers…", "date": "December 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r545901262", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Friendly staff", "review": "Easy to find in a car to and from the airport (just look at map first).Staff at reception and at the restaurant in the evening and morning were very helpful and friendly.  We paid €4 for underground parking, although we might have been lucky getting parking for free in the open air.  Light in underground car park does go off quickly thought, luckily I was able to find the light switch, so take a small torch! Our room 804 did not have any of the horror stories.  We had a lovely meal in the Irons and Woods.  House red €18, food €60 (3 starters, 3 mains 1 dessert).  Room price €107.  Lovely size terrace to watch the sunset. Only two garden chairs though, we took one of the dining chairs out.  Two bedrooms one double with en suite shower and one twin room and family shower room. Of…", "date": "November 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r539484139", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Golfholiday", "review": "Good for golfing, hotel acceptable, but missing a lot in the kitchen. In a apartment with 3 bedrooms only 2 chairs on the terrace. No waterboiler, most of the kitchen utensils missing or worn out. Breakfast in the restaurant good. Will probably not stay here again.", "date": "November 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r539434790", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Golf resort with appartments ..... worn down", "review": "This golf resort is located not far away from Alicante airport. Appartments are ok, clean and good size. The resort itself is somewhat worn down. Pools seem old. Restaurant lacks atmosphere, somewhat like an old school cantina. Golf course is good. ", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r538456050", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Excellent in everyway..", "review": "Second time here and this time we spent a few days. Weather was perfect and still warm enough for the kids to swim. Bar and food was plentiful and value for money... but what makes it is the apartment.  3 Bedrooms, full aircon, kitchen, dining room, lounge, 40\" tv... patio, sun roof, etc..etc.. all for under £100 per night...  The only complaint was that the wifi was flakey.. during the whole stay.. but was I there to be connected..??? NO..", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r536844005", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Short break", "review": "Excellent facilities and scenic surroundings with well maintained golf course and pools Staff very efficient and helpful and restaurant popular with residents Location handy for Alicante and beaches and area is real Spain in character rather than tourist Costa Blanca", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r536796729", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Lovely resort friendly staffs", "review": "Nice resort! Nice apartment, clean and spacious. Nice deco, tidy external facility. staffs are helpful and friendly. They provided so many service, there even a. Imputed to use in the hall. Only a little difficult to find. ", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r534945164", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Half hour walk to bus stop", "review": "If you don't want to drive, you can walk over a little hill by the resort (dirt road) and down a couple of roads to a bus stop. There are 2 buses that go to Alicante.  One of them comes from the airport so quite busy.   The walk is about 30 mins and the bus takes about 20 mins, but check the bus times in advance so you don't miss it. The tickets are around 2 euros for a single trip, or you can get a booklet of 10 tickets.  We couldn't find access to the beach on foot as there's a train track and dual carriageways in the way.  Excellent staff, some outstanding food (there's 2 menues). Lovely local Chardonay. Nice pool although the sun loungers are not adjustable. The resort would benefit from a shop onsite and a shuttle bus. The gym is 600 meters from the apartments and is very…", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r531394990", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "lovely place to stay", "review": "was lovely apartments and friendly staff. only downside is the food as a vegetarian I had some potatoes on the menu. the choice was cheap and limited for meat eaters too with an upgraded menu it would be a 5 star ", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r531012560", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "5* course with breath taking views! ", "review": "I played here last week with friends and we couldn't rate it highly enough. It's €60 a round with a buggy or an all day pass for €71 also with a buggy. The ground staff are constantly working hard and the course is in pristine condition. If in the area it is a must play course. The only negative is with the buggys you can't drive on the fairways so you do still have to do a fair bit of walking but it's well worth it! ", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r530004671", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Lovely relaxing apartments", "review": "Staying in 3 bed apartment which was excellent and overlooking full length of pool. If just looking for R&R this the place and a game of golf if that is your wish. ISSUE: On turning off from main road visual directions are poor. It is signposted apartments not Hotel or Resort (initially assumed they were different places!!) It is apartment signpost you need to follow otherwise you end up at clubhouse....at opposite side of golf courses! Reception is 3rd opening along on RHS again poorly signposted for 1st time visitors. Access to Alicante or Elche and to & from airport is good. Pools are quiet and little problem of sunbed hugging ie towels left for hours. Have rebooked for 4 days next week and coming back with our family later on for week.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r529811711", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Fantastic place!", "review": "Beautiful spacious 3 bed apartment. Clean and serviced daily. It is away from Alicante old town with a taxi approx 15 euros. Lovely food at restaurant on site! Pool is lovely.  We hired a car which meant we could go to the massive supermarket", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r529128691", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Poor Managment Made for a Frustrating and Short Stay", "review": "On our first night into the resort, we are unloading the vehicle and make our way into the staircase. Most other staircases in Madrid I had been had motion sensors to turn on the lights this one did not. While we are all tired and looking for the switch in of use its the first button we can find... turns out to be the fire alarm! there was no cover on the alarm it was just a button with red around it, which you can't see in the dark. Anyways, next morning the manager comes to the room and says we all have to leave within the hour because we are being kicked out because of our behavior the night prior. When we asked the management why they added to the story, that we had been peeing and puking out the windows. we asked for the evidence or the CC video footage and they had none.  …", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r528604954", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Impressive!", "review": "Staying at this hotel while in Alicante. It has lovely surroundings, friendly staff and food tasted great. Apartments are lovely and spacious. A small bit of advice is the half board menu does not change so  ensure to book all inclusive for full menu. Also a car is needed as the hotel is in a secluded, but beautiful, place. Would recommend this lovely hotel for sure! ", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r526388412", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Rent a car! ;)", "review": "The resort is beautiful with great views and a stunning golf course. We visited during school terms so it was very quiet here. Very peaceful!  Both pools are beautiful and the surrounding grounds are well maintained. There is one main restaurant with a bar and outside dining by the main pool. I believe there is a club house also at the 19th.   We did however have a couple of issues. Fortunately we had hired a car at the airport so we're able to enjoy other parts of Alicante. However, the resort is remote and is a 15/20 min drive to Alicante centre which is the nearest civilisation.   If you want a golf holiday you will be more than entertained but note that apart from the pools, golf and gym, there is no entertainment within miles. Perfect for some but we both have itchy feet.  …", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r526355426", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great manager, lovely place to stay", "review": "We've Just returned home after a lovely week in El Plantio. We are a family of 5 tho the kids are adults 24 & 21 We had a 3 bedroom apartment which was spotless & ideal for us. I agree with other reviews you definitely need a car & a little shop selling milk & bread etc would make a killing tho you can access everywhere within a 10min drive i.e.:Alicante, supermarkets & shopping outlets.  My main reason for writing this review is to give a special mention to the manager & his staff who were great, we had an incident whilst there and the manager was fabulous in helping us, I really cannot thank him or speak highly enough of him he is a great asset to the hotel.  I would recommend this hotel to anyone & I'm definitely hoping to return myself.", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r525233447", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Pleasant stay", "review": "I recently spent a short stay at El Plantio resort at short notice. We were looking for accommodation close to Alicante airport with facilities to entertain our friends who live 1.5 hours away after our plans needed to change. We had discussed our needs with the resort prior to travelling as one of our friends needed disabled facilities, when we arrived we had been allocated a ground floor apartment with full facilities. The apartment was superb with good kitchen facilities and lots of room, the patio was adjacent to the pool. The receptionist during our stay was Cecelia, this lady is a true asset to the firm she was friendly and nothing was too much trouble. We had a couple of minor issues during our stay which she dealt with immediately. On arrival we took a 10 min taxi ride…", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r524259698", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Will def return ", "review": "We had a really enjoyable stay at El Plantio in August 2017. The apartment (ground floor with a large patio) had everything we needed to stay with our two children. Two bathrooms, large bedrooms, well kitted out kitchen and utility room.  I requested a kettle before arrival which was delivered. The hotel is a short drive from Alicante so a car is a must, if only to go to the supermarket as there isn't as much as a shop on site. That said, we were more than aware of this and it actually worked in our favour as the hotel is quite quiet, no 'reserving sun beds' and over crowded pools. There are actually two pools - one with bar and restaurant where the food was lovely. The other was without bar/restaurant therefore quieter but clean and spacious. In the restaurant the food was…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r523226013", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "El Plantio Golf Resort hidden gem", "review": "With a small child we where trying to avoid the \"tower block\" hotels (fearing a high balcony) then we stumbled across this hidden gem El Plantio Golf Resort. The pictures looked nice and having a third floor max was ideal. The staff where very friendly (reserved us a ground floor) apartment which was very clean, modern, spacious, air conditioned throughout and well equipped with kitchen and laundry room (washing machine and dryer). Cheerful cleaning ladies came every day. Overall we rate the accommodation 9/10.  Excellent size family pool with large child shallow area - would benefit from obvious colour change on \"underwater\" wall between shallow and deep parts. The pool is cleaned every night, but could do with another skim over at mid day as some leaves and insects later on. …", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r519703385", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Pool", "review": "This used to be lovely. Now it's a bit tired as it hasn't changed decor wise in 4 years as far as I can see . Pool has the towel problem although signs everywhere!!  It is great to have a washing machine and tumble dryer  but it is along way out with not even a shop onsite to buy a paper! Definitely need a car.   I loved it last time as you didn't have to do the sun bed rush or go around huge inflatables in the pool. Will definitely. It return", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r510423930", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Nice apartment but wifi is very poor and breakfast is average.", "review": "If you are looking for a place to relax next to a gold course with 2 large pools they this will tick the boxes.   I had a business meeting and was check the place out for future business golf trips.   I need wifi to communicate and the wifi here was very poor and complaining about it just got excuses and there was no real effort to explain apart from being told, \"wifi is free so when you get it you do not have to pay for it\".   Umm, not great when you need it and can not get it.   In the past month I have staying in a lot of hotels and the wifi here was the worst.   Sort this out and you are onto a winner.   However, I will not be risking a business return.   Again, I stress this is me with business head on so please ignore me if all you want to do is crash out and ignore the…", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r507336787", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Extremely disappointed ", "review": "We went to meet up with friends who were visiting from England. We stayed on a room only basis, they were on half board.  We had a lovely spacious apartment, the complex is attractive and the pools are a good size. The staff were all extremely friendly, especially the waitresses at dinner.   However the apartment smelt of damp, the floor was wet when we entered so I slipped and fell straight away. The shower came on in the night scaring the life out of me and there was blood on a tap. The dishes in the cupboard were dirty.  The pool area had no umbrellas for shade, the surrounding area is all gritty and it ends up in the pool.  The food was terribly expensive and the quality didn't reflect the prices at all.  It's not a cheap place, at £100 a night we expected much, much more.  …", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r505100176", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "El Plantino golf resort", "review": "Just back from this resort, stayed there with my wife and 3 children. We were greeted by a very pleasant lady who spoke very good English, we had a late flight and didn't arrive until 11.30 pm but there wasn't any hassle. Our huge 3 bed apartment was ground floor block 4 right next to the larger of the two pools.  Good points on this resort, the apartments are very big with kitchen 3 beds great A.C, staff are all great and happy to help, two large pools, enough sun loungers as people come and go through the day, breakfast was continental very good, evening menu was good bar snack or A'lacart, laid back chilled type of place, families and couples only really, wouldn't come on a group holiday if you expect a lively place. Room cleaned everyday great underground car parking if…", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r504566180", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Highly recommended for an enjoyable stay", "review": "Staff are really helpful and respond very quickly to requests. Parking if spaces can be found is free, otherwise the more convenient covered garage is availabe for a small fee per night. It is a golf resort so it is just outside Alicante city, however the city centre is just a 10 miutes drive away. A car is must due to the location.  Unusual for this part of Spain is the free use of the room safe,  a bonus given that many other 4 star properties still charge to use a safe. The apartments offer great space and are very comfortable. The kitchen is well stocked with the basics such as pots, pans, dishes and even a dishwasher, if you wish to do some cooking but all other essentials such as washing up liquid you must bring yourself. Also washing machine and  dryer available in the…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r504373725", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Another great stay", "review": "After a wonderful visit last year my husband daughter and I stayed here again this year for 11 nights. We had requested the room that we had last year and were actually emailed back to say it could.not be guaranteed but they would do their best   Upon arriving we were unable to have the exact room we had last year however they placed us in a room in the same area and same layout we had like.   Fantastic breakfast selection with something for everyone. The orange juice was wonderful. Staff are very helpful. We had one small problem in our rooms and after reporting it to reception  it was fixed with half an hour.   Thanks so much for another memorable stay  ", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r498098865", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Excellent.. Worth a try", "review": "Stop over on a road trip. Fantastic for the money. Kids loved it. Fantastic apartments and facilities. A+ and would definitely return.   Easy to find, just off the motorway. Go shopping first though. Limited in that it's really a golf course. ", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r493011142", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Ideal for a short stay close to the airport", "review": "Used El Plantio twice now. Both times due to late arriving flights and it's proximity to the airport.   The 3 bed apartment is excellent, spacious and clean. Free wifi and a good breakfast. Wouldn't want to stay here longer though as there doesn't seem to be anything else nearby.   ", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r490701769", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Holiday review", "review": "Arrived earlier than 4pm check in time but we were checked in straight away the receptionists were very nice and welcoming.our apartment 612 was very nice and very good value for money .cleaned everyday and fresh towels .pools were  busy and clean only gripe difficult to get Sunbeds people put towels on them and think it's there's for the whole day this I believe is selfish and management should adress this. Apartments are looking a little tired and could do with a paint and refurb but overall it's a lovely quiet spot car is essential. Would recommend for couples ,families and anyone who wants peaceful break", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r490093166", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Very rude staff", "review": "My self and 11 of my freinds stayed at the resort we was straight away met with unhelpfull staff and made to feel like we was unwelcome there. I understood that we was a large group who was trying to enjoy ourselves but we was made to feel very unwelcome   i never will go again and i strongly recommend if your a large group of guys dont go. ", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r490065532", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Excellent resort and staff", "review": "I recently stayed at resort during kids break with family. The resort , the rooms , staff food ,everything was nice. This was one of my best holidays I have ever been. It was close to airport and city. Only thing they could do is offer some kind of vouchers for returning guests . As we will be using again same place in future.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r489916775", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Excellant overnight stay", "review": "Very impressed with everything, amazing pools and couldnt believe there were two. Pity about the menu though, very bad choice and no childrens menu, we had to ask waitress if they had various meals suitable for the children and they werent one bit helpful. Waitresses didnt bring menus to us when we sat down and came to take our order, we had only arrived so asked to see menu, waitress seemed annoyed. Reception staff very helpful and we got our apartment very quickly. Would definitely return as fabulous place and so relaxing. ", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r488267651", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Return visitor", "review": "Have visited this resort several times before due to its location and away from the tourist trap.  Have not used the golfing facilities so cannot comment. Have gone self catering as its so much easier.Ideal base to explore surrounding area. Will need a car to get around.  Taxi to the city  costs between 15-20 euros one way.  Rooms clean, spacious and tidy. Stayed in block 7 and got the sun on the balconies, but limited view of the golf course or surrounding area.  Will be returning.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r483583987", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good apartment and golf course but!", "review": "Stayed for 8 days to meet up with family. We booked bed and breakfast only, the others were on full board. The apartment was very spacious 2 bedrooms 2 bathrooms (1 en-suite) kitchen dining room etc. and could only be faulted by lack of kitchen utensils. No kettle, tea towel, washing up liquid etc. The balcony was large but unfortunately did not get any sun but if it did there was not enough furniture on it. So far so good, so would definitely recommend ! The gardens were well kept as was the Golf Course. Now we get onto the food and staff. The girls on reception fine. Breakfast staff fine. Breakfast acceptable if you like your bacon literaly swimming in fat so advise eat the cold food and fruit. Evening meal. Do not waste your money. The A la carte menu is very poor strange and…", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r480508851", "sub_review": {}, "travel_purpose": "", "rating": 2}, {"title": "Lovely mini getaway ", "review": "Just a quick review for this one. We booked a few days before departure date. We went for this hotel as it was close to the airport. With it being only a few days away, it was important our transfer to hotel was a short one!  This hotel is set in beautiful gardens, the check in was smooth and were met with friendly staff. The apartment was spacious and modern.  We ventured out to Alicante in taxi for a bite to eat and get sense of the local atmosphere. Highly recommended by us! ", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r480338737", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Nice self catering apartments", "review": "Our family stayed in this resort for 3 nights at the end of our holiday in Spain. The apartment was clean, spacious and comfortable. The pool was great although a bit cold in April however our kids enjoyed it for a short splash around. It also had a little play park which they enjoyed. Although we didn't use the golf course or restaurant they both looked great to. We chose to go into Alicante for dinner. We had a car so this wasn't a problem. The nearest beaches were around 15mins away and lovely. We chose the resort because of the good family room rate and distance from airport as we had an early morning departure. Overall it was a good experience.", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r475650981", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Excellent place to stay and very relaxing", "review": "El Plantio it takes a lot of beating if you want somewhere that is a really nice apartment with full kitchen and two bathrooms at a realistic price. Personally I don't play golf so that side has no appeal to me. The apartments are all very large but if you get one facing the golf course and you are on the top floor you have the advantage of a private patio and also an enormous roof terrace which is totally private - see photo. If you're not bothered about going out it's excellent place to hang out and relax.  The hotel has a bar and restaurant on-site but what it really needs is a poolside bar with a relaxing cabana / Beach side feel. I can't fault the place really but it just needs that little something to create a sort of relaxing hangout area and they certainly have the space…", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r472186706", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Perfect location for golfers", "review": "Under 10 minutes from the Alicante airport you'll find El Plantio. A 20 euro taxi take you to the resort where white apartments meet you. Very friendly staff takes care of you in the reception there you also find a restaurant with a nice view over the pool area. The rooms are large, nicely designed with all you need to live here for a while.  From the balcony we had a prefect view over the golfcourse.   Down by the clubhouse you'll find a restaurant, gym, large drivingrange and a par 3 course.  The golfcourse are elevated, not much rough, small greens with many nice views over the landscape.  I recommend El Plantio for any golfers!", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r468553959", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Still lovely", "review": "We stayed here before flying home from our holiday.  We've stayed before and loved it then and it's still great.  The apartments are amazing, large, comfortable, clean and smart. They don't have kettles.  Which is weird... boiling water in a pan for a morning coffee or tea.  But apart from that the rooms are great.  It's a way out of town so you definitely need a car here.  It has a bar and a restaurant.  Last time we were here we raved about the restaurant - it wasn't as good this time, but maybe I fell unlucky with the choice of lamb (not good) as my partner had cod, which looked (and was apparently) really good.  The facilities are amazing.  A great lengths pool and another pool, play parks for the children.  The pools are open when it's warm enough - so not now!! But are…", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r464197071", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Happy Memories of a Short Break", "review": "Excellent accommodation in a three bedroom apartment. Very spacious and well furnished to a high standard .The staff were very helpful , patient and kind  The surroundings are lovely with mature trees .The food at the restaurant is of a very high standard for grown -ups .A  shared portion of spaghetti bolognaise was willingly provided for the youngsters. The breakfast buffet was comprehensive . I would say a car is essential . Airport very close and 15mins to Alicante (A79 ) I would definitely stay here again.", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r462279215", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Don't go there with children", "review": "We just returned from El Plantio Golf Resort on the 18th Feb 2017. I went with my 8 year old daughter together with other friends/their kids. First of all, this resort was marketed by onthebeach as having a kids club, spa and other facilities for children. We found out this was not true. There was absolutely nothing to keep the children occupied. The pool was dirty and cold plus not heated so they couldn't even swim in it.  The closest shop is a taxi ride away and you don't pay less than 15-20 euros each way. The food was reasonable but it wasn't a buffet except breakfast and the same menu for the whole week. The apartments are well maintained and very clean. If you visit without children and not fussed about your meals then it is an ok resort. But DO NOT go there with kids as…", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r461563026", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Pleasant stay", "review": "Had a lovely stay at the el plantio golf resort, although we didnt stay for the golf we had a lovely walk around the course, our 2 bed apartment was clean and well equipped, like other advisors you do need to buy essentials such as dishwasher tab, clothes ect and with no local shops if you don't have a car your stuck! We also used the resturant which served al a carte menu after 7.30pm but before that was the snack menu we ate there twice and enjoyed all we had, the food is presented to a very high standard and full of flavours and best of all not expensive for hotel. The staff are very helpful & friendly. My only advice is to have a hire car", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r459741573", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "DO NOT GO UNTIL BOILERS STOP CO INSIDE APARTMENT!", "review": "I am sorry to say this, but as a registered gas engineer – I was flabbergasted to find that all of the boilers in this resort are illegal and leak poisonous gas into every apartment-it would appear to be that the contractors they used did not follow the manufacturers instructions or EU regulations.    I have notified all the authorities and the director of the resort is aware of the problem. You must not stay here until the problem is resolved otherwise death or illness could be imminent.   On another note – I inspected the rest of the apartment, and when you look at all the fittings and finish – there has been no snagging and there are gaps, dust, wonkey  fixings and general lackadaisical workmanship.", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r459131198", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 1}, {"title": "Great golf at a great price ", "review": "Dear Mrs. Seers,   As you can check. We do not answer the comments in this web, neither the positives nor the negatives. But in this affair, and following the instructions of the lawyer of the company, we understand that we must make an exception for the seriousness of your accusations. As we informed you by email, on Monday 13 February. Our hotels facilities comply with all regulations required by the law in Spain and were carried out by companies certified by the Ministry of Industry. We also sent you the Installation work document, of the apartment where you stayed, signed and stamped by an inspector, stating the following: “The distributor responsible for commissioning the installation certifies that the tests and checks indicated by the current regulations have been carried out, that the result of them is correct and that the installation is in service, so this document will constitute the certificate of pre-tests and commissioning of the installation.” The following Thursday of your stay and due to your calls, we received an inspection of Gas Natural Fenosa, the service provider. In this inspection the technician checked both the installation and the boiler of the apartment where you stayed, being correct in both cases. The inspector also took measurements of the filtered Co in the apartment with the boiler in use, the result of which is 0 parts per million. Therefore, the accusations made by you are false and may constitute a crime. We inform you that we reserve our right to initiate the relevant legal actions. Sincerely  Estimada Sra. Seers,  Tal y como podrá comprobar es norma de nuestro establecimiento no contestar a los comentarios de esta web, ni los positivos ni los negativos. Pero con su caso, y siguiendo las instrucciones del abogado de la empresa, entendemos que debemos hacer una excepción por la gravedad de sus acusaciones.  Como ya le informamos vía email, el pasado lunes 13 de febrero, las instalaciones de nuestro hotel cumplen con la normativa exigida en España y fueron efectuadas por empresas certificadas por el ministerio de Industria.  También se le envió el parte de instalación del apartamento donde se alojó, que viene firmado y sellado por un inspector, donde se indica lo siguiente: “El distribuidor responsable de la puesta en servicio de la instalación, certifica que han sido efectuadas las pruebas y comprobaciones indicadas por la reglamentación vigente, que el resultado de las mismas es correcto y que la instalación queda en disposición de servicio, por lo que este documento pasa a constituir el certificado de pruebas previas y puesta en servicio de la instalación”.  El jueves siguiente a su estancia con nosotros y debido a sus llamadas, recibimos una inspección de Gas Natural Fenosa, proveedor del servicio. En esta inspección el técnico comprobó tanto la instalación como el calentador del apartamento donde se alojó, siendo correcto en ambos casos. Dicho inspector también tomó medidas del Co filtrado dentro del apartamento estando el calentador en funcionamiento, siendo el resultado del mismo de 0 partes por millón.  Por tanto, las acusaciones que nos hace son falsas y pueden ser constitutivas de delito. Le informamos que nos reservamos el derecho a iniciar las acciones legales pertinentes.  Atentamente ", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r458690388", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Large apartment in remote location", "review": "We visited El Plantio as 2 couples, we flew Jet2 from on Leeds Bradford, then stayed 3 nights. The apartment  we booked had 3 double bedrooms it was clean, roomy, modern and well equipped. We had a bath room and the master had an ensuite. Good kitchen with enough cooking equipment for simple snacks, we didn't have a dish cloth washing up liquid , dish washer tabs or oven gloves which would have been very handy ! The resort is close to the airport but  a car is needed to get around as the resort has no shops for the essential food/ drink  items. The apartment has 2 TVs, fridge freezer, washer and dryer and lots of storage space . Our apartment faced the golf course which was lovely.  Great breakfast was included in our package. We had booked golf lessons with Andreas who was very…", "date": "January 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r453790969", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Lovely Apartment ", "review": "I stayed in winter so prices were very cheap. On my own but had a three bed apartment. Very spacious for a family, fully equipped kitchen. The A/C system was very good - I had to use it for heating (!) but it worked a treat. It's a remote site so not much for kids to explore but has two good pools. About 10 minutes drive to Alicante marina and 5 mins to the nearest large Carrefour. Close to Elche as well which is well worth a visit.", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r451327338", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "My birthday ", "review": "El plantio apartments were excellent in terms of space and very modern. The location requires a car. The food was very nice and restaurant staff very pleasant,particularly a nice waitress Maria. Our trip was out of season so the place was obviously very quiet.We enjoyed out time at el plantio. The apartment had a large rooftop terrace which would be excellent in warmer weather.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r444186638", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "BIG DISAPPOINTMENT", "review": "Although we can't fault this place (the quality is there and a very nice golf course nearby is a bonus) we were very upset while checking in because the receptionist refused to honor our voucher from the leading golf tour operator in England which clearly said that we had paid for our stay IN FULL!!! On the other hand we should consider ourselves lucky because our new payment with credit card was approved otherwise we would end up somewhere on the streets of Alicante!!! The worst part was that receptionist couldn't care less and kept on asking for a new payment in order to get a room (meaning that our voucher was good for nothing)!!! So dear guests, be warned and expect unexpected while choosing this hotel!!!", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r442830533", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Perfect holiday place", "review": "Love this place and have been there twice already .This hotel/ appartment complex has large spacious quiet appartments 2- 3 bedrooms. It has two pool areas with sun lounges. A very good breakfast buffet and snack and evening resaturant. Thre really usnt much around here except the golf course but Alicante and environs just 10- 15  min away by car. The apartments are very quiet and some have views of the el plantio golf course or the landscape around. Staff are very friendly and helpful as well.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r436727645", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "relaxing resort", "review": "This is a excellent resort if you want peace and tranquility,it will cost you about 15 euro to get a taxi into the centre of Alicante.We stayed in the self catering apartment which was very good,all you needed to make your stay very comfortable.It was overlooking the golf course which also was very good but the cost to play rent golf clubs which were of a poor quality,then to have to buy golf balls and tees left the course to expensive to play.It was worth the 45 euro green fee but it stops their.The restaurant food was excellent and well presented and the catering staff were helpful and friendly.The only problem I had with the resort was the fact they took advantage of the lowcost holidays situation,they  put the room up by 150 euro extra,they explained all this before we…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r431884871", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good Accommodation Close to Alicante Airport", "review": "A quiet well maintained resort with good facilities including two good swimming pools. Did not have a chance to try the golf course but looked in good condition. A particular benefit was the proximity to the airport about 10 minutes away.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r430989813", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Fabulous start to our holiday", "review": "We stayed here for two nights at the start of our holiday. We arrived at 9 pm, checked in quickly and were ordering dinner soon afterwards. It arrived in no time at all which was a pleasant surprise. The wating staff were great, especially Maria who gave us a big smile and made us feel very welcome. The pool was just the right temperature. We ordered a car through the hotel which saved us a lot of money on what they were charging at the airport. Would definitely go back. It was very relaxing being there. You do need a car though.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r427490385", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great Value and Excellent Accommodation", "review": "We stayed at El Plantio Golf Resort and had an excellent experience. The rooms are actually apartments, not traditional hotel rooms. Ours was a large 3-bedroom with a full kitchen and lovely terrace that overlooked the swimming pool. We found the front desk staff to always be helpful and friendly, as well as the restaurant staff. The food at the restaurant was excellent, and a good value too. Most importantly, I left my laptop computer in the hotel and did not realize that I had left it until 5 hours later when we arrived home. I called the resort and they said that they had recovered the computer and quickly posted it to me, extremely well-packaged (thanks Victoria!). We look forward to coming back next year, and would not hesitate for a moment to recommend this resort.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r425773330", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Good apartment but a pity about the pool", "review": "We loved the apartment it was functional, clean and luxurious with a walk in shower in the master on suite. There were two swimming pools and they were the reason why we stayed there. We had to tell reception several times that the pools needed cleaning, they were eventually clean but they should have realised themselves. It is a pity as otherwise we would have returned.", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r425423365", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Good resort, big apartments", "review": "Stayed last week in September. Apartments are big with 3 bedrooms, two baths, kitchen with oven, microwave,  fridge and freezer. Washer and dryer also in the apartment.  Very friendly staff. Drawbacks: No shop where you can buy stuff to the apartment like washing powder, drinks and other basic stuff. Pool are a little worn and sunbeds are damaged. No discount on golf fee even if you stay at the resort.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r424019481", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Dirty :( ", "review": "Stayed here last year & had a wonderfully clean apartment. Sadly this year had the complete opposite. Place was filthy like it had been locked up & left for 6 months full of cobwebs & dust.  Such a shame as the concept of El Plantio is super. I would suggest the cleaners need a few cleaning lessons!", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r423102352", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Another fabulous stay", "review": "My second time staying here.  Once again the staff were very welcoming, polite and friendly.  The resort is only 10 mins from the airport but you get very little noise from planes.  Also about 15 mins from \"downtown\" Alicante.  We hired a car and used the underground car park which is definitely worth it.  My only (slight) gripe is the fact that the lampshades in the bedroom that were dirty last year, were still dirty this year!  Otherwise, the apartment was very clean.  I think the walls could probably do with a lick of paint too.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r419715910", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Golf visit", "review": "El plantio apartments are large and functional but could do with a bit of sprucing up.  We stayed in 315 which was lovely and quiet but the balcony was sheltered from the sun and was stuck in the corner slightly so view was limited.  All rooms are supposedly overlooking the golf course but this one does not which was disappointing but it was so hot there weren't many golfers.  The restaurant is limiting in choice of food and could do with. Being expanded.  The hotel is a bit out of the way and it costs about 15€ each way to get into Alicante.  Would go there again", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r418915702", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "A lovely place - gold at the rainbow's end", "review": "We booked a one night stay here as we had an early departure from Alicante Airport and chose the resort as we could stay together in an apartment. It's about 5 miles from the airport so really convenient. HOWEVER, it took us 2 hours driving round, and round, getting lost, asking again and again for directions before we found it! Sat Nav was of no help. It's not signposted so that didn't help. I can only suggest printing off a large scale detailed map to use. It is in the middle of nowhere, so no useful landmarks or road names to assist.  The resort itself is lovely with fantastic apartments, well equipped and very comfortable. There's a large swimming pool and lovely lush gardens. We had an evening meal in the restaurant which is up market but expensive and with very small…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r418601328", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great golfing break", "review": "We have just returned from a lovely golfing holiday and stayed at this delightful, quiet resort. Being only 10 mins away from the airport you are on holiday almost immediately upon landing in Alicante. It is nowhere near the flight path and therefore extremely devoid of any airport activity. Our apartment was larger than expected and very clean however a kettle had to be requested but did arrive within a short while of our request. The staff were all very nice and helpful but I have to mention Maria who works in the restaurant overlooking the pool. She really went that extra mile for us and was always so gracious and utterly charming that we felt quite at home and at ease. She is a great asset to the resort.  The pools are a nice size and safe for non swimmers and children as…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r417559645", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Not for couples  - BAD LOCATION", "review": "We arrived in September 2016 to find this hotel is VERY far away from anything. Most of the reviews have stated to rent a car, which we are glad we did. There is nothing to walk to and everywhere around the hotel is prohibited (we assumed we could walk up the hills and mountains around). Taxi's are not cheap either.  The actual rooms are very nice, modern and clean and their are two pools and a restaurant. The pools aren't particularly clean (toilets/showers by the pools were extremely dirty) and a lot of the sundecks are broken (but when we went it was very empty so not too much of a problem). There was not much choice in food which is a little annoying when there are no bars/restaurants nearby.   Overall, if you are there to play golf then it is a good place to go- otherwise I…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r417449154", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good hotel for family and friends holiday ", "review": "Good and quite place.  Safe for family with kids near to Alicante airport. Good food and service . Room have a lot space , are clean . Had a lovely family holiday . Good service and nice atmosphere for single,groups and family ", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r414158639", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Another great Holiday", "review": "Just got back from our 2nd family holiday to El Plantio and it was as good as the first time, Lovely big clean apartments very relaxing and nice staff. Would recommend a visit to castle Santa Barbara. The food is great but could do with a bit more variety.  Would like to see some new sun beds on our next visit.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r412552240", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Relaxing,comfortable break away", "review": "Great holiday. lovely staff. great rooms.  Recommend putting mini bar price list in the fridge so people can be aware of the price of the items. Staff were very helpful when the fridge and freezer wasnt working. The cleaning staff were very polite and helpful. ", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r408602349", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Still no kettle!", "review": "Using this place as a stop off again before moving on.  Upon arrival the staff in reception were fantastic. We arrived very early and our room was not ready. We decided to drive into Alicante and they told us they would call our mobile when the room was ready. We requested an apartment with a roof terrace when we booked and where not disappointed! We are in a three bedroom apartment which is really big, stairs lead up to a roof terrace that gets the sun all day. There are lots of sun beds around the pool now which were not last year. Bar staff really friendly, prices of wine and beer really good. Bar menu food is good and prices are too. My only frustration getting to the apartment and having no kettle! Upon walking down to reception and asking for one, it arrived 10 minutes…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r406421491", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great place to stay", "review": "This is a great place to stay as a family, all the staff are great, food for lunch was always superb and freshly prepared.  We had a car as the location is out of the way, which we have a preference for.  Alicante is around 7 or 8 kilometres away, there is a smaller Spanish village closer called Torrellano around 3 to 4 kilometres away.  Really big clean apartments, also a pretty good golf course with some tricky holes, thumbs up", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r406089509", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Ok hotel", "review": "Second stay here for our holiday. Helpful and polite staff, nice price, two great pools, nice rooms with good a/c, washer&dryer included, golf course, really nice area with lots of greens, quiet area, nice beds.  What pulls score down,is the under par kitchen (please drop the fries, upgrade the menu), very remote location (rental car is a must!), horrible wifi connection,  gym room is located too far from the hotel, and is in terrible shape, few parking lots close to the apartments, tv channels are mainly spanish or dubbed. ", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r399333153", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "One night stay", "review": "Modern resort and apartments comfortable.  Resort was lacking in character but the pool was beautiful with grass areas around it and play area for the children.  No local amenities within walking distance.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r397899559", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Good value hotel near the airport", "review": "Nice apartments situated round each of the two pools.  Baby pool included within each of the main pools.  One has a play park for kids.   Nice restaurant right next to the pool.  A 10 min drive to Alicante where there are lots of shops, restaurants, a marina, karaoke and several supermarkets to stock your apartment.  The gym is basically a weights room with a static bike so little aerobic work although of course you can walk or run round the golf course paths.  Sunbeds need some attention.  There are no sun umbrellas although you can purchase one quite reasonably from the larger supermarkets.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r397194900", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Last minute treat", "review": "After finding our flight plans needed rearrangement, we booked a hotel close to the airport and stumbled upon El Plantio. Very friendly staff, nice pool and spacious apartments overlooking either the pool or the golf course. Apartment had a full kitchen fridge, cooker pots and pans, spanish tv, wifi, washer dryer etc. One thing we notcied it's worth buying the water from the main bar and not from the mini bar ! We were able to relax by the pool and forget our travel woes, overall decent place", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r396906124", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "3 night end of holiday stay", "review": "Quite unsure   Lovely great big apartment overlooking pool. Great breakfast.  As others have mentioned nowhere to dry your towels but they give you a washing machine and a tumble drier which must cost a fortune in electricity when they could give you a clothes horse to stick your stuff on ?? Seems daft anyway...  The staff work really hard and at times did feel as if they were understaffed. If they had a wee shop to buy essentials, they'd do well.  Lovely good choice of breakfast. Wasn't to keen on the food not much choice and way overpriced for drinks a gin €6.50 and the tonic €2, that's 5 star prices and no way is it that. Great big pool, but really manky didn't see anyone clean it and by the look of the bottom hadn't been done in a long time.  Won't return and wouldn't…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r396142864", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Loved it!", "review": "We were looking for a relaxing week for a family holiday - and we found it here! Just 10 min drive from Alicante Airport - but tucked away (no road or airport noise). When we arrived - we were shown the wrong apartment (2 bed rather than 3) but this was sorted out quickly.  The apartment we had was very spacious and comfortable. (I would say though that we were mostly self catering - and there were not enough pots, pans or utensils - so for a larger party it would have been very difficult to cater - however this is my one criticism).  We had lots of day trips planned - but didn't do any of them as the resort was so relaxing! The food in the restaurant was great. The golf was wonderful too. Wouldn't hesitate to go back.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r394765365", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great place for a family", "review": "Stayed with 2 kids 12 and 9 years old, good place to relax and to soak up the sun! Little bit far out of the centre of Alicante, but nice to avoid the crowds. The restaurant was very busy on the night we arrived (Sunday) so the wait for food and drinks was Long. The facilities are great and I would recommend for anybody with a young family visiting Alicante who is not looking for the pace of the city.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r392267458", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Perfect for families", "review": "We are a couple with two kids, 2 and 4 years old. The location is remote an quite, but still close to Alicante city and the airport. There are two pools, both perfect for kids as they are divided with one part with a depth of 60 cm. one pool has a strip of approx 50 meters wich maked It perfect for a morning or evening swim. Restaurant is good, not to fancy but does the job well. Breakfast buffet is standard with all the necessities. I do not play golf but used the course for jogging with a nice scenery and plenty of Tarmac paths. The gym is very basic and not well maintained but still does the job. All in all a perfect place if you're traveling with young kids and is looking for an active holiday. Recomend renting a car if you want to get around as taxied in this area is hard…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r391754347", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "A Bit Disgusting", "review": "The property has spacious rooms.  However they are clearly a bit tired.  More importantly, cleaning does not seem to be a top priority at this location.  We found a used baby bottle and all sorts of other trash in the pull out sofa.  When we mentioned this when checking out we received a perfunctory \"sorry\" without much feeling.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r391085085", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Excellent ", "review": "Absolutely top class apartment. Wonderful kitchen facilities,spacious and two great pools for both adults and kids. Food is possibly above average with good service. Golf course is top quality and challenging.The only down point of the holiday was the lady in the golf course was a little rude and unhelpful. I would highly recommend this hotel to anyone interested in travelling to Alicante..", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r389178485", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Terrific", "review": "Booked on line (Travel Republic, via Trivago) based on location and price. Would very happily come back any time. Great facilities, decent WiFi and great apartments. Highly recommended. 4 Euro charge for the underground car park seems a bit petty! Breakfast also very good but not cheap at 12Euros pp", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r388544211", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great place", "review": "We stayed in a lovely apartment. It was only 10min into Alicante by car and also 10 min drive to the Airport.  It is in the middle of nowhere but we were happy with this. The Apartment had all the amenities we needed other than a clotheshorse to hang our swimming towels and also some items we could not tumble dry. We stayed for 10 days and  were very happy", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r386688910", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Overnight stop", "review": "Stayed at his resort before and was not dissapointed this time either. Excellent location although a little difficult to find. Apartment was excellent and well maintained with all required amenities.Bedrooms were quiet and spotless.Staff friendly and helpful. Good breakfast. Will stay again", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r385247258", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent value, particularly for late flight arrival at Alicante airport", "review": "24 hour check in was the appeal as well as the amazing price of £48 for a two bedroomed, two bathroom apartment (2 person price) with kitchen, dining room and lounge area plus balcony overlooking the golf course. We didn't make the most of it because we arrived in the early hours and left mid morning but we enjoyed a good night's sleep (very quiet), a brief walk through the gardens and had a coffee by the pool which looked fine. Taxi was 18 euros at 1am, including a tip.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r384959503", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great Value for Money, but slight improvements required", "review": "Stayed for two nights, which cost £99 - absolute bargain considering! The room itself was perfectly adequate, with an apartment type setting. Good quality room, however noticed a few things that could have been improved.  Negatives:  - Shower wasn't brilliant (temperature fluctuated a lot)   - No hair dryer in the room (room service was poor, took 3 phone calls to get one)   Positives:  - Food was good (recommend the croquettes) - Views from our room (217) and size of the apartment - Close vicinity to the airport (10 min drive) but a little out of town (car required)  Would stay again if the price was the same, but i'd look to see if there was a better alternative first.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r384397663", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "5 nights in luxary", "review": "The hotel was more than we could have ever dreamed! We visited mid June and it was perfectly quiet. The 2 pools are huge and the sunbeams were comfy - although a few could do with being fixed as they were a bit wonky! The apartment was perfect, really modern and spacious and was cleaned/new towels every day. The food? Where to start! We paid hardly anything to upgrade to half board and gosh it was worth it! Breakfast was great with lots of fruit, cereal, bread, meats and pastries to choose from but dinner was out of this world! A starter, main course, dessert and glass of wine was included - with choices consisting of steak, duck, cod, cuttlefish and much more, Portions were huge and it tasted amazing - i couldn't fault the service either!   This resort is perfect for a little…", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r383800913", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Peaceful Gem, away from it all", "review": "We stayed here as a family of 2 adults and 3 children (2,6,9) in a very spacious 2 bedroom apartment. Please ignore any bad reviews about the kitchen equipment!! There are plenty of plates, bowls, glasses, pots, pans, even a blender!! A full size kettle, iron and hair dryer are available on request from reception at no extra cost. A full size fridge and freezer is great for all the lollies, (unfortunately, they didn't sell any at the bar/restaurant, they'd have made a fortune). The apartments are HUGE!! The biggest we've ever stayed in. Cleaned really well every day and towels changed too. The pool was a bit dirty with leaves when we arrived but this was rectified really quickly and it was kept very clean for the remainder of our stay.  The restaurant food was fantastic, we were…", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r380658435", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "A few nice holes but not as good as others in the area.", "review": "The course was in good condition but perhaps not as interesting a design as some of the others in the area. Quite a few dogleg holes which make club selection and course management important but overall I think there are more interesting courses. That said we had a good day the course was in good condition and the staff were friendly.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r377158723", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Absolutely fantastic ", "review": "Having checked out of the absolutely awful vivood hotel nr guadalese early we were looking for somewhere near Alicante  to stay and happened upon this great place. We got a huge three bedroom apparent for only 150 Euros for a night at the last minute. Apparent had everything you would need to live there for a longer term let. Has two great pools in beautifully landscaped gardens one of the pools is one of the longest I have seen in a hotel. Situated about 10 mins from the airport and surrounded by a golf course so very green unlike surrounding countryside. Very peaceful and tranquil spot. Has restaurants in main building and at the golf course club house which is very short drive - club house at this time of year only did lunch but main building open for dinner and breakfast as…", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r376650809", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Quite accomodation just outside Alicante", "review": "Spent a lovely few days here. Its a gof resort so alot of couples there to golf. We just wanted something quiter and away from all the hustle and bustle. Its 10 minutes drive outside Alicante central and only 10 minutes from the airport. We used taxis to get around.about €15 each time.suited us fine The apartments are great.spacious and modern.the kitchen looks to have all you would need to make meals but we ate out every night. The breakfast buffet is huge and plenty to choose from. The pools (theres 2) arent the nicest ive seen.but perfect for cooling off none the less. Staff at the hotel are very accomodating and friendly. Theres wifi available in all the apartments also. The t.v channels were all in spanish but after a while messing with the remote i managed to change the…", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r374896094", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Amazing apartments. I love it", "review": "Huge apartment with all amenities for 90 euros. Room for up to 6 people for that price. Near the airport and on a golf. Love the atmosphere with the pools. The restaurant is really good too. The tapas are really tasty.  ", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r372641015", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Brilliabt", "review": "This place is a great find (once we found it after google maps sent us on a MASSIVE detour..).  The room was amazing, huge and well appointed, roof terrace and lovely balcony.  The food in the restaurant was really good.  You'll note my love (or otherwise) of food from my previous reviews... This place was brilliant... The desserts were not as good as the mains but the mains were just amazing (reminded us of Masterchef food). Breakfast was good too, the pool was too nippy for us but I think it just takes a few more days sun and it would be perfect...  Go!  We'll be back!", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r372580877", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Nice Hotel with appartment rooms, a tiny bit tired in places, but great value for money.", "review": "Overall the hotel was great value for money. The apartment was huge, having separate rooms and a living space is much nicer than just a room. Overall, pretty clean and tidy.  The room could have done with a bit more of a clean in a few places, and a few bits are looking a bit tatty around the place. There were plenty of facilities, but it lacked much cutlery if you wanted to cater for more than a couple of people. Would have been nice to have Washing up liquid and a cloth rather than having to find a supermarket and buy them but it's not the end of the world. Take a teatowel if you want to dry dishes. Take a beach towel if you want one for the pool. We asked Reception for a kettle and this was supplied without hassle The TV's did need re-tuning, but only took a minute.  Mainly…", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r372345051", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "If you want only to play golf and nothing else", "review": "There were 6 of us staying here one night to catch a flight from the nearby airport in the morning. At a glance the apartment we had (three bedrooms, two bathrooms, living room, kitchen) was really nice but getting a closer look revealed a lot of unpleasant things. Towels felt moist as if not dried properly. Or maybe they had been dried but taken here they've gathered moist from the air. Just thinking because nothing seemed to dry here and after showering there was a large pool of water right on the floor in our bedroom. It came under the bathroom wall... not even the door area but I really mean under the wall. And if all that water at all times never dries up properly... I don't want to think all the moulds growing up here...   Kitchen also looked nice but quick look around and…", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r367941087", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Oasis", "review": "Stayed here for one night to catch an early flight. Good option, less than 15’ to the airport. But, I it also was a test for a longer stay. And although the resort is fine, the apartments very nice and the atmosphere relaxing, I will not take a holiday here. The main reason is that the larger area is rather depressing, a crossroad of highways and industrial sites. Downtown Alicante is about 20’ by car, and here a second reason I will not be coming back …never seen anything more utterly ugly than this stroke of coastline.", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r366304789", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Winter Break", "review": "Excellent apartment clean and well equipped, even had a built in dishwasher full oven and electric hob. No kettle strangely so we boiled water in a saucepan. Wonderful location on site overlooking the huge pool.", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r358959377", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Could be so much better", "review": "We spent a week in a two-bed apartment at El Plantio. The place is pretty isolated and you even need a car to get from the apartment complex to the golf course. The apartments are large and well appointed, although the kitchen is missing such obvious equipment as a kettle, toaster or coffee maker. The main problem is that the apartments have tiled floors and have poor sound insulation, so they are really noisy. The restaurant and bar are both in one fairly small room and are only open until midday and then again in the evening from 18.30. If you want anything to eat or drink outside these times then you have to go to the golf club, which as I already mentioned means a car ride. The café there is only open until 16.30, so there is a two hour window when you can't get anything.…", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r356805237", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "GOLF BREAK IN THE SUN", "review": "Stayed at the El Plantio apartments for a 5 day golf break in early march..Golf course was a good test for all levels with water on many holes close to airport so taxi is fine .walk way from apartments to pro shop and can leave clubs in secure area if you do not want to keep them in room .club house was good ,especially the pizza with prices fair.apartments were lovely,clean ,comfortable and very spacious.had dinner in restaurant every night with good food and wine.staff very good,friendly and happy. would recommened to any golfer wishing for a game of golf in the sun where you get a nice bit of roll on your ball compared to the wet winter fairways  of the uk.", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r354949157", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Good and value for money", "review": "We stayed in a first floor apartment which I would recommend for balcony views over pool etc. The apartment itself was very comfortable and surprisingly large. The staff were very helpful and friendly creating a pleasant atmosphere. The breakfast room does not open until 0730 hours though so if you want breakfast before your round of golf make sure your tee time is no sooner than 0830 hours. The golf course itself is great fun,, some interesting holes and in good condition when we visited in early March. The clubhouse bar serves reasonably priced food which is of a decent standard. Will I be going back?? Most definitely 😊 oh and if you don't plan to travel and are just going for Golf get a taxi from the airport, it's a 10 minute ride. Enjoy, we did.", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r354925745", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Excellent value for money", "review": "We visit El Plantio once a year. Friendly staff and spacious (huge) clean apartments. Quiet location with nice pool and playground for the kids. Breakfast has significantly improved over the past years. Excellent freshness and choice. Close to the airport but you'll need a rental car to get around.", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r354152327", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Lovely hotel and apartments", "review": "Really good quality apartments for a family holiday. The apartment and complex was of a high quality standard.   Pools were lovely and it was never too busy. The restaurant was great for lunches dinner and even takeaway items.  You will need a car as the hotel is not central. We would use the complex again and would recommend to our family and friends. ", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r353658147", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good location for airport", "review": "Went twice recently. Both times for one night stop overs on airport journeys. The first time. The evening meal was really good. The apartment was clean & tidy. Only niggle was door to ensuite didn't shut fully. Second time. The meal was poor. Because the dining room was catering for two large parties, an outside wooden table was put into dining room for us. 4 soiled placemats were put on this table. (We didn't merit a table cloth, like another couple similarly placed on an outside table). Service was slow, but not enough staff to cater for two large parties, and ordinary diners. Again the door to the ensuite wouldn't shut properly, and seemed awkward on it's runners.", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r353053609", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Emergency stopover was a delight! ", "review": "So we had a last minute change of plan at the airport and needed a hotel last minute that was close.  Following a quick online search we found El Plantio. It was cheap (€86 for a 2 bed apartment) and less than 5 mins away from the airport and thus ticked both boxes.  It turned out to be a little gem - even for us non golfers! Our apartment was superb - a real little home from home with a large balcony and pool views.   We ate in the restaurant which was okay however the service was slow (one poor girl left to cover every single table). The bar menu reasonable the a la Carte expensive.  Staff were excellent and if golf is your thing then I'm sure you'd have a roaring time here. ", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r352527673", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Large apartment next to golf course", "review": "El plantio golf resort apartment hotel is near the airport and a shopping mall ( Puerto de Alicante). But its preferable to have your own car. Which by the way is inexpensive in Spain. By car it takes 7 minutes to nearest mall and Mercadona supermarket. The mall includes a large Carrefour. We got an apartment in building 7 next to the golf course. Very nice views to the golf course. But ask for your type of apartment / view. Most buildings are facing south, while some, like building 7, face west. With direct sunshine from about 1 pm. If you want as much sunshine as possible ask for southfacing apartment.   The apartments are cleaned professionally every single day !  And you can buy a cleaning kit for just 3 Euros. With all the detergents you need plus more.   We ate only 1 time…", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r351538459", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Wonderful Golf Holiday.", "review": "Just returned from a one week golf holidays in Alicante. Its much cheaper to book with breakfast included, otherwise its really cheap to make your own breakfast as the apartment have all the required utensils in the kitchen. The apartment really feels like home with all the necessary facilities. Rooms were cleaned everyday. Breakfast was ok. The hotel receptionists were very helpful and pleasant especially thanks to Jessica, Victoria and Aillin. Golf course was really beautiful and breathtaking except for the unfriendly receptionist there.  LOOKS LIKE THEY ARE NOT HAPPY TO ATTEND TO CUSTOMERS :( Rented a car and was very convenient to drive around.", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r349711624", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Spacious well maintained apartments!", "review": "Wonderful apartments located between Alicante Airport and Alicante. Stayed for three nights with family. Booked second apartment for my parents. Staff were wonderful. Facilitated us in locating both apartments close together. Lovely grounds. Car vital as no bus service to the hotel. Would go back. ", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r348623047", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Good base for a golfing vcation", "review": "The resort is located between the airport and center of Alicante. The three of us had a big apartment with three bedrooms, two bathrooms, living room, dining room, kitchen and balcony. We even had a private roof terrace. The apartment had everything we needed. They have also added free WiFi in all the apartments, so you no longer have to go to the reception. There is plenty of parking around the apartment buildings if you have a car. The entire resort was very quiet during our stay: no noisy neighbors or wild parties or screaming children. Breakfast was included and was a bit more than OK with warm dishes (eggs, bacon, beans, potatoes), cheese, ham, various types of bread, fruits, cereals, cakes and pancakes.  Downsides: dinner in the restaurant was very medicore. If you want to…", "date": "January 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r344304622", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Ideal", "review": "The apartment was perfect for a short weekend break. Very spacious and clean and nice balcony. Beds were comfortable and it was very quiet at night so easy to sleep. You definitely need a car if you stay here as nothing around to walk too.", "date": "January 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r343637377", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Very nice ", "review": "This hotel have very nice appartments with big balkonys. Very well designed rooms with full kitchen. The golf couse is really good and the location of the hotel give you fast axcess to the other golfcouses in the area. A rental car is needed if you want to go to beach ( 7min) ,town (10min), airport (10 min)", "date": "January 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r343213588", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "El plantío golf restaurante", "review": "Four of us ordered the Hamburguesa Cerdo in the Club house restaurant after the round of golf. Our surprise was unison as we watched a small slice of meat and a few chips 🍟 on the plate before us. We complained about paying 9.5 euros fir something so utterly cheap in presentation and substance, but to no avail.  The waiter said he was only the waiter and told us to write a complaint which we did.", "date": "January 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r337995079", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Very difficult for anyone disabled", "review": "El Plantio is a very nice place to stay - near the airport so ideal for a morning flight, lovely surroundings, good restaurant, pleasant staff. But this time I stayed with a disabled friend and we got one of the apartments adapted for a disabled person with what looked like fine disabled friendly bathrooms. It turned into a nightmare as the bathrooms flooded the apartment when the shower was on and rendered the whole area a slippery, dangerous environment for both of us. Some serious rethinking needs as to design and safety of these bathrooms. We would have been better off just taking an ordinary apartment with a walkin shower. Actually it was so bad it ruined what otherwise would have been a perfect stay.", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r335155794", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Spacious apartment but car needed and lots of frustration elements", "review": "Located far from town and a car is an absolute must if you stay at this resort. You stay in the middle of nowhere, quiet and extremely dark at night. Professional pictures from management are photoshopped.  Apartment is older and more worn out. It is spacious, but cleaning is not good enough. Many of us got allergic reaction from the aircondition/heating.  Kitchen is modern, but lots of kitchenware were missing and causing frustration and slow cooking. The most frustrating was the hot water. Hot water was almost not functioning. The temperature was maximum 40 celsius. After complaining it got hotter, about 60 celsius, but then the pressure was extremely low and it water temperature was hoing up and down. At last our children didnt want to shower, because it could turn from hot…", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r334664969", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Luxury", "review": "The rooms and facilities in the rooms were superb.  Decoration was excellent.  The restaurant was good value and freshly cooked.  Unfortunately the hotel was a long way from anything and pretty isolated.  We used the hotel as we were flying off early the next morning.", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r329201010", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Inside and out of a 3 bed apartment ", "review": "4th time here . Love it each time we're here. No matter what time of year these apartments make you feel well relaxed and rested. I have written on each visit so won't write anymore here. Apart from good value for money. ", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r328133932", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely resort but....", "review": "Stayed for 1 night before flying out of airport early next morning - for what we wanted it was perfect. Arrived at 12 and got straight into our room with pool right outside.  Apartment was clean and quiet and well furnished.  We ate at the restaurant which was reasonably priced and the food was fine.  Would say that for a longer stay there is nothing to do anywhere near- we drove for 5 minutes just to find a petrol station.   You wouldn't be able to self cater - the kitchen was very poorly equipped - no kettle or toaster, only 1 bread knife and a few bits of cutlery, crockery. We only made sandwiches for lunch and just managed to do this. No dishwasher tablets, washing up liquid, dish cloths or tea towels so you can't even tidy up.  We would use again as and airport hotel as it…", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r326967256", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Disappointing", "review": "Very pleasant location but overall rather disappointing. Pre-ordered room with view and a kettle but received neither! Rooms OK but finished to a mediocre standard with attention to details missing. Towel rails loose, no basin plug, door jamming on floor,etc. Breakfast poor. Hot food(bacon,eggs,beans)inedibly cold-even restocked items arrived cold from kitchen! Jam and marmalade extremely poor, cheap quality items also inedible. Machine supplied coffee also very poor standard. Attitude of staff in golf pro shop not pleasant. Other staff very amenable. Great shame. Lovely location and potentially good resort spoiled by simple failings.", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r326567029", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "One of the best apartments I've stayed at ", "review": "The El Plantio resort was one of the most beautiful places I have stayed at. The apartment was spacious and modern. The terrace was large and overlooked the golf course. The surrounding views were delightful. The pool was large the facilities were great. The downside was (especially on the weekend) the golfers would come quite close to our apartment so you could hear the golf buggies etc. Sometimes you could hear the apartment above (we were on the ground floor). The resort is a little hard to find also.   Overall it was fantastic I'll never forget my stay here it was beautiful and I will definitely be staying again. ", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r326559212", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "ONE NIGHT ONLY", "review": "stayed at the el plantio golf resort for one night as we landed at Alicante very late at night !!!!!!!!!! staff were excellent and showed us to our room 6 berth promptly room was spotless with all mod con's. breakfast was plentiful and price very reasonable all in all recommended .", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r326046246", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Convenient for airport and Alicante, lovely surroundings but al a carte food pretty awful", "review": "Modern, spacious apartment with good size patio- only 2 chairs and no table! Not very easy to find resort but once you do it is well located. Dinner menu offered quite strange dishes and were poorly cooked, however Duty manager very responsive to our complaint . Wine very good . Pleasant but would agree with some other reviews that some issues need attention, particularly the quality of food.", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r325688503", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Holiday", "review": "Very pleasant location but overall rather disappointing. Pre-ordered room with view and a kettle but received neither! Rooms OK but finished to a pretty mediocre standard with attention to details missing. Towel rails loose, no basin plug, door jamming on floor-that kind of stuff. Breakfast poor. Hot food(bacon,eggs,etc)inedibly cold-even restocked items arrived cold from kitchen. Preserves(jam, marmalade)extremely poor, cheap quality items-again inedible. Machine supplied coffee also low standard. Attitude of staff in golf pro shop not pleasant. Other staff amenable though. Great shame, lovely location and potentially good resort spoiled by simple failings.", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r325286358", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Not ideal for couples", "review": "The resort is pleasant enough and a short drive from Alicante which has some very nice shops and restaurants at its centre.  Our apartment was really nice, maybe recently refurbished. Modern and comfortable with an ensuite for the master bedroom and a very nice new kitchen. Nice as the kitchen is ours lacked anything beyond basic cutlery, poor for a self catering apartment, we had to buy a lot of the kitchen basics that you would expect to be provided. Obviously dependant on time of year but be prepared to spend a fair amount of time dealing with mosquitos. The small blood spats on the walls and ceilings left behind by previous occupants evidence of their issues.  Part of our reason for choosing a golf resort was that as a couple we hoped it would be a more relaxing, adult,…", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r318036852", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Spacious, friendly and really quite laid back", "review": "We booked one night here, en route to our holiday destination.  Great apartment, very spacious with a balcony and access to a roof terrace.  Everything was squeaky clean and worked well.  The restaurant was good and not over-priced; the included buffet breakfast was a feast! We arrived somewhat tired and travel-weary and had some trouble finding our apartment, but we received the necessary help from the friendly receptionist. El Plantio is not the easiest place to find, but worth the effort for a very laid-back short stay outside the city.  Imagine that there's easy access from airport by taxi (though we drove).", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r316012927", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Big apartments, friendly staff, nice pool", "review": "It was a nice place, very good for kids. The apartments were huge and was good value for money. I cant say it was luxury but a good 3* hotel. Would recommend for families. Is slightly out of town so you would need a car. The staff were very friendly and helpful, Elena and Javier went out of their way to really help us and Jorge in the restaurant made our dinner very entertaining.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r315560730", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "You Decide", "review": "Whilst i cant really recommend these apartments I cant say they are too bad either. Spacious and clean they are although a bit tired looking, they could do with a refurb really. If your thinking that as the Apartments are on a golf course they will be peaceful Think again. Kids everywhere which for the life of me i couldnt understand as you are miles from anywhere and there are no kids clubs no activities for children. Why people with small children would want to go there i dont know. So there you have it an okish apartment surrounded by a Lush green golf Course with Two unheated swimmimg pools and lots of screaming kids.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r314060010", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Planning a return trip!", "review": "Just back from 10 nights at these apartments.  We were allocated a ground floor apartment with a HUGE terrace.  The kitchen was adequately stocked and we already knew to take a tea towel and kettle.  We also already knew to take our own beach towels as I had emailed ahead to find out.  I found it strange that apartments that can take four or even six people only have 2 chairs on the terrace/balcony.  All the reception staff and most of the waiting staff spoke very good English and were extremely helpful.  The staff whose English wasn't \"very good\" still had \"good\" English, so never a problem.  There was some reserving of sun beds which was annoying, but there simply aren't enough to go round.  We hardly sat around the pool but after a day out, it was nice to come back for a…", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r313803296", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Very pleasant stay", "review": "Could not fault the apartments very spacious, modern, cleaned every day, free wifi. The pools were lovely having lifeguards on duty and poolside bars a bonus. The restaurant served good food friendly waiters and good service. The only down side is that it is in the middle of know where so a car is definitely necessary.", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r311638473", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good but could be great....", "review": "Myself and 3 friends stayed in a 3 bed apartment in El Plantio earlier this month.  There are so many positives about El Plantio but a few things let down the overall experience.  First, the positives:  the apartment itself was large, well designed and spotlessly clean.  The first apartment we were allocated was on the ground floor and a little dark so when we asked to move to a higher floor, the reception staff were friendly and helpful and managed to get us moved.  All of the staff we dealt with were lovely - a special mention to Jorge in the restaurant who was very helpful about speaking to the chef about vegetarian options for one of our party and provided a fun, friendly service.  The breakfast was good - lots of choice including fresh fruit and freshly cooked items and it…", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r309239161", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Promised more than it delivered", "review": "I stayed at El Plantio for three nights with a small group of friends in one of the upstairs apartments. As other reviewers have said, it's convenient for the airport (about 10 mins, c.15 euros in a taxi), and again about 10 mins drive into Alicante, which is reflected in the price.  On the plus side: - the apartments were fairly clean, spacious and quiet (the metal shutters at night really helped to cut out the light). Ours had a nice balcony for sitting out.  - the two pools were nice, heated to a pleasant temperature  - the breakfast buffet was great, lots of fresh fruit, fresh juice and pastries etc. with a few cooked items and cold meat / cheese  - the reception staff were friendly and helpful  On the minus side: - not enough pool loungers! Which led to various pool-lounger…", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r308603837", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Great stay for a few chilled out days", "review": "Great 4 day stay at the resort, 10 min taxi ride from the Airport & 10-15 min taxi ride into Alicante . Apartments were amazing, very clean and spacious. Maid service everyday which was good. A few more kitchen utensils would have been good but we managed. Pools were nice but not kept very clean due to the grass surrounding them , there was a lot of this in the pool. Nearest Supermarket is around a 10 min taxi ride. The resort could do with a little onsite shop so that you can stock up on essentials. Husband and friends impressed with the golf course. Did not try the restaurant but friends in the group said the lunch time menu was good and better than the evening one. All in all this was a fab place to chill out and relax.", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r307208908", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Doesn't worth the money.", "review": "I was with my family (2kids 2adults)first impression was ok,but in the night we discover ants in our apartment(beds,table)and we have been bite by ants,we had a very noisy nights,the person who collects the kitchen rubbish came almost every night after 22.00,they make noise, spoke very loudly,we hear even music at 02.00 night,so no  sleeping well,customer service very poor,not to many choices from restaurant,and expensive,you can go in the town just with a taxi,who came already with €5- €6 on watch.The only good thing about this resort it's the swimming pool.", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r307016676", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Lovely rooms", "review": "On arrival (evening time) we found the reception was badly sign posted.  Reception staff were very polite and helpful.  4oclock check in I think is rather late even though full use of the facilities is available.  The rooms were lovely, clean and very spacious.  Unfortunately no kettle was in the room nor were there any dish cloths or tea towels.  An ironing board was provided yet no iron was.   I did think the glass on the balcony could have been cleaned.  Views of the golf course we're fabulous.  The hotel itself was out of the way, and I would definitely recommend hiring a car if staying here. We booked here knowing that we going to be out of the way - after all which golf course isn't !   Pools were lovely - yet could have been spruced up a little, chipped paint in the pool…", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r306336861", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great", "review": "Great hotel to stay. Great nice staff, poolarea and excellent rooms! Good place to stay at when you have had enough with Alicante! We stayed in Alicante at a hotel without a pool and that is tough in the heat. Closer to the airport but you need a rental if you want to go to Alicante. We didn't play golf but we loved it anyway!", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r305825108", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Nice hotel but isolated & the golf course was dreadful.", "review": "nice hotel with excellent apartments but the resort is isolated & a car is essential. The dining was good & the staff very friendly & helpful. The downsides were that we had to ask for kettle & hairdryer & there was a distinct lack of sun loungers by the pool & the majority of those there were faulty. We had booked to play the adjoining golf course. Firstly there was no transportation to the golf club house which was approximately 1 mile away. We had to carry our golf bags over 3 holes to get to the clubhouse. When we got there we informed that holes 10 to 18 were closed for essential work to be carried out. There was no reduction in our green fee the only compromise was that we weren't charged for our buggy. The 9 holes open were in a very poor condition with one green out of…", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r305743149", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Well worth a visit!!!", "review": "We stayed as a family (kids age 10 & 8) for two weeks in August!  It was definitely the best holiday we have had for a while.  Both pools were big and clean and had lifeguards. Sunbeds a were a bit sparse and annoyingly some people did the towel saving which was really annoying when they weren't even at the pool!  Our apartment was a 2 bedroom ground floor one which was very spacious and had a great view over the golf course and mountains. We didn't have any problem with wifi connection at all in fact on some days we were all using it!  We stayed on a b&b holiday which was very nice lots of choice and was refreshed frequently.  We had lunch a few times in the hotel and it was very tasty and the portion sizes were very big. The pictures below were the brownie and the carrot cake…", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r304712353", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Worth a visit", "review": "Stayed for one night as this place is near airport and we had early flight. Efficient check in wonderful apartment and amazing gourmet food well with a visit.  The apartment was fully equipped and sparkling clean  A wonderful place to stay", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r303791687", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great stay apart from lack of sun beds !!", "review": "Great place to stay off the beaten track. Villas very clean and loads of space, staff very friendly on arrival. Restaurant really good- plenty of choice for breakfast. Bar meals at lunch time great value with friendly service. My only big disappointment is that around both separate pools there are hardly any sun beds! Unless you get up at the crack of dawn and put a towel down you could find yourself literally lying on the grass around the pool! I really don't understand due to the size of the place and amount of villas why there are not more. As a family of four we only ever used two as we felt guilty so others could have some!", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r303685487", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Disappointing Overall !!", "review": "We were really looking forward to this hotel after reading all the reviews ! WRONG ! Where do I begin : ... Nice apartment with very minimal self catering equipment . The apartment was nice but very worn in areas of it , especially our ensuite . No kettle , toaster , dishes for oven , tea towels , cloths , very very minimal ! We went out and bought everything , You definitely need a car if staying there . There is no shop on site at all. We stayed in a two bed . My god the noise from the apartment above was unbearable at night . Every slight movement in rooms above and it was like it was in your own room . I was talking to another guest and she said same thing , if your not on top level it's horrendous with noise , She was woken up in middle of the night , thinking someone was…", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r300429287", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Lovely and quiet place- not only for golfing", "review": "Lovely and quiet place- not only for golfing  The flat is really big. We had a 3- bedroom flat for 1 (2) adult and 2 children. The bedrooms are spacious and the beds are lovely. The kitchen is nice, but not well equipped. But it does not matter so much- if you miss anything, the nice girls in the reception will bring you what you need.  Living room is with a larger TV and sofa area. Also there are a dining area.  The flat also had a washing machine and a tumble dryer.  Also there are a quite large terrace. We had a nice view to all the lovely plants and the swimmingpool. We had a quite wild- growing brugmansia right outside the terrace, which for us is exotic.  And the air condition was so good!  We had some problems with locking the terrace doors, but we just solved it with…", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r296209298", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great resort", "review": "We stayed here for a week in a 2 bedroom apartment. Very spacious and well kept. The kitchen was lovely but lacked what I would think we're basic requirements such as a kettle, toaster, and oven gloves. The apartment was big enough for 6 people yet the teapot was for 2 cups, cutlery was mismatched. The terrace was spacious but only 2 chairs were supplied so we had to use a dinning chair. During the busy season I suspect there would be a lack of sun beds and they really do need to put parasols up as the heat was very strong and this is dangerous. Several people brought small parasols from the hypermarket. We used the restaurant twice and found it to be good value. It was my sons birthday out there and I had arranged a cake for him. The waiters were very kind and made a fuss of…", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r294072534", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "I would love to come here again", "review": "Amazing hotel, perfect holiday. I went in September and it wasn't jam packed with people or noisy. The staff are helpful and the food is nice. Only slight down side is location, its very out of the way so you can end up spending a lot of money on taxis, its probably better to hire a car if you wish to explore.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r293246516", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "wow !!", "review": "Stayed here 1 night but wish we could have stayed longer ! We had a huge two bed two bathroom apartment, with a kitchen, lounge and balcony.  The pools are great for the children with different depths, for different capabilities.  Food for breakfast was lovely and lots of choice. Wish we could have stayed longer, we wil be back !!!! ", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r292513671", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Fab place to stay", "review": "Fell in love with this hotel. The apartments were spacious. We had a 2 bedroom  apartment for the 2 of us overlooking the golf course with magnificent views. Everyone in the hotel was fiendly. Even got invited for a dance with a wedding party that was going on at the same time as our stay! We didnt eat at the restaurant., so i cannot comment on their food. Instead we choose to go to the local Lldl for the basics and ate out most of the time.  A car is a must", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r292326521", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great place to stay", "review": "We stayed at this beautiful place for 3 days in July 2015. The appartment was spotlessly clean, the swimming pool(s) were absolutely brilliant and the buffet breakfast which we had booked in our deal had a lot of choice. I would definitely give this place 5 stars and will return again.", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r291849304", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Excellent stay", "review": "Stayed one night enroute from Alicante. Provided with 3 bed apartment; beautifully clean and modern with all mod cons. And great views over golf course. Hole 5. Staff very friendly and attentive and were able to check in at midday rather than wait until 4pm. Great meals from restaurant...salads and pizzas very good. Breakfast buffet had very wide choice. 2 great swimming pools although watch out for those who bag a sunbed before breakfast with their towels!!  Booked through Expedia and got a great deal. You ideally need a car as its a bit remote; about 30 mins from Alicante and Elche. Highly recommend it.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r290290221", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Delightful!", "review": "Fantastic, well equipped apartment at a lovely resort. We were there for a week and enjoyed every minute. The restaurant at the resort was great.  We explored the town of Alicante and the local area so feel that hiring a car was essential. Only slight niggle was the ridiculous use of towels to 'book' sun beds at the pool - meaning that for a large part of the day sun beds were lying unused!", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r288872855", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Great hotel and golf resort", "review": "Very modern and spacous rooms, we had a suite with 2 beds, kitchen, lounge and dining room. Staff helpful. Great room, once I worked our air-con controls. Used it as convent for Alicante airport, when we had early start, but many use as longer stay. 5/6 Apartment blocks with big pool and 2 restaurants and gym on site. Not within walking distance of anywhere. Rooms are at least 4 star", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r281910196", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent", "review": "I stayed here when visiting a friend that lives in Alicante. This was perfect as very close to the airport and not too far from Alicante.  The apartments were spacious and very clean. The staffers very helpful and always smiling. I wasn't too keen on the breakfast buffet but being self catering, this didn't matter.  The location is fantastic if you want peace and quiet. I have nothing bad to say. Will definitely visit again.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r281900441", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Very good value for money", "review": "The staff are very helpful and friendly we travelled in a group of 4 adult and had a lovely stay in the hotel for the second time. The breakfast was lovely with a great selection of hot and cold food. The man serving us breakfast alway had a smile on his face and made a effort to talk to everyone. And had great time for the children. The only draw back to the hotel is the location you would definitely need to hire a car.", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r281819543", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "golf holiday what a great place", "review": "absolutely fab accommodation spot on all facilities available apartment spacious and clean even had a washing machine and dryer staff friendly and helpful. food new caterers so food menu was extensive and of good standard close to alicante for days out and close to airport for transfers or car hire.  suggest a car needed as no nightlife .....2 pools apts overlook the course perrrfecrt for groups of golfers. will go back as golf 36 euros a round and buggy 20 euros cheap as chips course great for all handicappers as some challenging holes with water hazards if you want to take them on  highly reccomended apt hotel and the course brilliant holiday", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r281304822", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very comfortable establishment", "review": "Needed accommodation near to the airport for our last evening. We booked a 3 bed unit which met our expectations. The view from the lounge looked straight out onto wonderful gardens overlooking the golf course. There was a washing machine and tumble dryer in the utility room which meant the washing was all done before returning. The pool area was large surrounded by lawns.   The price paid included breakfast and this represented excellent value. You do need a car when visiting and its worth paying the 3 euros per day for the underground secure car park as you get direct access to your unit.  Air conditioning worked very well in the apartment and the furnishings were top quality.", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r278808670", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent for a relaxing week", "review": "My partner and I stayed at the hotel with 2 families. While the men played golf at surrounding courses the rest of us kicked back and chilled round the pool. There were plenty of sun beds available so no need for anyone to get up early and throw towels on them! The children in our party enjoyed endless hours in the pool and there is a playground if you have younger ones. It was very hot when we visited and there were no umbrellas so if shade was needed you have to go into the poolside bar - which wasn't too much of a difficulty! The apartment was amazing. Fully equipped modern kitchen, big bedrooms, a huge en suite and lovely lounge diner leading onto a big balcony overlooking a second pool was great. Our friends had a three bed apartment which came with a roof terrace! To be…", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r276113681", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Excellent for Families with Children", "review": "We recently stayed at El Plantio Golf Resort with our small children. The apartments and the apartments were simply fantastic. Our children loved the combined pool and play area.   The breakfast was quite adequate and right in from of the pool area to enjoy the view.  We already have our next reservation there. We highly recommend the stay there.   The only issue we had was a problem with the WiFi coverage in our apartment. Other than this the stay was absolutely fantastic.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r275276086", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Beautiful apartments ", "review": "Me and my partner visited this hotel back in August 2013 first impressions of this hotel was oh gosh it's in the middle of nowhere but we didn't let this put us off. The hotel receptionist was rude and unhelpful when we didn't know where our apartment was she just pointed and said over there. Anyway we didn't let this spoil our trip. So when we got inside of the apartment it was fabulous. We couldn't believe how big and great value for money this apartment was. It has every single thing you need for a self catering stay down to the smallest detail. The apartments where very clean they was  even a washing machine and tumble dryer. The pool side was very quite and nothing to do apart from read and relax which was not to our cup of tea so we went out most days which cost us an arm…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r274487542", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Recent stay here", "review": "We stayed here with another couple, in separate apartments.  Beautiful resort. Large clean apartment overlooking the golf course. Rooms cleaned daily to high standard. Apartments had laundry rooms with washer and separate drier. Kitchen had a dishwasher, large fridge with freezer. Basically a fully fitted kitchen with ALL equipment that you would need. We were there on a bed and breakfast basis. The breakfasts there were hot and plentiful. The two pools were very clean and well maintained. Bar service there was good also. WIFI worked everywhere but, the ground floor apartment where my friends were. We had a car which you need. Although taxis could be ordered at a cost. Would recommend and stay again.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r272594988", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "El Plantio - Nice apartment", "review": "Me and my husband stayed at El Plantio golf resort for one night. The apartment was very big and clean and service at the reception was also good. I can just complain about the wifi which did not work in our apartment, worked fine in the garden.The golf course is not the best but ok.               ", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r271516931", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Relaxing stay and good value for money out of season", "review": "I enjoyed staying in this resort, the staff was friendly and very helpful. The apartment we stayed in was overly spacious for the two of us as it could easily sleep a family of 4/6. The apartment had a lovely balcony overlooking the golf course, it was peaceful and it had most of the amenities in the kitchen. I would recommend that you would need a car to access the resort and to get around, the kitchen could do with a few added items such as a kettle, oven gloves, tea towel especially as it's a self catering apartment. All in all I would definitely go back in the warmer months and enjoy the pool!", "date": "February 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r271478195", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Relaxing Resort ", "review": "Stayed there 4 nights at end of April in the 3 bedrooms appartment , which was quiet spacious with good facilities such as complete kitchen, washer & dryer , dishwasher however furniture is aging., staff are friendly , swimming pool is nice. Belfast buffet needs improvement in terms of quality and variety  , if you don't eat pork cold cuts , you don't have many choices.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r270038284", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Great value for money", "review": "Very spacy apartment for very good price. Stuff very friendly. Breakfast was good but, sorry to say, the dinner was not (only restaurant nearby). Easy to reach the golfcourse.  Busstop to city center Alicante only 10 min.away.", "date": "February 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r257236326", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Good value for the appartment but food for dinner not good", "review": "We had a late flight into Alicante & this place seemed to be a sensible stop over the the night. Apartment was good & clean and we would return to that at teh Late rooms price. However, the food when we ordered dinner was not good. Maybe they wanted to go home as we were the only people there.  Breakfast the next day was good ad a different Team running the show so miles better.  Without a sat nav we had problems finding it", "date": "December 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r243875269", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Still great value for money", "review": "My fourth visit here. My friend sayd he wouldnt never dare to book apartment with this low price. Now he will:). Im sure ill be back next year. These roomy flats were again clean and tidy. Only negative thing was trouble with terrace door lock. golf course was under maintenance but playable anyway.", "date": "November 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r240953504", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "November 2014", "review": "Stayed here in November 2014 with 5 other male friends as part of a golfing holiday.  The apartment itself was fantastic. We had a 3 bedroom, which easily slept 6. It was huge and nearly brand new, with large lounge, dining and kitchen area. Wifi worked fine in our room. The two pools were nice, and the restaurant was good, although we only ate there for lunch.  As all the other reviews state, a car is a must if stopping here. Taxi to Benidorm costs about 75euros each way, and you can only have 3 passengers per taxi due to Spanish law! Alicante is nice, was a little quiet though. Taxi into Alicante cost around 15euros.  Great place to stay if your are playing golf, lots of courses near by and the accommodation itself is great.", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r240357125", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Nice family place", "review": "Nice, calm, spacious family place and good value for money hotel. Spacious rooms, equipped kitchen, washing maschine/dryer in the rental apartment. Very clean. The closest beach (Urbanova) is some 15 min. drive from the resort. The restaurant  at the resort  not really suitable for families as you wait for some 30 min and the choice is rather poor. The restaurant in the golf area is a bit better. (fortunately the kitchen was fully functional). Wi-fi available but very weak capacity...", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r236684175", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Terrible service", "review": "The hotel and the rooms deserves 6 stars, but im sorry to say that the two male waiters who worked in the restaurant and in the pub made the stay horrible. They both where rude when we tried to order food and drinks and used up to 35 minutes to serve drinks. We stayed There for 4 days, but will never visit them again i'm afraid. ", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r235396474", "sub_review": {}, "travel_purpose": "", "rating": 1}, {"title": "Amazing Apartments", "review": "Stayed here overnight and would have happily stayed longer. Was expecting a pokey, basic, old fashioned apartment. (I didn't book it and hadn't seen pictures before we arrived) and I couldn't have been more wrong. Really modern apartments with everything you could need. Ideal for a family holiday as the apartments are very spacious and there are play facilities for the children. Hope to go back for longer. ", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r231822296", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "good holiday", "review": "Stayed there for one week with family in early September.  We booked an apartment with two bedrooms. The apartment was spacious, it had a living-room with a sofa and armchair and there was a dining area as well for six people. The apartment was well-equipped (microwave, dishwasher, washing machine and dryer etc).   We did not try the restaurant at the golf course but the one at the reception area was good. What I really liked was that the beer was served in a chilled glass. The staff was nice.  We usually spent the morning at the pools and in the afternoon we drove to beaches nearby (Playa San Juan, Santa Pola).  Getting to Alicante by car takes around 10 mins.  Getting to the closest supermarket takes around 5 mins. Getting to the airport is around 10 mins.  Negative: poor wifi…", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r230177045", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Call it residence, not resort", "review": "It's not a real resort, the only restocafè was very bad, not a little shop even to by a cigarette. The apartment was good and large. Not so bad but not a resort. I have no idea about the golf club. Bye              ", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r229879485", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Lacked facilities and not our best holiday choice!", "review": "Before I go into the detail of our 10-day stay (which finished yesterday), two cautionary notes for others; Note 1) If like us, you decide to book a rental car in advance from the UK, do NOT take-out the extra damage wavier/vehicle excess insurance protection at the same time ... as your selected car rental company at Alicante Airport may not recognise or approve it and you are then faced with two options, a) leave them with a 600 Euro deposit to cover any potential damage or b) take-out their damage wavier insurance at extra cost.  No brainer ... took out their version at 90 Euros, so wasted £50 earlier back in the UK.  Not too worry!  Note 2) If like us, you punch in the resort's address into your SatNav, it will take you to the golf complex and NOT the hotel resort ... the…", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r229769589", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Excellent", "review": "Perfect hotel and room. You cannot go wrong. Only negatives are the bar shuts at 11ish and its a little out-of-town. Its about 15 euros for a cab into main alicante for anyone wondering. About the same cost to the airport.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r228093757", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Brilliant and will stay here again", "review": "We came here for a low key hen party, and received excellent treatment. The hotel is a taxi ride away from the airport and town but easy to get to.   We arrived early but we're allowed to go to one room it was HUGE with washing machine, utilitity outside area big living space perfect.  Food was lovely a bit more pricy than town but great quality.  The pool was fantastic sunbeds available!   Great value for money ", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r220335321", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Good Hotel", "review": "We stayed for a week. The apartment was nice and spacious and the appliances were all working and well maintained. It was also clean and always had hot water. The pools were clean but there was never enough loungers so there was a fight for them. The staff were very nice. The food was nice but was a bit expensive. It was a quite resort but the was no entrainment in the evening so it was a little to quite. The beds weren't very comfortable and there were no hangers in the wardrobe. A car is essential as it's a long walk to the bus stop. Overall Good value, not great value.", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r220231526", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Good Family Hotel", "review": "Stayed here for just one night due to easy access of Alicante airport for return home. Excellent modern apartments with good sized rooms and all mod cons. Only stayed one night and not sure we'd want to base ourselves there, not much around unless you're into golf. Great pool and we not too pricey on the food in the restaurant. Provided an excellent last night for us as a family of 4.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r219684129", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great value for little money", "review": "Perhaps it was because we stayed outside of the high season - but we could not believe how incredibly cheap this beautiful hotel was - for a very spacious, beautifully furnished apartment with a garden and a terrace, access to the nice pool, free parking in front of the house, a good breakfast buffet. Ideal for families with small or older children and of course for golf lovers (this I assume, as I don´t play golf, but the course looked nice, and the noise from mowing the lawn did not bother us at all).   You need a car though to get around and into the city of Alicante and to the beaches. And keep in mind that in Alicante parking is difficult, or at least not cheap (in comparison to NY of course it feels almost like free parking).   There is also wireless in the house. The big…", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r218277920", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Lovely spacious apartments", "review": "We only stayed at the resort for 24 hours but the apartments were very clean and spacious. The staff were all very friendly. The location is a bit off the beaten track so a car would be useful. The resort is only a 15 minute drive from Alicante airport.", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r215846509", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "A really relaxing place", "review": "We are currently staying at this property as I type.   The accommodation is amazing. We are in a 3bed apartment which is simply huge including 2 bathrooms and an amazing balcony. The kitchen is a full size one with dishwasher, hob, oven and microwave and all the cooking utensils you might need ( though we are here half board). There is a utility room with full size washer and tumble dryer.   There is a TV though no English channels  There is a full size lounge and dining room  There is WIFI- there was a problem with this on Friday evening as more people arrived but it is fine now as a technician addressed this problem  There are two large pools surrounded by grass and even though there are not many sun beds we have managed to get some no matter what time of the day we went down …", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r215113037", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Love it.", "review": "Currently here with my boyfriend and it's brilliant, admittedly there has been problems like our oven didn't work but within 2 mins of calling reception someone came to fix it and it was done in 10. What's given is very basic but as long as you know that before you come then it's not an issue like a tea towel. Wifi is horrendous but I wouldn't let that put you off here. Very clean, staff are very polite and helpful, swimming pools are amazing and definitely not brown so I guess they have been painted since others have visited. Definitely need a car saying that me and my boyfriend are getting taxi's and not a problem with the airport and supermarkets 10 minutes away. Perfect for small families and couples and golfers ;)", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r214585996", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Wish our one night stop could have been a week", "review": "Stopped here before travelling down to Mojacar and we were all extremely impressed by the lovely staff, accommodation and facilities. This will be a preferred destination for a quick weekend getaway from now on. It's only 10 mins from the airport and in the middle of nowhere. Lovely. Great little restaurant and delicious breakfast", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r211460077", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great apartment accommodation", "review": "Beautiful setting with golf course and no plane noise despite being 10 minutes from Alicante airport.  The rooms are two bed roomed apartments, very spacious, modern and well equipped.  Massive living room and large galley kitchen, master bedroom ensuite and second bedroom with adjoining bathroom. Large balcony with golf course views and massive pool with lovely gardens; there is a second pool but I didn't see it. I used it for an airport stopover but it would be ideal for families, especially with the kitchen facilities. A car essential as it is remote. If it was on the accommodation itself and pool area, I would give it top score but I have marked it down due to poor instructions to find the hotel, the restaurant and average customer service.  Like other people who reviewed…", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r211328339", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Exceeded expectations", "review": "We recently returned from a weeks’ stay at this resort during the busy school ½ term week.   I was extremely impressed with this resort.  I have visited the Costa Blanca on numerous occasions as have family living over here.  I have to say this place is a real gem, a lovely green oasis.  The resort is immaculately maintained and the staff are very friendly.  The accommodation is of a high standard and has daily maid service.  We had a top floor apartment with stunning views over the golf course. The room/apartment was huge, complete with AC, Wi-Fi and comprised of 2 large bedrooms with ample storage space.  The master bedroom was on-suite with a large shower.  There was also a large living room, separate dining room, galley style kitchen complete with full oven and 4 ring hop,…", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r210001086", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "We came back!!!", "review": "My husband and I returned to El Plantio in May.  We asked and were given the apartment we wanted and we could not have been happier.  We arrived on an early flight and asked if we could leave our baggage as our rental car was small and we would come back to check in at the proper time?  Our host Victoria immediately checked us in at midday so we could access our room.  Brilliant!!! It left us on a winner straight away.  Our apartment was of the usual standard for El Plantio, clean and welcoming.  The complex was quiet and perfect for a lazy, peaceful holiday.  Wifi in our room is a great bonus.  We stayed around the hotel a bit more this time and really enjoyed the pool area and had lunch on a couple of occasions.  The menu is small but the food is good and reasonably priced. …", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r209771937", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fabulous place", "review": "Myself,  husband and teenage son have just returned from a short holiday here and felt I must say how lovely it was. The apartments are lovely, stylish, roomy and very clean. The two swimming pools were gorgeous and  it was so peaceful with beautifully kept gardens and plants.We stayed there primarily for the golf  which my husband and son enjoyed a couple of times. There isn't a shop which is a bit of a shame and a little quiet on an evening but we caught the bus at the end of the road into Alicante which is very easy to do and easy to get a taxi back. The staff were very helpful. The breakfast which was included was very good although thought the food on the evening was expensive. I would definitely recommend it.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r208831122", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Lovely apartment not easy to find", "review": "This apartment is set on beautiful grounds near Alicante airport. Having said that we drove around for 2 hours trying to find it as it is not well sign posted and particularly hard to find in the dark. We stayed here for one night on our way up the coast so weren't there for long but could have happily stayed longer. The grounds are gorgeous with two large swimming pools. The apartment was very clean and modern. Would recommend for families and obviously for golf lovers.  We were told there was a mini bar in the room but this consisted of a couple of bottles of soft drink, two cans of beer, a chocolate bar and some olives. A bit disappointing! For such a large resort I expected there to be a shop nearby but unfortunately not, it's a drive into Alicante if you want to buy any…", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r208142270", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "nice and quiet", "review": "This holds the middle between an apartment and a hotel.  It's an apartment (2 bedrooms), but with a restaurant (which is handy for a good choice of continental breakfast) and a swimming pool available (open in the summer).  Even if you don't intend to play golf, this is a good place to stay in the Alicante area, as long as you have a car.  It's very close to the airport (but you don't hear noise from airplanes), in a little green oasis in an otherwise quite dry and barren Spanish countryside at the Costa Blanca.  When we stayed here in early May it was really quiet in this resort, which we liked a lot.  For activities, the city of Alicante is only 10 minutes drive away.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r204553635", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "fantastic", "review": "really luxury hotel, with a bog golf course. Room or i prefer to say the apartment is so big , 3 rooms , a bif kitchen , nice terrace, and swimming pool is nice too. But just a little far from alicante center city.", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r199606395", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Poor wifi", "review": "Stayed 2 weeks in March 2014.  Large modern apartment. 700 metres walk  the clubhouse,  500 metres to the bus 90 stop,  Cost 1.55 Euro to Alicante and the village Torrellano the other direction. 1.5 hours between buses.  The golf course in very good condition and pleasant athmosphere.  Nice place for winter golf, however I will not come back, because I want to surf with my pad or computer, but the wifi is too weak and pretty much useless most of the time.", "date": "March 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r199108969", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Good place for cheap money", "review": "We was in Alicante for a week in february and stayed at this hotel. As other mentions this place offers big appartments with kitchen and washing facilities. 2 tv`s and lot of space.  We took breakfast included and was satifsfied with the list of food provided. Pancakes, egg, fresh juice and others.  As concering the training facilities it is impossible to enjoy these as they are far away from the hotel and in the golf courts where u can not walk without permit. Not good.   If you choise this hotel, you will not be angry afterwards. Rent a car and you and your families are mobile. It takes max 10 minuts in car to alicante centrum.   we will come back.", "date": "February 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r193678104", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "SUPER VALUE/SUPER ACCOMMODATION", "review": "Had a 2 week stay here in January and can reiterate many of the previous positive comments. We wanted to play golf and have good access to Alicante, so we booked this resort to satisfy both requirements. We had a lovely 2 bed apartment, which was very well appointed. It certainly can be classed as up market accommodation. Good quality washing machine, tumble dryer, dishwasher, microwave, oven and hob which allowed us to self cater more than adequately EXCEPT there was a limited number of pans and no toaster or sharp knives. (We were lucky enough to be able to borrow these from another source). Although we had a couple of niggles regarding maintenance, due to 24 hour maintenance, a man arrived within minutes to rectify all our problems. However, there are a couple of issues that…", "date": "January 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r191744517", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Relaxing", "review": "Stayed here a few nights for business. Spacious, clean, well appointed apartment with modern kitchen, dishwasher, washing machine etc. Our room overlooked the golf course. Two swimming pools, wasn't really hot enough to swim. Very quiet and relaxing stay. Excellent location if you like golf but not near town or supermarket so you definitely need a car.", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r189206736", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "An oasis", "review": "I stayed here for work over the Christmas period, it's 15 mins from the airport and about the same into Alicante town.i was in a two bedroom apartment which was very lovely ,huge living area two bedrooms modern kitchen with oven, microwave and halogen hob, all very up market,     There was also a utility room with a washing machine and dryer .i enquired and it's £45 a night in slow season so a bargain if there's a family , it got superb views over the landscaped golf course and if you are into golf it looks a great course. You def need a car and it's in it's own area so it's a car journey everywhere , but for quiet and relaxation it's just perfect, breakfast , food and beer all reasonably priced too,", "date": "December 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r188479229", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Really lovely for the money", "review": "We stayed here for 5 nights in October this year for a quick sun break before a big party (basically to top up our tans). We picked the hotel firstly because it had great prices (we paid only £45 per night for a 2 bedroomed apartment) and secondly because of its quiet location. We arrived late at night and struggled a little bit to find it - but actually it was quite well signposted when we got our bearings and well lit. We quickly got checked it and made our way to our apartment.  What we liked: 1. Massive apartment for the money - 2 bedrooms, 2 bathrooms, kitchen and living area 2, lovely balcony with sun all day 3, 2 really good swimming pools in the apartment complex which had lots of sun loungers (not of the best quality but still ok) 4. Good quality beds and great quality…", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r187704687", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "All you need with quality!!!", "review": "First time we suprise when we step in to apartment. Three bedrooms for three men. We ordered two... Apartment was clean and almost luxury, short walk to clubhouse, beautiful view from roof terrace, nice golfcourse in reasonable price, less than 15 min from airport, 15 min to downtown, long swimmingpool beside our apartment. We would choose this one again.", "date": "November 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r183871175", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Fantastic", "review": "What a pity we stayed there just for 1 night. The apartment was very big (2 bedrooms, 2 bathrooms, 1 sitting room,kitchen), new, modern and fully equipped. Our balconies overlooked the golf course, a swimming pool and children area. The apartment was faultless: clean and very well maintained. Parking space was available for free. Breakfast was  generous and tasty.", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r180244739", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Better than the Pictures!!!", "review": "My husband and I stayed in El Plantio in early September. The pictures in the brochures do not do this hotel justice. Our early flight meant our room was not ready when we arrived but despite this, we were given a warm welcome. We originally asked for a room near the pool. When we asked if we could have a room over looking the golf course, this was not a problem and boy was it well worth it.  The views were simply stunning.  Our apartment was incredibly spacious with all we could want for.  We were thrilled to say the least. We had daily cleaning and any encounter with staff was friendly, polite and professional.  The free wifi in the apartment was a real bonus despite the odd breakdown.  As the complex is out of the city, a car is essential but the peace and tranquillity is…", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r177270458", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Perfect for what I was looking for but service was disappointing", "review": "I stayed here in September for 5 nights. I chose this because it is very close to the airport and didnt want to be travelling a great distance or hire a car.  15-20 euros to airport and around the same to the town centre. On arrival there was no help/trolleys to transport all our luggage to the apartment. No wifi in apartment (room 201) and the reception was \"hit and miss\" in the pool area. Very limited on utilities but wasn't a big deal as we just used what we had. The biggest negative for me was a few members of staff (mainly in the resteraunt) They didn't seem to welcome us and rushed us when ordering food/drinks.  For me, this didn't ruin our stay but I could ruin others stay!    Overall we had a really relaxing stay and would recommend this resort. However, don't expect a…", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r176278543", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "On the surface quite lovely, but lots of flaws...", "review": "The complex is simply stunning, the gardens are lush and green and with great views of one of the two pools or the golf course. The apartments are ultra modern, and comfortable, very spacious and clean. On the whole it is good value for money, and if I come again I will need to be a little better prepared.  The positives: Bright spacous apartment Washing machine, tumble drier and dishwasher Full fridge and freezer Large natural looking pools Helpful reception and maintnance (electronic safe failed on a daily basis, we gave up in the end) Beautiful gardens  The negatives No welcome pack, so there is absolutely nothing at all (salt, tea, coffee etc). You will need to buy everything you may need. No cloths for washing up, no liquid or dishwasher tablets No tea-towels Apartments…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r175193535", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Perfect for families with young children", "review": "We stayed here for five days Aug 13, and yes a car is a must if you want out and about, however if you want quality time with young children and don't want to spend lots of money this is the place to go. The apartments are comfortable,  spacious and very well equipped . Visit the supermarket a few miles away, fill your fridge and freezer and cook what you fancy when you fancy it, play with your children by either of the two safe pools or the small play park. The pool side and play areas are  grassed and safe. The hotel provides  floats and other toys for the kids. No smoking or glass is allowed at the pool and apart from ice cream and snacks there is nothing much to spend money on. There is no entertainment for older children or adults at this complex and unless you enjoy a good…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r171960347", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "nice hotel, bad management", "review": "good: spacious apartment, 2 bathrooms, nice kitchen, washing and drying machine, dishwasher, comfortable distance to Alicante/ Elche/ Benidorm/ beaches/ supermarket; microwave oven   bad:- poor signalized on the road (the GPS data may be useful)        - no privacy for the ground apartment's terrace        - no help from the reception to get to the apt.        - not enough dishes/ mugs/ forks/ knives (family of four)        - no coffee filter (there was something like an ancient coffee maker, not electric, with old molded coffee in it)        - no corkscrew (bought it at Mercadona supermarket)        - no hairdryer (got it from the reception)        - no ironing machine (got it from the reception too)        - no changing beds (unless asked the maid; apparently every 2 days!)   …", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r171912119", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Pool was murky and dangerous", "review": "Stayed here again as had been before and large pool was great for kids. This time the water was so unclear you could not see the bottom of the pool. This was probably dangerous for accidents in pool due to lack of visibility on water. Someone might hit their head and if on bottom of pool would not be seen. A bit of maintenance and appropriate use of chemicals such as a simple chlorine shock treatment and buffer would take care of it. Disappointing and won't be back.", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r171340047", "sub_review": {}, "travel_purpose": "", "rating": 1}, {"title": "pictures aren't everything!", "review": "Hi, we stayed here end June for a week, we read the reviews and thought it was a really nice place. we took note of the review about hiring a car. The place itself is really nice, the apartment would be perfect if they just placed maybe an extra 10% more effort in. A car is required as 10 minutes in the car is a large carrefour supermarket, perfect. When you arrive late at night you ask is there anywhere to buy drinks and food and you are directed to a vending machine or the mini bar in your fridge!!  As i mentioned if they placed a bit more effort in the place it would be perfect. The patio area of the apartment would be nice if they had sun loungers. The kitchen facilities are extremely limited. The swimming pool is not blue as the pictures would have you believe, and whilst…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r167400557", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "The photos you see is what you get.", "review": "I am writing this from the sofa in one of the apartments. They are by far the nicest self catering apartments I've stayed at. Its just what we wanted but wish now we had followed advice from other reviews about hiring a car. We got a taxi into the town Torrellano for the super market and im really surprised of the lack of english that is spoken, infact in Alicante too. But its there country so its up to them. To summarize the apartments are lovely but hire a car :-)", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r166810348", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Relaxing Family holiday", "review": "Not long back from our one week stay at the El Plantio golf resort in Alicante and I must say I was very very impressed for the cost. The apartment was clean, airy, light and a good size. All the appliances were all new and high-tech and all the windows/patio doors have the electric blind gates. The kitchen is fully equipped with everything you need and there is a fridge and freezer. IMPORTANT- DO NOT eat or drink ANY food/drink that they provide in the fridge and shelves as everyone knows mini-bars are extortionate.  The showers and en-suite were really nice. The en-suite was a wet-room style bathroom and had a nice sliding frosted door. There is also a laundry room with a washing machine and a tumble dryer- extremely handy!!  The airport is close by and the town is not too far…", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r166726401", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Be careful of the sneaky mini bar trick", "review": "The apartrment very nice, spacious and modern,  However on check-out, we had a nasty surprise;  what had appeared to be on arrival a nice little welcome gift - a couple of beers and bottles of water in the door of the kitchen fridge, and some peanuts etc - turned out to be an extortionately priced minbar. There were no obvious indications of this in the flat, and this little and apparently intentional trick left a sour taste.   Furthermore, the equipment in the kitchen was very minimal. Other than this, a nice apartment.", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r165805397", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Excellent Great Value for Money", "review": "We stayed at El Plantio in early June this year. The accommodation was of a very high standard. Apartments were large, clean and comfortable and serviced each day. We found the location ideal - peaceful and quiet but only a short journey into Alicante (approx 15 euros each way in a taxi). We found previous criticisms of the pool area unfounded. There were plenty of sunbeds, which looked new and the gardens around the pool areas were pretty and well maintained. Staff were friendly. We came away with the feeling we had got more than we paid for and would definitely recommend. Only downside is that there are no basic essentials in the apartments (condiments, dishwasher tablets, cloths etc) so if you are planning to self cater it could be expensive and wasteful for a short stay. ", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r165074833", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "One night stay", "review": "Just one night at this resort as wanted to get to airport for an early morning flight and wish we had stayed longer. Apartment was very high spec and huge for the 2 of us. Cleaning wise, if I was being really picky was average and not quite as shiny as it could have been but the quality of fittings and fixture are faultless. the apartments would be great for a family and golf mad parents on self catering holidays for a week plus", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r164818824", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nice stay spoiled by", "review": "Nice stay in this hotel was spoiled by some items of clothes going missing from my wardrobe.....housekeeper and manager totally uninterested in my complaint. So if you go to this resort do not take nice clothes....apart from that its clean comfy and I would have gone back but not now.......", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r164735335", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Almost ideal!", "review": "The resort is very close to Alicante Airport and about 6 miles from the centre of Alicante.  The apartments are quite isolated and it is worthwhile hiring a car if you wish to sight-see and move around; we hired a car from Goldcar at a rate of only £10 per day and visited nearby resorts, including Benidorm, which is about 30 miles away. Plenty of car parking is available on-site. The apartments are spacious and well equipped, ours had a lovely walk in en-suite shower in the main bedroom in addition to the main bathroom, fully equipped kitchen, including dishwasher. The swimming pools don't look immediately inviting as their colour is a sort of worn terracotta rather than the traditional blue, but they're well maintained and the water is fresh. There are enough sunbeds around the…", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r164718058", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent", "review": "Stayed for one week 31st may 7th June, Block 2 room 217. Check in quick and staff polite, Great place for a Pool Holiday which was what we wanted, Alicante city 10 mins away 11-15 euros in a taxi, Reading other reviews plenty of staff there for the amount of guest there, Loads of sunbeds, Would definitely recommend this hotel for its peaceful quiet location as I said the nite life is a taxi journey away, Food in restaurant good, Towels and beds done every day, No complaints at all would return in a heart beat :) Thank you to all in Plantio golf :))", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r163287205", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Very modern and quiet.", "review": "After staying in Madrid, Lisbon, Sevilla and Granada, El Plantio was a very nice change of pace even though we did not take advantage of the golf course. Stayed here 2 nights. Gave us the opportunity to kick back and relax a little. The value can't be beat. We had a 2 BR suite with a Living room and kitchen and patio just off the pool. We caught up with some laundry as the unit had a washer and dryer. Buffet breakfast was delicious. Eggs and bacon!! The restaurant was a little slow for dinner but the food was good.  Nothing nearby for eating out. Some very interesting castles nearby for sightseeing.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r163279687", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Really quiet!", "review": "Travelled to Alicante over the bank holiday weekend with my family.It's a very quiet resort,ideal for golf enthusiast  but not offering much to anybody else.We arrived in the night and had a hard time finding our apartment,which was block 8 and a little distance from the reception,with 3 Kids,4 boxs, and 3 pieces of hand luggage,it was no easy task.With no staff around the permises(except at the reception and bar) to give us proper directions,we  had to find our way ourselves.I think  the management is keeping staff down to the bearest minimum.The Apartment was large and spacious ,as well as clean.On the second day however we ran out of hotwater and despite someone being sent to repair what ever was wrong,we continued to have lukewarm water until we checked out after our 3 night…", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r162558026", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Fab...but remote!!!", "review": "Accommodation absolutely superb! Specification..(get me) like something out of magazine in doctors waiting room....Yes, pools are fresh?water and not cosmetic blue but crystal clear & cool for swimming.  However......we were on a 40th birthday trip and totally the wrong place for partying!! too far from Alicante...taxis cheap but not ideal!!  Would definitely stay here again for a quiet family/girls/romantic break.", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r162482905", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "leave the breakfast", "review": "Accommodation spacious but lacked warmth we stayed 2nights which was more than long enough, the breakfast was very poor, on the positive the staff where pleasant, we arrived late evening and it was hard to find our room and info on the place was none existent.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r160821285", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Almost there, but not quite...", "review": "My colleague and I were booked into El Planito for a last minute stay. we were staying in a 3 bedroom apartment. It seemed modern and well equipped, however some parts looking a bit tired. For instance the glass door in the en-suite was cracked around the handle and a somewhat botched repair had been made instead of replacing the door. Wi-fi, whilst free, was rather poor in strength. That was if you could connect in the first place. I suspect that there were not enough IP addresses to go around. Given that everyone has a smartphone these days, the wi-fi setup has room for improvement.  The bar and dining area came across as fairly functional and soulless. As previous reviewers have mentioned, this is primarily a golf resort. There were several large groups of golfers having a…", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r159621746", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Beautiful apartments in a tranquil setting", "review": "We stayed here for 5 nights in April with our 15 month old daughter. After driving round for a long time we finally found the apartments. The sat nav didn't take us to the correct place so we then searched for golf courses and found it that way. The apartments are really beautiful, lovely and spacious.. Comprising of a lounge, separate kitchen, bathroom, 2 bedrooms and an en-suite, utility room and we were on the bottom floor so had a very large terrace. The apartment had all the facilities we needed for our stay, oven, microwave, utensils, washing machine, fumble dryer, dish washer. We didn't have a kettle and hair dryer, so I asked at reception and they gave us these without any problems. The staff at reception were always very helpful and pleasant throughout our stay. The…", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r158339552", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "very nice!", "review": "Even for non-golfers, this is a very pleasant spot. Excellent and large appartements for super value.Golf-course is (now?) in good condition. Pool areas are nice but some of the underwater painting is missing which is maybe what other reviews dislike.", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r156671946", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Get away", "review": "Stayed here with my husband in September 2012. The apartments are wonderful and could easily be used as a home!! Unfortunately once you get out of the apartment, the facilities are very shabby with few sunloungers, many are broken and although the pools are spotless, they look very uninviting as they are painted in camouflage. There is little to do and there is not even a mini supermarket, which means a car is essential. My husband booked a round of golf but the course was in such terrible condition, he abandoned his round and demanded his money back. The greens were under attack from some type of fungal disease.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r156239533", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "deffo value for money", "review": "spent two nights here with my wife apartments are very nice and spacious - esp for the price - although would not book the optional breakfast again - good location for Alicante itself and the airport - good for golfers", "date": "February 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r154835805", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Value for money, but slightly worn down", "review": "I recently spent 3 nights at the El Plantio Golf Resort in the outskirts of Alicante. The hotel is conveniently located 2-3 outside of Alicante overlooking the golf course and the mountains in the horizon.  The hotel features some very nice and large apartments; nicely styled at a very competitive price. Our apartment was ~1,200 sq.ft. at €50 a day. The rooms (now) have complementary Internet. Everything looked and was very nice.  On the downside, the pool areas looked outdated and dirty. I know upkeep probably isn't a priority this time of year, but all things considered, cleaning the pool areas wouldn't do the trick. Also, some of the tile work needs to be repaired. I WILL definitely be back, and soon. :)", "date": "January 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r150916594", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "lovely", "review": "Booked this up for a getaway week in December, the accomodation we were given was more than expected, tghe apartment was fully furnished for a week self catering. Washing machine, tumble dryer, microwave, oven, 4 ring hob, dishwasher, kettle, iron , hairdryer. apartment had a double ensuite bedroom, and a twin bedroom with a separate bathroom. Kitchen was a galley style, sreperate dining room, utility room, 2 balconies, spacious living room with large lcd wall mounted tv ( only BBC World news) WI-FI in room, underground car parking.  10 minute drive from alicante airport, 10 minutes to alicante, 45 minutes to Benidorm.  Car is really essential as there is only the golf complex and hotel on site. Apartments back on to the 4th and 6th tee boxes and a 5 minute walk down the 5th…", "date": "December 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r147596710", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Highly recomendable, great value!", "review": "We spent 1 night over this place visiting some friends in Alicante.  We rather booked a flat instead of an hotel room because of our son who is 1 year and a half and quite dynamic so we wanted something with space and comfortable. We were given a 2 bedroom flat with 2 bathrooms (1 en-suite) and we felt really well there. Flat is modern, cosy, with all the amenities you could need. It was on the base floor and the windows in the living-room were opening onto a small terrace looking at the swimming-pool through threes and big plants. Because of the location of the resort, you sleep very well as you're far from any city nuisances. We're thinking that we would definitely go back, probably with friends and we would probably make use of the golf by the way!", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r142367901", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Dont stay here!", "review": "This hotel is rated as a 5* hotel and it certainly is not,it is more like a 3*  The rooms are clean and comfortable but the pool area, reception and bar area are very sparse and the pool is uninviting and the sun loungers are very dirty The food was not cooked well and very average It is a golf resort and unless you are going to play golf all day I would definitely not recommend this hotel", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r141502110", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Wonderfull place. Shower in first bathroom had broken hoze and a burn or smudge on a settee cushiion on arrival today 26/09/12 b", "review": "Stunning for the price. Nice welcome. Consearned they took my credit card details since the shiwer cord is broke and there is a mark on the sofa cushion but apart from that it is trully a lovely place so far. Will add photos as the week progresses", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r141390531", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Very relaxing at a very reasonable price", "review": "Had to book something quickly so visited Laterooms.com and got 3 bed apartment overlooking the golf course for 150 euros per night for 4 nights. Perfect for me, my wife, 3 kids and mother in law.  It is a little out of the way so car hire is a must. Location with car hire is perfect. Ideal to travel to Alicante itself or Benidorm for beaches (we did this for a day).  These are luxury apartments - no basics here. Air conditioned throughout the rooms and temp was constant. They have blackout electric shutters, balcony, fully equipped kitchen including dishwasher, dining area, living area with flatscreen TV, main bedroom has tv too.   Kettle was not in the kitchen area but a quick call to reception and one was duly sent up. Equipment in the kitchen was state of the art. Hob and…", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r139745581", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Incredibly rude staff", "review": "My girlfriends and I came away for a relaxing girly break for 4 nights and stayed at El Plantio.   On arrival we were told that we would not recieve our room until 4pm, despite the fact that it was 10am in the morning. I have never been to a hotel where it takes this long to clean a room!!!!  We then went on a tour around the hotel to look at the surroundings. Hint: do NOT come to this hotel if sitting by the pool and relaxing is what you want. Both pools look unfinished, brown/green and were constantly murky/unclean. The surface is dangerous and both of my friends scraped themselves on the floor. To top it off, there is a maximum of 15 sunbeds to cater for the whole of the hotel, and all are reserved by 9am, leaving one to sunbathe on muddy grass as the pool area is not paved. …", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r137644802", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Great hotel, need a car though", "review": "Great apartment, large and very modern. Washer and dryer, microwave, flat screen tv's, wet room. 2 pools both huge. Downsides being that no where was walking distance so car or taxi is a must. Bar closes at 11pm at which point the whole resort is like a ghost town.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r136785698", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Upmarket Resort", "review": "Extremely pleased with our 2 bed apartment.  Paid 70 euros a night for a family of 4, booking through Venere.com.  Had spent many hours searching holiday rental sights for an apartment or villa, couldn't find anything half as nice for less than double the price.  The apartments are quite spacious, modern, reasonably well maintained and very clean.  Every where else we had looked at had an end of stay cleaning fee of upwards of 100 euros, we were therfore surprised with a daily maid service washing out floors, cleaning bathrooms, emptying dust bins, making beds etc and clean towels every day, also bed linen was changed every 2-3 days. We only required to speak to reception at check in and check out and had no problems with service at any time.  Generally resort had an upmarket…", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r134659427", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Very good as long as you know what to expect", "review": "We had done a fair bit of research about the resort before we arrived and knew what to expect. It is about 5 minutes from the airport and a car is necessary unless you want to spend a fortune on taxis. We arrived at 9pm and check in was swift and friendly. We had booked and were shown to our two bed apartment which was very well finished and spacious. There were three of us travelling and this was perfect for the apartment. There were only two chairs on the balcony and only a three seater settee in the lounge area. This was fine for us but could be a problem if there were more people in the apartment.As has been said before the kitchen equipment was not comprehensive and in fact we went out and bought large glasses as there were only wine glasses. The apartment was cleaned and…", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r134433099", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Bitterly Dissapointed with the Staff  and the  rural disconnected Location", "review": "I had high hopes for this place after taking time to pick the \"right\" place for my Wife and young family. On arrival we were sent away and told to come back at 4pm as the room wasn't ready. This was annoying as the facilities outside of the pool is very very limited and we had no where to change into swimming gear and a drive of 6kms to get into Alicante were all of the local activity is based. Please beware! This place has very little to keep the kids occupied. Staff at the Bar were extremely rude to the  children and ignored my eldests request for a drink. Is her money not good enough?? The same staff member refused to take spare change to buy a drink at the bar when my Wife asked for the request. Awful!!!  The place has no entertainment and the apartments have no WiFi…", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r133615201", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Apartments lovely, location very isolated", "review": "We stayed in a 2 bedroom apartment overlooking the golf course, the accommodation itself was clean, modern and very pleasant. The location of this hotel, despite being 10 minutes from the airport, is very isolated - it cost €34 round trip to the centre of Alicante and due to the lack of facilities at the resort, and it being self catering, it is essential to either hire or car or get taxi's. The resort has no shop - so even basic essentials need to be bought in Alicante centre. The resort does boast a shuttle service, which is slightly less costly than a taxi, however on 3 occasions it was \"unavailable\" during our 5 night stay. Considering the size of the resort there were few sunbeds available for use beside the 2 pools. The food and beverages available in the restaurant are…", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r133377022", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Great Apartments - Poorly equipped", "review": "As others have said, the physical apartments are great.  We had a large 3 bedroom, 2 bathroom apartment overlooking the pool for 70 euros per night for 2.  We were OK with the location, out of Alicante is what we expected.  A bit difficult to find.  We drove past what looked like a real estate agents advertisement, following the signs to the golf course.  Wrong place.  Turn left at the big sign without arrows.  We travel well equipped, but still could not wash the dishes because there was no wash powder for the dishwasher, no dishwash detergent, no dishcloth, no T-towel and no plug for the sink!!  WiFi available only in the reception area. Would have got 5* with a little more attention to detail.  Although the finished apartments look great, there is another block of apartments…", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r132969375", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Excellent accomodation", "review": "The apartment was absolutely wonderful, beds were comfortable. We had a balcony overlooking the golf course, very spacious, well equipped kitchen (no kettle) TV had only BBC world, eurosport in English. excellent pool with a grass surround we had no problem getting a sun bed but there were not many. Bar was quite basic but had what we needed. Wifi free in the reception area. Nothing in the immediate area, we visited the Barrio area of Alicante which was excellent and the beaches at Arenales Del Sol. Would certainly go back again.", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r132880991", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fantastic apartment but very isolated", "review": "The apartments are fantastic, very clean very spacious  I had a two bed ground floor backing onto the 6 hole tee. No kettle, or tea towels etc which you would expect in self catering but in general good. restaurant had set 3 meal menu, which was not very good, out of 6 nights I  enjoyed 1 meal and had to have grilled chicken on the others at a set cost of 20 euro. breakfast was ok had once, 10 Euro. The hotel is a good 20 min walk along  two roads, from the golf course and the 'shuttle bus' is not always available, this is a bit inconvenient , the club house has a slightly better menu but they close at 8pm?  then you have to walk back to the hotel. Tried to Hire golf clubs (driver and 6 iron) was told yes on Saturday at a cost of 8 Euro, but on the monday was told no have to…", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r132441649", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Lovely spacious clean apartments", "review": "Stayed at this resort for 7 nights in a very clean well presented 2bed apartment, overlooking the golf course. Only had one issue with a noisy tv which the staff reacted very quickly to. It was not at all busy so not many staff around but as it was self catering it did not bother us. You do need a car if stopping at this resort as there are no restaurants in walking distance. It was good value for money, we would definitely go back.", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r131858822", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Poor service", "review": "Decent location, clean apartments. Poorly stocked and staff not exactly over welcoming. Complaints not taken seriously. Tad pricey for what we got.", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r130692756", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Beautiful accommodation", "review": "Set on one side of the golf course away from club house but views over several fairways. Just ten minutes to Alicante Airport but you would never know,it is quiet, calm and peaceful surroundings. I stayed in a two bedroom apartment with roof top terrace,it is fabulous. Very clean, the only item missing was a kettle otherwise everything else at your fingertips,if you are in the area then I cannot recommend highly enough.not ear anything so a car is essential.two swimming pools.one negative is the restaurant,every night has a set 3 course menu so no real choice. Buffet breakfast okay and the staff very helpful and even allowed a late checkout at no extra charge. Although I did not have a round of golf it was clearly a popular course and people spoke well of the set up.", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r130522454", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "4 stars", "review": "The kitchen was wel equipt but  for self catering but things like a teapot, teaspoons and more of those little things where not available and can be a lot better", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r129075414", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great value for money,  would stay here again.", "review": "Great value for money,  spacious apartments.  Perfect for families or groups. As a couple we were given a very spacious 2 bed apartment with tv, kitchen etc. However we did have to move to another apartment since our heating wasn't working (a must need in feb). So, we got moved to a smaller apartment but was alot more than we needed either way. Didnt get the chance to try the food in the restaurant so cannot comment on the food. When booking ask for a room on the top floor with a pool view :) ", "date": "February 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r124497170", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Great!", "review": "BEAUTIFUL, spacious apartments, great value for money and good service. Wish we had stayed longer!", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r120741264", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Lovely appartments but no real soul to the place", "review": "Not sure how to review this place, lovely appartments but totally isolated. If you want privacy then a very good spot. A car is a must there is nowhere to get any provisions so make sure to bring provisions with you as there is nothing nearby. There are no tea towells so bring or get your own. We didn't try the resteraunts but both did not beckon us in and looked void of any atmosphere and anyhow  they close after about 7.30pm. I can see the appeal for anyone on a golf holiday but ultimately the complex appeared to be not one thing or another and lacked a focal point or any atmosphere. I was not left with the feeling that I would return which was a shame really.", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r118771010", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great but could be better", "review": "Stayed in mid September. Would highly recommend. It's a bit out in the sticks but only 3 miles from either the airport or Alicantie itself. A strange set-up for a Four star hotel its more like a time share complex. We joked that it was a bit like a cross between the set of The Prisoner and the set of Elderado. The accommodation is excellent. We had a two bedroom apartment which seems to be the smallest available.  You get a master with large en-suite and flat screen TV. Another decent sized bedroom. A bath room with shower. Large living dining / kitchen area leading on to a large balcony, ours was on the ground floor and in a corner so was especially generous. You even get a utility room with washer and dryer. There is Air con throughout. Although the accommodation was excellent…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r118457069", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Amazing apartments", "review": "I have just got back from a week holiday with my husband and 14 month old daughter, we had a great stay. Rooms were kept clean and towels were changed daily. Bed was sooo comfy and it was nice having air con in the room when the temperature outside was 30+C in September.  We went self catering thinking we could go to the supermarket when we arrived to discover it was closed due to it being a sunday.  The apartment itself was gorgeous and would stay there again - I would recommend you take washing up liquid, sponge, clothes, dishwasher tablets and washing powder - I took all with me after reading reviews (despite my husband telling me not to bother).  The kitchen is well equiped with a utility room - washing machine, dryer, dishwasher, fridge, cooker, microwave and kettle. The…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r118359296", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Very Very Nice but", "review": "These apartments are lovely and clearly were built to sell as luxury apartments until the big bust and now they are rented out as an hotel. The setting is nice and quiet (if you like that) and the pool being heated is great for all ages. I agree with the reviews that there arent many sunbeds but there seemed enough when I stayed in July. The restuarant is not very good its ok for a sandwhich and some chips but thats about it. We took our 2 year old boy and he loved it and it was nice it was out of the way a bit. The golf course is ok, the usual when playing abroad a bit overpriced but the views from the holes at the top are spectacular.", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r117980750", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Very relaxing, a home from home!", "review": "My family and I have just returned from a very relaxing holiday in the Oasis Plantio appts.  On arrival we were allocated a 3 bedroom appt when only booked a 2 bed which was a lovely suprise our room had an en-suite bathroom with shower and my children had their own bathroom with shower and bath which was a luxury to have such space.  The appartments were very impressive and spacious with fully fitted kitched with full size fridge freezer which we filled after visiting the local super market approx 10 mins away the \" Mercadona\", microwave, hob and full size oven and dishwasher, only prob is they dont leave any dishwasher tabs or washing up liquid to start you off so you have to buy this in also there is a utility room with washing machine and dryer which was handy as went home…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r117552939", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Absolutely brilliant holiday", "review": "Loved this place, was so relaxing.  Apartments were first class and very comfortable.  We had stunning views of the golf course and pool.  The staff were very friendly and helpful.  My only complaint is the selfishness of other English holidaymakers (no not germans but English people).  As in previous reviews I can confirm the lack of sunbeds and where I did not find it a hardship to spread my towel and the grass for a spot of sunbathing it would have been nice to lie on a sunbed occassionaly.  I was disgusted by people getting up early to go to the pool to reserve sunbeds (one woman passed my apartment every day at roughly 8.45 to reserve 4 sunbeds) by placing their towels on them and then leaving them there for the rest of the morning, sometimes up to 4 hours.  Now this…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r117508022", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "OK if you do not like to be by the pool!!", "review": "This resort and location was excellent for us but there was one huge drawback which ruined our holiday and eventually forced us to move to a different resort.  We booked this as a pool holiday as that is what we all like. Not into beaches and sea etc! There are just under 100 apartments with about 300 guests here and 2 swimming pools but only 31 sun beds in total and hardly any parasols!!   There was virtually no chance of getting one, let alone 3 for my wife, daughter and I. This meant you were on the hard standing or grass next to the pool with no shade at all in the 33 degree heat of August. For us this is our whole holiday and we were not able to complete it. We moved to a villa with pool further up the coast.  I spoke to staff on site who, rather embarrassedly said, that…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r117383651", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "mixed opinions on this hotel", "review": "hotel was lovely,apartments are lovely,staff are mixed as some are lovely and some are good at communicating especially on reception, others are not and are a little rude as well.mainly in the eating area a bit rude.Food is not very good,poor choice often alot of chips,alot of cold food as stood along while in the heat trays.Dinner left for 4 hours in trayus and no water to drink,no butter,bread very hard,fruity was all overripe. Breakfast is lovely best meal they do although eggs were all dried up,juice very watered down,no butter.Accomadation is fabulous,too far from town and shops,no food shop on site either for bread and drinks etc. Cost 30 euros to do return to town so expensive and unable to get bus or walk as on the motorway as well as a long way to go,20 mins away. No…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r117372701", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "very relaxing, peaceful holiday", "review": "We read reviews before booking so had a good idea of what to expect.  On arrival at the airport we phoned the hotel and they sent the minibus to come and collect us it cost us 10 euro and is about a 5 minute journey.  We arrived at 10:30am and were able to check in straight away.  We had a 2 bed apartment which was very large and the master bedroom had an en-suite.  We were on the ground floor and had a large terrace area overlooking one of the swimming pools.      We had our own washing machine, tumble dryer, built in microwave, over, dishwasher, kitchen, dining area, living room, 2 bedrooms, 2 bathrooms and lots of storage space and wardrobe space.  There are 2 large swimming pools at the hotel,  both have a shallow child friendly area so ideal for younger children and both…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r116339237", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Very nice stay for a family meeting near Alicante", "review": "We were in the Be Live Plantio Golf for 3 nights in April 2011. We rent a big 3 bedrooms apartment for all of us ... a couple + 3 kids, my husband's parents and my mother. It was very easy to arrive to the Hotel both from airport and from Alicante City (we had GPS anyway... :-) ) The apartment was very nice, modern furnished , clean and well equiped. There is a great supermarket just some minutes (by car) from there - Carrefour (in a small mall).  Personel were very kind and professional (we speak Spanish...). I would surelly stay there again...", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r116073136", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Amazing Apartments but...", "review": "These were probably the nicest apartments that I have ever stayed in but, I would say that the restaurant is not great and over priced.  The consequence of this, as other reviewers have said, is that you have to go into Alicante to eat which is very expensive altogether.  The taxi rides plus meals set us back a great deal of money for only a short stay.  Hire a car and shop at the nearby Carrefour supermarket and you will have a fab stay!", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r115648861", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great apartments but a couple of small issues", "review": "First, the pros: the apartments at this place are extremely-well kitted out, and also pretty spacious. We booked directly with the hotel for two nights, and although there were only two of us, they put us into a two-bedroom apartment (not sure if the one-bed ones were all taken), at 100 euro a night including breakfast. Now, I'd not have complained too much if our accommodation ended at the bedroom door (which included an en-suite shower room), but we also got another bedroom, a bathroom, a utility room, a kitchen, a dining room, a living room, a large terrace with cane furniture, and because we were on the top floor, a staircase up to our own roof terrace! The staff were very friendly, especially Toni at the restaurant. Also, the grounds were absolutely stunning, and the two…", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r114802764", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Only one regret...", "review": "We landed in Alicante at 10.30 in the morning, having had an early flight and minimal sleep the night before. We got to this hotel an hour later and didn't have much hope that it would be okay to check in so early. However, we were immediately impressed by the beautiful surroundings of the hotel and we would have been quite content to sit in the bar and wait until we could check in. Fortunately, the early check in wasn't a problem at all and we were given the key to our 'room' (no 304) straight away.   When we walked into our accommodation we couldn't believe our luck. The room is an apartment with two enormous bedrooms (one ensuite), a living room, kitchen, utility and bathroom. The kitchen was fully equipped and boasted siemens equipment throughout. On opening the shutter, we…", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r114787212", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Pretty damned Good", "review": "Stayed here for a 4 night break in June.   Here are the good points. 2 pools are beautiful and very clean and well designed.  The apartments are spacious and finished to a really good quality, the apartments are kitted out with full kitchen, also in the utility there is a washing machine and a tumble dryer, this was great as we did all of our laundry and travelled home with clean clothes!  The gardens in the complex are stunning. The staff were very polite and always had a nice smile.   Whilst we really enjoyed the hotel here are some of the goings that they should really improve on....... The restaurant were only able to serve around half of the items on the menu, even though the hotel was at full capacity. The golf clubhouse was a 20 minute walk from the hotel and we were…", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r114718627", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Quiet with a great apartments", "review": "The location is about 10 minutes by taxi from Alicante (a much bigger and more vibrant city than I'd thought!). Its a golfing resort but I can't comment on that as neither me or my wife play. We just went for a relax by the pool and do nothing holiday and for that it works well. We only tried the food at the poolside restaurant which was ok but limited.  The breakfasts were very nice though. The best way to enjoy the hotel is to go full self catering, the apartments are lovely. Very modern, great layout, roomy with well equipped kitchen - which I wish we had taken more advantage of. No sign of the coffee maker advertised though.... Pool is lovely. Great place for peace and quiet in beautiful surrounds. Staff were all very helpful too. Recommended", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r113492661", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Information provided could be improved upon", "review": "We stayed at this apartment resort for 10 days.  The apartment was great, as were most of the staff.  However, people need to know that they have to call the hotel to arrange for the shuttle to pick them up at the airport, and have to go to Level Two of the airport, outside the Arrivals Hall, to be picked up.  The hotel shuttle has El Plantio written on the side (the hotel staff only told us to \"go upstairs\" and when asked, did not say that the name of the hotel was on the shuttle, even when specifically asked).  The nice thing about the shuttle is that no matter how many people in your party, it only costs 10 euros per trip.  The apartment kitchens are fully equipped and if there is something you need, just call the receptionist and ask for it.  However, the coffee makers and…", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r110109575", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Lovely weekend break", "review": "We stayed here last minute and loved the spacious, very comfy, well laid out apartments. We love nice hotels and have stayed all over the world in someof the best, ncluding barcelo asia gardens in nearby benidorm. Plantio golf apartments are fantastic.  The location is beautiful, and is a 5/10 min drive to the lovely city of alicante.  Value for money, this place in unbeatable.  We only paid 70 euros for 2 adults and 2 kids in a 2 bed place.  We did the driving range -only 5 euros.  the resort is quiet but that suits a lot of people and with alicante being so close we didnt find it an issue at all. But best if you have a car if you are there more than a few days.  I was a bit cold in the night, and could have done with more covers, but I always am cold. Lovely little park for…", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r107342975", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "beautiful but too quiet", "review": "gorgeous setting apartments are gogeous pics dont do justice.sense of security is great as appartments have steel shutters by switch control. two pools and small play  park. breakfasts are great but evening is quite bland and repeatative. we stayed with two kids in mid july yet entertainment didn't start till august so extremely quiet. we met a nice couple with one child so helped. but we were usually the only people at pool thru day and around after 8pm. would be great for larger crowd. you need a car to go anywhere outside complex ie for any entertainment or cuisine choice.", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r102474070", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Discretion and comfort", "review": "The building choice of separate block of rooms/small apartments is the best for a group of five girls on holiday. The apartment was silent and very well refined, the rooms and the bathrooms large and clean. I appreciated especially the spruce garden and the not-commonly-blue-tessellated swimming pool! Beakfast little disappointed me (I expected more in terms of variety and selection of food), even if it could be considered a traditionally continental one.  Useful (since the hotel is outside the city) and quite cheap (about 10 € a trip) the shuttle service to and from everywhere you want.", "date": "June 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r100938145", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "The best hotel I've ever stayed in.", "review": "Beautiful location, you step out and it feels like Australia! Palm trees, exotic, amazing surroundings. Everything's so bright - lovely warm welcome in the mornings. The reception/receptionists are very friendly & helpful! I couldn't fail to fall in love with the stunning posh apartments they gave us, we could really make ourselves at home. The food is lovely. You'd never get bored here! Great taxi service to get into the town centre which is also so much fun with lovely restaurants beaches and things to see, as this hotel is a bit out of the way! However this is a good thing because it's so peaceful. My family and I loved it. Gracias for making it the best holiday ever, estupendo! Naturalmente Me vuelvo en el verano. Me encanta España! XX", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d1526898-r98116723", "sub_review": {}, "travel_purpose": "", "rating": 5}]