[{"title": "Good stay", "review": "We found welcoming staff and we have clogged bath so they change the room immediately.. breakfast good for such price and the location good. The staff don't talk English so it's little hard to communicate lol Deserves 6/10", "date": "November 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r726304783", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Average hotel", "review": "Very uncomfortable bed, and the room was small and is in need of an uplift,especially the shower and mattress. We changed hotels after 2 nights here. The staff are very helpful and breakfast was different but ok.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r684817610", "sub_review": {"Sleep Quality": 1, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Terrible", "review": "I have visited Istanbul a number of times now and this is one of the worst hotels I have stayed at ever. The only good thing I can say about it was the receptionist during the day was very nice and helpful. Besides that it was terrible. We arrived late in the night and expected our rooms to be ready and they were not were we juggled between rooms moving our own bags untill they finally found room for the night and then asked to move again in the morning. The rooms were tiny and the hotel is split into two buildings with one side of the hotel having a tiny unsafe lift to access it. Room service was extremely slow and the rooms were dirty including the sheets having stains, black marks and the same with the curtains and the bathroom.  In one room the laminate was broken so it had to be fixed. The evening and night staff were not friendly especially the receptionist. The breakfast defiantly wasn't work the effort to go down. I definitely would not recommend this hotel at all.…", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r637521742", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Well done", "review": "We had actually booked into the other Q Inn in Istanbul, but apparently it was under repair. So, they put us in this one with an upgrade. Apparently the King Suite is their top room. It was spacious and had everything we needed plus more. A bit dated but the people who ran it could not do enough to make our stay comfortable. The view of the Sea of Maramar was great to wake up to. Unfortunately we had to cut our visit short by 1 night as our tour changed. Well done for making us so welcome", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r381611447", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Just ok...", "review": "I stayed for 3 nights in this hotel. The first night the weather outside was really rainy, cold  and windy but the heat in the room did a good job. Next morning i went for breakfast. Not something special but sufficient. The rest of the day i  had the chance to visit the old city which is really close. The area around is full of stores and very vivid.  One of the reasons that i picked that hotel was because of its close position to the Laleli station. In general the hotel is sufficient enough for a traveler who want an economic price and a hotel close to public transportation. However It surely needs some restoration in some spots.", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r346452025", "sub_review": {"Value": 4, "Location": 4, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Good lacation", "review": "Hotel is located in a very busy commercial district. A few tram stops from Blue Mosque. Helpful staff. Clean rooms. Perfect breakfast with sea viewing. Next time  we will choose this hotel again. Recommended.", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r345328991", "sub_review": {"Location": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "It was okay", "review": "They offered good clean and air conditioned room. Hot and cold water was running. It is near from tram station. Offered good morning breakfast but the staff did not provide the free drop at airport as agreed between me and Kamal there front desk man. Anyhow it was a good stay.", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r335008000", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Perfect ", "review": "The Q Inn Hotel on laleli located in a very busy commercial district !  it is well located just a few blocks to the tram station and a few more to the University. The staff was fantastic for us,  The breakfast service is quite lovely and very varied with many offerings. We were lucky enough to stay in the double room which was cosy  . well worth the upgrade if you can afford it.", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r328682985", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Great hotel with great staff", "review": "Visited Istanbul for one week in beginning of November. Qinn is a very small, 4 floors hotel. There is one restaurant in the top floor which offers great breakfasts. They've Lots of fresh veggies and 3-4 kind of cheeses and much more foot for breakfast. The reception guys were very helpful with booking the excursions. If you want to do some sightseeing or just to go around, the reception will give you all the information. They will come and pick you up from your hotel and after drop off. Very easy and very enjoyable. We went for the dinner cruise on the boat with the show. It was great. We saw the night Istanbul and had great food with drinks included. Special thanks to Vedat, Murat & Zeynep. We will be back.", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r326562246", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Comfortable Lodging Near Istanbul University", "review": "The Q Inn Hotel on Koska is located in a very busy commercial district and thus traffic can be an issue as with most of Istanbul. Nonetheless, it is well located just a few blocks to the tram station and a few more to the University. The staff was fantastic for us, especially Aida at the front desk who went out of her way to help us numerous times. Tarkan was also very helpful. The breakfast service is quite lovely and very varied with many offerings. We were lucky enough to stay in the King suite which has a lovely view of the Sea of Marmara, well worth the upgrade if you can afford it.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r325591867", "sub_review": {"Location": 4, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Location, location", "review": "Hotel is located near the Grand Bazaar. Accommodation has good standard, clean and it is quite quiet. Breakfast is very good and the view is amazing (Marmara Sea). It is actually located in massive shopping area dedicated for wholesale and retail customers from Russia. A few tram stops from Hagia Sophia.", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r310052869", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Don't recomand !!!!", "review": "I was in this hotel and i'm so disgusting . The air conditioner was no work , the cabin bath had a problem and all ther water was on the floor like we had our pool in our bathroom :)) the breakfast was terible ! So poorly and bad food . The walls , sheet and towels was stained . The carpet was full of crumbs like it was not vacuumed . Even noise could be here trough the glass .the staff hotel was not helpful at all . I don't recomand . ", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r310039797", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "RUN AWAY, PHOTOS ARE NOT RELIABLE. THIS HOTEL WILL RUIN YOUR TRIP", "review": "Terrible start to our trip. Within 5 minutes of arrival to our room, we realised two things.  PROBLEM:  1) The shower was broken (the shower head was on the floor unattached to the water cable). We have no idea why house keeping would clear the room as good for guests. 2) The aircon was barely working and in the horrid heat that it is in Turkey in August, it was unacceptable.  ACTION:  We rang the reception and told them of this and said we needed to switch rooms. She those us the hotel was fully occupied and we could not switch tonight and that she would have an \"engineer\" come up to look at the shower and aircon.  10 minutes later finally someone had arrived (this was after we told her we had a reservation we were in a hurry to, so they better be quick). Someone who looked and…", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r306669512", "sub_review": {"Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "ok for first time", "review": "room is good, average condition. Personnel is good and would like to help. Breakfast is poor, nothing to eat. you  must pay for omlet and fresh juice. if you hotel personnel offer restorans or taxi is not good, they very expensive", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r300411875", "sub_review": {"Sleep Quality": 3, "Rooms": 3, "Service": 3}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Mrs Madunic Mirela", "review": "We check in on 11.08 and check out 17.08 2015.Stay 6 night.Hotel have big and nice room.Good restaurant ,good service and finaly good food.Recepcion people  is very friendly and know jobs.All time if you need some ofer for helping.I must say Mr.Murat is very good man he alweys tray help.Thank Mr .Murat who organize our 6 days- we have wonderfool experience in Instambul and hotel.Recomanded this hotel", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r300152922", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "The Russian Merchants Nest", "review": "The hotel is near at the Grand Bazaar and Sultanahmet Square, it is quite easy to get to the Eminönü Pier. The hotel is located amidst a variety of shops selling cheap Turkish clothing, both at wholesale and retail. The streets are always full of annoying merchants, offering their stuff. The city noise doesn't go down until late at night. Boxes of mechadise are being carried back and forth. The hotel residents are mostly russian merchants, who buy the goods to resale them back home.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r291745033", "sub_review": {"Value": 5, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "4 nights at Q-Inn Hotel", "review": "We were in a double bedroom. The room was a bit too small for two people and the window was facing the area with air conditioning equipment so it was very noisy. It's better to have a room facing the street, the street is quiet during the night and morning.  The hotel was clean, the towels were changed every day. Everyone was really nice to us. You can enjoy great breakfast with a nice view of the sea.  I would recommend staying in this hotel, even though I prefer hostels for these kind of trips, because it's easier to meet people.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r290637543", "sub_review": {"Value": 3, "Location": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Fake Ratings", "review": "- We have priority for late checkout and when we asked to confirm that, the receptionist said swear to God that you will rate us 10/10 and I will let you stay free of charge. we asked him and if we don't, he said you have to pay for the late check out!! That's what they do to get high ratings! - The breakfast was very poor and if you come in the last hour, you will simply find nothing to eat. - The beds are very bad and the hotel overall is over priced and should be maximum 2 stars.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r274923014", "sub_review": {"Value": 1, "Sleep Quality": 1, "Service": 1}, "travel_purpose": "Traveled on business", "rating": 1}, {"title": "Dont mistaken thought this hotel in Sirkeci, actually it is in Laleli!", "review": "I'm going to write my review in both hotels, Sirkeci and Laleli. Most of the reviews on this hotel actually referring to the one in Sirkeci.  At first, we wanted to stay in Sirkeci because closer to tram, metro and ferry. But we mistakenly booked the one in Laleli. Our first stay in Istanbul were at different hotel but we decided to send one of our luggage to Sirkeci for storage because we wanted to cover outside Istanbul before we return back. When we reach the hotel in Sirkeci, we realized our mistake. We should went to Laleli instead. But the staff in Sirkeci assured us, it was OK to leave our luggage at Sirkeci and they will arrange to send the luggage to Laleli. No charge was mentioned. They were really polite and we trusted them.  Upon our returned to Istanbul, we straight…", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r266613864", "sub_review": {"Location": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": " An \"Alrite\" centrally located little hotel ", "review": "The room is generally clean but tired with wallpaper peeling down a bit, stains on carpet, fragile bed.  The free sauna is a topup of the stay but all other services like Turkish bath and massage are chargeable.  The staff at the front desk is really helpful for directions in the city, where most of the attractions are within walking distance from this hotel.  ", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r265929865", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Nice hotel", "review": "It is nice clean quite place to stay in. They have very politely employees. It is also, strategic place, which you will see in its area so many different kind of restaurants, shops, markets. Anything you want it is there. I strongly suggest that it is a very good place to stay in.", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r261599943", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Value for money & Welcoming Staff!", "review": "Lovely Hotel with a great service! Staff really make you feel at home and should you wish to get a personalised service contact Mr Murat at reception Desk! He will surely help you in anything you might need during your stay! Hotel is very clean and walking distance to Tram. Few stops and you're in the Old City and other main attractions like Blue Mosque, Grand Bazaar and so much more:) Huge Breakfast Selection served on the 8th Floor with lovely views of Marmara Sea!  Hope you find my first Review Helpful!", "date": "January 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r253468269", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "You get more than what you pay for", "review": "My friends and I stayed at Q Inn hotel for 5 nights in December 2014. Christmas holidays in Istanbul. It is not a common thing, considering that there are not big celebrations for it, but it was a nice experience, and Istanbul especially by nigh is magic.  The hotel is a good choice for reasonable price. The rooms are good, quite and clean. The breakfast was OK. The restaurant is in the 8th floor, and during the first days, we could enjoy the food, the view and the sun. The hotel location is really good if you are especially interested in the old city center, mosque, aya sophia church or old saray of sultan. But it is a 5 metro stops far from the most populated area of Istanbul, Taksim and Istiklal street. Also very far from Dolmabahce Palace, a must see. I really didn't like…", "date": "December 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r252156986", "sub_review": {"Rooms": 3, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Good choice for very reasonable price", "review": "My husband and I stayed at this hotel for 4 nights, during winter. At first, we decided for Q Inn Hotel Old City, and then found this hotel by searching for reviews for before mentioned hotel. As Q Inn offered services for almost half the price of the Q Inn Hotel Old City, we easily changed our minds, and booked this hotel instead. We were not disappointed :). We were given a double room, but with one large double and one extra bed in it (that extra bed served nicely to place clothes, so no complains there). Room, including bathroom, were clean and heating worked properly. Food (breakfast) was good, with good variety of vegetables and salads. Also, you can get tea or American filter coffee at no extra charge, but for hot chocolate, cappuccino or Turkish coffee you have to pay…", "date": "January 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r247745153", "sub_review": {"Value": 5, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Simply the best", "review": "I stay here once a month for about one and a half years already. The location is great, the rooms are nice and clean. Big thank you to the staff for running Q-Inn hotel the best way possible, especially MYRAT.", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r235178212", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "One of the best!", "review": "Thoroughly enjoyed my time at the Q Inn hotel.  The rooms are well designed, clean and quiet. The location is terrific, near to what you want to see/do while maintaining a slightly luxurious separation from all the bustle of Istanbul. My final call out is to the great staff here who definitely practice \"whatever/whenever\" to make your stay memorable. Mr. Dalci was very helpful and made my stay very pleasurable. On my next trip, I'll be sure to stay there again. ", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r234933521", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Excellent location & great staff", "review": "I stayed here with a tour group - twice, at each end of the tour.  No traffic can come directly up to the hotel as it has pedestrian access only, so you you have to carry your suitcases up a short distance - although as soon as a staff member spied us coming up the incline they rushed to assist with the bags. The staff were friendly and helpful, pointing out how to get to places close by on a map. They also locked up extra luggage for our tour group for over 8 days (a godsend to a traveller at the end of their long holiday!!!). When it was raining I also had the complimentary use of an umbrella!!! Again a very much needed, yet small thing.  The rooms are compact (hard if there is more than one suitcase in the room) comfortable beds and clean rooms. The shower had good pressure…", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r234647492", "sub_review": {"Location": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Nice place to stay ,very kind and friendly staff!", "review": "We spent four days at this hotel with my wife in sep 2014. The hotel is very close so close to tram and the historical places. The rooms are not large, but quite clean and comfortable.  Breakfast was really delicious.  The thing I loved the most about this hotel was very kind and friendly staff. I wanted to watch Galatasaray at Türk Telekom Arena. But I didn’t know how to Buy ticket. So I asked at the front desk, They tried all possible means. Finally somehow they got a ticket for me, and staff(His name is Murat) went to stadium with me. Due to his help I really enjoyed the game(and galatasaray won). I can't thank him enough.  I recommend this hotel to everyone!", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r233629077", "sub_review": {"Location": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Nice hotel and free hamam", "review": "We have been to Istanbul several times and have stayed at a variety of hotels.  We were pleasantly surprised with the Q-Inn Hotel.  They location is quite convenient as it is near the seaport and down the hill from the Blue Mosque. The rooms were nice and quiet and the hotel staff were friendly and helpful. The breakfast was delicious and we especially enjoyed the hamam in evening after a long day touring around. We would certainly stay here again.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r233042192", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Feel at Home Hotel:)", "review": "Upon arrival you are welcomed by the helpful staff at the reception. They assist you with all you need during your stay! We would like to thank Mr Murad most especially for going out of his way to help us with places of interest & more!  Hotel is very clean and centrally located. It's just 2 blocks away from Tram station & 3rd stop you're in the Old City where there are so many attractions such as Blue Mosque & so much more!  Wi-Fi is also Free & very good!  One last but not least do not miss the Breakfast which is more like a Lunch Buffet than a Breakfast!  So much selection! I hope you find this review helpful!  ", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r230311822", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good option", "review": "This is rated as 4stars. Don't go by western standards. It is not that, but it is clean, conveniently located, and the staff is friendly and helpful- especially Ali. The rooms are big enough to move around in. The hotel is located across the street from a bar that plays American music from the 80s and a train track. If you want to sleep, bring earplugs, ask for a quieter room or stay elsewhere. There are black out blinds so bring blinders if you need them.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r227608476", "sub_review": {"Value": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Awesome", "review": "I stayed with my family in this hotel for four nights. I was bit scared before booking but when i arrived there it was all changed. Eveything was superb, clean and upto mark. The hotel was very quiet, at middle of the city about 2 Tram stations away from Grand Mosue and Hagia Sophia. The breakfast was too good and at the top of the hotel with good view. I must say you can stay in this hotel. The hotel staff is very helpful as they guide you completely where to visit and can arrange private car for you. I would like to Thank Mr. Murad and the Ukrainian lady who were very helpful in guiding me the places. I strongly recommend this hotel as i found this hotel very reasonable in all the aspects.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r224975869", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "All about location...", "review": "Dear Guest,  Thanks for your kind and amazing review, and we are very glad to read your kind words about our hotel. We give a huge importance what our guests consider about us, and that's why we are very happy to see that you were satisfied with your accommodation in our hotel.   We are trying to improve ourselves day by day with the contribution of our guests, and your kind words about our hotel motivate us for sure.  Please always remember that you are a member of our big family, and we will be very glad to see you in our hotel again.  Please also feel free to contact with us if you need any assistance from Istanbul or Turkey, and we will try to assist you.  Kind regards and best wishes from Istanbul, Mr. Cem Dalcı", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r221271844", "sub_review": {"Location": 5, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Elie Haddad", "review": "Went on a budget travel vacation & this hotel did not disappoint... Big beds, good AC, OK breakfast (good view while having it though)... the location was the main thing with this hotel... the whole block was shopping & restos... walk upwards 2 blocks & the tram was there... everything seemed downright accessible from this hotel... Their staff was very helpful though sometimes have issues with English... Very satisfying for the price...  The only weird thing was the lift...", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r213422116", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Amazing! ", "review": "Great location at the heart of the old city, Hotel staff are friendly and approachable especially Alli hehe  free Turkish bath and sauna , The hotel is very accessible; very near to everything from tram to shopping centers to restaurants to gift shops, everything. The room is quite small but its clean and well maintained everyday. If I'm going back to Istanbul I'll definitely stay with this hotel again. Good job!", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r212520876", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great location", "review": "booked online with booking.com. great location at the heart of the old city, good value for money, very friendly and helpful staff. main attractions including hagia sophia and grand bazaar are within walking distance, which is very convenient and efficient in a city choking in traffic. all in all very good experience.", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r206273261", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Value Plus!", "review": "A warm welcome, detailed instructions/maps on the sights of Istanbul, comfortable room (ask for a room not on the street), good breakfast, friendly and helpful staff. Great location - close to tram and metro stations - like previous reviewers, try the public transport - it's quick, cheap and efficient! Great value - would definitely stay again!", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r206016781", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "A lovely central hotel", "review": "We really enjoyed our time in Istanbul and the staff at Q-Inn Hotel made it even more wonderful. They were keen to help us with directions and tips on how to get around, they made a call for me when I left my jacket on a bus (and got it back), sent us to an amazing traditional Turkish Bath and called us Taxis on numerous occasions.   The included breakfast was delicious, fresh and slightly different each morning.   A lovely hotel and a wonderful stay!", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r205067320", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Good price - awful room initially then complained and were upgraded (thankfully!)", "review": "Booked on basis of TA reviews.    Firstly, location is slap bang in what appears to be the clothes shop centre of the city!  If you like cheap/blingy clothes this is the place to be!  It is a 5 min walk from the nearest metro (Universite) which is great (metro is far better than taxis - IST roads are chocka block)  The first room on 3rd floor had a mucky stained floor - simply not good enough.  After making a point of this - an upgrade to the 7th floor King Suite occurred and I am glad to say it was a vast improvement.  I would not have stayed in the first room.  The breakfast is good - yoghurts/fruit/bread/meats etc.  0730-1030.", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r201924056", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Good price, nice view", "review": "We choose this hotel because of the price and view and were not disappointed. The staff is very kind and helpful. The breakfast is fine. The only bad thing is the hot water is salt.  We were so lucky to stay at best room with a great view, but all visitors are able to enjoy this view from the restaurant.", "date": "March 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r197886335", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "friendly and nice staff especially Mr. Estender", "review": "He helped me slove any problems about taxi and lot of things.I will strongly recommend this hotel to my friends in the future. Many thanks to Mr. Estender.I think if I have a chance to travel to Istunbul again i will stay in this hotel for sure.", "date": "January 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r190473037", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "good overall", "review": "Dear Guest,  I would like to thank you about your kind review on the behalf of my all staff. As you have emphasized, our staff is always ready to assist you, and solve the problems as much as we can. When we get good feedback from our guests, we get really motivated and our passion to serve our guests increases.  Please always remember that you are a member of our big family, and we will be very glad to see you in our hotel again.  Kind regards and best wishes from Istanbul, Mr. Cem Dalcı", "date": "December 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r188017013", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "in general its  good, but it is not a 4-star hotel", "review": "It's a decent hotel overall for a medium range travel. Rooms are neat and friendly staff, breakfast is good. Would have been better if the reception, hallways and lift were more spacious and had different restaurant options. Appreciate your services!", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r183251749", "sub_review": {"Value": 2, "Location": 4, "Sleep Quality": 3, "Rooms": 2, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Q-ueasy!", "review": "We have stayed at the hotel for a week, the staff were friendly, especially with my kids, reception staff in general were good, especially Mohmat.Rooms are somewhat small but clean hotel is not 4 stars, the breakfast was relatively good , but must find a solution to the stairway at the entrance of the hotel that is not commensurate with strollers and when carrying luggage, in general good, but it is not 4-star hotel", "date": "November 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r180444049", "sub_review": {"Value": 3, "Location": 2, "Rooms": 2, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "not worth a choice for future tourists", "review": "Firstly, we had a bit of a disaster when we arrived at the hotel (left laptop in taxi!), but the hotel staff were very helpful and did their best to try to help (we got it back in the end!)  We were disappointed with the location of the hotel on arrival as it didn't suit our needs.  We had thought we were booked into the other Q-Inn, which is more centrally located.  However, we went up to our room to unpack and were brought drinks to the room, which was lovely.  Once unpacked we decided to have a nap before going out to explore the area, however, when we woke up, we discovred the air conditioning unit had leaked a large amount of water onto the top of the wardrobe which was running down the front and inside - luckily not onto our clothes!  We called reception for assistance and…", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r179907114", "sub_review": {"Value": 2, "Location": 2, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "A good experience", "review": "the outstanding point was the kind and polite staff, they help us during the stay a lot. the room itself was totally comparable with a 4-star and a 2-star Hotel that I had once resided in Madrid. the breakfast was also good.", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r171145513", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Central, cosy, clean", "review": "We were in the older part of the hotel and had a wonderful large room at the front, very clean and the staff were pleasant and very helpful. 2 days of ease as Central to everything by tram or walking.", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r168672627", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great experience!!!!!!!!", "review": "I was there in the hotel for 3 days in July 2013. It was an amazing experience. Realizing we are newly married couple, the manager upgraded us to the King Suite!!!!!!!!!!!! It was one of the stay in Turkey. For the price they offer the hotel is a great deal. Close public transports, Grand Bazar, Blue Mosque, Hagia Sophia and other key tourist place. The staff was very friendly and helpful.  Thanks for making our holiday special.", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r168661325", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent hotel!!", "review": "Perhaps the best part of this hotel was the free hamam! We enjoyed turkish baths nearly every day of our stay. The staff was extremely kind and helped recommend travel plans. The hotel was very close to key travelers destinations.Wifi was strong.", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r164640908", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Q-Inn Hotel, Istanbul", "review": "We spend 4 days & 3 nights in Istanbul.  We had the pleasure of staying at Q-Inn Hotel.  A lovely hotel on a quiet street.  The staff were the friendliest we have ever met.  Thank you for making our stay in Istanbul wonderful.", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r164525958", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good value for its price", "review": "Very nice and helpful reception, clean rooms (probably, they could be a litle bit bigger), good selection of meals for breakfast, good location (15 mins of walk to sights), close to public transportation. It was a bit noisy outside, but that was not a kind of dramatic problem.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r161267276", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Central with all you really need", "review": "Dear Guest,  We have gladly read your kind review about our us, and we are grateful to you for your kind words. Your kind words are always motivating us to want the best, and we are always improving our service with our guests' assistance.  Please always remember that you are a member of our big family after that, and please let us know if you need any assistance from Istanbul or Turkey, we will gladly assist you as much as we can.  And you will be always welcome to our hotel.  Kind regards and best wishes from Istanbul, Mr. Cem Dalcı", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r160378756", "sub_review": {"Value": 4, "Location": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Nice Clean Well-Located", "review": "We stayed here for three nights and found it to be a good hotel. The rooms were clean and comfortable, the location was good and walking distance from the main attractions, and the breakfast buffet had quite a lot of variety. Overall not a bad place to stay! ", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r159784723", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Good location with clean rooms but paperthin walls.", "review": "Dear Guest,  Thanks for sharing your ideas and experiences with our other guests. We gladly read your kind review about our hotel and we appreciate it.   It was a great pleasure to host you in our hotel, and after that, when we read your kind review, we get motivated and I am happy that we are on the right way.  Please let us know if you need assistance from Istanbul or Turkey, and we will gladly assist you.  Kind regards and best wishes from Istanbul, Cem Dalcı", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r159154298", "sub_review": {"Value": 3, "Location": 4, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "", "rating": 3}, {"title": "Good hotel in Istanbul", "review": "Q-inn Hotel Old City is close to Sultanahmet area and the tram line. There are lots of restaurants and shops around the hotel. It's also close to seaside. Rooms are not so large but enough for your needs. You can easily walk around to find a restaurant at night.", "date": "February 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r156767197", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Great location, Mediocre service, Good for Vacation...", "review": "This is a great holiday, laid back hotel.  The front desk staff are responsive and friendly.  The breakfast is mediocre to poor and the staff supporting are horrible.  The lunch and dinner staff are great.  Overall, I do recommend because of the location...  The rooms are fine, however nothing special.    Enjoy", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r156672354", "sub_review": {"Value": 4, "Location": 4, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "", "rating": 4}, {"title": "Qinn Otel", "review": "At the end of November 2012, I had chance to visit Istanbul for my several appointments and I have found this hotel in after I have seen the reviews of previous guests. I strongly recommend you if you need to transport a lot during the day for different places in Istanbul, since the hotel is located in the center of this amazing city. The rooms are big enough and especially the breakfast was good enough with rich options. I will definitely stay here for my further visits in Istanbul. Tip: I have stayed at the 5th floor and you should try the delicious omelette of the chef in the morning.", "date": "November 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r147134506", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Clean, comfortable and welcoming", "review": "Our dearest guest,  First of all, I would like to thank you for your kind review on the behalf of our all staff. Your kind words and great words strongly motivate us for sure and help us to improve ourselves in every area.  Please remember that you will be always welcome in our hotel and please let me know if you need any assistance from Istanbul or Turkey.   Best wishes from Istanbul, Cem Dalcı", "date": "November 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r146507253", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 3, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good location, but that's it.", "review": "The hotel is extremely well located. Nice to stay there 4-5 nights. During the week it was extremely cheap thank to an online booking... For the hamman I do suggest to go to one of the beautiful and historical hamman of Istanbul", "date": "November 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r145290620", "sub_review": {"Value": 2, "Location": 4, "Sleep Quality": 2, "Rooms": 2, "Cleanliness": 4, "Service": 2}, "travel_purpose": "Traveled solo", "rating": 2}, {"title": "Great Place, Great staff, Perfect Location!", "review": "This place has a good location, walking distance to pretty much anything that you'd like to see around old town Istanbul, but I really can't understand why it has such good ratings  + Free wifi, and it's working. Good breakfast buffe in a nice environment on a rooftop.  - The rooms. They are tiny. And make sure that you don't get a room on the 7th floor - it's under the breakfast hall, so unless you'd like to wake up 06:00 by people starting to prepare breakfast, make sure you avoid this floor if you do stay here.  My bathroom had a leaking toilet. The water was running all night and it was hard to flush. The TV wasn't working (well, I didn't care, just mentioning).  - The area is probably not the best to stay nighttime alone. It felt a bit dodgy.  - The service. First of all I…", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r144390206", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "\"Friendly, helpful staff and centrally located hotel\"", "review": "Over a three week period, I stayed at the Q-Inn for six nights. The hotel is centrally located to all the tourist sites during the day and easily accessible to explore the excellent nightlife in Taksim Square. The staff at the front desk, housekeeping and at the cafe were kind, efficient and very accomodating. The beds were comfortable and the rooms were clean and there was minimal street noise due to no cars being allowed on the front street. Thanks to the Q-Inn staff for helping making my stay in Istanbul a memorable one....we'll see you next time!", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r142669718", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Solid Hotel in a Great Location", "review": "This hotel pretty much ticked every box for a traveler. The rooms were clean with comfortable beds, the staff was friendly and the location is great. Don't expect luxury, but if you're looking for a hotel that is above-average, this one will fit the bill.", "date": "March 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r141774894", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Thank you", "review": "Dear Qinn team  i just want to thank you all for the kind service you all offered, as housekeeping were very helpful, as reception and room service were so friendly, and sure kitchen chef also, it is not the first time i visit your luxury hotel, and am pleased to be your regular visitor whenever i go to Istanbul. best regards to the management of Qinn on the top Mr.Jame and the friendly receptionist Murat. i appreciate you for the hard working team you all have. Raghad :)", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r140050510", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Great Value and nice service", "review": "Was there with my German Girlfriend for 5 nights in Istanbul. Perhaps 4 star qualification compared to Italian Hotels (I am Italian) is too much, but the price was valuable and the service more than good thanks especially to the daily receptionist (Jasper was his name?) and the main waiter of the breakfast room! Very easy to reach Bazaar, AlyaSofia, Blou Mosque and Topkapi", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r138781132", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good Choice :)", "review": "The hotel is very accessible; very near to everything from tram to shopping centers to restaurants to gift shops, everything. The room is quite small but its clean and well maintained everyday. Hotel staff are friendly and approachable especially the reception Canser. If I'm going back to Istanbul I'll definitely stay with this hotel again. Good job!", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r137967187", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Good Value and accesible", "review": "The hotel is in the center of shopping area.Very near to the tram and very accesible.The hotel staff are friendly yet some of them  can hardly speak and understand english..still they try to give a good service.Breakfast is good.We stayed there for 3 nights and 4 days.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r136485858", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Nice hotel", "review": "Dear Guest,  I am very glad to read your kind review and please remember that our guests' kind reviews are always a source of motivation. Please let me know if you need any kind of assistance from Istanbul or Turkey and please remember that you will be always welcome in our hotel during your next accommodations.   Best wishes from Q Inn Hotel Istanbul, Cem Dalcı", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r136239698", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "skip it.", "review": "The hotel is good ....it terrace resturant it also good.... The room in which I stayed dint have a good view....the staff we're not kind with us..... The rooms are small but managble..... This hotel can be used for business trip.....", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r135749344", "sub_review": {"Value": 1, "Location": 5, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Average", "review": "Dear Guest,  I am glad to read your kind review and you can be sure of that your kind and good ideas about our hotel definitely motivates us and this motivation provides us to work harder and create better service in our hotel. I hope we can see you in our hotel again and please remember that you will be always welcome in our hotel.  Please do not hesitate to contact with us if you need any kind of assistance from Istanbul or Turkey and we will be glad to assist you again.  Best wishes from Q Inn Hotel Istanbul, Cem Dalcı", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r135669004", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Bad choice", "review": "the hotel was a disappointment from the 1st minute i saw it. skip it completely if you can.  it is however centrally located with easy access to transport, shopping and pretty much everything else. the room was tiny, i felt like i was boxed inside a matchbox and the rooms were uncleaned for 2 days, i had to go ask the reception to send someone to do it ! the breakfast buffet is pretty much standard and the same thing everyday. the bathroom utilities are below standard so please carry your own shampoo and conditioner. the service is alright.  the do have free internet in the reception lobby so you can do your research before you head out ! there is a small tv which i never used and there is no telephone in the room.  on the whole a very below average hotel considering their…", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r134375370", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Really best choice", "review": "I ve been to Istanbul last month and stayed in this hotel.I and my friend were pleasantly surprised when we got in to the room: the furniture was of slight milky colour with glass decors,the walls were of the same gamma,there were big mirror in the corridor,which is important for us,girls,the beds were comfortable and the bed linen was white and clean.The towels were changed every day.There was no smell of сigars in the room.The staff was so friendly and helpful,especially receptionist Murat))).The restaurant is gorgeous with pleasant sea view and terasse,you can enjoy breathing fresh air while havving breakfast.I highly recommend  Q-inn Hotel to visitors and next time i  will surely stay in this hotel.", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r131076816", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "busiiness location", "review": "Dear Irina,  We are so glad to read your good review about our hotel and our staff as well. Hope to see you soon in our hotel.  Cem Dalcı", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r130668047", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Excellent choice", "review": "Laleli is neighborhood of clothes whole-seller shops ?!!! perfect for women :) Small and clean hotel but the room space is not compatible 4* hotels. Nice view of the sea of Marmara at the breakfast hall. pricey because the Istanbul hotels  are totally pricey  :(((  near the tramway station and 15 min walk to Sultan Ahmet and Hagia Sophia. I prefer to stay at the apart hotel in Istanbul next trip.", "date": "March 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r130431735", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Decent location but print out booking details", "review": "Dear Ali,  Thanks for your review about our hotel. You are right about the expensiveness but the date you have visited our hotel was not only our peak season but also Istanbul Hotels' peak season. Other dates will be cheaper for sure. Hope to see you soon in our hotel for at least a good breakfast with a great sea view again.   Kind regards, Cem Dalcı", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r127521728", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Dear friends!", "review": "a very good hotel, friendly staff and warm, clean hotel, good service, comfortable rooms, free wifi conection, the hotel is very well located (from 5 min of the Blue Mosque, St. Sofie, the ippodrome, Topkapi) and moin for 2 min tram station, ideal for visiting Istanbul I highly recommend this hotel and I intend to be in Q-inn in Old City during my next visit to Istanbul Stay quite remarkable especially for the friendliness of the staff that I am very grateful.", "date": "March 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r127282020", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Fully recommended", "review": "Friendly and helpful people! Small but clean and central-good price!fully worth it!", "date": "March 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r126265924", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "nice and clean", "review": "Hello,  Thanks for your kind review about our hotel and you will be always welcome in our hotel.  Kind regards, Cem Dalcı", "date": "January 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r122927130", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Q Inn", "review": "I have spent 5 nights in  hotel Q-inn Laleli , and I'm really satisfy  with my stay ... it is central, near the tramvay station University Laleli, a bus station serving all over Istanbul, the metro station Aksaray and Historia mall are at 1 km, the Grand Bazaar is at about 500 meters (10 minutes of walk). back to the hotel, it is a boutique hotel, unpretentious, charming and very very clean, medium-sized, our room was very clean, beautiful and tastefully decorated, (it could be easily a room of a five star hotel). The restaurant has a beautiful view of the Marmara sea and the port Yenicapi, the breakfast is correct with a variety salty and sweet, The staff is friendly and efficient, my special thanks to Mr çenser the manager. Personnally i recommend this hotel for those seeking…", "date": "December 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r121814349", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Small but Elegant", "review": "Wonderful and inexpensive place to stay - warm people, huge breakfast, within short walking distance to many sites, quiet street.", "date": "March 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r121480363", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "A stay to remember...", "review": "Location: This hotel is located at Laleli and there are a lot of shops and restaurants near the hotel. I just walked to Grand Bazaar, which is about 1 kilometer away to Grand Bazaar entrance (I think it's entrance of Gate 7). It is also close to the tram station.   Room: I love the design and furnishing, which is somewhat like a boutique hotel but the rooms are small. Everything in the room was working so no complaints on this.  Breakfast: Limited choices available and the food quality was acceptable by my standard. The restaurant was quite small too but nicely decorated.  Suitable for: Young couples, travelling with friends, business and solo travellers.  Unsuitable for: Travellers with infants/strollers/wheelchair.  Would I stay again in this hotel? Probably, but not with my…", "date": "November 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r121456875", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Very nice hotel", "review": "I like it very much. Very friendly and professional personal. Light and clean rooms. Stay there when i visit Istanbul", "date": "November 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r120547234", "sub_review": {"Value": 5, "Location": 3, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "unfriendly staff, no hot water, overpriced", "review": "Room was clean but small, window looked out on to internal ventilation shaft - so no view.  Biggest issue was lack of hot water - it was only tepid, far too cold to shower comfortably, for the whole of my 4 day stay.  Presumably an energy/cost saving measure.  Staff didn't smile or speak.  Significantly overpriced given the above.", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r120047007", "sub_review": {"Value": 2, "Location": 3, "Sleep Quality": 4, "Rooms": 2, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled solo", "rating": 2}, {"title": "Never again", "review": "We  stayed at the Q Inn for two nights and then travelled to Central Turkey.  Upon our return, we were informed that some of the rooms which had been previously booked for the group had plumbing problems.  Some of the group were then walked to an alternative hotel. The promise that the rooms would be ready at the Q Inn the following day was not met, neither was the arrival of the luggage which left some of the group having to attend a very special function without being able to change into clean clothes.  It later came to light that the hotel had double booked the rooms and that there were no plumbing issues.  Never again- I have visited Istanbul many times and never ben treated like this before - the manager did not even apologise", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r119367562", "sub_review": {"Value": 1, "Location": 3, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "We loved it and we'll be back in Q-Inn hotel in Kosaka Cad. ( Laleli )", "review": "Special congratulation for the Staf ,like Azat, Murat ,Mehmet, Canser and beautiful girl from the reception :)) They are my friends!!! Thank you for everything! and i hope that we'll see it again!:)   Pietro and Raly from Rome (Italy)  p.s Q-Inn Hotel - Koska Cad.N-30 34130 Laleli -Istanbul - The Best One :))", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r116521809", "sub_review": {"Sleep Quality": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Huge Disappointment !", "review": "I've travelled to Turkey for 10 days July 2011 (Antalya & Istanbul) and to be frank,this is one of the worst hotels that i've stayed at in my life. I read the reviews and saw the pics posted here and therefor decided to go for it,but the truth is that this hotel is nothing as the reviews posted here. I frankly dont advice anyone to stay here except if you're on a very tight budget,although this hotel is way overpriced according to its location and standard. This hotel is located at Laleli,Istanbul,not a good place to stay at,i would recommend places like Sultan Ahmed or Taqsim. The room i stayed at had a borken AC which was leaking day and night,causing the carpets to be soaked with water causing a terrible smell ! In addition had a terrible noise,we reported this to the…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r115835332", "sub_review": {"Value": 2, "Sleep Quality": 2, "Cleanliness": 1, "Service": 2}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Awesome and comfortable stay.", "review": "The hotel was cozy and close to everything. We really enjoyed the staff. The manager was really helpful and attentive. I would recommend the Q Inn to anyone looking for a place to stay in the central city location. However the room was a bit small but if you're not planning on staying at the hotel for long, it shouldn't be a problem.", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r115428819", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "We loved the receptionist!!!", "review": "Hallo,   I am Cladue Crouppe and I stayed in The Q-Inn Hotel between dates 01/06 and  05/06 with my husband. We had great time in Istanbul. It is really amazing city for us. It was our first time in Istanbul and we loved it.  Lets talk about the hotel. It was a gorgeous experience to stay in this hotel. The rooms, the staff, cleanliness, service, everything was great. I would recommend this hotel to everyone honestly.  I would like confirm that, we met Zuhal who is working as a receptionist. We loved her. She helped us a lot. She is really hard-working, helpfull staff. And the main thing is she is so so cheerful.  We believe that she is going to have a really good career in tourism field. We hope to see her again.   Thank you for everything Zuhal!  Faithfully, Cladue Crouppe", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r114707836", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "THANKS FOR EVERYTHING", "review": "We stayed at Q inn Hotel in may for business. Hotel is small yet , the location is perfect to arrive whereever you want.Moreover, personals are really kind and helpful.Especially, receptionist Zuhal help us too much. Thank you so much again and again. When we will come again to Istanbul , we will prefer Q inn Hotel again....", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r114391767", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "NO WAY!!! This hotel is overpriced!!!", "review": "We stay 3 days in Qhotel in Laleli but we didnt enjoy it. The room was small and dirty. The bathroom was smelling very bad. Moreover, the charged us 14 TL for a double turkish coffee. Its a shame! Although we asked twice for receipt or invoice they didnt give us! For sure i will NOT reccomend this hotel.", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r113658979", "sub_review": {"Value": 1, "Sleep Quality": 2, "Cleanliness": 1, "Service": 2}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Nice Hotel", "review": "Its a nice hotel all in all. We had a great time in Istanbul and the hotel gave us the chance to take a breath every time and then. Its very comfortable and tidy. Thanks to Zuhal our personal favourite person at the hotel. She works there and was very helpful and kind and cute with us. She helped us a lot. When you go to Istanbul, and you should. Then you should stay at the Q-Inn Hotel.", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r110517546", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "wonderful trip", "review": "It was my first time in this hotel and I was very much appreciated and to offer all tourist who visit Istanbul. Nice atmosphere, good clean and comfortable room.  Nice design, excellent breakfast. Very good sounds' isolation - was absolutely quiet though the guests were in abundance. The location was quite good; the waiter staffs in the restaurant were very friendly and helpful;) very nice and friendly staff!", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r109589224", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Great Holiday", "review": "We stayed in the Q-Inn Hotel 4 days. This hotel is in very good location, I reccommend everyone especially who likes to visit historical places.The staff was very professional and courteous.The person from reception, Mr.Rasim was very helpful, he show us which places  need to go, what kind of restourants need to go, what to eat.in one word, he guide us as profesional tourist guide.If I will come again to Istanbul, I can tell for sure that I will stay in this hotel.", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r108948441", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great stay", "review": "A great place to stay in Istanbul for tourist trips. Very close to Old City historical places. Great service in hotel, especially thank to Mr. Rasim, ask him when you be there, he always feel free to help.", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r108864470", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Totally perfect", "review": "I am very thankful to all your personal for their kindness and service... Special thanks to Mr. Rasim.. Hope to see you soon", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r108857888", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Wonderfull stay", "review": "We enjoyed our stay in Q-Inn Hotel. Wonderfull atmosphere and best service. Thanks a lot to Janser for understanding and assisting very kind and professional person", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r108495135", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Enjoyable", "review": "Having been in another Hotel for two nights and been unable to take any more we decided to move to the Q INN riund the corner. We have found the Receptionist SEDA very helpful and knowledgable. The hotel was very nice and very clean. The only let down was beakfast time when it always was shortage for something the crockery wasn't very clean most of the times. I would suggest to the breakfast waiter to spend more time in the dinning room looking at ll these thing. We also found a very helpful waiter Mr Ibrahim. Very god hotel in overal and most of the staff extremely helpful. THANK YOU. We arrange our own transfer with ahmetmeydan@istanbulairport-transfer.com  very good I do recommend him.", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r108422074", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Very Good staff", "review": "Thats very good small butic hotel.In historical part of Istanbul.Veru good staff. Alla people ara kind.Tanks a lot to MR Babayev specially for good advices!!! And very taste meals in breakfast.Rooms very silent.Impossible to ehar voice from the streets, and neighbour rooms.", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r108416474", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "very good place, very helpful people....", "review": "This year I stayed in The Q-Inn Hotel for 4 days and it was my first time in this Hotel. Before my choices were other otels which were not satisfactory. In my first day I enjoyed this hotel and decided to be regular customer of this hotel during my Istanbul visits. Besides, I want to send my thanks, greetings to employees of number one hotel in my heart. Especially I want to thank Rasim, azeri guy who helped us, guided us. He was very hospitable. Thank Q-Inn, thank you Rasim... Nari..", "date": "March 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r108092568", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "excelent", "review": "Hello friends! I stayed in this hotel 4 days and I would stay again with pleasure! All workers are so friendly specially Mr. Rasim has mets me so good, thanks him for everything. The services, rooms, restaurant are so excelent. Thanks for all!!", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r108083721", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Choose this Hotel, if you want to realize your dreams...", "review": "We stayed in The Q-Inn Hotel 3 days. I can tell for sure that these were my best days in Istanbul. Of course the main reason of this is The Q-Inn Hotel. Beautiful location for shopping and visiting the city, superior views, especially the Marmara sea view over the terrace restaurant.....  Above all, I can not finalize my comment without emphasize one person`s name, receptionist  Mr. Babayev. During our stay he was very helpful, and guide us in all things. Thank you very much for everything what you done for us.", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r107777312", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "My adress in Istanbul-The Q-Inn Hotel", "review": "Because of my work every month travelling to Istanbul and staying in different hotels. But after my trip in march i found the hotel which i was looking for a long time. The Q-Inn Hotel. I dont want to describe the comfort and other privileges of this hotel. For people who is looking for the hotel to stay in Istanbul i can describe like this: If you want to stay in hotel and feel yourself  \"white man\" choose The Q-Inn Hotel and i guarantee that you will feel  yourself exactly  \"white man\". P.S. Special thanks to Mr. Babayev  for his efforts. Keep it up.", "date": "March 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r107760057", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "soo exclent", "review": "hi. I can say only 1 words, this hotel very beauty. servis, rooms all exclent. and I want o say big thanks to person Rasim, who meet me and serviced me. Thanks all persons who work in this hotel. This is a exclent hotel in Isanbul.", "date": "March 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r104951748", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "good days spent", "review": "Hello to hotels administration. I have spent there 5 days and every day as first day I have seen the same hospitality from administration especially from reception. Suggested us where to go and what to buy which  will consider Istanbuls culture. Mr. Rasim gave us some useful information about city and every time we were welcome for him. Than you guys. Hotel very hot and beautiful.", "date": "March 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r104257390", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "This is the place to stay if you're in Istanbul...", "review": "I went to Turkey to visit my classmates from college. I stayed here because my friends told me it had a great view and location. So true. And the staff was very professional and courteous. I reached there 2 hours before check in time and the guy at the reception(I think his name was Rasim) didn't create problem about that at all. He even escorted me to my room and gave me suggestions about the places to visit when you are in Istanbul. Definitely made my vacation more pleasant. So as I started, if you're in Istanbul, The Q Inn is the place to stay...", "date": "March 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r104207152", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "super hotel", "review": "I stayed for three nights. The hotel is modern. Although the hotel staff tries to appear attentive, every phone call we made to reception was answered by receptionists especially by Mr. Rasim. His hospitality surprised me", "date": "February 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r104191860", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Everything is super", "review": "Very good hotel,nice staff,comfortable rooms. Service is very good.", "date": "March 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r104096457", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Beautiful Hotel", "review": "Indeed the best hotel i've ever been. Beautiful clean rooms.  i endlessly enjoyed staying at The Q-Inn hotel. The best service especially the Receptionist Janser was very grateful, hospitable. i recommend you guys to stop at The Q-Inn Hotel.", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r103573120", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Went for Business But had great Holiday", "review": "We had a lovely week at the Q-Inn Hotel. Actually we went for business but we had great holiday. The place of The Q-Inn is really great to see Istanbul and vist old places. In hotel the grounds were well maintained, the staff all very helpful, the food was lovely and everywhere was spotless. And the Azerı guy Rassim in reception really helped us and guide us about where to go, what to do, what to eat. If I will go to Istanbul Q-Inn is where I will stay...", "date": "March 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r103248236", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "super visit", "review": "We stayed for four nights. The hotel is clean and modern. Although the hotel staff tries to appear attentive, every phone call we made to reception was answered by receptionists especially by Mr. Rasim. His hospitality surprised me and my family. This is a good 4 star hotel I think.", "date": "March 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r103219156", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Good value for money and very good personnel", "review": "I've already been at hotel Q-Inn and i choosed it againg for the good price and quality. The hotel is in the perfect position for shopping and visiting the city! I especially thanks the receptionist Rasim for his hospitality, friendship and being helpful during our stay in hotel.", "date": "January 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r103130878", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good, sweet hotel", "review": "Hotel is not very big. But Crew is very picky. From rooms to service all are in good condition. Receptionist Rasim gave us very good number i the evening. and we had a good communication with him. If we summarize everything in this hotel is good.", "date": "February 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r103036207", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Unforgetable days in Q-INN", "review": "Otel crew met us in the evening and showed the best room as possible. we stayed there about 5 days. Everything was very good. Specially reception guy Rassim helped us and advised some city places.", "date": "February 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r102782275", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Good service and Value for money", "review": "We stayed at the Q inn in July 2010, we had done booking through an agent and were not expecting much from the hotel but to our surprise, it turned out to be excellent service and very caring management - We had a 3 year old child with us in our group and the staff did everything possible to make us comfortable. We stayed there once when we landed in Istanbul and decided to stay again when we came back to Istanbul from the 5 days tour of turkey before we departed. I have already recommended this hotel to many people. Also, their location is ideal for tourists and everything is close by, especially the old city and very close to tram station as well. It is not a 5 star hotel so one should not go with that expectation but it is great value for money in the boutique hotel category…", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r89742677", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Unique service from  q inn hotel", "review": "Dear Sirs.  We are glad to see your opinion at Tripadvisor.com and we also want to see you at our hotel again. Hope we can make you happy as much as we can. We are sorry that Mr. Umit is not with us at the moment but be sure that the service quality and the friendship of our staff will be the same. I want to help you and answer any of your questions anytime you want.  So hope to see you soon and have a nice day.  Best Regards. Erkan KOC erkan@qinnhotels.com Phone : +90.212.638 20 00", "date": "October 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r83782585", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Fawlty Towers", "review": "This is a highly recomended hotel i stayed in this hotel for 5 days\\ 4 nights. The hotel location is perfect as it is in the main shopping road and it takes you around 10 minutes walking till you reach the grand bazar, 5  minutes till you reach to the metro station. The breakfast is good and the service that ALI ERDEM provided me was unique & perfect as he changed our room to a big one and tried to hire us a cheap taxi to the airport and showed us the way to each destination we wanted to go. ALI ERDEM thank you very much.", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r79987341", "sub_review": {"Value": 1, "Location": 2, "Sleep Quality": 2, "Rooms": 2, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "small cozy hotel for short stays", "review": "We booked this hotel because of the positive reviews via booking.com. I emailed them right away to order a transfer service, however I did not receive any response, so we had to pick up taxi in the airport when we arrived. Location seems pretty nice, it is located in the street in the old town pretty close to restaurants, shopping area etc. We were accommodated right away, however the room which claimed to be double was really tiny. The TV didn't work and neither did the Internet. So the staff member came to our room, tried to fix it all, but after that they gave us another room with working TV and Internet (which was apparently bigger than double - i'd say it was triple). That was a nice bonus. Breakfast was alright, nothing special, but the view from the restaurant is really…", "date": "October 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r79368179", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Excellent service.  Very clean.", "review": "We chose this hotel particularly for the positive comments on Trip Advisor about how helpful the staff were and we were not dissappointed.   We booked by email and arranged for their free airport pick up which was a godsend (and they spelt my name correctly on the card - which most people don't seem to be able to manage in the UK!), particularly as our flights were delayed and we were 2 hours later than planned.  Staff were very helpful at sorting us out a nice (tho' not cheap) place to eat on the first evening. Comfortable triple room.  Reasonable size for this part of the city and very clean.  The shower (once they remembered to turn the hot water on!) was excellent.  Not very wheelchair/pushchair/heavy suitcase friendly as there are some quite steep steps to get to the door…", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r77519745", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great Hotel - one caution", "review": "3 tram stops, or a 15 minute walk, from Sultanahmet, in an interesting neighbourhood in a wholesale/retail shopping district. As everyone else has noted, the staff are so helpful. Their recommendations and assistance made our stay in Istanbul easier and much more interesting. I can't say enough good things about them.  There is a good selection of breakfast foods, including fresh and delicious fruit and vegetables.  The only caution I give is to make sure you have a room that is not on the 7th floor. Even staff agree that it is noisy because of the breakfast room above. We arrived to find that we had been given rooms on the 7th floor. Fortunately my friend remembered having read about the 7th floor on Tripadvisor, and staff were very accommodating in immediately moving us…", "date": "May 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r69473660", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Clean, pragmatic, superb service and prime location", "review": "Introduced by a colleague to stayed with me at the hotel. Would recommend to any visitor to Istanbul because of their excellent service by very energetic and willing staff. More importantly, a clean environment in a prime location", "date": "June 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r69209433", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Excellent staff", "review": "Although many people were puzzled by two single girls choice of  staying at the once \"unfriendly\" district of Laleli we were quite amazed by the convenience of the district and the excellent tips given by the staff. Rooms were very clean, the service was excellent (at any time) and the hotel manager Umit was always there to help us with everything we needed. The hotel offers a very decent breakfast with a view of the Bosporus, its really close to the tram station and prices are very competitive considering that for the same hotel in another district you would propably spend much more. Would definately recommend it.", "date": "February 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r67858278", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Excellent location; good views", "review": "I was a late arrival - all staff were very helpful but I suggest you get info during the working day if need to speak with someone in fluent English. Arrangements were made on my behalf to do an afternoon cruise - despite this needing to be done between midnight and 8am. Use the good location of this hotel by setting off on foot - easy walking distance to Grand Bazaar and other sites. Great places to eat nearby. Breakfast was a great start - expansive view, peaceful, good spread, attentive service. My room was small and next door neighbour kept TV going all night which was not great, but no noise from roads etc. Highly recommended if you have a short amount of time to spend and want to get a feel for this city and its people. Transport to and from airport was reliable and…", "date": "May 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r67148044", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Perfect Hotel", "review": "very quite and great staff..in the center of the city of Istanbul, the staff are very understanding and helpful, funny as well!, great cleanliness.", "date": "June 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r67017279", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Excellent staff, excellent service, perfect location", "review": "The hotel is located in the heart of Istanbul and the management and staff of the hotel made our stay an unforgettable experience.", "date": "May 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r66284695", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "disappointing", "review": "I would not recommend this hotel. On the website the rooms look really nice but they are actually tiny and the walls are very thin. The decor of the rooms are tacky and very cheap looking for the price you pay. The service is great but does not make up for everything else which is not up to standard. My partner and I were very disappointed! There are plenty of other places to stay in Istanbul which are nice and a better price.", "date": "April 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r66250611", "sub_review": {"Location": 2, "Sleep Quality": 1, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "It was the most perfect experience", "review": "The service and staff in the Hotel was just incredible. We have never experienced nicer customer care and service then in the Q Inn Hotel in Istanbul. The staff was very helpful and answered all our needs.The view of the Terrace Restaurant, were breakfast was served was so beautiful and peaceful - enjoying a great breakfast with the view of the Marmara Sea. The location could not have been any better, everything was easy accessable and walk distance, such as Sultanahmet and Blue Mosque, Grand Bazar, Hagia Sophia etc. I  would always recommend this Hotel. The Rooms are very clean and very cozy and comfortable. My next trip to Istanbul will be soon and definitely we will be stayin in Q-Inn Hotel again.", "date": "May 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r65398692", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "wonderful and friendly staff, comfy hotel", "review": "the hotel is a small one, new, with comfortable rooms overlooking the street. within seconds of the tram, and the old historical part of Istanbul. the room was comfortable and clean. since booking on the phone we were amazed by the friendliness of the manager. the rest of the staff proved as friendly and wonderful in providing tips and hints on the city. worth the money all the way!!", "date": "February 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r63525302", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 3, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "A gem in the heart of Istanbul", "review": "This is small but well run hotel in the heart of what can only be described as the textile wholesalers district!  That said, it is within walking distance or a short tram ride from all the major attractions.    We stayed 3 nights in a corner room on the 5th floor overlooking the back streets of  the district but that didn't bother us as we were out most of the time!  The room was cosy and the bathroom could have done with a few more inches of space so you could at least sit comfortably on the toilet!   The rooms were clean and there was a safe and mini-bar.  The well stocked buffet breakfast was held in the restaurant on the 8th floor with views of the sea - what a wondeful way to have breakfast.  Fresh strawberries were part of the delights on offer at breakfast and they were…", "date": "April 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r62960015", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Worth every lira", "review": "The good surprises start at the arrival, with welcome fruits and a very kind service. The bedrooms were clean, very comfortable and with plenty of space. The staff efficiency and hospitality was far beyond our expectations. The only issue was the noise on the street, as it's a commercial district (easily solved with anti-noise windows), but if you are in Istanbul you will surely spend most of the day outside. Highly recommended.", "date": "March 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r62419985", "sub_review": {"Value": 5, "Location": 3, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Beware of promise of \"free\" Airport Pickup", "review": "We originally booked 3 nights with Q-inn Hotel Istanbul.  However, due to change in travel plan, we could only stay in Istanbul for 2 nights.  We wrote to the hotel to inform them of the change and asked if the airport pick up would be charged.  Just prior to leaving home, we checked email again and there was no response.  When we arrived at the Ataturk Airport, it took us about 20 minutes to locate the driver who mispelled our name.  Then we were told to wait on the side while he waited for some more passengers.  Our plane landed at 1:37pm.  By 3pm we got impatient and asked the driver to call the hotel to confirm if the pick up would be free.  If it is not free, we would take local transit instead.  I was then connected with the hotel manager who told me, \"don't worry, it is a…", "date": "April 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r61806156", "sub_review": {"Value": 2, "Location": 2, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 4, "Service": 2}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Good hotel with very helpful staff", "review": "Small hotel, 6 floors of 6 rooms each. We had a room at the front which was very clean and warm but could have done with a bit more storage space for a long stay. Located in the heart of the garment district, only a few tram stops from the Blue Mosque / Sophia Haghia - about a 10 minute tram journey or comfortable 30 minute walk. Whilst this avoided the tourist crowds the road was always busy and noisy at all hours.  Maybe it's a Turkish thing to blow your car horn at 4 in the morning! Adequate breakfast buffet but avoid the lift in the mornings as it gets taken over by the cleaners! Very helpful front desk who arranged our return to the airport when our booked limo failed to arrive.", "date": "April 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r61085253", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good customer service", "review": "Stayed for 2 nights at the Q Inn.  I have read some of the recent reviews and must say that I think some of them are being a bit picky.   We arrived in and were greeted by umit who told us we had been upgraded to the king suite (junior suite).  We found the room to be very large and beautiful.  We got good service from the bellboy.  I agree that some of the buttons in the shower were not working but after all it is a shower.   Yes the hotel is a small hotel and in a shopping area but because of this it is in the centre of things and close to all the sites.   The junior suite was abit noisy due to the restaurant upstairs but morning prayers etc are heard any where in istanbul, it is part of the experience.   We had one dinner at the hotel and were served by a waiter that didnt…", "date": "April 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r60945780", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Not bad!", "review": "The Q Inn is located in a district called Laleli.  It's a busy, bustling area full of clothes shops and is very well placed for travelling into the nicer parts of Istanbul by Tram - the stop is only a 5 minute walk away.  The Grand Bazaar is walkable.  In terms of eating out locally there aren't any Restaurants, we ate once at the hotel - the Restaurant is at the top of the hotel and has amazing views out to sea; the food was ok but the service was a bit like Basil and Manuel from Fawlty Towers, well meant but comical!  The front of house staff were very helpful and really couldn't be faulted.  The cleaning staff however where a different story.....  The rooms really weren't well cleaned, I'm admittedly fairly fussy, but their standards were poor, it seemed as if they just came…", "date": "April 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r60659312", "sub_review": {"Value": 4, "Location": 2, "Sleep Quality": 2, "Rooms": 2, "Cleanliness": 1, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Clean and cheap alternative", "review": "The good: The rooms are clean and the staff is very nice and friendly.  The tram is three blocks away and very convenient, although incredibly crowded (like anything else in Istanbul).  Breakfast is also good, and was included in our package.  Bathrooms are clean and not too small.  The bad: I needed Wifi for business back home, and even though the hotel advertises it, my room was out of the reach of their network (and I was on the first floor!), so I ended up using an open network from a nearby hotel.  So their Wifi is NOT reliable.  Also, the beds are uncomfortable, and the rooms are tiny.  The room was not air-conditioned (we had a unit- but it would not turn on), which was ok because the weather was nice, but it would have been terrible if we had been here on a hot day.  The…", "date": "April 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r60427221", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Avoid - Better & Cheaper accommodation easily available in Istanbul", "review": "I booked three nights at The Q-Inn Hotel in Istanbul in March 2010 via telephone and email. It was a Junior Suite priced at 120 Euros per night (120 low season, 250 high season) and the photos of the suite and its facilities looked very good on the hotels website (first mistake!). A car was also arranged to meet us at Ataturk Airport.  When we arrived at Ataturk, the driver picked us up about 15 minutes later. A pool of drivers appears to be arranged amongst the taxi drivers. The transfer was pleasant enough.  We arrived at the hotel and a bellboy brought our cases from the street level up to a kind of mezzanine level where we checked in easily with the hotel’s General Co-ordinator – Umit, who was very pleasant. The bellboy brought the bags up in the lift to the Junior Suite…", "date": "March 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r59256682", "sub_review": {"Value": 1, "Location": 3, "Sleep Quality": 1, "Rooms": 2, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Bed uncomfortable, walls are too thin", "review": "I stayed here based on other Tripadvisor reviews but I should have been skeptical because only 1 reviewer has more than 2 reviews.    The pros: The service is great - the manager is very nice and hospitable. However, there are too many cons that outweigh his personable service.  Also, the bathroom and shower are very nice,    The Cons: The location is very hectic - and its a 25 minute walk to the old part of Istanbul. The location is in the middle of what can be described as the garment district, and the neigborhood is very packed. To some this might be charming but I found it too hectic for my tasted.  The room is very small and has only one small window. The bed is a full size bed which despite the name isnt full enough. The bed isnt comfortable.  My room's window must've…", "date": "March 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r59057334", "sub_review": {"Value": 2, "Location": 1, "Sleep Quality": 1, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 2}, {"title": "home away from home", "review": "walking into a warm environment with a pleasant staff ever ready to give a helping hand is all one wants after a long day scurrying around a stranger city. our room was comfortable and was decorated in well taste. The staff including the manager were very hospitable and always eager to meet our requirements and need. The hotel is also spot on as far as location is concerened. enveloped in a happening shopping district and close to grand bazaar and walking distance to sultanahmet was just a bonus. Thankyou for making our journey alot more memorable.", "date": "February 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r57787054", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Value for Money", "review": "I had seven days business stay in this hotel and it has been one of the most memorable experience in my life. The hotel is equipped with all amenities one could ever desire for business OR leisure stay. The graceful and charming staff is always ready to offer you best of their services.", "date": "February 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r57488473", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Beautiful and Relaxed", "review": "We are staying in the King Suite. It truly is as beautiful as the pictures on the web. Its decor is how someone would decorate their own private luxury apartment. This is the second time we have stayed in this hotel, but this time opted for the premium room due to the off season rate. We are very pleased with the courtesy of the staff and their concern for our well being, which is reflected in many ways. The heart of the hotel and its humanity is Umit, the General Manager. We would like to commend him on the fine staff he has assembled here, to the extent that we feel comfortable and relaxed with each and every member of the staff. As part of his concern for guests, late at night, Umit actually drove us in his personal car to collect our luggage from another hotel we had left…", "date": "February 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r55680445", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "An excellent place to stay in Istanbul", "review": "I stayed two nights  in this beautiful and very well located hotel. The staff was very nice and helpful and even arranged an alternative program for us when the travel agency cancelled one of the activities we had scheduled for one of the nights. The breakfast is delicious with a wide variety of food that suits every taste and the view from the restaurant is magnificent (since it is quite close to the sea). My room was very well equipped and I enjoyed all the amenities and facilities of a first rate hotel. I would highly recommend this hotel if you are planning to come to Istanbul.", "date": "January 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r53997218", "sub_review": {"Value": 3, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "an excellent choice", "review": "I would recommend the Q INN to all types of turists.  The service combined with the extreme care and cleanliness of the rooms makes it a most welcoming place to return to after a long day in the streets of Istanbul.  Next time, I will certainly try another one of the Q INN chain recently opened in January 2010 as well.", "date": "January 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r52994220", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Quality stay in Q Inn", "review": "I stayed at this hotel with my wife at the beginning of December 2009. Pick up service was waiting for us at the Ataturk Airport with a nice and very comfortable Mercedes SUV. Management was very quick with registration procedure. During that time our baggage was taken to the room. We were staying in Junior Suite on the 7th floor. It has a very nice sea view. We used to order coffee and enjoy the view before sunset. I have to mention here that the room service is very quick and coffee is great. There are so many other things that should be mentioned here but most important are that hotel is new, just opened, so everything is very clean and modern. All means of transportation are just few steps away. Most important touristic places can be reached by walking. Hotel management and…", "date": "December 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r52785466", "sub_review": {"Value": 4, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "exellent, helpful staff", "review": "I spent 8 nights there with my collegaues and we can say that the hotel andalso the staff were perfect!  It was the first time we have been to Istanbul and they helped us with everything from advice on touristic sights to transport. The cleanliness of the hotel,  and the helpfulness of the staff made our first impression of Istambul be very pleasant.  As it turned out later this visit was one of our most unforgettably beautiful trips and the role of this hotel went a great way towards our good experience.... Thanks a lot guys", "date": "November 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r49719283", "sub_review": {"Value": 4, "Location": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Expectations Met", "review": "As the Hotel is new the place was clean and also comfortable. The breakfast included warm dishes. The management team was excellent. When we informed them that we were leaving for another hotel to have access to fitness facilities, they actually drove us to that hotel free of charge with a smile on their face and invited us to visit again in the future. The only negative was a postage sized television in the room. The view from the top floor breakfast terrace is spectacular ... the Golden Horn and Bosporus. Also, the ground story is a retail store so you actually have to drag your luggage up a flight of stairs before you get to the lobby and the elevator, but the duty manager went out and brought up our luggage. The manager met us at our departure and said that this was their…", "date": "October 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r46581637", "sub_review": {"Value": 4, "Location": 3, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "The new Hidden Gem of Istanbul...", "review": "Q-Inn Hotel Istanbul is ideally located as it walking distance to all the tourist sites including the Grand Bazaar, the Underground Cistern, the Hippodrome, the Topkapi Palace, the St. Sophia/AyaSophia, the Blue Mosque and the Archaeology Museum. Further, the tram station is only 2 minutes walking distance from the hotel and just 4 tram stops away is the Eminonou station where you can take the government public ferry cruise, which criss-crosses the Bosphorous River (separating Europe and Asia) while stopping at the Dolmabache Palace for a small fee. Additionally, the fantastic hotel location means that restaurants are only minutes away.  When my trip plans changed and I had to stay fewer days than anticipated, the hotel readily accommodated my request and I very much appreciated…", "date": "October 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r45980179", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "The perfect hotel for your stay in Istanbul!!!", "review": "I got to know Q-Inn Hotel thru my travel agent, since it is not yet listed anywhere in the net.  I believe I am the first to review this hotel - if I am not mistaken...  Q-Inn is a hidden gem of Istanbul, they just opened Aug 2009, thus all the furnishing, bedding, linens, etc. are brand new and changed daily!!!  I just love being in a Boutique Hotel with a feel of a mini-Five Star Hotel.  The staff are great, very friendly and they help out in every way they can. However, this hotel is not for guests on wheel chair because the Reception/Lobby is on the Mezzanine Floor of the hotel.  The elevator only starts from the Mezzanine to the 8th floor.  Its situated in a place where you can also get good bargains if you're there for clothes business.    You can easily walk to the Grand…", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1547269-r45006648", "sub_review": {"Value": 4, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}]