[{"title": "Disappointing", "review": "I was there in a yoga retreat and it was a fantastic experience.  The rooms was very cozy. There are very wonderful gardens and a beautiful swimming pool. The vegetarian and vegan food is delicious and there are a very good service.", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g660261-d1550390-r520853927", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 1}, {"title": "Very wonderful gardens", "review": "My 2nd visit to Santillan. Spectacular yoga shala, fabulous gardens, delicious and plentiful Spanish home cooking are the 3 highlights. Rooms are perfectly adequate for a retreat, internet signal good in the gardens and public areas, although not in the bedooms - but this gives a welcome break from the screen. Wonderful relaxing atmosphere - I will definitely go back again", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g660261-d1550390-r442323397", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Spectacular Retreat Venue", "review": "We attended a yoga retreat (teacher Simon Low) at the hotel for 7 days and were spoilt by the peaceful environment, hospitality and the food served at every meal. The rooms were big, airy and comfortable. The yoga studio is so peaceful and well equipped. We were served delicious healthy meals for breakfast, lunch and dinner using always the freshest of local ingredients and herbs and fruits from the Hotel's own garden. There are always tea/coffee making facilities available at every floor of the hotel. Plenty of nature walks nearby which is wonderful during breaks from yoga.   My husband and I felt so comfortable and peaceful that we hardly ventured out of the hotel.  When we were not doing yoga, we were either chilling out at the pool, reading in the library or pampering ourselves with the various therapeutic treatments available.…", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g660261-d1550390-r437358959", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Peaceful, serene and beautiful destination for a Yoga Retreat", "review": "What more could you ask of a holiday than a to spend it with interesting and interested people, be well fed, enjoy fine accommodation in an idyllic environment, with the added privilege of an audience with the incredible Simon Low? Apparently a lot, according to some of the other reviewers that have preceded me on this site. I can only comment that I have been to Santillan twice in 4 months and would again at the drop of a hat if money and time were not constraints. I could find no fault - the staff were incredibly friendly, the setting beautiful, the yoga shala awe-inspiring, the rooms characterful and clean, the food delicious, varied and plentiful, and my fellow guests like-minded and incredibly positive.  To describe my recent trip as a real tonic for both the mind and body would be a gross underestimate - I have returned to \"reality\" revitalised, energised and thoroughly refreshed, with many happy memories. Thanks to all in Santillan for the experience, and here's to the next time! I am already planning my next trip and would heartily encourage others to do likewise.…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g660261-d1550390-r426375919", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great yoga, disappointing hotel", "review": "Abi and I came to Santillan for a week's yoga holiday with Simon Low and the experience was delightful, and by the end of the time there I realised that it had been one of the best holidays of my life. Inspirational, attentive and considerate teaching by Simon alongside wonderful food and service provided by Marta and Tana and their lovely team, helped to generate an incredible warmth and friendliness among the group of people who were there with us. The hotel and yoga facilities are superb. The large yoga room looks down the valley to the sea, a scintillating view; the bedrooms are very comfortable and the public areas and gardens have great character. The pool is gorgeous. This is a very special place.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g660261-d1550390-r422567390", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 2}, {"title": "Sublime week in a heavenly place", "review": "I have just returned from a week's yoga retreat with the inspirational Simon Low in Santillan and I can honestly say that I cried when I had to leave. The setting of the hotel is beautiful and, contrary to what others have said, the gardens are well maintained and a wonderful peaceful backdrop to a week of yoga. Thank you to Marta and Tana and Marta and Dolores and all the rest of the staff for looking after us so well, The food was to die for and Marta's tortilla really is the best I have ever eaten. The yoga shala is a wonderful space with the added bonus of a great yoga wall. If you want to experience a yoga retreat as it should be then book in with Simon as he will inspire you greatly whatever your level. I will be back I promise.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g660261-d1550390-r422071155", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "The most inspirational yoga retreat", "review": "We spent a week at this hotel, taking part in a yoga retreat. The location is nice and the facilities are good, but there is such lack of management that it does spoil things. The swimming pool is lovely - but dirty, the gardens are pleasant but unkept, the receptionist is friendly but often there is no one there. I could go on an on... Our room only had hot water occasionally, the owners dog bit me and left bruises on both legs... They do have great staff, Dolores and Melanie do a fantastic job and work extremely hard. Some days only one of them seems to do everything! In summary, the place has potential but I can't recommend it the way it is currently run.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g660261-d1550390-r421430386", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Disapointing", "review": "Stayed at this hotel a few months ago and it was amazing. It's not run down at all and is set in a beautiful location with views of the sea. If you and a nice relaxing location this is the place to be. The grounds of the hotel are simply breathtaking and it would be a fantastic venue for a wedding or party. Its really unique and very Spanish.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g660261-d1550390-r401303002", "sub_review": {}, "travel_purpose": "", "rating": 2}, {"title": "Not 4 stars, maintenance needed", "review": "This hotes has a fantastic location and a friendly atmosphere. Lovely large rooms and fabulous pool The restaurant is very private and quiet. Has a lovely staff and good food. Good value and fantastic gardens views", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g660261-d1550390-r221020196", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Hotel and food were great", "review": "This hotel used to be wonderfull. It is vert beautyfull situated nut completely abandoned. Rooms and swimmingpool dirty. Food absolutely no four star. It is a shame: a perfect place but the wrong keepers. ", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g660261-d1550390-r214808513", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Hotel in desolate state", "review": "My parents stayed at this hotel for 2 days while visiting us in Malaga.  The hotel is in a beautiful, quiet setting, and it is a shame that the service at the hotel doesn't meet the standards of a 4-star hotel.  It's like a 4-star building, with 2-star staff.  The rooms weren't ready on arrival, the restaurant food is poor (just read many of the other reviews), the internet was only accessible near the reception, and the jacuzzi at the pool requires you to feed it with money.  This hotel needs to hire some more professional staff who are motivated to make the hotel a real 4-star destination.  They have a great setting, but are missing the human capacity to host a good stay.", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g660261-d1550390-r208584404", "sub_review": {}, "travel_purpose": "", "rating": 2}, {"title": "Average to Poor, Pay for Bubbles", "review": "A few months ago we were at a friend's wedding at this hotel and everything was very well organized. It was a dream wedding. The hotel very clean and tidy, in good condition. Food very good and good treatment. Celebrate my 50th birthday there and recommend it to everyone who wants to relax for a few days or celebrate something in a natural place.", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g660261-d1550390-r172327338", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Hidden treasure", "review": "Room was comfortable and garden was lovely even though a bit ragged.  Views from large balconies are lovely.  Breakfast included good cheeses and fresh coffee and fruit.  The only internet access was on the front desk computer that had to be shared by all.  The nearby white village was not of particular interest and it is far from anything.  Unfortunately the hot tub was cold and the small pool was not as appealing as in the photos.  When we checked out, the person at the front desk told us that we should have asked them to heat the hot tub up for us.   The person at the desk in the evening did not speak much english, but the morning people did and helped us arrange our day, etc.  One had to run the water for about 10 minutes before it got hot.  No soaps or shampoo were…", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g660261-d1550390-r132253032", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Off the beaten path", "review": "We call this the \"Hotel California,\" and a year later still laugh about our stay here. We loved the photos overlooking the sea, and couldn't wait to get there. I don't know how they took that photo -- there is one spot where you can see a little bit of the sea way out in the distance if you have binoculars... Anyway, the drive up is one of those nerve-wracking, windy road on the edge of a mountain deals. When we arrived we were very impressed with the beautiful building, but as soon as we got out of the car, a couple of big dogs -- one being a coal-black German Shepherd named Carbon -- came running up to us barking ferociously. I like dogs, but these two looked like they meant business, so we jumped back into the car. We sat there for several minutes expecting to be rescued by…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g660261-d1550390-r120227095", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Skip it", "review": "Hello we are really sorry about your comments but our clients don´t think like you. All our clients said that the hotel is better when they come in  the hotel than in the web page?. Of course we have animals because it is a rural hotel but we did not have any problem in 15 years with them. The acces it is good its is only 1 km of road and we are 20 minutes away from the center of Malaga. To be in a relax place where you only listen to de birds you can´t be in the city... Please come again because we don´t kown what can happend. We are sure you will like it and we will work hard to make your holidays really good Also we don´t understand why you make your commet a year later?. If you had that bad expirience in our hotel you should make the comment after your holliday so we can improve our services...but a year later is really extrange. Thank you for all your comments but we are a new staff in Molino de Santillán and you can read all the new  and actual comments of our clients.... Of course we will keep this information for the future to improve the Molinos services.", "date": "May 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g660261-d1550390-r66744118", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Romantic getaway", "review": "Surprisingly charming hotel, hidden away from the touristy scene at the busy Malaga coast line in the hills with great views over the ocean. It takes some driver's courage to follow the narrow and steep road towards to the hotel but you get rewarded upon arrival. We had booked a standard room which was very spacious and uniquely decorated with all required comfort and the same nice views as described above. The hotel has a beautiful and superbly located swimming pool. Staff is very friendly and goes out of its way to provide a nice stay. The restaurant has a nice and authentic atmosphere, meals are however of average quality and overpriced. We would certainly return to this lovely secret place.", "date": "October 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g660261-d1550390-r20784045", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Beautiful Stay", "review": "A beautiful hotel, reached along a very narrow road.   What you would expect from a 2* hotel - room basic but clean, with everything that you could need, including tea and coffee making facilities, a rareity in Spanish hotels.  Exceptionally well maintained gardens.  Friendly and helpful staff, most of whom speak English if that is what you are loking for!  Breakfast is standard Spanish type buffet, but unlike other reviwers I had no problem with the bar, which was open all night.  To be honest I wasn't that impressed by the evening meal, hard pasta with too much cheese sauce, and pork chops - standard fare.  I would recoomend this for those looking for peace and quiet, with very friendly staff - it is NOT reccomended for people who want nightlife etc.", "date": "December 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g660261-d1550390-r11594818", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Mixed Feelings", "review": "We spent a rainy grey Sunday in this wonderful oasis of luxury (we stayed in the junior suite) close to Malaga. The room had a jacuzzi (make sure you run the pump first). The ambience of the hotel was that of an informal country house with cats and dogs lounging in hidden corners. The food was marvellous, and the hotel was clearly popular amongst the locals as a venue for Sunday lunch. The taste of the eggs revived chilhood memories gor us both; they produce a lot of their own food from their own gardens.  Highly recommended.  Garry & Katja ", "date": "August 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g660261-d1550390-r8368526", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}]