[{"title": "Clean, tidy, well decorated. ", "review": "Istanbul’s most famous street, pedestrianized Istiklal Caddesi (Independence Avenue), throbs day and night and offers a fantastic array of architectural sights, shops, treats, and throngs upon teeming throngs of people. At the avenue’s northeastern end is expansive Taksim Square, thought by many to be the very heart of the city, with many of Turkey’s most renowned restaurants and some of Europe’s most happening nightlife in close proximity. In striking contrast, Beyoglu’s less trafficked areas – such as the affluent Cihangir and the antiques district of Cukurcuma – exude Old World charm and provide contemplative calm and splendid diversion via an assortment of cozy cafes, attractive boutiques, and quiet lanes.", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r295408171", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Amazing visit to Istanbul", "review": "These serviced apartments are well located and are nicely decorated. One of the apartments has spectacular views too. Easy to find cabs nearby and only 50m up the hill you'll find a metro station. You also have a host of restaurants and bars all within walking distance. ", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r261942226", "sub_review": {"Value": 4, "Rooms": 5, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Great location, but lack of management response to guest needs", "review": "3 Americans women taking our first trip to Istanbul couldn't have been luckier with our accommodations as the Galateia Residence Apartments. I was a bit leery that this is not a true hotel, but in most every sense of the word, it does operate that way. There is a person at the front who will greet you and help you to your room. The apartments are self catering and to a very high (modern) standard. The neighborhood has been referred to us as the SoHo of Istanbul, and I couldn't agree more. Great nightlife, shops, boutiques, restaurants. And this is walkable to the old town across the bridge. The area is VERY hilly, so it's not for the faint of heart, but we enjoyed walking all over town. There are metro stops nearby, but we never mastered the public transportation system in our short time, so we either walked or took taxi's everywhere. Great hotel, great location, great amenities!…", "date": "November 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r192101006", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 5, "Rooms": 3, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Great hotel", "review": "As living on  what is now serviced apartment, great location staff friendly, but if stay longer than week bring on toiletries as per contract suppose to replace soaps and shampoo but it is not the case, asked for it no willing or response to have this sorted.", "date": "January 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r190832797", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Great place!", "review": "Great hotel and excellent staff. Taxi needed to get to the city centre. Rooms were a good size and the bathroom was of a very high quality. Room service was efficient and prompt. Breakfast was a buffet and there was substantial food available. There was an X ray machine to check luggage entering the hotel.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r172712562", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Superb place to stay!", "review": "Istanbul’s most famous street, pedestrianized Istiklal Caddesi (Independence Avenue), throbs day and night and offers a fantastic array of architectural sights, shops, treats, and throngs upon teeming throngs of people. At the avenue’s northeastern end is expansive Taksim Square, thought by many to be the very heart of the city, with many of Turkey’s most renowned restaurants and some of Europe’s most happening nightlife in close proximity. In striking contrast, Beyoglu’s less trafficked areas – such as the affluent Cihangir and the antiques district of Cukurcuma – exude Old World charm and provide contemplative calm and splendid diversion via an assortment of cozy cafes, attractive boutiques, and quiet lanes.", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r168970688", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Very Good Hotel..Very Good Location", "review": "Very well-positioned, directly adjacent to the Sishane metro station and Istiklal Caddesi. Many restaurant choices. Service was excellent. Good kitchen appliances and rooms. Full cupboard of utensils and plates, Lovely shower. Great place for long-term stays. Comfortable beds and sofas with a spacious living area. Large master bed. Close to supermarkets and Galata Tower. Lovely view from the 4th floor. Overall, an amazing hotel.", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r165360566", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Fantastic!!", "review": "Galateia Residence is an amazing hotel located on Istaklal street..  The rooms were very spacious with very elegant decor.  The living room was also spacious with a kitchenette.  The staff was very friendly.  Highly Recommended.  TIP: I had a bad experience when I hailed a cab from streets..So please Always book a taxi from the hotel which you are staying at..they usually know honest cab drivers.", "date": "December 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r149444653", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Can't Praise This Place Enough", "review": "This stay was way more than I ever hoped for.  I didn't expect much from this low key establishment, but wow did they ever prove me wrong.  From the care and attention of the staff, to the lovely views from the room or apartment, all was just fantastic.  We stayed in the top floor apartment (if you can afford it, do it, you won't be disappointed) and the room, the view, the balcony, everything was wonderful.  The Residence is situated about 5-10 min walking distance from the main strip in the old city and the Galateia tower.  Walk down the hill about 10 min, get on the tram and head to any part of the city you want.  Just a great location.  Special thanks to the staff, whoever owns this place, give them all a raise, they deserve it!", "date": "January 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r148881627", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Excellent service and massive rooms!", "review": "Staying here is like having a beautifully furnished, large apartment within steps of Istiklal Caddesi.  Fully equipped kitchen, full bathroom plus separate \"guest\" toilet, lovely bedroom with huge, comfortable king bed, a luggage room with coat closet, and a large living room with big windows, dining table, television with lots of channels in many languages--all impeccably clean and stylish.  The staff is also extremely helpful and friendly.  An excellent alternative to staying in a large, impersonal hotel.  Your cab driver may have a little trouble finding it, but once you get there you'll be happy.", "date": "December 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r148638961", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 3, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fantastic stay!!", "review": "Istanbul’s most famous street, pedestrianized Istiklal Caddesi (Independence Avenue), throbs day and night and offers a fantastic array of architectural sights, shops, treats, and throngs upon teeming throngs of people. At the avenue’s northeastern end is expansive Taksim Square, thought by many to be the very heart of the city, with many of Turkey’s most renowned restaurants and some of Europe’s most happening nightlife in close proximity. In striking contrast, Beyoglu’s less trafficked areas – such as the affluent Cihangir and the antiques district of Cukurcuma – exude Old World charm and provide contemplative calm and splendid diversion via an assortment of cozy cafes, attractive boutiques, and quiet lanes.", "date": "December 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r148623536", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A peaceful oasis in the midst of  bustling Istanbul", "review": "We stayed here for 4 nights over New Years and had a fantastic time! The street was very quiet but located off Istiklal caddesi which offered plenty to do and very close to the Galata Tower. Staff were lovely and very attentive. The apartment was spacious, beautiful and very well kept. We would absolutely stay here again and we highly recommend.", "date": "December 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r147708203", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Effortless stay - just how it should be.", "review": "For our first visit to Istanbul our family of 4 (2 adults, 2 teens) wanted somewhere near the sites, near the shopping and where we could spread out and relax.  Guided by the other reviews on Tripadvisor we booked Galateia Residence for our 5 nights in Istanbul and it certainly ticked all those boxes.  Firstly - getting there.  Take up the hotel's offer of transport from the airport, they know where they are going, and apparently many taxis don't!  Secondly - location.  We were initially worried that we may be too far away from everything but as it turns out Galateia Residence is perfectly situated on the hill on the north side of the Golden Horn, just near the centuries-old Galata Tower (tip - stunning 360 degree views!).  It is a few minutes walk up to the funicular stop which…", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r145939825", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Feeling at home", "review": "Aside from the slight difficulty of reaching the front door, this has been one of the best stays in recent years. It is in an area of small street – the kind that taxis just can’t find – so take up the car service from the airport, after that Istanbul and particularly the area needs to be walked with public transport.  The staff know the area well and have good English. Staff are generally otherwise invisible, breakfast and the minibar are however overpriced. Tap the staff for food recommendations, it is free and they like feedback on their efforts post meal.  The rooms are well furnished, clean and well supported – the TV lacks a few channels that chain hotels have – but not really an issue. Wi-Fi flawless, kitchenette well equipped. Bedrooms have plenty of storage – but lack a…", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r145063005", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Fantastic!", "review": "Great location - very close to all of the main streets and places and at the same time in a quiet place that you do not hear the noise of night Istanbul. Very polite staff, ready to help you in any matter. Cozy apartments, clean and spacious rooms, where you will find everything you need for a comfortable stay in the city.", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r144535539", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "great place", "review": "Istanbul’s most famous street, pedestrianized Istiklal Caddesi (Independence Avenue), throbs day and night and offers a fantastic array of architectural sights, shops, treats, and throngs upon teeming throngs of people. At the avenue’s northeastern end is expansive Taksim Square, thought by many to be the very heart of the city, with many of Turkey’s most renowned restaurants and some of Europe’s most happening nightlife in close proximity. In striking contrast, Beyoglu’s less trafficked areas – such as the affluent Cihangir and the antiques district of Cukurcuma – exude Old World charm and provide contemplative calm and splendid diversion via an assortment of cozy cafes, attractive boutiques, and quiet lanes.", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r144153610", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Fabulous apartments run by very helpful staff and in a great location", "review": "we spent 4 nights at galateia. our room was definitively a 5 star hotel quality. very friendly staff, large apartment for a family of four, well refurbished, clean and modern interior design ie no carpet floor, free wi-fi, quiet and safe area on top of Pera. best value for money in a long, long time. strongly recommended.", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r144109778", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Will be back for sure. Soon i hope.", "review": "These apartments are huge, with superior fittings - Vitra bathrooms, all mod cons, well stocked large fridge with minibar prices cheaper than local shops, fully serviced, kept tidy and spotless, with separate wifi in every apartment (no drop in download speeds) and satellite tv. The location is the best in town - in a quiet spot at the back the buzzing area of trendy bars and great restaurants of Beyoglu, and within walking distance of the Museum of Modern Art and the Bosphorus. We hopped up to the Babylon club for a gig, had a 40-spice steak on the rooftop at Leb-i Derya with amazing views, and a quiet Crimean with a piano in a former prison - all a short walking distance away. If we get the chance to return to Istanbul we will definitely stay there again.  ", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r143227202", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Great Apartment, Great Location", "review": "Just off Istiklal street, near just about everything in the lovely and vibrant Beyoglu - an oasis of calm and comfort. Super friendly and helpful staff (thanks Nurhan and Serhat - hope i spelled your names right). I stayed here for a short business trip but would definitely return here with my family. I stayed in the smallest of their appartments which was already nice and spacious - wonder what the bigger ones are like, some even have a view of the bosphorus  Clean, new everything, nicely equipped kitchen, nice bathroom, comfy bed - and a guest bed brought in by housekeeping for my colleague no problem whatsoever. Didnt use the breakfast service since the coffee places nearby are so super nice.  Really looking forward to going back, i feel totally comfortable recommending…", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r143099695", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Fantastic base for a stay in Istanbul", "review": "We were a group of 3 and stayed in one of the Junior Deluxe (1 bedroom) apartments at Galateia Residence. The apartment was very clean, with modern facilities, and more than enough space (around 1000 sq.ft/ 90 sq.m).   Overall: Location - Great location, right next to Istiklal shopping street as well as the Sishane Metro Station. A few mins away from the Galata tower. Going to the old city was also easy, just take the Tunel funicular down to Karakoy and take a tram to Sultanahmet. Taxis were also easy to find at the Tunel square.  Staff - The front office staff were all very helpful and courteous, and made sure our stay in Istanbul was wonderful. The housekeeping staff did a great job every day.  Apartment - The apartment itself was great. The beds were well made and…", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r142671435", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent Location", "review": "Istanbul’s most famous street, pedestrianized Istiklal Caddesi (Independence Avenue), throbs day and night and offers a fantastic array of architectural sights, shops, treats, and throngs upon teeming throngs of people. At the avenue’s northeastern end is expansive Taksim Square, thought by many to be the very heart of the city, with many of Turkey’s most renowned restaurants and some of Europe’s most happening nightlife in close proximity. In striking contrast, Beyoglu’s less trafficked areas – such as the affluent Cihangir and the antiques district of Cukurcuma – exude Old World charm and provide contemplative calm and splendid diversion via an assortment of cozy cafes, attractive boutiques, and quiet lanes.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r141793097", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Perfect homebase for Istanbul", "review": "I arrived last week from my trip to Istanbul and stayed for 5 days at the apartments.  The location is great, the apartments are clean and the staff is very helpful.  Good kitchen, modern bathrooms.  I absolutely recommend it.  My only recommendation is to confirm the restaurants suggested by the staff we had a very unpleasant experience with one of the seafood restaurants under the bridge (Gala Pera) do not go!!!!! I recommend to look up comments before going to any restaurant.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r141708018", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great place", "review": "The Galateia Residence is perfectly located on a quiet side street, just steps away from lively shopping and restaurants on Istiklal Ave.  Staying in Beyoglu is a wise choice for exploring Istanbul, because it is a charming respite away from the crowds and tourist sites in Sultanahmet.  All the Sultanahmet sites are a short cab ride from Galateia.  The apartments are clean, well appointed, and stylishly decorated.  Our apartments (5A and 4A) were extremely spacious and had fantastic views of the city and the Bosphorus.  We were warmly welcomed by the manager Nurhan Gulgez and the wonderful front desk staff - notably Selim and Serhat.  They were always there to greet us with a warm smile and they were ready to assist in any way, from restaurant and sightseeing recommendations,…", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r140811314", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Wonderful Stay!", "review": "If you want a beautiful, quiet apartment with all the amenities in the middle of everything, then stay here.  Staff was great as well.  Location is right in Taksim, a few steps to Istiklal (a huge pedestrian zone) and right near a subway line.  Galata Tower is also nearby.  Overall a highly recommended experience.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r140756620", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "ISTANBUL", "review": "I stayed here last week with a couple of friends.  It was our first time in Turkey and the staff here made us feel welcome!  Location is great.  The accomodations are very modern and very comfortable and clean.  I wished I could move in!  We first stayed on the top floor apartment which was great! Spectacular views of Istanbul! Full kitchen, spacious living room, bedroom, office space and wonderful balcony! Staff was very helpful.  Definitely stay here!!", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r140229774", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "superb", "review": "Istanbul’s most famous street, pedestrianized Istiklal Caddesi (Independence Avenue), throbs day and night and offers a fantastic array of architectural sights, shops, treats, and throngs upon teeming throngs of people. At the avenue’s northeastern end is expansive Taksim Square, thought by many to be the very heart of the city, with many of Turkey’s most renowned restaurants and some of Europe’s most happening nightlife in close proximity. In striking contrast, Beyoglu’s less trafficked areas – such as the affluent Cihangir and the antiques district of Cukurcuma – exude Old World charm and provide contemplative calm and splendid diversion via an assortment of cozy cafes, attractive boutiques, and quiet lanes.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r139964454", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Wedding Guests", "review": "The location is wonderful, near most sights and close to a metro station, with trendy shops and picturesque streets. The apartment was well furnished and nicely decorated and the staff  really friendly and helpful. we loved it and do recommend it wholeheartedly.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r139537186", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "best place to stay in istanbul.", "review": "4 apartments for ourselves and friends from California for our son's wedding during the last 2 weeks of August, 2012. Apartments are clean and modern. Service is excellent. Staff very helpful and knowledgable.They answered all questions with good humor, arranged transport and cleaned the apartment for us. Personally I stayed in the top Bosphorous view one bedroom apartment. The views are spectacular, but the bathroom is quite small. Kitchens are modern and equipped. It is near many bars and restaurants, shops and markets, metro and tunel. We had more space, beautiful views, room to entertain, proximity to metro and Galata Tower and all for less rent that a hotel. A great place to stay.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r138924088", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Sumptuous!", "review": "we stayed in two different rooms at this charming (the real charming, not real estate agent charming) and stylish hotel/apt.  the rooms are smartly decorated, very clean and the staff are extremely helpful.  e.g., getting a turkish sim card was a breeze. reservations with various service providers were reliably made. it is located in the very hilly neighborhood of galata, which means spectacular views, especially if you can afford the penthouse apartment with the balcony and the floor to cieling picture windows.  our stay at this very affordable hotel was a highlight of our trip to istanbul.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r138130283", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Very nice, especially with family.", "review": "We are staying in the duplex apartment 8b and it is truly stylish and beautiful. Designer furnishings and bathrooms.   Would recommend if you fancy a real treat in a quiet location - yet 2 minutes from Istanbul's busiest streets and close to metro and Galata tower. Lots of great designer shops in the area and at night the area has a real vibe", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r137687109", "sub_review": {"Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great stay, friendly staff, beautiful aparment", "review": "Istanbul’s most famous street, pedestrianized Istiklal Caddesi (Independence Avenue), throbs day and night and offers a fantastic array of architectural sights, shops, treats, and throngs upon teeming throngs of people. At the avenue’s northeastern end is expansive Taksim Square, thought by many to be the very heart of the city, with many of Turkey’s most renowned restaurants and some of Europe’s most happening nightlife in close proximity. In striking contrast, Beyoglu’s less trafficked areas – such as the affluent Cihangir and the antiques district of Cukurcuma – exude Old World charm and provide contemplative calm and splendid diversion via an assortment of cozy cafes, attractive boutiques, and quiet lanes.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r137533495", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great place!", "review": "My family of 4 stayed for one week at the Galateia Residence and we were all very happy with our experience. The staff was attentive and friendly, the location was great, and the apartment itself was well decorated and spacious. The only reason I am not giving an \"Excellent\" rating is because of 2 things:  1. It was VERY difficult to find via taxi. Do not expect airport taxi drivers to have any clue where this place is. Getting from Ataturk airport to the residence was the most stressful and unpleasant part of our trip. We ended up having to get out of the taxi in some other part of Beyoglu, in front of a \"Galata Residence\" (there are 3 or 4 hotels/apartments in the same neighborhood with some variation of Galata in the name) and walk with our heavy bags to the right place.…", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r137334717", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Excellent choice for families", "review": "My husband and two daughters and I stayed at the Galateia Residence for 3 nights before going sailing in the south. it was excellent on all accounts - clean, spacious (huge actually), great location - and most of all the staff went beyond expectations to help us find restaurants, shops, taxis, etc. Truly one of the most enjoyable and comfortable \"hotel\" experiences we have ever had. and we travel constantly!", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r136904892", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Incredible service, wonderful rooms...I want to stay there every time", "review": "We stayed in the mezzanine duplex apartment which was the most spacious choice for our family reunion. Our group ranged 0-80 yrs in age arrived on two separate flights at Ata Turk and Sabiha airports, and were all picked up on time by the transport arranged by the hotel. The residence appeared to be fit for all of us! There were two bed rooms and a third double sofa bed in the living room. The self-catering facilities were adequate for cooking any food, and easy access to Istiklal street made shopping, eating and entertainment absolutely easy and fun. All the staff were exceptionally kind and helpful by global standards, specially Nurhan who helped us book transits with spacious and luxury minivans and tours a few times. He even kindly called several pharmacies in town to find…", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r136878290", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Perfect", "review": "The location is great, with a friendly staff, and great views in the upper rooms. While somewhat difficult to get to by taxi, the location couldn't be more convenient, yet not on the main noisy pedestrian street. Just up the narrow road is one of the most popular pedestrian streets, just down the road is Galata tower. The beds were very comfortable, and having a kitchenette was a great thing. Even in the smaller apartment, there was room for a rollaway bed, so it can easily accommodate 3 or more people. We stayed in the penthouse one night, and it may have been one of the most beautiful views I've ever experienced. 360 degrees of views from Beyoglu.", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r136849686", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Amazing honeymoon stay! We wished we could have stayed longer", "review": "Istanbul’s most famous street, pedestrianized Istiklal Caddesi (Independence Avenue), throbs day and night and offers a fantastic array of architectural sights, shops, treats, and throngs upon teeming throngs of people. At the avenue’s northeastern end is expansive Taksim Square, thought by many to be the very heart of the city, with many of Turkey’s most renowned restaurants and some of Europe’s most happening nightlife in close proximity. In striking contrast, Beyoglu’s less trafficked areas – such as the affluent Cihangir and the antiques district of Cukurcuma – exude Old World charm and provide contemplative calm and splendid diversion via an assortment of cozy cafes, attractive boutiques, and quiet lanes.", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r136776964", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "amazing hotel apartments with amazing staff", "review": "My wife and I stayed at Galateia Residence (in trendy Beygolu) the first night of our honeymoon.    Though our taxi (45 minute ride in traffic) had some difficulty finding the hotel, the front desk staff graciously met us 1/2 block away and assisted us to the hotel.  Upon checking in, we were informed we had received a complimentary upgrade to a larger apartment on a higher floor. The apartment was splendid and spacious - living room, den, full kitchen, 1 1/2 bathrooms (master had a Jacuzzi), and a lovely bedroom with views of the Bosporus. The hotel is very well located -- it's a half block from the vibrant Istikal Caddesi, but secluded enough that the street noise is non-existent. There are numerous good restaurants and bars nearby, as well as multiple public transit options…", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r135947617", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Home away from home", "review": "we stayed in this hotel for a total of 8 nights, we really enjoyed our stay, i would give a 10 for the very kind staff.. they are very helpful and always happy to help and assist you and give you the best way to go to your destination  the apartment has a great kitche with dish washer and it really helps us as we are 6 people so it was really cheaper for us to use the kitchen facilities to save some money + restaurants are very expensive in istanbul so you really need that kitchen   i would definitly stay there again if i visited istanbl again and i would defo recommend this hotel to my friends  Sultan :)", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r135309183", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "My home in Istanbul", "review": "We just returned from a 6 day stay at the Galateia. As a family with young kids, we were looking for a serviced apartment that gave us more space than a hotel and also the option to self-cater if required. The Galateia turned out to be the perfect choice. Large well-appointed rooms, tasteful interiors, a fully functioning kitchen, comfortable bedding, efficient housekeeping, wi-fi, in short-all the comforts of home. Nurhan and her staff are welcoming and always ready to help. In addition, the Galateia is situated in the Beyoglu area which is full of quirky shops and cafes, just walking around teh streets gives you a taste of everyday life here. The Galateia is the perfect base from which to explore the magical city of istanbul. We will be back!", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r134770734", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Excellent", "review": "I have now stayed with my friends at Galateia Residence three times in the last three years, and it has most definitely become my home in Istanbul.  The staff are wonderfully helpful.  The location is perfect - for wandering the streets of Tunel - as well as for convenience and transport to other locations around the wonderful city of Istanbul.  The apartments are spacious, well maintained and functional.  During my most recent visit I has the privilege of staying in the top floor apartment, with the most magnificent views across the Bosphorous to Topkapi, Aya Sofia and the Blue Mosque.  Just beautiful.  I look forward to my next visit... sadly probably not until next year! But don't wait for me..... D", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r134647128", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "3 nights in a wonderful apartment and great staff", "review": "Istanbul’s most famous street, pedestrianized Istiklal Caddesi (Independence Avenue), throbs day and night and offers a fantastic array of architectural sights, shops, treats, and throngs upon teeming throngs of people. At the avenue’s northeastern end is expansive Taksim Square, thought by many to be the very heart of the city, with many of Turkey’s most renowned restaurants and some of Europe’s most happening nightlife in close proximity. In striking contrast, Beyoglu’s less trafficked areas – such as the affluent Cihangir and the antiques district of Cukurcuma – exude Old World charm and provide contemplative calm and splendid diversion via an assortment of cozy cafes, attractive boutiques, and quiet lanes.", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r134425480", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Convenient, quiet, spacious - throughly delightful", "review": "me my waif and two children and an infant just stayed in galateia. we loved our stay and would differently come back again. the apartment: is very clean and luxurious the bed is so big the ac is excellent .... you would just love every detail of it and it would differently be better then a hotel stay by faaaaar. the staff: Nurhan, serhat and yehea are incredibly worm and genteel people and are very welcoming. they well go out of their way to help!!. they will bring you in when you are lost a specially the first time. give you recommendation and take care of your needs......if any. the location : is suburb as it is 30 steps from istiklal street, the main shooing and activity center. and is very close to a metro station that well take you to other areas,", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r134228128", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Fantastic location, fantastic apartment, fantastic staff!", "review": "We stayed at the Galateia Residence at the tale end of a three week trip to Turkey.  We wanted to rest up for a few days before moving on.  It consists of two adjoining buildings on a steep cobblestone street right at the bottom of Istiklal Caddesi (main shopping street in the new part of the city) in an incredibly convenient and scenic location.  This hotel does not have ordinary rooms, but gigantic, fully equipped apartments with wifi, large flat screen TVs, a fully equipped and spacious kitchen and, in our case, a spectacular bedroom and master bath with views of the city and Bosporus.  Only the top floors with 2BR apartments have the great views.  The decor is modern and sophisticated and the bed comfortable.     The hotel is lightly staffed with one person at all times but…", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r133980901", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Home away from home!", "review": "We arrived late at night and the night porter was there to meet us and carry our bags to the hotel which was a lovely welcome.  The apartment was lovely, the bed ENORMOUS and the shower and bath absolutely divine.  If you like massive showers, you will love this place!  Also, if you have been walking around Istanbul for 9 hours you will appreciate an amazing shower!  It's ideally located in Beyoglu which is a fantastic location, the metro is about 50 metres up the street as is the funicular railway (tunel) down to the tramway to get you to all the main sights.  The shopping district is at the end of the street and there are little corner shops dotted around for all the supplies you might need.   The staff were great and extremely helpful, Nurhan and Gagri were fab and Serhat was…", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r132910573", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Fabulous apartment,value for money!!!", "review": "We enjoyed a wonderful stay at the Galatiea Residence - staying in the one bedroom Premium Apartment (5a) with 2 young children (8 and 5). Apartment was huge and had a great panoramic views over the Posphorus and the Golden Horn. We loved the furnished balcony and its charming view. Supurb air cond system and free super fast free Wifi internet access. All the staff are courteous and friendly. Ideally located a stone's throw from the lovely Istiklal street and the metro station, and all attractions are a short taxi ride away. The in-room breakfast was excellent and perfect. We are already looking forward to our next trip back to Istanbul and shall be staying at the Galatiea Residence again.", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r132414984", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Contemporary and spacious", "review": "Istanbul’s most famous street, pedestrianized Istiklal Caddesi (Independence Avenue), throbs day and night and offers a fantastic array of architectural sights, shops, treats, and throngs upon teeming throngs of people. At the avenue’s northeastern end is expansive Taksim Square, thought by many to be the very heart of the city, with many of Turkey’s most renowned restaurants and some of Europe’s most happening nightlife in close proximity. In striking contrast, Beyoglu’s less trafficked areas – such as the affluent Cihangir and the antiques district of Cukurcuma – exude Old World charm and provide contemplative calm and splendid diversion via an assortment of cozy cafes, attractive boutiques, and quiet lanes.", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r132181962", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Really beautiful apartment, fantastic view and location, well priced:  really extraordinary accommodations. ", "review": "Since Istanbul is so large, we stayed at two hotels during our trip to get a sense of different neighbourhoods. Galateia Residence is more like a spacious apartment than a hotel. Our place included a den with extra bed, a huge master bedroom, enormous closets, a fully outfitted kitchen, and a living/dining room, all beautifully decorated. We even had satellite TV and thanks to jetlag I got to watch a Stanley Cup final game at 5 am, which is my Canadian duty. The front desk was friendly and helpful, perhaps better suited to independent travellers who like privacy rather than hand-holding.  The Beyoglu neighbourhood is fantastic, not touristy, just full of people strolling and shopping along the Istiklal Cadessi pedestrian mall. Lots of amazing restaurants in the area, especially…", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r131786770", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Perfect place, perfect location in Istanbul", "review": "We were stunned at how attractive and gracious apartment A4 was, and how spacious. The photos on the web site don't completely convey the quality and beauty of the place. A4 includes a sitting / dining room, kitchen, main bedroom and very large ensuite bathroom, a guest bathroom, and second bedroom. This flat is located on the fourth of the five floors in the building, and the master bedroom and bathroom open to dramatic views of the Bosphorus and the Old City. The nightly rate is extremely reasonable given how much space and grace is offered in the suite. The only challenge is that it is so attractive and comfortable that one feels torn going off to sightsee; or rather, what a very pleasant home base during a busy day.   The location is excellent, just around the corner from…", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r130502121", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Mix experience", "review": "My husband and I and 2 others had a wonderful stay here. We loved the location in the Beyoglu area. It was close to the walking street Istiklal, but not too close so it was quiet at night. Close to the Tunel and metro which will take you down to the old city and many other locations. The service was truly first rate and genuine. We loved it here. ", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r130227929", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Very nice appartment", "review": "We stayed there for four night in duplex apartment .apartmet was very good .location also good . But In our full stay elevator was not working and also last day their is a problem with hot water .As we were check out reception people ask us to pay for damage in our kitchen platform crack.we ask our chefe about that and it was there when we check in it might be become bigger their we are not sure and we paid 100 euro extra for that so please check apartment when you check in and saw them if you find any damage . Staff was good and helpful .we had two apartment and for one apartment they allow us to check out at 4 pm .That was good . We enjoyed our stay but there is a small small problems so it was mix experience. Don't forgot to check your apartment while ch in and saw them if…", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r129851716", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Fantastic", "review": "Istanbul’s most famous street, pedestrianized Istiklal Caddesi (Independence Avenue), throbs day and night and offers a fantastic array of architectural sights, shops, treats, and throngs upon teeming throngs of people. At the avenue’s northeastern end is expansive Taksim Square, thought by many to be the very heart of the city, with many of Turkey’s most renowned restaurants and some of Europe’s most happening nightlife in close proximity. In striking contrast, Beyoglu’s less trafficked areas – such as the affluent Cihangir and the antiques district of Cukurcuma – exude Old World charm and provide contemplative calm and splendid diversion via an assortment of cozy cafes, attractive boutiques, and quiet lanes.", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r128165697", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent Hotel", "review": "We have just returned from Galateia Residence and are already wanting to return. The appartments are beautifully furnished and are immaculate. They are also spacious and comfortable. The location is perfect for visiting all of Istanbul with excellent dining and shopping within walking distance. Staff are wonderful and nothing is too much trouble and you are always greeted with a smile. We will be back to visit Istanbul and will certainly be staying at the Galateia Residence.", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r128097019", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "So wonderful, we are already planning on returning to Galateia Residence!!", "review": "This is an excellent hotel and the apartments are very well decorated and maintained.  We rented two apartments (one two bedroom and another one bedroom) for our family stay.  The woman who works at the front desk every morning is lovely and was so incredibly helpful. I wish I could remember her name.  She helped us book the whirling dervish show and the bosphorus cruise.    The kitchens were well stocked with supplies and the fridge even doubled as a mini bar.  We had some maid service every day but sometimes the towels were not changed and even though the sheets are supposed to be changed every other day, it did not appear that way.  (This is why I am giving the hotel 4 stars.)  The fellow at the front desk in the evening was also helpful with our luggage too.  They do allow…", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r127948410", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "best ratio quality/price", "review": "We (myself, husband and our 2 children ages 10 and 15 years old) just returned to New York City after staying 8 nights at Istanbul's wonderful Galateia Residence. We rented the 2 bedroom, 2 bath, 4th floor flat which had a great view of the Bosphorus from the master bedroom and ensuite bathroom. The flat was very roomy, clean and comfortable, and had a well equipped kitchen allowing us to eat breakfast in daily, (and prepare lunch or dinner had we wanted to.) After a marathon day of sightseeing, we were all so happy to return to our \"home\" at Galateia Residence every evening.   The location of the flat was perfect for our needs. We took the tram most days to the sights in the Old City, but if one were super-motivated, you could walk down the hill and across the Galata bridge to…", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r127645739", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great place, great staff, great location!", "review": "friendlly and helpfull staff, fluent in english, and ready to quicklly fix any trouble or fullfill a request. Just that was worth the expense, but you get on top a huge apartment, spotless clean, modern and most comfortable. You can go to a hotel in the old town and squeeze yourself in a 12 square meters old room, or you can go to Galateia and get 90 square meters of heated floors and a 2x2 meters latex bed, just next to a whole mile of car free shops and restaurants in neoclasical buildings; the choice is yours.", "date": "March 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r127502798", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent location, modern and well equipped.", "review": "Istanbul’s most famous street, pedestrianized Istiklal Caddesi (Independence Avenue), throbs day and night and offers a fantastic array of architectural sights, shops, treats, and throngs upon teeming throngs of people. At the avenue’s northeastern end is expansive Taksim Square, thought by many to be the very heart of the city, with many of Turkey’s most renowned restaurants and some of Europe’s most happening nightlife in close proximity. In striking contrast, Beyoglu’s less trafficked areas – such as the affluent Cihangir and the antiques district of Cukurcuma – exude Old World charm and provide contemplative calm and splendid diversion via an assortment of cozy cafes, attractive boutiques, and quiet lanes.", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r127436079", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Very spacious and modern.  Good location for new Istanbul", "review": "Galateia is wonderfull located, close to Galata Tower and to metro and tram stations. Although Istikal street is just up the street the place is quiet. There are a lot of shops and restaurants in the neighbourhood but only small places to buy food so cooking a real meal is not easy. WI-FI internet works everywere and the bathroom is not only modern and spacious but very confortable.", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r127394941", "sub_review": {"Value": 5, "Location": 4, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Epic Location!", "review": "In a very quiet street but Tunel tram station is only a minute of walk away.  No taxi driver can find the whereabouts of the street but u can ask for Tunel station and just walk a bit if u hv no luggage.  But your main visit will be mainly Old istanbul.  This hotel is less convenient.  The room (apartment) is very spacious and very clean.  Some rooms are in renovation too so they are now newly refurbished.  The kitchen comes with everything u need for cooking and dining. The service is almost wonderful except they left behind a top did not belong to us in our laundry and gave us a shopping bag did not belong to us when we left.  That was a bit worrying.  Otherwise, their service is perfect.", "date": "March 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r126882035", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Super nice/clean, good location, excellent service", "review": "Although there were some initial bumps with our reservations, the staff at the Galateia Residence went above and beyond to make sure we felt welcomed and all issues were resolved. As with the pictures posted up of the place, they do not do it justice. The space is modern, comfortable, and new (the shower is great!). It's also, in my opinion, in the best location possible. The metro station is literally right up the street and you're super close to the tram that takes you to Sultanahmet and the older areas (which I wouldn't stay in for the fact that it's way too crowded there and hard to get in and out if you need to take a taxi). Istiklal, one of the liveliest places in Istanbul, with shops, restaurants, and amazing night life also feels right outside the building as it's so…", "date": "February 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r124287232", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "centre of istanbul", "review": "Super nice/clean, good location, excellent service, good price. It's my second time in Istanbul and I strongly recommend Galateia residence > i think it's hard to find better.", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r124068674", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Ammmmmaaaaaaazing!", "review": "Istanbul’s most famous street, pedestrianized Istiklal Caddesi (Independence Avenue), throbs day and night and offers a fantastic array of architectural sights, shops, treats, and throngs upon teeming throngs of people. At the avenue’s northeastern end is expansive Taksim Square, thought by many to be the very heart of the city, with many of Turkey’s most renowned restaurants and some of Europe’s most happening nightlife in close proximity. In striking contrast, Beyoglu’s less trafficked areas – such as the affluent Cihangir and the antiques district of Cukurcuma – exude Old World charm and provide contemplative calm and splendid diversion via an assortment of cozy cafes, attractive boutiques, and quiet lanes.", "date": "January 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r123702716", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Great apartments in Istanbul", "review": "If you want to stay in best place in Istanbul you MUST choose this apartment!!!! Everything that you will need - view, location, helpful stuff, and more and more!", "date": "November 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r120349852", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 5}, {"title": "Great location and fantastic staff", "review": "The rooms are clean, well furnished, quite, spacious with a good location (a few meters from the metro station and istiklal road) & value was great. I look forward to staying there next time I visit Istanbul.", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r117793634", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent place to stay while visiting Istanbul!", "review": "We stayed eight nights at the Galateia Residence and had a wonderful time. The location is fantastic – in walking distance to Istiklal shopping street, Tünel square (with many nice restaurants, coffee places and small design shops) and the Galata Tower. Furthermore Şişhane metro station and Tünel funicular are just a stone’s throw away. Our apartment was located on the first floor. It was very clean, modern and spacious, had nice furniture and was well equipped. Cleaning service took place daily. There is a small fitness room in the building containing a treadmill, a bicycle and a rowing machine. We also had the chance to see the top floor apartment, which has a great city and Bosporus view but is of course more expensive than the apartment we rented. Particularly worth…", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r117582618", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Perfect stay", "review": "We had a fabulous holiday in Istanbul. It was such a surprise – a very modern city with so much to see and do.  And the Galateia was the perfect choice for a hotel.  It is in a great neighborhood with lots of good restaurants.  We really liked having the extra space to relax in. As stated other reviews, it is very spacious, modern, clean and the staff is very friendly.  All other comments are true!  We will definitely stay here on our next visit to Istanbul.  http://donaldandcathy.typepad.com/donald_and_cathys_europea/2011/05/istanbul-turkey-a-real-surprise.html   We agree with the last review - let them arrange your pickup from the airport.", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r117028678", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Amazing views of the Bosphorus and very helpful staff", "review": "Istanbul’s most famous street, pedestrianized Istiklal Caddesi (Independence Avenue), throbs day and night and offers a fantastic array of architectural sights, shops, treats, and throngs upon teeming throngs of people. At the avenue’s northeastern end is expansive Taksim Square, thought by many to be the very heart of the city, with many of Turkey’s most renowned restaurants and some of Europe’s most happening nightlife in close proximity. In striking contrast, Beyoglu’s less trafficked areas – such as the affluent Cihangir and the antiques district of Cukurcuma – exude Old World charm and provide contemplative calm and splendid diversion via an assortment of cozy cafes, attractive boutiques, and quiet lanes.", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r115000747", "sub_review": {"Value": 4, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Perfect accomodation if you look for the best location and the best views", "review": "Our apartment was on the 5th floor, with a living room, king bedroom, one and a half baths, a kitchen and a pull out twin bed tucked in a chair.  The view took our breath away, and it was very nice to have a living room.  We wouldn't  recommend cooking, as the supermarket is a serious hike away.  The location is great, near where Tunel comes into Istiklal Caddessi.  It is down a steep hill from there, so not great for anyone disabled.  Our taxi couldn't find it, so we called the hotel from Tunel, and the staff came up and got our bags, and took them down for us.  The 4th floor may have equally nice views, but I think the view is blocked on the 3rd floor.   The staff were always very helpful.", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r114620111", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Absolutely worth the money!All rooms are somewhat spectacular or at least surprisingly cozy!", "review": "If you are looking for a peaceful, modern and cool apartment with the best views of the city, you must to book it.  My wife and I booked it for our honeymoon and it was one of the best choose we did... apart of the fact of visiting this amazing city.  The staff was always worried about us and they gave us nice tips.  Located in the city center, not the historical one but the real one. Walking distance to the most highlighted places you can visit, and one minute to the metro station.", "date": "November 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r114607853", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Felt like home!", "review": "We particularly liked the discreet and prompt approach. Especially when the taxi driver did not know how to get us there (pedestrian area) the manager Mr Kukul met us personally where we were dropped. He and his staff went to all length to make our trip to Istanbul a smooth and relaxing experience! We had plenty of requests and wishes as this trip was a semi business affair! Efficient, friendly and flexible! Our expectations were exceeded!  We usually stay at five star hotels for impeccable service! This residence is a seamless and most pleasurable treat for all occasions that take you to this wonderful city where staff recommendations are crucial! Thank you Mr Kukul and your very helpful and cheerful staff!", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r114502842", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "A Perfect Apartment in A Great City", "review": "We travalled in a group of 4 girls and felt very safe and well accomodated. The Galateia is in a perfect location, the metro and \"tunel\" station is right in front of it. Best to start to the most sightseeing spots in Istanbul. It is located in a side street of the famous Istiklal street on which you can spend hours with shopping, eating, in galeries or pubs or you only listen to various street musicians. The appartments are fitted out very tasteful and are very comfortable. As it is in a side street it is also very quite. For people who do sports addiotionally to the hours of walking around I would recommend to use the steps in the metro instead of the fitness room - this one is not really big and not very well equipped. First hotel that made me say (during my visist there): \"I…", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r114245739", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Amazing Residence with Two Serhats.", "review": "Istanbul’s most famous street, pedestrianized Istiklal Caddesi (Independence Avenue), throbs day and night and offers a fantastic array of architectural sights, shops, treats, and throngs upon teeming throngs of people. At the avenue’s northeastern end is expansive Taksim Square, thought by many to be the very heart of the city, with many of Turkey’s most renowned restaurants and some of Europe’s most happening nightlife in close proximity. In striking contrast, Beyoglu’s less trafficked areas – such as the affluent Cihangir and the antiques district of Cukurcuma – exude Old World charm and provide contemplative calm and splendid diversion via an assortment of cozy cafes, attractive boutiques, and quiet lanes.", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r107575245", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A home away from home.", "review": "Impressed by the location. It is in the very center of every place to be and it is really in silence. If you compare with hotels in Sultanahmet, with this residence  you can feel Istanbul inside. Also the concierge service is working like a charm. They advised really great night clubs and so many great tours which we recommend other guests... I would like to say thanks these two guys in the same name of Serhats :) Sı vous passez  a Istanbul venez ici sans aucune hesitation !", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r105977168", "sub_review": {"Value": 4, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Excellent location and accomodation", "review": "Our family had a wonderful time in Istanbul and this was due in no small part to the wonderful apartment we stayed in at Galeteia Residence. We were in a two bedroom/two floor apartment which was clean and nicely furnished with a small kitchen but all the rooms were huge. The views over the Bosphorous were fantastic. The staff at the residence were brilliant and could not do enough for us. My kids (aged 8,14,16) all thought it was one of the best places we have ever stayed in which says a lot considering there was no free breakfast or pool. A great city and a great place to stay. Looking forward to going back soon.", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r105949539", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Absolutely brilliant! Don't stay anywhere else.", "review": "Located close to Galata Tower and the main shopping street-Ishtakal Caddesi. GR is down a side street - about 50 yards- so it was quiet but handy for shopping and eating out.", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r105131335", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "that was the best residence ever!", "review": "I've just spent 9 nights at Galateia Residence and I loved it. I'm a global traveller for business and pleasure and I'm fussy when it comes to the value for money equation. Suffice it to say that my expectations were exceeded (doesn't happen often, let me tell you) by this place. Great location just off busy Istiklal Caddesi in Beyoglu but still very quiet. I had a huge apartment which became my retreat after the hustle and bustle of traipsing around the tourist haunts of Istanbul. The ability to self cater was important - I bought all sorts of yummy mezes from Namli Gurme down on the river (or at the spice market) bought some  nice wine from the small shop down the hill and loved the whole experience.   The staff at Galateia are wonderful: friendly and helpful.   There are…", "date": "March 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r101757126", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "You should stay here", "review": "Istanbul’s most famous street, pedestrianized Istiklal Caddesi (Independence Avenue), throbs day and night and offers a fantastic array of architectural sights, shops, treats, and throngs upon teeming throngs of people. At the avenue’s northeastern end is expansive Taksim Square, thought by many to be the very heart of the city, with many of Turkey’s most renowned restaurants and some of Europe’s most happening nightlife in close proximity. In striking contrast, Beyoglu’s less trafficked areas – such as the affluent Cihangir and the antiques district of Cukurcuma – exude Old World charm and provide contemplative calm and splendid diversion via an assortment of cozy cafes, attractive boutiques, and quiet lanes.", "date": "February 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r101557049", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great location with the services of a hotel and the privacy of self catering", "review": "One of the most pleasant surprise on our frequent holidays, even i read very good reviews and saw nice photos of the place.  First of all, its a place where every detail is carefully decided and i like the place where you see the management put a lot of effort to maintain the standard, so you feel good paying value-for-money place. Location could not be better, in a small, quite street and still very central. Stuff very helpful. You have all apartment for yourself, very modern, clean, comfy bed, very elegant building. Definitely, we will come back again!", "date": "March 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r101141597", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Exotic Romance In Turkey", "review": "We were 5 friends meeting in Istanbul for a few days of relax, culture and fun. The first great surprise we got when we arrived in Galateia Residence is that they offered us an upgrade from the Deluxe Apartment to the Superior Bosphorus Apartment with such an amazing view... We were delighted! The pictures on their website show pretty much the apartment as it is... Modern, bright, clean, comfortable and spacious... The bathrooms were too and the shower was amazing! The situation of the apartments is very convenient. One minute walk to Istiklal Caddesi and Galata Tower, in the vicinity of trendy shops, bars and restaurants and around the corner to more traditional streets too. A very nice walk to Sultanahmet in the mornings/sunset crossing the Golden Horne along Galata Brigde.…", "date": "March 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r100297102", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "very impressive view", "review": "Looking for a romantic getaway in Istanbul? Look no further. This place is the answer to your dreams. I've been living and working abroad and my husband and i had one week together. We chose the Galateia Residence. Our every need was met. The apartment was huge, the bed soft and luxurious and the bathtub long, deep and delightful. It is near public transport, shopping and clubs yet it is tucked away for a quiet, private stay. I dream of going back!", "date": "January 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r99155505", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "do you want to feel like a princess?", "review": "The hotel has very nice view you can see the bosphorus and old İstanbul.  It is very clean and best thing very near to the night life of İstanbul. (Taksim)", "date": "February 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r96942595", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Perfect place", "review": "Istanbul’s most famous street, pedestrianized Istiklal Caddesi (Independence Avenue), throbs day and night and offers a fantastic array of architectural sights, shops, treats, and throngs upon teeming throngs of people. At the avenue’s northeastern end is expansive Taksim Square, thought by many to be the very heart of the city, with many of Turkey’s most renowned restaurants and some of Europe’s most happening nightlife in close proximity. In striking contrast, Beyoglu’s less trafficked areas – such as the affluent Cihangir and the antiques district of Cukurcuma – exude Old World charm and provide contemplative calm and splendid diversion via an assortment of cozy cafes, attractive boutiques, and quiet lanes.", "date": "January 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r94216990", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Great location, clean apartment, helpful staff", "review": "We stay in: - Superior Apartment - very convenient , - Bosphorus Duplex Apartment -  Spacious, - Superior Bosphorus Apartment - beautiful view.  Each has its charms.", "date": "January 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r93841158", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Galateia home from home", "review": "Apartment very quiet and in good location - near Galeta area which is very trendy.  Staff were very helpful especially as I had my wallet stolen in Istanbul - receptionist arranged for wallet to be delivered at hotel after it being found by someone in another location.", "date": "November 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r93725098", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Really great place to stay, especially with a group of friends", "review": "We chanced upon these serviced apartments while looking for a long term residence & loved it so much we stayed nearly  3 months.Perfectly located & appointed for self catering when your jaded from regular hotels. This is better than a 5 star hotel & has much more in room comfort .The front of house staff & management are outstanding & helpful in every way. The housekeeping also some of the best we've experienced anywhere in the world & we've been travelling & living in hotels for over 12 months.will be returning soon", "date": "December 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r91812627", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "ok but not value for money", "review": "We were really please with our stay at Galateia Residence. We stayed over the boxing day/new years eve period with friends (so total of two couples). The main bedroom had a HUGE bed and really comfortable. The second room which was the business room they changed into a bedroom with a fold out bed. Our friends stayed in this room and said the bed was surprisingly comfortable. It was an excellent type of room for us as both couples had the privacy of their own room as well as being able to spend time with each other in the living room and kitchen.   We used the kitchen a lot not only to save money but to also be able to enjoy the fresh fish and vegetables available in the markets. Probably one of our best dining experiences was in our own apartment!!!  The cleaner was lovely and…", "date": "October 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r86826504", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Perfect Location, Attentive and Personalized Service", "review": "Istanbul’s most famous street, pedestrianized Istiklal Caddesi (Independence Avenue), throbs day and night and offers a fantastic array of architectural sights, shops, treats, and throngs upon teeming throngs of people. At the avenue’s northeastern end is expansive Taksim Square, thought by many to be the very heart of the city, with many of Turkey’s most renowned restaurants and some of Europe’s most happening nightlife in close proximity. In striking contrast, Beyoglu’s less trafficked areas – such as the affluent Cihangir and the antiques district of Cukurcuma – exude Old World charm and provide contemplative calm and splendid diversion via an assortment of cozy cafes, attractive boutiques, and quiet lanes.", "date": "October 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r86113872", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "One of the best hotels we've ever enjoyed", "review": "My husband and I recently did a multi city trip throughout Europe for our anniversary and chose Istanbul as our destination for 5 days. We were a bit surprised to see how expensive hotels in Istanbul were and stumbled upon this apartment style hotel in Turkey Travel Planner. What a great find!  To be as accurate as possible, I will say we did start off a bit rocky because the service we used from Backpackers International transportation could not find this place. The hotel can be hard for some taxis/drivers to find so you MUST indicate to them to take you to the top of Tunel at Istikal and drive down by the Swedish embassy.   If you choose Galateia, I recommend getting very detailed directions from them to have ready for your cabdriver before you arrive.  The location is SO…", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r85323903", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A spotless haven in Istanbul", "review": "We travel a lot: Our trip to Istanbul this summer was part of a four-month tour of the U.S. and Europe. So, when I write this is one of the best hotels we've ever enjoyed, I'm saying a lot.  More than a hotel, Galateia Residence is a small apartment building run as a hotel. We stayed in two of Galateia's apartments during the two weeks we spent there during our visit to Istanbul. Both units were finished beautifully, with modern, fully stocked kitchens. The beds were exceptionally comfortable. They were quiet.  The location was terrific: just steps from Istanbul's major entertainment boulevard -- -- Istiklal Avenue -- as well as a subway stop, and a funicular that takes you to other transportation links to major mosques and other tourist sites.  Views from our top-floor…", "date": "October 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r85192709", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Superbly located apartments", "review": "After a terrible start in other accommodation, which we managed to flee after great difficulty, we were so grateful to find this refuge in Istanbul.    Professionally managed and well run, our every wish was accommodated by courteous and polite staff.  'Yes' was the answer to every question.  The apartment was bright and spacious, spotless and lovely to come home to in the evenings after sightseeing.   I would highly recommend the Galateia residence to anyone seeking a Sultanahmet alternative.  Terrific location just off the Istiklal Caddesi....short walk to Tunel (this is important).   Some flats offer Bosphorus views!        Tip:   bought the freshest fish under the Galata Bridge and prepared it in the apt.    Great fun!", "date": "October 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r85042644", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "The perfect place for business and pleausure", "review": "The apartments are very well located on a quiet , traffic free, street in the heart of Beyoglu, there's an excellent array of shops and restaurants within a 5 minute walk, the Metro and the Tunel funicular are just round the corner and Sultanhamet can be easily reached by public transport.  The apartments are furnished to a high standard with large, comfortable beds and very adequate kitchens and living space.  Staff were particularly helpful and friendly and airport transfers can be arranged.  I have visited this lovely city several times both for business and leisure purposes and would wholeheartedly recommend the apartments for either purpose.", "date": "October 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r84903370", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Very comfortable hotel in an excellent location", "review": "Istanbul’s most famous street, pedestrianized Istiklal Caddesi (Independence Avenue), throbs day and night and offers a fantastic array of architectural sights, shops, treats, and throngs upon teeming throngs of people. At the avenue’s northeastern end is expansive Taksim Square, thought by many to be the very heart of the city, with many of Turkey’s most renowned restaurants and some of Europe’s most happening nightlife in close proximity. In striking contrast, Beyoglu’s less trafficked areas – such as the affluent Cihangir and the antiques district of Cukurcuma – exude Old World charm and provide contemplative calm and splendid diversion via an assortment of cozy cafes, attractive boutiques, and quiet lanes.", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r84547468", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Much needed bit of luxury and space...", "review": "We had an excellent stay at this hotel.  Summary:  LOCATION:  Very convenient.  Half block from Istikal where there are lots of shops and restaurants.  Situated on a very quiet street.  5 min walk to Galata Tower.  2 min walk to the funicular.  Overall excellent location.  ROOMS:  Very modern and comfortable.  Our room had a large living room, dining area, kitchen (fully equipped), two bathrooms and one bedroom.  There was also free WIFI in the room.  The room was clean and of an excellent standard.  The only small negative is that there were no small soaps/shampoos etc.  Just a large wall dispenser by the sink and in the shower.  STAFF:  Everyone was very friendly and helpful.   The front-desk personnel gave us excellent tips re: restaurants and made bookings for us.  Being a…", "date": "October 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r83927093", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "An elegant home away from home.", "review": "We arrived at the hotel having lost our luggage and we were thrilled to find our apartment was so clean, spacious, light and luxurious. The staff were very helpful with great tips on where to eat, shop and sightsee. They were also helpful with our search for our luggage. I enjoy windows and views so we were very pleased with so many windows and balconies in each room of the apartment! The heating was ideal, shower and bathroom huge and immaculate, kitchen modern with appropriate equipment. All in a gorgeous old building.", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r81608374", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Affordable Luxury", "review": "Staying at the Galateia Residences was a complete pleasure. The suite was very spacious and chic and we felt that we could say for weeks without being bored of it. We advise you to choose a room with a view of the Bosphorus as it was mesmerizing. For families this is a much better option than a hotel.  The location was brilliant, close to everything but yet quiet and exclusive. We highly recommend it.", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r80417896", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "This is a Wonderful Hotel!", "review": "We booked into the Galateia for 1 night for our anniversary after changing our plans (our original hotel had no rooms left). We couldn't have been happier with the outcome. We arrived very early but our apartment was ready and we had been upgraded foc. The staff were extremely pleasant and helpful. They more than exceeded my expectations when insisting that the wine and chocolate cakes I had ordered as a surprise for my wife, would be complimentary for our annivesary.  Anyway, back to the hotel. The apartment was huge, very plush and just staying there made you feel very special. Highly specified fixtures and fittings throughout. The bed was the most comfortable we have slept in, in a long while in a hotel, and all the linen and towels felt luxurious. Kitchen and Living Room…", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r80150964", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Perfect Location in Istanbul", "review": "Istanbul’s most famous street, pedestrianized Istiklal Caddesi (Independence Avenue), throbs day and night and offers a fantastic array of architectural sights, shops, treats, and throngs upon teeming throngs of people. At the avenue’s northeastern end is expansive Taksim Square, thought by many to be the very heart of the city, with many of Turkey’s most renowned restaurants and some of Europe’s most happening nightlife in close proximity. In striking contrast, Beyoglu’s less trafficked areas – such as the affluent Cihangir and the antiques district of Cukurcuma – exude Old World charm and provide contemplative calm and splendid diversion via an assortment of cozy cafes, attractive boutiques, and quiet lanes.", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r79783441", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "If you are looking for a spacious place in the middle of Istanbul", "review": "We spent four days at the Galateia Residence and although we only booked a junior suite we were upgraded to the top floor apartment!  The views of the Bosphorus were amazing and it was nice to have a terrace.  The location is great, its right off of Istiklal Caddesi but you don't get any of the noise however it is hard for cabs to find.  Plus: - comfortable bed - great soaps (Molton Brown) - staff is super friendly and helpful, provided an umbrella and allowed a late check-out - easy to get to Sultanahmet via tram - good restaurants/bars are super close - good internet service - apartment features but service of a hotel  To address a previous poster's comments, we had no issue with room service waking us up and we slept in late a couple of the days.  The shades/curtains in the…", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r77514425", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good, but far from excellence", "review": "Then Galateia Residence is the right place for you. All apartment categories are spacious, clean and have all technical features you will ned for your stay. If you want a view and real luxury you should go for the superior appartments. The others might not have a view. Concerning the breakfast you do not have to order the lowest category because it is not worth it. You can easily find a place near the appartment in Tünel or the Istiklal to enjoy a delicious breakfast (for example in one of the House Café's). The hotel manager Yüksel is doing a very good job: do not hesitate to ask him for recommendations. And: do not miss the Bosphorus tour on Sunday organized by him. :-)", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r76732238", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "My favourite place to stay in Istanbul", "review": "We spent 3 nights in a junior suite of Galateia Residence. Here is a summary of our experience. This place has some excellent features but unfortunately some other aspects are a bit neglected. Altogether it is a good accomodation, but far from excellence... if you are an exigent customer you could be unsatisfacted.  PLUS: - Perfect location, very close to istiklal caddesi but far enough to guarantee the quietness of your stay, day and night. - The suites are very spacious compared to the price you pay  -  The furniture is generally of good quality, and the bed is extremely big and confortable. - The staff is friendly and always available for your requests, and you have the conforts of a 4 stars hotel even if you are staying in apartment. This is a pretty good combination. -…", "date": "June 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r74409014", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Galateia Residence - Best Hotel in Istanbul", "review": "I really want to say a a few words about this hotel in which I had an exceptional stay. I have travelled to Istanbul a lot of times before and I have never really found somewhere to stay that matches my needs. When I found Galatea, I got the perfect location, comfort, luxury and service. The staff was professional and yet warm and friendly, which is important for me who travels alone in business. Wireless connection was another important thing for me. I really enjoyed the little extra, like the luxury soaps in the shower and the dvd collection. Even though it was just near the Istiklal street and Taksim, it was totally quiet and the beds are huge! I slept lika a baby. I felt at home, and welcomed in this unique combination of hotel and home.  /Priscilla", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r74370640", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Amazing stay with a special mention to the manager and staff for their friendliness", "review": "Istanbul’s most famous street, pedestrianized Istiklal Caddesi (Independence Avenue), throbs day and night and offers a fantastic array of architectural sights, shops, treats, and throngs upon teeming throngs of people. At the avenue’s northeastern end is expansive Taksim Square, thought by many to be the very heart of the city, with many of Turkey’s most renowned restaurants and some of Europe’s most happening nightlife in close proximity. In striking contrast, Beyoglu’s less trafficked areas – such as the affluent Cihangir and the antiques district of Cukurcuma – exude Old World charm and provide contemplative calm and splendid diversion via an assortment of cozy cafes, attractive boutiques, and quiet lanes.", "date": "June 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r73813273", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Great Apartments in a Great Location", "review": "Back in March, I was in charge of the organization of a 4-day trip to Istanbul for a group of 15 friends in June. What was threatening to become an organizational nightmare turned out to be a very pleasant experience when I came across the Galateia residence and its manager, Mr Yüksel Kukul.  Mr Kukul was extremely helpful and professional all the way, demonstrating patience and flexibility during the finalisation of the lengthy booking process, organizing airport transfers, restaurant bookings as well as a fantastic boat day trip on the Bosphorus ahead of our arrival, etc. I should also mention that he and his staff were very professional and very friendly during our stay,  always eager to adapt to the needs of a large group of friends travelling together. While the building is…", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r72653491", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "If you can afford it, you have to stay there", "review": "We stayed at Galateia Residence with our two teen daughters for a week.  The apartments are extremely nice and the location is perfect.  Close to a very nice area of town near the Galeta Tower with lots of shopping, nighlife and great restaurants but far enough off the main street that noise was not an issue.  It is also close to the Tunel which takes you down the hill to the tram where you are just a few stops from the major sightseeing areas.  I preferred this to being in the more touristy neighborhood of Sultanhamet. The staff were very helpful and attentive.  They brought in two beds for our teen daughters, worked tirelessly to help my daughter establish a wireless connection with her IPOD, and upgraded us (for no apparent reason) to the room on the top floor with a…", "date": "June 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r72377104", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Perfect place to stay", "review": "I think the hotel (appartment) cannot be located any better. Near Taksim but still quiet next to the park of the Embassy.The appartment is really estonishing  as is the staff and manager. Always eager to help.  A pity I could not stay longer , but this was already a treat for me as I normally book cheaper hotels. However  when I will come back to Istanbul with my lover I definitly will book this romantic scenery again.", "date": "June 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r71063902", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "great stay", "review": "Istanbul’s most famous street, pedestrianized Istiklal Caddesi (Independence Avenue), throbs day and night and offers a fantastic array of architectural sights, shops, treats, and throngs upon teeming throngs of people. At the avenue’s northeastern end is expansive Taksim Square, thought by many to be the very heart of the city, with many of Turkey’s most renowned restaurants and some of Europe’s most happening nightlife in close proximity. In striking contrast, Beyoglu’s less trafficked areas – such as the affluent Cihangir and the antiques district of Cukurcuma – exude Old World charm and provide contemplative calm and splendid diversion via an assortment of cozy cafes, attractive boutiques, and quiet lanes.", "date": "May 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r65391674", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great apartment in Istanbul.", "review": "perfect value, great view, great rooms,helpful staff!", "date": "May 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r65043732", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good location, clean place and customer oriented", "review": "We were looking for a nice quiet place to stay in the heart of Istanbul, and were really happy with what we found in Galateia Residence. The apartment and the view were absolutely stunning! One of the best accommodations we have ever stayed in (we travel a lot). The only changes we would make - to have cleaning service on the weekend (toiletries and towels weren't refreshed for two days) and to have a washing machine in the apartment which is a pretty common thing for serviced apartments (they only offer laundry service that you have to pay separately) . Apart from that, great experience, would stay there again without hesitation!", "date": "April 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r62710677", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 3, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Perfect Hotel", "review": "In terms of location, the residence was located at the end of Istiqlal road (a very nice road to walk through with lots of people similar to the marienplatz in Munich). Being at the end of istiqlal road means that you have access to the road and at the same time close to Sultan Ahmed (where all the sight seeings are). Not only that, but you have a tram that takes you from the end of istiqlal road to the beginning. You also have a tram which takes you from the top of the hill to the bottom (Istiqlal road is on a higher ground). After that you can take a tram which takes you to sultan ahmed (10mins away).  The location of this residence is one of the key elements.   As for the residence itself, its composed of two buildings adjacent to each other. Each building has a couple of…", "date": "April 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r60918418", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Luxurious Apartment.  Perfect for Families,", "review": "We are so glad we found the Galateia Residence. It is, as the other reviews say, perfectly located in a lively area packed with bars and restaurants but just a short trip to the Galata Bridge and across to the historic old town.  We booked at short notice over the Easter weekend and were lucky to be allocated a duplex apartment. A huge open plan lounge / kitchen / diner, small bedroom and bathroom downstairs. Large flat screen TV and comfortable sofa, large floor to ceiling windows looking up to one of the consulate buildings. Upstairs we found a very large bedroom with comfortable circular bed, excellent bathroom and a terrace.  For the price in this part of Istanbul and with this quality I don't think you would find a better hotel. The very friendly Hotel Manager confirmed the…", "date": "April 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r60877966", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "perfect", "review": "Istanbul’s most famous street, pedestrianized Istiklal Caddesi (Independence Avenue), throbs day and night and offers a fantastic array of architectural sights, shops, treats, and throngs upon teeming throngs of people. At the avenue’s northeastern end is expansive Taksim Square, thought by many to be the very heart of the city, with many of Turkey’s most renowned restaurants and some of Europe’s most happening nightlife in close proximity. In striking contrast, Beyoglu’s less trafficked areas – such as the affluent Cihangir and the antiques district of Cukurcuma – exude Old World charm and provide contemplative calm and splendid diversion via an assortment of cozy cafes, attractive boutiques, and quiet lanes.", "date": "April 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r60661296", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Great apartments in a great location - highly recommended", "review": "We stayed here over Easter break. it was perfect -- the property manager gave us a good deal on a great room. Location wise, it's just off Tunel Sq. which is exactly where you want to be -- close to all the restaurants and bars in Taksim, but also a nice walk (35min) from the historic sights on the other side of the river. It's also right on the subway line (Tunel sq. stop). The only thing was the extra bed was a little small... but you don't go to Istanbul to lie around in bed, so we didn't mind!", "date": "April 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r60522573", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Totally unbelievable!", "review": "These new apartments are really smart, really well-appointed and really comfortable.  They are located only 200m from Tunel funicular station and the new metro station at Shishane.  There are shops and lively restaurants / bar scene nearby .  They proved the perfect base to explore the old and new towns.  The residence manager couldn't have done any more for us and was extremely polite and friendly. Print out detailed maps, addresses and phone numbers though because they aren't yet on taxi drivers' radars which makes finding them the first time a little tricky.  Will def consider them next time I go to Istanbul.", "date": "April 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r60508435", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Short visit !", "review": "We were referred to Galateia residence by another hotel in Istanbul. Therefore, we did not have any particular expectations. Upon arrival, we were kindly upgraded to a larger apartment. We were totally stunned after seeing our rooms! Perfectly clean, very tastefully renovated and extremely luxurious! The staff was delightfully kind and friendly, and the rooms were very quiet, the bed soft and all in all, we barely could believe we got such a fantastic apartment! I have travelled a lot due to my profession, but nowhere have I enjoyed my stay so much! Perfect!", "date": "March 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r60079164", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Highly recommendable", "review": "Stayed 2 nights on a short vacation in this brand new property Luckily I was one of the first who had the opportunity to enjoy this great hotel. Would love to stay there again in the heart of Pera.", "date": "March 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r59959709", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "\"Everything you need is in this place and more\"", "review": "Istanbul’s most famous street, pedestrianized Istiklal Caddesi (Independence Avenue), throbs day and night and offers a fantastic array of architectural sights, shops, treats, and throngs upon teeming throngs of people. At the avenue’s northeastern end is expansive Taksim Square, thought by many to be the very heart of the city, with many of Turkey’s most renowned restaurants and some of Europe’s most happening nightlife in close proximity. In striking contrast, Beyoglu’s less trafficked areas – such as the affluent Cihangir and the antiques district of Cukurcuma – exude Old World charm and provide contemplative calm and splendid diversion via an assortment of cozy cafes, attractive boutiques, and quiet lanes.", "date": "March 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r59257067", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "not want to leave", "review": "Everthing was wonderful about this hotel during my one night holiday . The room was perfect, the scenery was perfect.. So thank you for your quality and kindness. I hope  I will come to this hotel again soon.", "date": "March 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r59119333", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Enchanted istanbul", "review": "the room was incredible , we have a bosphorus wiev in our bedroom and bathroom.We booked junior deluxe apartment but they did a favor to us and upgraded our room to bosphorus wiew apartment.The apartment was perfect ,  have no bad comments about the room or galateia residence.Thanks again.", "date": "February 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1718593-r56680649", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}]