[{"title": "Awful. Do not stay here unless you want to ruin your holiday", "review": "What an awful experience. If this is too long to read - just look at the pictures I took and posted. I have reviewed over 130 places/hotels on tripadvisor - this is not merely a first time user with a bad travel experience. I have travelled independently since 1993. I have NEVER been treated so badly by staff, managers, and owner, or stayed in a hotel where, after complaining about the room not being what we booked, and not being clean, I was threatened with having the police called!! The owner threatened, saying he was a lawyer. He seemed to believe that if we did not stay, we could not leave a review, and was trying to blackmail us not to stay, for that reason. So rude. Anyway, the photos of the bathroom are in the room they put us. They then tried to up sell us a suite - at an extorionate rate. The entry to the suite is where I took the photos with the blue paint peeling everywhere. Do not stay here; it is a smelly dump. Go up the road to Sunrise resort-  infinitely better hotel, pleasant staff, and great facilities.…", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r701546363", "sub_review": {"Location": 3, "Rooms": 1, "Service": 1}, "travel_purpose": "", "rating": 1}, {"title": "Disappointing", "review": "Such great potential with nice pools and ideal location. Staff unhelpful and you are charged for absolutely all extras. Don't book an All-in, is isn't wroth it. The kitchen-cook hasn't got any knowledge of European food. Lot of people who booked all-in were eating down-town. All over hotel old drinking glasses, not enough cutlery. Also the garden can have more maintenance. Lot of cats in the restaurant.", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r691601535", "sub_review": {"Value": 1, "Location": 4, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Disappointing ", "review": "Such great potential with nice pools and ideal location. Staff unhelpful and you are charged for absolutely everything 2 games of pool cost €7. Towels €3. Man making pancakes for breakfast was rude and very reluctant to make pancakes (his job). Service very slow and restaurant food very poor. Drinks were served very slow, beers were flat and not even full pints. Over all very poor.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r682116321", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "The best hotel in lesvos ", "review": "The best hotel in lesvos with a friendly staff and very good Wi-Fi connection very good food and the room whit A/C very clean hotel and also very good swimming pools  very recommended for a lovely holiday well spent ", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r681349704", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Wonderful Hotel lovely staff ", "review": "We stayed over one week at The hotel ,and it was very relaxing ,wonderful views  very clean pools .friendly staff :). Room cleaned every day and always served with a smile . Will visit next year for sure  ", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r681305815", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Stay away", "review": "Rooms small and not so clean. Property needs maintenance asap. Pools arr dirty and full of sand and suncream. Unfriendly staff, especially the barman at the pool. All inclusive food is more than horrible. Go somewhere else!", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r680575582", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Awesome place, average all incl", "review": "We have had a wonderful stay at Viva Mare. Due to the anniversary of me and my friend, they upgraded us to one of their suites as a surprise. So kind! And w o w, the suite was incredible. Comfortable beds, great view and all so clean. We made use of the all inclusive facilities, but that was a bit of a let down. Especially breakfast and lunch did not offer a lot of choices. During the afternoon snack, only one scoop of ice cream a person is allowed. You have to pay extra for cola zero/light. Etc. But looking at what you pay, it’s a good price-quality ratio.  Overall I would recommend this place! But I would recommend to eat in Molyvos, which can be cheap ánd super delicious!", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r679410683", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Disappointing", "review": "An old fashioned hotel with stinky rooms. Shower was too small and it became a big struggle when we tried not to splash water outside of the tub while having a shower. Breakfast wasn’t even appealing to the eye. Housekeeping never replaced the toiletries although we stayed there for 4 days and there were even no shampoo in the room. Only shower gels! Not recommended. This hotel was a complete disappointment.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r679134628", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Breathtaking Views", "review": "This is my favorite hotel in the world! Kingdom of relaxation. Food is there, coffee, drinks all amazing. My favorite part is the spa! The entire place is very beautiful and comfortable. It is also situated in an extremely gorgeous natural terrain.", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r612779625", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Kyle Hiebert", "review": "Amazing hotel. We felt welcomed and right at home right when we walked in the front doors. Excellent service, breakfast, lunch, dinner buffet, great pools, and beautiful view from the veranda!! Couldn't really ask for more perfect place to spend the summer!!", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r612535276", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Beautiful setting ", "review": "When you first walk in you would not think that a place this beautiful is in this area. The staff is friendly and the hotel is very clean. The rooms are very comfortable and clean. Our room had a decent view of the ocean but there was construction beside us that took away from the view. The bathroom was a little dated and when you shower the water goes everywhere, the toilet is too close to the sink so a larger person will have a hard time using the toilet. I am sure that not all the rooms are like mine and I will return. Thanks for some awesome memories Viva Mare.", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r525481359", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Good relaxing holiday", "review": "Friendly staff, Very nice views, good rooms. For a relax holiday a perfect place. Food not a lot but quality is good. There is no entertainment. There is a shuttle bus to bring you to mollivos. Overall a good holiday.", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r525404405", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Amazing hotel, wonderful vacations!", "review": "One of the best hotels I've ever been :) The view from the terrace and the balcony was amazing, the rooms were clean and the stuff was really helpful and friendly! I recommend it to everyone for sure! Really nice feeling!!", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r522525702", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "amazing vacation", "review": "Viva Mare is a great hotel for vacation for all ages. It has been one of the most beautiful and relaxing holidays I've ever been! It was excellent! The service, the rooms and the amazing view! I would highly recommend it for relaxing and peaceful vacation", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r521872061", "sub_review": {"Value": 5, "Location": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent!!!", "review": "Very friendly environment, all hotel stuff very helpful and kind. The rooms and common areas were clean. Food was delicious. The hotel is in a very close distance from the village of molivos, which means that it's quiet enough, and the beach of eftaalou is only a 5 minute walk.", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r521798139", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Very plasent place to spend vacations, with few drawbacks...", "review": "Overall, hotel is very nice and clean. Staff is very friendly and kind. They do great job, keeping everything in order. Event when our AC had broken, administration tried to compensate our discomfort for 2 nights by giving us bigger, sea-view  room.  Room was a bit small, but sill clean and comfortable. Small disadvantage - room on the first floor with balcony heading main entry. Consequence - a bit noisy in the morning.   Pool area is also very nice and well organized. For me big plus for no loud music at the pool area. Just gentle music from the bar.  Beach, well there is no beach to tell the truth. Just barely organized seaside gravel road ( sometimes used by the manager in his SUV), with 5 or 6 umbrellas and sunbeds. in the water you will find slippery rocks, many many sea…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r517322249", "sub_review": {"Sleep Quality": 3, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Relaxing, smooth and high quality", "review": "Visited Viva Mare for a business trip. Breathtaking view to the sea, great breakfast and great pool & spa amenities. Really enjoyed the smooth blend of the hotel with the views of the landscape and the sea. Sooooo relaxing experience.. Looking forward to see the adjacent complex to be soon completed with the huge infinity pool...", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r500610429", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Don't hesitate to go here", "review": "Spent a week at this lovely hotel with my teen-age son. He just loved the pools and the excellent service at the pool bar. The views from both the rooms and from the restaurant are just amazing and the same goes for the staff who work hard to provide really good service. All are very friendly! Eftalou is a nice quiet place and perfect for a relaxing holiday, but you are still close to Molyvos with with sufficient amounts of tavernas and stores. The hotel's shuttle bus makes the trip to Molyvos very easy. Don't hesitate - Lesvos is certainly worth a visit and Viva Mare Hotel is a perfect place to stay!", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r423902538", "sub_review": {"Location": 5, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "great experience and total recommendation", "review": "i had one of the best holidays in this hotel, everything was more than expectations. very friendly and kind stuff, nice location... people, please visit this hotel, it is a must to see. one more thing, there are no refugees as everybody is thinking.  Sasa", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r421698121", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Excellent Place", "review": "It was a good trip. My wedding was held at this hotel, staff unfortunately was the minimum and this resulting in poor service in general, but with an excellent sef which did everything to please us. The top room view is amazing and is one of the things that will relax you. Service of the hotel is poor in general but the rooms and facilities are excellent", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r420376001", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "The most fantastic vacation! ", "review": "We spend a week in Viva Mare, and it has been the best vacation we could ask for. The hotel is full of incredible staffmembers, and there are NO refugees, if you are unsure about it.  We would love to return!  Only the breakfast can be improved a bit! ", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r402471367", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A great hotel with really good service and a stunning view.", "review": "This hotel is really great. Well it's not really luxury, and the rooms is great but not really high standart. But it dosent matter. The staff is so nice, the pool area is so great, the restaurant is far better then many of the restaurants in the town and best of all. You really feel you are welcome, the staff really care for you and want to do the best for you.  So ignore the missing star and pick this hotel anyway, i am sure that you wouldn't regret it.  GREAT FREE WIFI! ALL OVER THE HOTEL!! And take care for your cellphone net, it can jump to the turkish net all over the island. Remember to lock your cellphone on greek network manually. If you have automatic network turned on it can be very, vert  expensive!!!", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r399332894", "sub_review": {"Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "As good as usual!", "review": "We stayed for the first two weeks in June. The airport transport was 2 hours due to a slow driver and an hours flight delay so we arrived really late at the hotel. We were pleasantly surprised with sandwiches made waiting for us in our room which was the same great room from last year! There were a lot of new staff this time but they made us very welcome and Maria was as lovely as ever even though she was stressed out with the Greek wedding in two weeks time to organise! The food was lovely as usual and we would recommend this place to anyone who has never been to this great island. It was a bit quiet this year for obvious reasons and I hope people start coming back to the island as you do not know what you are missing. I would like to say a big thank you to all the staff who…", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r392525785", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Awesome hotel & staff and location in Eftalou right next to Molivos", "review": "We would like to thank you so much for such a nice stay at your beautiful hotel, Viva Mare. Beautiful setting, seaview, 5-6 awesome pools, really nice and well kept and clean rooms and the most friendly, helpful and charming staff made our stay memorable - and we´ll for sure come back and recommend Viva mare  PS. Free Wifi is very nice   Best regards, Anne Harsdorff Stein & Jerry Lagoutaris,  Copenhagen, Denmark", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r391449441", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Holiday ", "review": "We stayed at the Viva Mare from 25th June for 1 week. On arrival we were greeted by friendly staff, check in was speedy and efficient. We arrived at 10 pm after 1.5 hours drive from the airport, we were tired and hungry and after a quick freshen up and although the hotel was quiet the restaurant stayed open to enable us to have a meal.  The hotel has spectacular views and is in a beautiful location. The bedrooms are clean and spacious and lots of rooms have wonderful sea views and worth paying the additional amount to have one.  Breakfast is plentiful although not very much variation but more than adequate. Molyvos is beautiful with lots of restaurants and a lovely harbour and the hotel provides a shuttle bus service several times a day although a taxi is only approx.€5. I will…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r388789402", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Breathtaking views ", "review": "This place is awesome. Most amazing views from all parts of the hotel, clean, friendly staff and so affordable. Free Wifi, 6 pools, pool bar, spas etc. Great for families or couples. Even helped me with some printing and scanning for my work. Highly recommend.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r385253743", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Wonderful!", "review": "Fantastic hotel, fantastic view, excellent personnel, pools like diamonds...which I enjoy every year! The breakfast is very good with a big variety of choices. The weather was a little bit cold and I couldnt enjoy enough the pools. The room was very clean and the view over the aegean sea was fantastic!", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r369806118", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Superb location, wonderful staff", "review": "I'd like to thank a lot the hotel staff, especially the reception, who were very helpful all the time with a big smile. I kindly suggest that the beach be improved a little. Otherwise I strongly recommend this nice hotel.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r368395471", "sub_review": {"Value": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Service and location", "review": "very good food, choice of alakart service was a very good option too, the spa location and the service at the spa were excellent. 6 pools with spa in a unique location oposite Turkey was fantastic. The service of that spa was remarkable. Personel was discrete and everywhere around. Rooms were big and clean and had a very nice seaview. Access to Molivos village with hotel mini bus was quite often and on time daily. I recomend it for families and bussiness trips.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r354495927", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Mr.", "review": "Have been to many vacation places in Europe, S.America, S. Africa, but this place is the best we have ever been. Everything is outstanding!! Can't wait for the time to go back. Beautiful rooms, great views, it's a dreaming place. The rooms are very nice, the service outstanding, and the food just plain delicious!", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r352870017", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great hotel", "review": "Great place especially for families . Big clean rooms with partial sea view . Great breakfast buffet . Very close to Molyvos town with great restaurants and night life . We will go back. the staff was very pleasant and helpful .", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r352840634", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Not good for eating", "review": "Hotel ok.,beach katastrof, a lot of migranten, all dirty. We have all inclusive and give us a \"local\" beer..alcohol free!!! Halooo??no music in hotel, nothing..And for lunch we have 5 meni for eating. Pasta and burger.I dont came hier anymore.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r343081035", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Lovely hotel", "review": "Absolutely loved this place...staff was very friendly and accommodating, rooms were very clean, half board = exquisite, beautiful grounds, close to historic town of Molyvos, and easily accessible to the beach!", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r320207657", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Wonderful", "review": "Viva Mare remains a wonderful place to spend our summer vacations time and again. We came back to find a brand new restaurant with excellent dishes! Very clean swimming pools that along with the palm trees make up for a dreamy scenery!", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r316373778", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Fantastic facilities, great hotel", "review": "This is an excellent hotel for any trip to Lesvos where relaxation in comfort and style is the priority. The staff are helpful, polite, responsive and speak English as well as Greek which is a big plus for the international traveller. The room was well-lit, spacious, well appointed, spotlessly clean, with comfortable beds. The public areas such as the bar, terraces, and lobby are clean, luxurious, with comfortable seating ideal for a coffee or indeed a game of backgammon (they have boards, just ask) or a drink in the evening. We had very nice meals in the restaurant, and snacks from the bar; there are also some good restaurants a short drive away so this makes a great base for exploring Lesvos. The views out across the sea from the rooms, terraces and restaurant are amazing.…", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r314013915", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent Hotel", "review": "The reception area is spacious with lovely comfy settees. The bedrooms are a good size with lovely balconies. We had a sea view and a BATH with a shower attachment. Towels were changed daily and bedding every two days. Free air conditioning. The breakfast was exceptional with eggs, scrambled, fried, boiled or omlettes. Bacon, sausage, cheese and hams. Yoghurt, fruit, toast, croissants and cake. The verandah area had comfy seating with shade. The swimming pools were never overcrowded.  Very few English people but other guests very chatty along with the friendly staff. A curtesy bus was provided but bus stop right outside the hotel gate. A 20 minute walk into Molyvos which we walked several times.  The best accommodation I have stayed in whilst in Greece.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r312008957", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Awful food, dirty dishes, average rooms", "review": "Food was uneatable. Seriously, rat wouldn't touch it. For 7 days they served the same for breakfast and dinner. I don't know how is it possible to have so bad tomatos and olives, when you live on island, which is covered with olive trees! Even their greek yogurt was uneatable - it was like fat mixed with powder milk. Every piece of food was so bad, that you can't imagine. Glasses and cuttlery were always dirty-looking. After 2 days we were eating in town. In bathroom and room you can smell cigarettes, if someone is smoking one floor beyond. Bathroom is old, used, even paint was destroyed. Hotel beach is about 1,5 meter width, and is not impressive, but pool is great. Actually, they have another pool, so this one closer to the sea is quiet and nice. People working in this place…", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r310610908", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Best choise in Lesvos", "review": "Very nice hotel, best choice for families with children. Big pools, sunbeds allways available even during August (we were there 7-15Aug).  The beach in front of the hotel is not nice but there are really nice beaches close to the hotel (Petra-Anaxos)- 5min drive.  Close to Molivos, the best place in Lesvos and a hotel bus available to get you to Molivos and Petra 2 times per day. Very friendly staff", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r310481422", "sub_review": {"Location": 5, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "vacation ", "review": "freaking amazing!!! glorious. this place is wonderful I love it!! there is more pools than I can count. the staff is so kind and go out of there way constantly. the beds are super comfy. the decor is luxurious and the view is exciting! the sea is right there and the hot springs are down the road!  ", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r307847653", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Viva Mare -", "review": "I am going to be honest with this one and this will go against some of the reviews but this is my opinion and not all will agree, but here goes.  let's start with the elephant in the room - Migrants. there are a lot coming to the island this is true. there are on average 10-15 boats a day landing along the coast. you will see them walking along the road into Molyvos where they are then moved onto Mitiylene. They do not beg and  do not bother you so do not let the scare mongers in the press put you off booking in Lesvos.   Hotel - the hotel is a nice hotel and is very colonial in appearance on the inside. there are plenty of cool comfortable seating areas in the reception area and the hotel is well kept. The views from the patio areas are really nice and the restaurant views are…", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r305317871", "sub_review": {"Sleep Quality": 2, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "LOVELY HOTEL", "review": "I had a very beautiful stay beginning of August in this hotel.First of all, the location and the view from the rooms is spectacular. A wonderful choice, polite staff, doing their best to serve you at any time .Excellent breakfast, amazing a la carte menu, and great variety in the buffet. The pools were great and so many that we didnt know which one to choose. We will definitely come back...", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r304893021", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Nice and quiet", "review": "One of a few hotels at the beach around there. We were staying with the family of 4. Got two connected rooms. Nice!  Excellent food, specially breakfast. Dinner is self service,offering not that many different dishes, but they are all good!  And they are not repeated often so don't miss it  Most of the 14 days we had problem deciding what to take. You can not eat it all, can you.  Lunch is served ant there is enough to chose from. Hotel is offering different possibilities from bed & breakfast only to all inclusive. My suggestion is to take half board. Not offering enough to all inclusive guests. Room is clean and big enough. The only remark is concerning bed. It is very hard, same as the pillow.  There is enough sunbeds around pools and at the small beach.  Staff is friendly and…", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r302185762", "sub_review": {"Sleep Quality": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Fantastic poolarea and good, friendly service", "review": "The hotel is located beautifully, with a great view from the rooms (with sea-view) and from the restaurant over the Aegean Sea facing the Turkish coast. Compared to the sea-view rooms, the rooms facing the surroundings are quit disappointing Therefore I will strongly recommend to book a room with sea-view.  Breakfast is nice, with a fine choice of fruit, bread and fillings. And together with the aforementioned view, breakfast is every time a great start of the day. The pool area (with several pools) is absolutely something special. Lying at different levels between the hotel and the sea, and never to crowded, it offers a perfect place for many sunny and happy days for the whole family.  The people at the hotel are friendly and serviceminded. This counts specially for the people…", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r297802037", "sub_review": {"Value": 4, "Rooms": 3, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "A hidden jewel within cosmopolitan Molyvos.", "review": "Great hotel with impeccable service and attention to detail, closed to cosmopolitan Molyvos. Panoramic view from most rooms and the outdoor veranda. Seven great swimming pools that satisfy all interests. Great indoor pool and and an unbelivble a la cart menu. Great brealkfst br  t Ble", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r294287710", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "VERY ENJOYABLE STAY", "review": "Stayed here early july 2015 and had a maisonette room which was immaculately cleaned and very spacious. During our stay we found all staff helpful and very friendly. The hotel has a very relaxed atmosphere and there was no rush to get a sunbed at any of the pools and we enjoyed using the Spa pool area which had comfortable sunbeds and excellent views with the added benefit of Tommy serving you food and drink and sharing his humour. Thanks Tommy.  its a hotel we would definitely return to and would recommend .", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r290520283", "sub_review": {"Location": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "So so disappointed ", "review": "This hotel is not four star. More like two or three. And three because of the outside pools.   We booked this hotel and were bitterly disappointed.  The breakfast is terrible unless you enjoy tinned peaches and fruit cocktail. Given that Lesbos grows lots of fruit it is hard to credit serving this rubbish. So after day one we avoided breakfast. There are plenty of great places in Molyvos for breakfast.   There is a kettle in the room but no crockery and there's a notice up in the dining room asking guests not to take crockery to your room!  The one saving grace about this hotel is the outside space and the various swimming pools. The spa pool is great and is worth the five euro fee.   Don't expect to easily swim on the beach as it's quite inaccessible unless you like a rocky…", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r287490012", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Great time! Lovely place!", "review": "Review for Viva Mare Molyvos  Great time! Lovely place.  Returned a fortnight ago from the Viva Mare Eftalou Molyvos , where we stayed with friends, and would certainly go back.  This hotel is wonderfully situated... has  beautiful views of the bay, spacious dining area and lovely pool areas to sunbathe.  Great pool bar and staff. Rooms are  very clean and comfortable and we had a lovely balcony view. Breakfast great, plenty of choice. The staff are all very helpful and friendly , really  couldnt fault them, and there is a little shuttle bus driven by the hotel staff to get you down into the town of Molyvos and back 4 times a day. It is a  good couple of miles into the town, people were walking but maybe a stroll for the fittest amongst us!  The only negatives we found were the…", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r279948076", "sub_review": {"Value": 4, "Location": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "A Great Holiday!", "review": "We checked in this hotel after we were disappointed by two others in the same area. We were welcomed although we did not have a reservation. The hotel is right next to the sea and the view from the dinning area was simply wonderful. Our room was spacious, in two levels, with a small interior staircase. There was a comfortable double bed on the first level and two single beds on the upper level. The staff was friendly and helpful. The breakfast buffet was varied and plenty. We did not dine in the hotel so I cannot comment on their food. Lovely spa and facilities for children. Highly recommended, I will come back.", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r261613771", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Excellent hotel", "review": "we enjoyed our stay here. I was a nice experience. Staff was very helpfull. View is amazing, If your love to walk you can walk kind of all nice placeses from the hotel. Room was clean and big enough as i said view from the room was remarkable. couldnt be better. it will be my next choice again.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r246473338", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Remarkable experience", "review": "We have had an amazing week here . Our room was lovely, not very big not very small just right :) but what mattered the most was the fabulous view to the Aegean Sea  It is just 20min walk from Molivos area and 20min walk from Eftalou Hot Springs.  Everything is top quality!!! The quality of the rooms (from what i can understand recently renovated)  The staff was great, helpful and friendly, my regards to Kiriakos the main Pool Bar who was always there to help us and make shure we had the best time possible.  The breakfasts are wonderful, taken on the balcony area, enjoying the sea , with a great choice of everything you can imagine you surely would be dissapointed.  If you like pools there are 6 of them and also a fabulous sea with a wanderfull sandy beach infront of the hotel.…", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r242872609", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fabulous !!!!!!", "review": "A fabulous and quiet place !!! You can enjoy the amazing landscape so offer you real vacation and not only that !!! The rooms were clean, comfortable with great view. The staff was very professional and very friendly !!! The breakfast and menu was excellent !!! If you visit Mytilene i suggest you the Viva Mare hotel !!!", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r241297790", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Experience worth spreading", "review": "Reading the reviews on trip advisor i cant think of something more to add in order to compliment this amazing hotel!!  Everything work as it should from the moment of arrival since the department day...the stuff is great, they will welcome you in the most polite way and they will make you feel like home. The facilities is another strong point...there is everything you can imagine, Spa area, wellness pool, heated pool, 3 more pools for all the tastes, children playground, gym, huge parking area, amazing gardens.  Regarding the hotel's location is 15 minutes walk from Molivos area and if you don't want to walk there is a Hotel buss free of charge!!", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r241136058", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Best value for money!!", "review": "We enjoyed our stay in the hotel mainly because of its beautiful location and excellent service. The people made us feel like home and were there to satisfy all our needs. The facilities were modern and in good condition but it was quite far away from the city centre. Ideal for  family holidays as well as for couples.", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r240744403", "sub_review": {"Value": 4, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "The essence of vacations", "review": "I am very pleased with this hotel!!! The rooms, the facilities, the swimming pools (6 swimming pools and one of them with power jets Jacuzzis waterlfall effect reverse swimming), the spa, the view (you have to see it to believe how beautiful the Aegean sea looks from this hotel) , the sea, the food, the services, everything  were great. I had done a good research before visiting   Lesvos and I ve found out that chosing hotel Viva Mare (ex-Alkaios) was a best value for the money choice!! I will definitely prefer it when I come again at Lesvos!!! Highly recommended !", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r240285590", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "very nice", "review": "The hotel was very nice, the staff helpful , we diid complain about our room , as the bathroom was well below par, but after that it was plain sailing . I must add , Dorothy our room attendant was great , as was all of the reception staff. the driver of the shuttle bus was also great . You may gleam from my report I thought all of the hotel, staff, and service was fab, but thats greece. Adorable.  A few glips so what , it adds t o the flavour . Yes I would return .", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r237004163", "sub_review": {"Sleep Quality": 5, "Rooms": 3, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Nice place for a peacefull holiday", "review": "We really enjoyed our one week staying here. A very nice place with sea view. It was the last week of the season, but the staff was very nice and the room was excellent cleaned and the restaurant offered everything, just like in the full season. Probably middle September is the best time to be there. I suppose the July an August are more noisy. There is a spa with an outside poll (affordable for 5 euros) and other 3 pools and a small private beach. Not very much to do outside the hotel, but they offer free ride from the hotel to Molivos, a beautiful place to visit. They are also very attentive and offered us other free rides in the neighborhood. We left with great impressions and nice memories and we recommend the hotel, especially to couples, but also to families with children.", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r234545588", "sub_review": {"Location": 4, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Relax", "review": "First of all, smiley and very kind stuff at reception. Hotel is very clean, big with many different facilities. I liked spa center, pool with hydro massage and jacuzzi, with fantastic view. For sure we will come again.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r227841896", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Amazing Hotel", "review": "I enjoyed my vacation at Viva Mare Hotel at the begging of July.Breathtaking view with lovely sunsets. Excellent breakfast and prompt service by the entire personell.  Extremely tasty a la carte dishes.  I had a very pleasant experience changing pools every day. The wellness pool stole my heart and tuned my mood daily.  All things considered, my choice of VIVA MARE was an excellent one and i will return next year definatelly", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r221933041", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very good and would recommend to less uptight people!", "review": "Stayed there for just a couple of days. The savoury breakfast was delicious (unlike the sweet bits), the spa was real fun if you are easily amused and admission is just 5 Euros per person. The sea view is great and the surroundings just fine. The staff were helpful BUT they spoke to us in singular while they should speak to us in plural.  Oh and something weird that happened. One morning we returned to our room after breakfast and two maids were inside trying to fix the curtain and they wouldn't leave the room unless we'd ask them. Once I asked them, they disappeared (really never came back) but I found them very indifferent and indiscrete.", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r216550673", "sub_review": {"Sleep Quality": 5, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Great family vacation!", "review": "Very nice hotel with great view by the sea. Excellent pools and as a bonus great play areas for children. Hotel is located slightly outside of Molivos but it is quiet and relaxing and you can easily get in to the town either with hotel minibus (4 times/day), local bus or by taxi (5€). Hotel staff is very friendly and helpful and everybody speaks good english. We will definately come back as soon as possible! ", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r212305450", "sub_review": {"Value": 5, "Location": 4, "Rooms": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Great experience!", "review": "A wonderful choice, worth its money! With a variety of pools to switch among and nice gardens. Polite staff, doing their best to serve you at any time. A clean and neat room, with a wonderful sea view. Three minutes from Molyvos, but at the same time a quiet and romantic place onto the seafront, away from noisy situations. A great variety in the buffet, with top quality domestic products. Definitely recommend it!", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r209387874", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "not what you expect", "review": "The hotel, when we booked advertised a 4* rating offering an evening buffet. This is no longer. As half board we were offered a pathetic choice of 3 meats or 2 meats & 1 fish depending on the day, with this you can have chips, saute or boiled potatoes or rice or pasta. The rice I had 1 day had been reheated & one day the chips were reheated. Vegetables are frozen mixed. If you are half board you are not entitled to a tablecloth preset table as these are for \"a la carte\" customers who might come.   The staff are mostly lovely people and are very helpful and the hotel is very nice in a beautiful setting in a wonderful resort. As a bed and breakfast it would have been perfect.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r208558876", "sub_review": {"Value": 2, "Location": 5, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "It's a great hotel!", "review": "We stayed there at end of September 2013, for 8 days and we absolutely loved it. First of all, the location and the view the rooms get is spectacular. Molyvos is located on the north side of the Island and boasts a excavated and restored ancient fortress and a beautiful beach. The Town of Molyvos is beautifully lit at night full of hotels, restaurants and there is night life during the summer months. Its not uncommon to see people strolling the roads with flashlights at the outskirts of the town. There are car and motorbike rentals with Gasoline stations open late in the evening. Even the fortress is lit and looks spectacular at night. The interior of the hotel itself is a little outdated, however the areas outside, the grounds and pools ( includes 3 kiddie pools) have been…", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r183562493", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "richard&kids", "review": "We had a great week here. The location is superb looking across the strait to Turkey, and the pools are excellent - it felt like a mini-aqualand but without the crowds! They have a decent shuttle bus into the local town which is a real delight - but we liked the tranquility of the location too The beach is small but at least there is a beach - we travelled the island a bit and beaches are not the reason to come here - but if you want a relatively unspolit Greek island experience this is the right destination All inclusive buffet food got a bit monotonous after a week but it was perfectly acceptable", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r182665667", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "A true gem of an island and a hotel that 'COULD' be excellent !", "review": "Let's start with Molyvos (Mithyimna) - what a true gem on a greek island, totally unspoilt and showing visitors traditional greek styling.  Sunsets we can only dream about, lovely friendly island people who genuinely want to make you feel welcome on their island.  The Hotel The Alkaios is set on a hill approximately 2kms from Molyvos.  A small, family owned (although family not on site) 72 room property, with 4 stars which is a little dated perhaps, but rooms were clean and adequate.  ROOMS Large room, AC works well, although the bathroom in our friends room was totally unacceptable as it was too small to bathe in and if you tried to have a traditional shower the bathroom flooded !!! .Our friends therefore had to bend over the small bath to wash hair etc and then sit it the…", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r178977436", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 5, "Rooms": 3, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Our stay had its good and bad points", "review": "What made this Hotel for us was its pools and the two kids play areas. Just fantastic. Do not come to this resort of you want a beach holiday...the beach is rocky both in and out. You would definitely need to wear beach shoes. Had two interconnecting rooms on the first floor with a lovely outlook of the pool area and Turkey in the distance. Rooms were immaculately clean but old fashioned. A kettle was in the rooms but no cups or tea/coffee/sugar/milk. WIFI was included in our price but it wasn't working at our end of the corridor, so we would only access it in the public areas. Hotel staff were friendly and chatty. Great buffet breakfast, the outdoor terrace is just beautiful. Hotel is situated about 2kms out of Molyvos, so you really do need a car or take advantage of the hotel…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r177731532", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Calm and pleasant!", "review": "Located just around 2kms from Mithimna with its spectacular sea bay and remarkable castle located above, the Alkaios Hotel is one of the biggest hotel facilities in this corner of Lesvos island. Hotel is located a bit remotely from Mithimna but easily accessible either by foot (20mins) or by car. However, you can also use a hotel shuttle going from/to Mithimna several times a day. Hotel is placed at the seashore with impressive view of the Hawaiian-style sea cliffs nearby and sea canal (width approx. 12kms) with the Turkey coastline clearly visible on the horizon. Hotel has two outdoor polls with small wet bar, beautiful garden, large dining deck, kid corner, spa and very small private non-organized beach. The dining deck is absolutely spectacular, especially during dinner time.…", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r175334638", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Really average!", "review": "Excellent hotel for families with children. The pools are fine but the \"beach\" is not the one where Di Caprio went. It is only an entry to the sea. The service is good but we did not have really the opportunity to check them in pressure. For sure are very friendly and helpless. Awful breakfast, which tries to look good, but the quality of the food is almost the worst possible (except of the Feta and the olives). We can not expect in this category something better in \"The all-inclusive age\". Pool bar has the same problem. Cola from \"Lidl\" and house wine....have a beer! We did not have lunch or diner. The location is good but you will need a car or a bike to move around. The room is fair and offers the principal. And also its better in the reality than at the photos. If you get a…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r174003470", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Average hotel with a bad beach", "review": "Alkaios is a average hotel by  the seaside but unfortunately they dont use this advantage. They have 3 big pools bbut nothing by the beach. Only few sunbeds and umbrereallas which looks very dirty. They didnt change my beddings for 4 days but they change towels if i put one on the floor. Breakfast is ok nothing great , fetta cheese, olives , tomotoes and some hot stuff. We got a room for 60 Euro which is good price for august. If you wanna got to Molivos, you need a car or take a taxi for 5 Euro.", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r173648480", "sub_review": {"Value": 3, "Location": 2, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 2, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Great greek vacation", "review": "Eftalau, Molyvos. Hotel Alkaios. WOW. I ordered a vacation based on the travelagent saying that it was a nice place.... I read some of the reviews here on tripadvisor, and had my doubts. But those old reviews are old, and things are happening. When we arrived with the bus late evening sunday, we where well taken care of by the staff expecting us. Tammy the GM was even so kind to carry my wifes bag to our room. In the reception area you find will Tammy and Joanne and a couple more, they will do almost anything for you to make you feel good at your stay. That was my personal experience. But I also asked nice, and nice questions might get you nice answers. In the poolbar we had your barman George, when my wife an I played backgammon, he came, looked at our game, shaked his head and…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r172425795", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great hotel, friendly staff", "review": "We spent 11 days at this hotel, the all inclusive service. First of all, the staff is very friendly and ready to help whatever you need. Special praise to the hotel manager Tommy. The rooms are spacious, clean, with a terrace. We got a view of the parking lot with palm trees, and it was not as bad as some have written. Bathrooms are large enough, with a bathtub. The door of the room badly insulated sound, as it is already written. A room maid cleans the room every day, twice weekly linen change and towels every three days. For 3 euros per person you have the ability to get every day clean towels for the beach.  The food is very tasty and a great choice, except that the selection is repeated every few days.  For dessert they serve a couple of cakes and the offer is the same every…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r170040016", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 3, "Rooms": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fantastic unbeatable Holiday", "review": "Having been to Greece for nearly 30 years ,last holiday was in Rhodes 2 years ago very disappointed as the real Greece had disappeared. THEN SUDDENLY I WENT TO ALKAIOS HOTEL ,and no io don't work for them went their first week in June and their are not enough words in the English Dictionary that can explain how wonderful our holiday was.From the time we stepped into the hotel until our final steps out the experience was wonderful. LOCATION-BRILLIANT ACCOMODATION-SPACIOUS CLEAN BRIGHT AND WONDERFUL FOOD-EXCELLANT HOME COOKED FOOD. LOCATION-COULD NOT HAVE BEEN BETTER. STAFF-WELL WHER DO I START FROM THE HOTEL OWNER TO THE CLEANERS NOTHING WAS TOO MUCH FOR THEM THEY MADE US FEEL LIKE ONE OF THE FAMILY. The hotel has gone through a tremendous expansion by the local owner and is…", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r167942883", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Disappointing hotel", "review": "We visited the hotel at the beginning of July. The location of the hotel is really good (just a couple of km away from Molyvos), but we faced a number of issues during our stay:  a) we spent 4 days there, nobody changed our bath towels or the toiletries  b) bathrooms have no windows or ventilation so everything was really stuffy  c) rooms have no internet access – even though we had repeatedly asked before booking d) breakfast contained only low quality products the quantities of which were also small. In addition, when something finished (i.e. butter) they would not replace it d) the ladies at the reception were impolite and could provide no assistance. They were even making inappropriate comments in greek about tourists from abroad who were complaining about the services they…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r167131025", "sub_review": {"Value": 1, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Those bad reviews are absolute rubbish", "review": "I am in Alkaios hotel right now and I can tell you that those bad reviews (that almost put me off when booking) are absolute rubbish. Let me explain why (I will share now some quick impressions and come back with another review after the whole stay at the hotel) :   1. First of all, the entire hotel is excelently placed right on the seafront. Unlike 99% accomodations on Lesbos (and on most greek islands), which have a road (in most cases that's the main road!) between them and the beach, Alkaios is actually a beach hotel. This is very important for families with small kids but also for anyone who doesn't like to watch and listen the cars passing by all day long.  2. The architecture is beautiful, the terrain is very well used and from the rooms and the restaurant you overlook…", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r165547329", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Alkaios Hotel", "review": "This beautiful hotel with a breath-taking view across the Aegean Ocean and Turkey in the background is luxurious, ideally situated and very well maintained. The many pools are cleaned on a daily basis and as with the rest of the hotel are beautifully clean and well maintained.  The food is excellent and varied to cater for most tastes.  The room is comfortable with a balcony overlooking the pools and Ocean.  The people working at the hotel are friendly and engaging.  A free lift into Molyvos and back offers the opportunity to explore the beautiful surroundings, enjoy the wonderful scenery and the various shops and bars.  Molyvos and its people are enchanting and the hotel offers a beautiful relaxing atmosphere.  Beautiful small birds compliment the surroundings and a bar by the…", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r165514766", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Very nice hotel", "review": "Very nice hotel in a  beautiful location. clean rooms and quite comfortable. the view from the room was great. The breakfast was excellent. (one of the best i have ever had in a hotel) It is actually a 4 star hotel and not 3 star that it appears in booking.com.", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r164710251", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Beautiful location", "review": "This is a fantastic hotel, great for a peaceful relaxing holiday. The views are amazing, the whole island is beautiful but from our room balcony and many other areas of the hotel you can see the coast of Turkey across the sea. The rooms are a little small but it did have a flat screen tv and DVD player. The bathroom has a drain (with cover) in the middle of the floor but this is because wet rooms are standard in Greece, they don't usually have shower doors but it looks like they have put one in to satisfy the guests (commenting on this as some other reviews mentioned this) and the rooms are very clean. Pools are beautiful, cleaned every day and it was very quiet when we went so no morning rush to claim a sun bed. The hotel is family run with a few English / Dutch staff working…", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r164299517", "sub_review": {"Value": 5, "Location": 5, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Peacefull get away", "review": "Firstly would like to say that Thomas cook are not doing a great deal in promoting this beautiful hotel that is located in an outstanding place where the view is breathe taking. More people need to come down and check this place out, highly recommended. The house keeping is great, staff attend and cater for your needs whatever they may be and are most welcoming. There was a good variety of food available, however on an evening there was plenty of broad beans as one of the options. Catering staff were always present, great service. The spa was sensational, again one to try however that costs a mere five euros for as long as you like, small price to pay for what you are getting. The gym is pretty small but it gets the job done. Overall, the stay at this hotel made my holiday.", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r163461513", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very good, with some minor improvements it could be excellent!", "review": "Positives: Nice location with lovely views of the coast of Turkey! Staff is friendly and very helpful. Free shuttle bus to Molyvos four times a day. Buffet style meals with plenty of choices, soft drinks, wine, beer and ouzo. Plenty of sunbeds around 2 pools plus a kid's pool, and a small sandy beach strip.  Negatives: Very uncomfortable beds. Small bathroom with a deep drainhole in the floor. I lost my footing a few times before I figured out not to step into it which was kind of hard as it was perfectly centered on the bathroom floor.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r141348525", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 2, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Perfect position", "review": "The hotel position perfect the hotel staff all so friendly and welcoming the cleanliness of the hotel again spotless all the pools cleaned everyday along with all the surrounding areas you could not wish a nicer place with any amenity needed . A couple of moans but not really enough to warrant a complaint with the tour operator 1 the food could be counted as a little bland with a few more herbs and spices it would be so much better  2. All the advertisement showed a flat screen tv and jacuzzi baths in all rooms which is not the case (probably a little petty in my part) 3 and the worst in my view dont expect the local rep to turn up could not be bothered to attend the hotel during  our 2 week stay he could only be counted as pretty useless so dont expect much from him . Apart…", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r140948058", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "expected more", "review": "I spent a week in this hotel and i was a bit disappointed. I spent way more money on the hotel this year than i did before in Greece, since i wanted it to be a bit more special... The hotel has a beautiful location with great view of Turkey, it's about 25 minutes walk to Molyvos, plus they have a free mini bus service that goes to Molyvos 4 times a day. It has 2 big pools and 2 small ones for kids, lots of sunbeds, a pool bar and a beach that we didn't use. There's also a spa (5euros per day), which has one outdoor pool with 2 jacuzzies and one pool inside (plus saunas and gym) which nobody uses in this hot weather. But it's only open from 11am till 18pm. The hotel was fully booked when we were there and there were lots of families with small kids, so you have to expect lots of…", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r137707518", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 2, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Mixed feelings", "review": "My husband and I spent 4 nights at Alkaios last week and unfortunately, I have mixed feelings about the place. Let me start with the good stuff. The place is very nicely done with a lot of marble and tasteful furniture and comfortable sofas around. The room we had, although a bit small, was very nice with plenty of room to store clothing, the bed was comfortable and the bathroom with a jacuzzi tub and marble walls was very, very nice. The pools were very nice and even the rocky beach was a wonderful plus to the complex.  Food and drinks were plentiful, to the point that if you take advantage of all the snacks and happy hour offerings you will gain weight! The hotel is very closed to Molyvos, I understand they have a shuttle, that we didn't use because we had a car. It is also…", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r136919205", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "brilliant hotel", "review": "We have just had 2 weeks at this hotel it  was fantastic the food was great the rooms very clean and clean towels everyday the staff was friendly, cannot understand why anyone has complained.  I would recommend this hotel if you are looking for a fantastic holiday", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r135998647", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fantastic holiday", "review": "We have just got back from a two week stay at the Alkaios and thought it was fantastic. Our room had the best view in the whole hotel, with two balconies, one overlooking the sea and the other the pool. The room was kept spotless throught our stay and towels/bedding was changed regularly. The food seems to be something that a lot of people have previously complained about, god knows why! We thought it was excellent, there was plenty to choose from, five different main courses for dinner and four for lunch. There was just about every dish on the salad bar that you could think of and there was also at least five hot side dishes. Desert always included water melon and a choice of at least seven different types of cake. Free drinks of wine, ouzo, beer and all the soft drinks was…", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r135771533", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Pleasant stay", "review": "We stayed there 3 nights and enjoyed the stay thoroughly. The staff  is very friendly and extremely helpful. The beach turned out to be better than our expectations as we had read some very negative reviews about it. The sea is so clean that you feel like drinking it. We had not taken an all- inclusive plan because we like having food elsewhere. We just had  breakfast  at the hotel and i think that is their only weak point...", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r135433495", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "I had such a pleasant stay at the Alkaios Hotel!", "review": "* ROOM : our room was cleaned properly every day. The beds were a bit firm but we slept well on them. When we put a towel on the bathroom floor it was replaced. Enough room to put your clothes etc. AMAZING seaview. Only one complaint: the locks make quite some noise when your neighbors close their doors.  * BUFFET : in the morning I'm usually not very hungry so I don't eat that much, but the lunch and dinner buffets (Greek buffet) were very good. The salads were super fresh. The tzaziki was the best I had in years. Every day different meat/fish/pasta or a dish like stuffed aubergines, moussaka etc. Lovely Greek deserts! And thumbs up for Christos the chef, always doing his very best to make sure there is enough to eat for everyone.  (A note to the critics: when you make a buffet…", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r133101536", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "It's not where you think it is - it's better!", "review": "My wife booked this hotel for us to come away and celebrate our 20th wedding anniversary. Molyvos was our first holiday together 24 years ago (romantic or what!). From her memory of 24 years ago and the \"beach\" location our tour operator referred to, she thought we were down near The Olive Press Hotel (the one with the chimney in all the pictures), as that's the \"outskirts\" of Molyvos which is on the hillside. The hotel is in fact on the other side of the mountain and fortress - definitely a bit more than the outskirts of town!! It might be a c.25 mins walk into town, but it's the gradient of the walk you need to consider in 35c of heat. Used the minibus once all OK and the taxi back was 5 euros. We hired a car to explore the island anyway. But reviewers issues to the location…", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r131961263", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Such a disappointment!", "review": "Just returned from two weeks at this hotel. We have booked 'All-inclusive' Greek holidays for the last six years and expected a similar set-up here. What a shock! There were only eight people staying here for the first few days then a few more joined us. Food offerings were meagre and limited, we grew sick of spag bol  and Greek salads  Drinks , again, limited selection. A' free cocktail' per night was a slushie with a shot of alcohol - whoopee!! A few of the staff were lovely and really helpful but others were bordering on rude if asked for something they couldn't help with. Our room was very good and very clean and the surroundings were beautiful so we did every trip and excursion available and were truly enchanted by the beauty of the island! There was no evening…", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r131365771", "sub_review": {"Value": 2, "Location": 4, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 4, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "aperigrapti empiria!!!", "review": "paidia piga 2 ebdomades stin lesvo & emena ston molybo & epatha tin plaka moy!!!!!!! ektos oti itan ena panemorfo meros, to ksenodoxeio poy emena itan ena palati me oloi tin simasia tis leksis... apo ton kosmo poy doyleye mesa mexri & tin diakosmisi toy ksenodoxeioy... eixe katapliktiko service yperoxa domatia fobero fagito..  & to pio oraio apo ola einai to spa to opoio to latrepsa... to kalitero apo ola itan ... i timi... poly oikonomiko ksenodoxeio...  anipomono na erthei ksana to kalokairi gia na pao pali... i oraioteres diakopes moy!!!!!!!!", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r119521586", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Back again in our favorite Hotel ; Alkaios", "review": "And again we would like to tell  everybody what a beautiful hotel it is !    We come here , in this hotel 2 times each year , for the last 4 years .    Because it is a perfect place to be , the hotel is beautiful , the rooms are very nice ,    the pools are great , the food is very good and the view is the best in all of Lesbos !     For us it is like coming home , also because of the very friendly staff ,    they will do anything to make your stay as pleasant as possible , and to us they feel like     friends ,     But not only we keep coming back , every time we see that people are coming back ,    and they feel the same way about this hotel .     So, we are already looking forward to next year !          Thanks again Hotel Alkaios !!", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r119516031", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Perfect", "review": "I was part of group of 6 people who visited this hotel and have been going to greece for years, so after reading all these reviews i was abit worried about we were letting oursleves into but luckily i neednt have worried its was Perfect. The rooms were comfortable and well air-conditioned. The views from our room were stunning, the pool areas were clean and had plenty of sunbeds to go around. The best part of the hotel was the food by far  i love the traditional Greek food and salad they was always something different to have each night which. We even had a very fussy eater who tried everything and is now a Greek food nut now. The staff were fantastic stratos made the effort to talk to everyone and ensured everything was enjoying themselfs. He would drive us into Molyvos most…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r119223028", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Great hoilday", "review": "After reading some of the reviews before our holiday about this hotel I was worried but wow the hotel and staff were excellent. The location was superb for what we wanted, I can not give the staff enough praise they were really helpful and cheerful even though it was nearly the end of the season. We were there from 17th Sept to 1st Oct, when there was a thunder storm and our room was flooded through no fault of the hotel after wi-fi was installed and holes through roof were not filled properly the staff moved us straight away with as much as help as they could give, Stratos the courtesy bus driver and Nicolas the bar tender were the best so happy to help in anyway possible. The only small problem was that the food could have been warmer but the choice of 4 or 5 main courses…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r119135748", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Alkaios Hotel - what a gem!!!", "review": "Will we go back?- yes yes yes.   This hotel is in an idyllic location - quiet, unspoilt and overlooking the sea.    There are plenty of swimming pools to choose from and for a small fee you can spend all day by the spa pool which has jacuzzi pools within and jets to massage you.  The area is very sheltered with a glass wall so you can sit back, relax, look out to sea and watch the world go by - bliss.   As with previous reviews the staff are so helpful.  I travelled with two friends and we were first shown to a lovely room with an extra bed in which would have been a little cramped for us.  Helena on reception asked how our room was and, on explaining he situation, immediately looked to see if she could change it for us..  The next day we had a much bigger room for no extra…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r118875751", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Real Greece", "review": "Ok, if you've seen any of my reviews you'll know Im a travel agent and one that travels alot. Ive been to Lesbos previously, staying in Annaxos over 17 years ago and have been to over 20 Islands in Greece. This was by far the best Greek holiday Ive had in a very long time. Mainly because it was a real Greek holiday , with real Greek food ( a major plus for me and my party of 6). We all loved the food, it was as good as if not better than the restaurants in Molyvos, so much so that we only bothered eating out once, just for a change and wished we hadnt bothered. There wasnt much to do in the evenings at the hotel so we usually took advantage of the free shuttle bus into molyvos and chilled in a variety of traditional greek bars, bliss! The people are so friedly and this are def…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r118741939", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 3, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "The Best hotel!!!!!!!!!", "review": "We stayed  at  Alkaios hotel 15 days in Aug, the only we  have to say is that we had the best holidays!!!!!!! First the rooms are very comfortable cleaned  every day , many facilities in the room,   view fantastic to the Aegean sea, the stuff of hotel very friendly .We had bed and breakfast but when we taste the food that served in the restaurand we asked to be  All inclusive!! The food well cooked and served. What to say for the spa area and all the spa facilities hotel provied every thing was perfect, we want to say  that Alkaios is more than 4stars.", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r117715680", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Not worth the money, very disappointing", "review": "We stayed for 2 weeks late August, 2011.  You'll always get mixed reviews but this is our honest appraisal: 1. Staff - a couple were friendly (Stratos and Nick) but the majority were very rude and couldn't care less about customer service or just being polite - they just don't really care and standards are very poor.    2. The Food - if you like to eat exactly the same dull, very poor quality food for breakfast, lunch and evening meal every day of your stay then you'll be OK here.  The food was truly awful by any standards and as a result we ate out every night and only had toast in the morning (we bought our stuff to eat at breakfast).  We are certainly not food snobs, far from it, just a normal family but with basic standards.    3. Our Room - we think we probably had the best…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r117650644", "sub_review": {"Value": 1, "Sleep Quality": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Continuous mistakes by service", "review": "2 couples, arrived in August. At the first night the given rooms were not what we had agreed upon reservation. We were however offered a free dinner for compensation. Next day we were assigned the correct rooms however upon returning late at night we discovered that one of them has not been cleaned by the cleaning service.. Garbage from previous tenants were visible, bed linen not changed - bathroom not cleaned. So one couple was moved to another room just for this night. At this room the balcony door could not be locked from the inside. This room was at the ground floor..That has done it for all of us so we decided to leave the premises. No argues from the hotel management , nore any valid explanations for all this mess.", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r117001488", "sub_review": {"Value": 2, "Sleep Quality": 1, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Fantastic Lesbos", "review": "Our 1st visit to the Greek Islands arrived on 23 July 2011 and left 6 August Rm 213, the service was fantastic nothing was too much trouble for the staff all very friendly. Our host Stratos was great fun and ran and good free bus service to Molyvos. Very clean, very comfortable.Food was excellent.The feta, yoghurt and tzatziki were to die for. The pools were maintained well, the views were excellent. Special thanks to Nick for excellent service with plenty of beer, no problem with all inclusive ouzo it was Greece after all, granted imported drinks had to be paid for.Additional thanks to Achilles for supplies of cold drinks and coffee at the poolside, must get him a new CD.   Our tour Rep Andy was also great from first meeting him at the airport on our arrival to our departure…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r116871183", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fantastic :-)", "review": "Please do not take any notice of the negative reviews on here. We stayed for 1 week in June & really wished we had booked for two. I confess that I was a little worried by the reviews I read before we went & did contact Thomas Cook who answered ' remember anyone can post on review sites so read carefully & make your own mind up '. Well I have to say they where right. The hotel, location, food & staff where great. All inclusive was super, choice was good & cooked well. The choice was plentiful & well cooked. Drinks, ok there was only beer, wine, ouzoo & soft drinks ( whiskey, vodka,brandy etc etc etc ) where available at a small price. Location was second to none & the rooms where spotless, cleaned daily with fresh towels ( linen every other day ). The staff where friendly &…", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r116487058", "sub_review": {"Value": 4, "Sleep Quality": 5, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "The Real Truth .......... Fantastic", "review": "We arrived on 23 July 2011 and left 6 August.Very clean , very comfortable.Food was excellent.The hotel and pools were very clean.Make sure you get to know the staff especially Stratos the manager and Nick the best bar man in the world.Nothing was too much trouble for the staff,when we were there, there was a taxi strike and Stratos run us about in his mini bus, wouldnt accept any money for it.The views are stunning as is the location.We have been to many greek islands and hotels and this was by far the best.Our tour Rep Andy was also brilliant from first meeting him at the airport on our arrival to our departure.He gave us plenty of local information sorted out our hire car and made sure we had a good time.Would we go back DEFINITLY", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r116378309", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Fantastic", "review": "I absolutely loved it here the hotel was fantastic we had a fabulous room with a sea view. the staff were very friendly and always to help you. The food was lovely. In all I could not fault anything about my stay at the alkaious. Will definitely go back.", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r115497816", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Totally amazing and we will definately go back there and recommend it to anyone.", "review": "The hotel  is set with stunning views.The staff are very friendly and willing to help and advise you on the best places to go and visit.We found the food excellent and the hotel imaculate.Staff will always go out of their way to make sure you enjoy your holiday without any hiccups. It was our first visit to Lesvos and i have to say despite the fact that a few people had issues from having read the trip advisor ,these issues were un-called for. It is always best to read the small print on the hotel before you decide to book,then go with an open mind and find out for yourself.We will definately go back there as we went with just the two of us and came back with many  friends including some greek. The thomas cook rep was outstanding. The outcome of our holiday is,the hotel and…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r115443621", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "fabulous ignore the negative comments !!!!!!!!!!", "review": "firstly i would like to say what a beautiful place this is , the hotel is set in a stunning location on an unspoiled island ,  the island doesnt rely on tourism and is real greece , i have been to many greek islands and to lesvos twice , i can honestly say this hotel is perfect the staff are superb , they will help with anything you need , srtatos the manager and nick the barman in particular are fantastic , the food is typival greek which is where you are , if you want english go to benidorm or stay in england , the hotel is clean , rooms are cleaned regularly , the all inclusive does only consist of beer ,wine , ouzo,and soft drinks , i cannot beleive what some people were complaining about , the pool was cold the food was cold ,,molyvos was hilly , ,it was to hot ,,to windy…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r115437338", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "All inclusive but not as you know it", "review": "We booked an all inclusive holiday in good faith with Thomas Cook based upon their description of the holiday, hotel and facilities.We did not receive the all inclusive holiday that we booked. Firstly the strengths: Hotel has wonderful views over the sea and to Turkey from the dining terrace. Rooms are spacious, clean, and beds comfortable. Bed linen and towels changed every other day. Food whilst well presented was lacking in variety, chicken and pork every day cooked in a variety of different ways, lunch and dinner. There was a large selection of salads, and cold meats and bread. Staff cheerful and work hard in the resturant particularly. Opportunities for improvement: The only alcohol provided that was part of the all inclusive package was beer, wine or ouzo, spirits or…", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r114993763", "sub_review": {"Value": 1, "Sleep Quality": 4, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "we realy love Alkaios and will go back again !", "review": "I realy can not believe some of the reviews i just read !? Our experience is as always ( we where here for the sixth !! time ) fantastic !  Maybe even better than ever , because the owner is constantly improving the hotel . The food was great , the staff was  friendly and helpfull , the view stays amazing . Every time we arrive there, it feels like coming 'home' !  If you want free cocktails go to a resort in Turky , but if you realy want to experience  the Greek way of living and enjoying life , go to Lesbos and its best hotel : Alkaios !!", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r114677164", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Great location,", "review": "We have just returned from two weeks at the Alkaios hotel, upon arrival the reception was good, the foyre is comfortable with soft furnishings, we where shown to our room, there is a lift, we had a sea view, the views are excellent over to Turkey, there was a large kettle in the room, as we discovered not all rooms have kettles but i believe you can ask for one, there is a catch though, my wife asked for a couple of cups to take to the room when we were in the dinning area, and were told we are not allowed to take cups to the rooms, we bought a couple of mugs from town. The electric to the room turns off when you remove your key from the adaptor on the wall, when you go out, We found that the fridge retained its coolness in the day when we where out from being on overnight, the…", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r114650749", "sub_review": {"Value": 4, "Sleep Quality": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Nice hotel - Shame about the all-incusive(Rip-Off) service!!!", "review": "Arrived mid May 2011 on so called All-inclusive holiday, everything looks great on arrival, hotel lounge areas look comfy the rooms are reasonably spacious and are clean with TV (limited channels) and a fridge (empty) which only works when your key is in the wall holder as with the air-con, but didn’t like the inter-connecting door as you could hear next door occasionally!!! But great sea views from balcony if on that side of hotel. Oh and a lonely kettle with no water, no cups, nothing. If you need to get big bottled water turn left out of hotel 30m down road to take-away pizza sells various drinks etc. As me and my partner like to eat and drink as much as the next person on an all-inclusive holiday imagine our surprise when all alcoholic drinks were limited to only 4 options…", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r114616889", "sub_review": {"Value": 2, "Sleep Quality": 3, "Cleanliness": 3, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Not what we expected", "review": "The hotel is in a lovely location,but it certainly is not an all inclusive package.We felt very let down by the description in the Thomas Cook brochure because it did not live up to the description given.we were told that the hotel had installed a water filtration system so that the tap water was safe to drink?The pool area was spacious but very loud music playing, not relaxing! The food was not up to standard,it was hit and miss sometimes the food was warm sometimes not, coffee was luke warm as was the water.The staff we found very friendly and Molyvos town was beautiful and hope to return but not to Alkaios.", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r113659766", "sub_review": {"Value": 1, "Sleep Quality": 3, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "'All Inclsive' Don't be fooled . . . . . ???", "review": "'All Inclusive' No, No No, Do not go . . . . ??? Arrival – No information, No lift, No direction, Not even a drink. Room – Empty fridge, that only worked when you were in the room so that was a waste of space, what good is a fridge with no electricity, No water, Kettle, No cups, tea, etc . .  Meeting with Rep Andy  - How he walks in each week knowing the complaints he is going get by badly let down guests,  and saying that we can all have a complaint form – WHY – when we returned the form he just told us to complain directly to Thomas Cook, he also said that some of our complaints had been dealt with, I would like to know what these were, was it the laminated piece of paper placed in our room after 2 days, the one that I suggested should have been there in the first place or…", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r113174462", "sub_review": {"Value": 1, "Sleep Quality": 3, "Cleanliness": 2, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Nice hotel..... poor food", "review": "The hotel is very nice in modern style and in beautifull settings with mountain and sea views..... the staff were very helpfull but the food did not live up to what i expected, too large choice  of poor quality prepared food instead of a few choices of high quality...... stay on the greek cuisine instead of tourist food. Finally music is played in the breakfast area where one should be able to eat in peace. Lovely pool areas ..... but spoiled by very loud music from the bar which could be heard in every pool area. I enjoy peace and quiet on my holiday. Nice rooms with free aircon.", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r113071950", "sub_review": {"Value": 3, "Sleep Quality": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "IT STARTED SO WELL", "review": "We arrived at the Alkaios Hotel at the end of may, and were greeted with snackes and drinks. My parner and i thought we had made a great choice. How wrong we were , firstly the All inclusive package was missold to us, it consists of only four drinks, these are, ouzo, beer , red wine and white wine. there are no snacks between meals,even though they have a brick bbq down by the pool . theres no entertainment, and the food is the same, down to the last detail, at breakfast lunch and dinner. the hot water for coffee is always cold, and you have to pay for bottled water. the room, albeit nice had a fridge that never worked, even after we reported it. the bar staff seem to busy getting drunk, to care. the hotel is about a 30 minuite walk from the hotel, even though the holiday…", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r112382568", "sub_review": {"Value": 1, "Sleep Quality": 2, "Cleanliness": 3, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "beautiful hotel on an awful beach", "review": "this hotel is beautiful, beautiful swimmingpool  with whirlpool. the swimmingpool is not clean, but we are there in may, the season is yet beginned. The roomsare good, and the rooms with seesight have a beatiful vieuw. The personel are friendly. The beach is terrible, a small dirty beach. The food are not varied. The way to the centrum is over the hill and is very high.  4 x per day a hotelbus drive to the centre. on 400 metre there is a small shop.", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r110380580", "sub_review": {"Value": 2, "Location": 1, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 3, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "'Absolutely Fabulous'", "review": "After reading some of the reviews about this hotel we were a little worried to say the least!  There was no need! This Hotel is as stated 'Absolutely Fabulous' - from the spotlessly clean rooms - done every day - bed linen changed every day - to the fantastic service of every member of staff in the hotel - especially Costas at the pool bar and Maria on reception.   Nothing was too much trouble.  Honestly we could not have asked for more.   We stayed on a bed/breakfast basis - breakfast ws fine - the times were very relaxed - there was a choice of a cooked breakfast, breads,cheeses,hams and yogurt and cereal for the heath concious!  The views from every part of the hotel are stunning - the view from our balcony was over the Aegean looking at Turkey!  Breathtaking.  The hotel…", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r80176123", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Overpriced.", "review": "The Alkaios Hotel on face value looks beautiful and does have the makings of a top quality hotel, however a number of factors meant that our stay was nowhere near as pleasurable as we had hoped.  The 200m of private beach is more like 20 (unless you're prepared to walk through the wet, dirty seaweed).  During the two weeks that we stayed, we never once saw anyone clean the pools - the children's pool was filthy and the spa pool had all sorts of debris floating around in it.  One of the other pools had a worm floating in the bottom of it for three days!  They gym was a collection of rusty weights, the only excercise bike had its handles hanging and one of the running machines didn't work therefore the gym comprised of one running machine and a cross trainer.  The sauna didn't…", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r80110418", "sub_review": {"Value": 2, "Location": 3, "Sleep Quality": 1, "Rooms": 3, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "very disappointing - run down and poorly managed", "review": "We were promised - albeit by Thomas Cook - a top class hotel with a range of facilities.  Although the pools were good, the other aspects - dirty room, missing furniture, rude staff, frequent powercuts, stale food, and poor service - made this one hotel we would never stay at again.   Apologies to non-Brits reading this review, but it needs the 'hotel inspector' to sort out the staff bickering and mismanagement.  A great shame as Lesvos deserves far better.", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r79378616", "sub_review": {"Value": 1, "Location": 3, "Sleep Quality": 2, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Great hotel", "review": "Alkaios hotel is a great choice for a very comfortable break. We stayed in one of the mezonette rooms which accomodates 4 people. Room was a spacious duplex, brreakfast was better than average, staff friendly and the best thing about the hotel was the choice of swimming pools. Srayed there for 3 nights and did not bother going to the sea, as the pools were a treat (with waterfalls, water massage, jacuzzi, etc)..  Room was not cheap but it works out cheaper than to 2 rooms (that accomodate 4 people). Molyvos is nearby as are other interesting places but would recommend a car or bike to get around. On the downside WIFI was not working and TV showed only  foreign channels which may disappoint Greeks.", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r79345251", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Breathtaking views, comfort and relaxation", "review": "We have just spent a week at this hotel and have had a wonderful time. The location is about 1.5 kms from Molyvos. It is therefore quiet and relaxing but the town can be easily accessed via the hotel bus or taxi (we used both means to our satisfaction). The pools and spa were excellent. Plenty of sunbeds with nobody putting their towels out to reserve them at the crack of dawn! Breakfast was adequate and with enough variety to suit most tastes. Our room had a breathtaking sea view (well worth the extra paid) and a lovely balcony with 2 comfortable chairs and a small table. The air conditioning in the room was very efficient. The beds were comfortable and the linen and towels were changed every second day. Minor irritations were poor service for drinks around the pool and the…", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r76504488", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 5, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "just superb !!!", "review": "aa week spent in this delightful hotel in its beautiful semi rural situation above and looking over the agean and turkish coast - high qualiry fittings - spacious - great terraces - friendly and helpful staff - wonderful room service and 5 swimming pools in addition to a small beach  with pool service and a great jacuzzi pool - one of the best i have ever used for Greece and the islands - quite excepional - and deserves real success", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r75449951", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "You must have been in Alcaeos !", "review": "In june we where in hotel Alcaeos for the fourth time . And again it was great , It is even getting more beautiful every time we come back . The hotel is build on the best spot in Lesbos , the view is realy amazing ! The rooms are nice and clean . All the staff is very friendly and and they will do everything  to make your stay in Alceos one to remember ! There is not a big  beach , but who needs it when there are so many big beautiful swimmingpools !  For us Alcaeos is the best hotel on Lesbos !", "date": "June 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r72034151", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Not like advertised – unfinished and dirty", "review": "This hotel is not anything near how it's described on the hotels webpages. Based on the pictures only, the hotel is spotless. If you actually go there, the hotel seems unfinished and lacking several of the major facilities advertised. Not a real restaurant, dirty playgrounds, dirty pools, electrical wiring sticking out everywhere, a private beach where you  can't see the sand because of all the seaweed, rude staff, no operational spa, rusty and dirty excercise equipment and rude staff. Check out a family run hotel instead is my advise.", "date": "June 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191869-d1729448-r69539561", "sub_review": {"Value": 2, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 2, "Service": 1}, "travel_purpose": "", "rating": 2}]