[{"title": "Boutique Hotel?! Maybe Antique...", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1733585-r195367900", "sub_review": {"Value": 2, "Location": 3, "Sleep Quality": 2, "Rooms": 1, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Good and cheap!", "review": "The rooms were indeed on good price for the area: very close to touristic attractions (Sofia, Blue Mosque, Cistern Basilica etc), but hotel itself is in a bad shape, old and unattractive. Even consider staying here for sleep only, beds are uncomfortable and shower cabin are chemistry tube size, an adult heavy fit in it. Whole room looks sad and overwhelming. Fairly breakfast on top of building and no elevator, access on the terrace on fire escape style stairs. For few more euro, better booking elsewhere. The hotel photos doesn't reflect reality, maybe in the firsts running year. And BE ADVISED on reservation by credit card : We booked with a credit card and they charged us in advance for the full amount of payment and there we had to pay cash again for the reason that they will refund your money on credit card?! They did not do so, and when returned home had to go myself at the bank to make a refusal for that transaction and wait another 20 days until the funds were released. Nowhere have happened like that ... And it does not provide a receipt!…", "date": "November 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1733585-r185939098", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "EMMASARAY HOTEL", "review": "I reserved a family room and when I arrived with my friends they gave us instead 2 double rooms because the family room wasn't available. The rooms were just ok and the bathroom was a little dirty. The staff was really nice and helpful and overall the hotel was perfect for me and my friends because we had a low budget but still wanted to be close to the important things in Istanbul and it was nice that the breakfast was included.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1733585-r180707207", "sub_review": {"Value": 2, "Location": 4, "Sleep Quality": 2, "Rooms": 2, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Decent, not bad", "review": "What can l say Istanbul is amazing but the hotel is not,it needs a very good clean and the rooms need decoratedThere are no lifts we are over 70 and had 54 steps to our room, The only good thing about the hotel the view from the verrandas  are brill and its near every thing.Our room was not good it looked has if someone had drawn on the walls over the beds and they had got some paint that NEARLY matched and just gone over the drawing not the full wall.I think for the same price you could find a better hotel PS please dont go on the cruise up the river at night very expensive and not good value,", "date": "March 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1733585-r157453949", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "I have found a curb at the wall of my room, I want to back my money but they didint.", "review": "We came to the hotel and were ok with the hotel, as it was jus my friends and i so we didn't really mind the hotel, as we just needed a place to sleep, however i wouldn't recommend this hotel for a family, as i feel it is not the right standard for a family. But the staff were really helpful, friendly and welcoming. The rooms are decent, and the breakfast i didn't prefer because it was the same thing everyday. However this hotel is situated in a very good area as everything is just walking distance so you will save lots of money on taxi. But i still feel if it is just friends going then this hotel will be decent for you.", "date": "February 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1733585-r153484474", "sub_review": {"Value": 1, "Location": 3, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "", "rating": 1}, {"title": "Very Bad experience", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1733585-r140376157", "sub_review": {"Value": 1, "Location": 3, "Sleep Quality": 2, "Rooms": 1, "Cleanliness": 2, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "The worst hotel I have ever been to", "review": "We had very bad experience at that hotel, when we arrived the owner wanted us to pay for the whole stay which was planned to be 10 days, but after arguments we agreed to pay only for 4 nights. We discovered that the hotel was very expensive comparing to others around, also the breakfast was very bad they couldn't handle more than 10 people at the same time, having only 1 inexperienced person serving the breakfast and we discovered that person was the one responsible for the hotel cleaning. only one kind of cold cuts and no cheese at all and usually there was none left and we had to wait until she refill the plate again with food. we will never book in this hotel again. the pictures they are displaying for the hotel are not true and the rooms and reception are very poor in…", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1733585-r136128847", "sub_review": {"Value": 1, "Location": 5, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Bad experience", "review": "When we arrived at the hotel they gave us two rooms (there were 4 of us) even though we asked for one family room. They said that this room was not available that night and that they will move us to it the next night. We arrived in Istanbul late, after travelling whole day by car, with two children and we agreed to stay in these two rooms for one night. But, when they took us to the rooms we just couldn't believe our eyes. They were on the roof top and even though we tried to negotiate with the owner he just pretended as if he doesn't understand English. So, we stayed there since we had no alternative for that night and the noise was unbearable. The rooms were a total disaster, stinky. The next day they moved us to the family room which was somewhat better, the bathroom did not…", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1733585-r132950118", "sub_review": {"Value": 1, "Location": 3, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 3, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Bait and Switch", "review": "We went to this hotel and stayed their one night. The room was decent for the price, the TV was a little small and it was noisy.. they also had children working at the front desk who spoke little english, but other than that it was fine.  We decided to go for a trip to southern turkey for a few days and gave them a deposit to keep our room for us when we get back. We got back late and found out they had given up our room!Then they offered us a tiny, very smelly room with just one double bed for a ridiculous price (we were 3 people).   Horrible horribe service. Don't trust this hotel", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1733585-r132528080", "sub_review": {"Value": 1, "Location": 2, "Sleep Quality": 1, "Rooms": 2, "Cleanliness": 2, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Damp, nothing much works, not as advertised in the photos", "review": "This was probably the worst experience I have ever had with a hotel.  The photos on the website look great, but they are very deceptive.  The hotel is a low end budget hotel, which would be fine  if it was advertised as such.  But they mislead people by making it look much nicer than it really is, and they try to charge higher prices based on the deceptive photos.    We checked in, and I was going to pay by credit card, but the clerk requested that I pay by cash.  I did not have enough cash, but I said that I could pay by cash after getting money from the ATM the next day.  That was fine with the clerk, so we went up to the room.  My wife took one look at the room and the bathroom and she was angry at me.  The linens were oversized for the beds.  The lighting was poor.  The…", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1733585-r130344555", "sub_review": {"Value": 1, "Location": 2, "Sleep Quality": 2, "Rooms": 1, "Cleanliness": 1, "Service": 2}, "travel_purpose": "Traveled solo", "rating": 1}, {"title": "Much more best then Rose Hotel in the next two steps", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1733585-r129978592", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Please dont go to !!!!!!!! Website photos are fake", "review": "There are good, friendly and honest staff, normal kitchen, good location, low price (readiness for discount). And there is no need to bang your head on a shelf above the sink, when tilted during washing your face - like in Rose Hotel (room 105). Wireless in room is poor. Cleanliness and neatness of the interior, too.", "date": "March 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1733585-r126496578", "sub_review": {"Value": 1, "Location": 4, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Worst place ever stayed. I've slept in a treehouse in the jungle with cleaner facilities and better service.", "review": "It was the dirtiest hotel I have ever stayed in. The pictures on the website are not of the hotel, none of the rooms look remotely close to the pictures.  The rooms are tiny, damp and smell really bad and nothing works in the room.  The staff are very unhelpful .   They want money upfront before seeing your room, once you get to your room you see why.   Breakfast is from 8-10am but we came down at 9am and there was no more, we asked if we could get some more but they said no all done.   Overall I can not express enough about how bad this place was, please please do yourself a favour and find somewhere else even if you have to pay a little bit more.", "date": "February 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1733585-r125397849", "sub_review": {"Value": 1, "Location": 3, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "", "rating": 1}, {"title": "Please, don't go !!", "review": "I can't express how truly awful this place is. The pictures on the website are completely false. Trust the photos of theyre dodgy rooms shown on the tripadvisor website. On arrival we told the man who claims to be the manager that we had a reservation. He had to phone someone else to confirm. He then hassled us for money up front but couldnt tell us how much it was. He kept asking us. Very confusing.   We were shocked when we saw the room but were tired so didn't argue. Basically our room was a shed on the roof. So small we could barely get our bags in and hurt ourselves getting in and out of the shower. The smell in the room was awful and the bed was damp...well wet actually. There was no security and we could hear every noise going on outside.  Later we discovered that another…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1733585-r117953731", "sub_review": {"Value": 1, "Sleep Quality": 1, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Warning!", "review": "The worst hotel we have been in our round world trip since february. Missing things in the breakfast, broken shower, very old towels and the bed seems like a stone; it's so old that we could feel the springs in our back. Please check the pictures from the other reviews !! The pics from the web site aren't true. Danilo and Luah", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1733585-r115835277", "sub_review": {"Value": 1, "Sleep Quality": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Try anywhere else first", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1733585-r114772640", "sub_review": {"Value": 2, "Sleep Quality": 3, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Steer clear", "review": "The only thing \"boutique\" about this place is that \"boutique\" is correctly spelled in its title. (Seriously: I have stayed in far better places in Nepal and Tibet.) There were ants in our room and my bed; there was very litle space to pass each other between three beds; no place to put luggage; Internet connection in our room was dicey and available within only a 2-foot radius of a certain point; and when I pointed to a sharp bedspring that was sticking out of the mattress that had ripped my jeans and torn the skin of my knee, the maid pulled up her pants leg and pointed to an identical iinjury. We prepaid for RT airport service, but when one of us stayed longer and attempted to use his  credit, he was told \"the shuttle doesn't run on Tuesday.\" At least the AC worked really…", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1733585-r107005270", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Worst hotel ever, stay away", "review": "We arrived mid evening with a reservation. Were told they were full but they could arrange for us to stay over the road. A very heated \"discussion\" took place between the two managers in which we were virtually ignored but eventually given a room. The second hotel was fine but newly renovated and not quite organised. The next morning it all kicked off again and we insisted that we stay in the second hotel, the Harmony Hotel, and eventually got our way. Things were fine after that and we enjoyed our stay. I can't describe the Emma Saray's rooms, but the reception area was grubby and unwelcoming.", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1733585-r106439221", "sub_review": {"Value": 1, "Location": 1, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "EXTREMELY BAD", "review": "Firstly, the hotel is extremely over priced and does not reflect its star rating.  My friends and I booked to stay at the Emmasaray, which is where we checked in on the night we arrived. However, we were then taken to another hotel around the corner that was essentially a building site and unsafe for guests to stay. The place was being decorated and smelled strongly of paint. There were no smoke alarms in the room and no fire escape lighting.  The room had no towels, a leaking toilet, exposed electrical wiring and the room had an over powering smell of cat urine, damp & mold. Plus there was no terrace and the wifi signal was too weak to connect to.  We requested to change rooms but were told nothing was available. When we complained about the leaking toilet, we were told that…", "date": "December 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1733585-r91711998", "sub_review": {"Value": 1, "Location": 1, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "A Beatuiful Boutique Hotel", "review": "Never, ever think about going to this extremely bad \"hotel\". Arriving in the shabby lobby was a bad start; the place had a bad smell, look and vibe. The room was not finished (4 p.m.) so we had to wait 25 minutes. When we finally entered our room it was a place where you don't even want your dog to sleep. The description of Biage (see below) is what it is, or worse. So we tried to cancel our booking ending up in a long and unpleasant fight with the owner. We left paying him 100 euro's otherwise he would not cancel the credit card payment.   For sure, the people who write good reviews of this hotel are friends and family of the owner. Do not trust them! be warned and never ever go to this place. Sleeping under a bridge is a better alternative.  After leaving (pay 100 euros and…", "date": "October 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1733585-r84657766", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Terrorific", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "October 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1733585-r84609145", "sub_review": {"Value": 1, "Location": 1, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Stay away", "review": "The worst hotel I've ever seen, the website has nothing to do with reality. Rooms very very small, almost did not fit the bed, foul odor throughout the hotel, due to the moisture that was in the walls of the rooms and bathrooms, wiring unfortunate, all the cables hanging from the wall. Unbearable odors in bathrooms, they had to be with the windows open in order to stand the smell in the room, the latter recommended by the hotel receptionist. Disgusting breakfast, a few slices of cucumber and tomato, but seeing cockroaches in the hotel reception did not give eager to prove it. The receptionist a impresentable and a liar, trying to cancel the booking, we changed to other rooms less unhealthy ... lied and deceived us until we left. do not go under any circumstances, is a disgusting…", "date": "April 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d1733585-r60948820", "sub_review": {"Value": 1, "Location": 1, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "", "rating": 1}]