[{"title": "Hey picky folks - you should peek into this gem", "review": "I have been to this resort with a big group of family and friends (10 in total). From start to finish I couldn't find anything that needs improvement. The rooms were spotlessly clean, there were tons of different foods and drinks, the pool was very clean with enough number of sunbeds, and most importantly it is located by the sea. My 10-year old daughter loved the sand beach, no rocks, nothing in the sea. The staff was amazingly hardworking and friendly. They seemed to have a great management team as they all looked happy 24/7. Special thanks go to Gonul, Sumeyya, Burak, Mehmet, Veysel, and all of the other members of staff who made our holiday so great!  ", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1747320-r707319939", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "The best room ever. Amazing pool & beach, satisified with everything (but those cuisine fusions?)", "review": "Dear guest,  thank you very much for your very kind rating here on Tripadvisor. We are happy to hear that you were satisfied and we hope to see you again!  Kind regards & all the best!  Sunis Hotels ", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1747320-r706878712", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Best vacation ever", "review": "When we arrived, we were greeted by refreshing towels and a welcome non-alcoholic drink. That was an amazing refreshment after the tiring bus trip to get there.   You get to wear a fabric bracelet to distinguish between all the hotels that are nearby. Those plastic ends can get annoying, so bring scissors!   The room was A M A Z I N G. Very spacious, smelled amazing, the bathroom was big enough for several people and you get to choose from shower or a bath. I missed having actual shower gel, shampoo and conditioner as is a standard in other hotels. But we did get spa robes so there's that.   The pool was very warm for the first few days and then, after the foam party the water went cold - which I guess is understandable if lots of it was changed over? It's not a hotel's fault but kids in the pool get very annoying but then again, the pool is enormous so you should be able to find a quiet place for yourself.   Do get up to reserve a sunbed if you want to stay by the pool, otherwise you won't be able to get any.   The pool bar is great with not only trail mix but also nachos and popcorn to choose from if you feel like your diner wasn't big enough. Lots of coctails though mojitos are pre-prepared, so if you want it non-alcoholic, you're out of luck. High quiality fruit juices with a choice of 100% and even the rest was all Cappy, so nice. Soft drinks were branded as well and included in all inclusive is even imported alcohol, which was unexpected.   Pool snack bar was amazing with a rich choice of baked and stuffed potato, pizza, hamburgers, gözleme, waffles, ice cream, salads, fruits, ...  The beach snack bar was great too though we've only seen the grilled tuna once, so it's best if you figure out when is that served if you don't want to miss it.   The staff is very German prone, even if you speak English to them, they like to answer in German, so get ready for that.   Animations are on the calmer side with yoga, aqua gym, darts, beach volley, water polo and possibly boccia and evening programmes, but the animation team is great, particularly the main animator called Max I think?  Lot of choice for breakfast though throughout the days the choices don't vary much but if you wanted you'd be able to eat different meal every day of your stay. I loved those custard & chocolate pastries! Freshly pressed orange juice (do it yourself, though) and carrot juice (try it at least once) available, as well as all hot drinks and all the juices. DON'T eat gözleme at breakfast, though, as that is pre-prepared, wait for the lunchtime/afternoon gözleme done in the snack bar!  Lunch was good as well but we preferred eating outside because why would you get dressed if you can stay in your beachwear?  Dinners were crowded but always delicious. This is me saying hi to the cook that always made sure to give me stuff freshly from the grill, going so far as to garnish it with condiments! But sometimes there were cultural blends that don't sit well with me - sushi with sardines, spring onions, cooked tuna & salmon... Wasabi wasn't that good either. Spring rolls with cheese and dill? But the rest was delicious, watermelon and melon usually amazingly sweet. I loved the roasted carrots, duck, chicken, seafood, ....   There's a sort of pool service when a very nice waitress gives out frozen aromatic towels that are the best refreshment you can imagine. Sometimes in the morning you can get coffee straight on your sunbed. Sometimes in the afternoon watermelon, ayran, bottled water, fruit cocktails,... Amazing.   The beach is usually clear, sea warm. Seashells if you bother to look (and I always do). But because it's so great, the sea is very crowded. Sometimes big waves (love that). Sunbeds here are usually only half taken, so don't worry about space there!  Loved the hotel's attitude towards cats.   I'd recommend going to see tortoises after breakfast to a bridge that is right next to the hotel close to the beach.   Also, probably one of the cleanest hotels I've ever seen with rooms always smelling nicely, cleaners cleaning the OUTSIDE of balconies, beach walk being getting rid from sand regularly...…", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1747320-r700997548", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "2018 Summer Vacation in Antalya", "review": "Dear guest,  we are pleased that you were satisfied and that spent a nice holiday in our Hotel. With your rating you give an insight into our concept and the conditions of our house.  We hope to welcome you again and send best regards,  Sunis Hotels", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1747320-r620529423", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "The best hotel in Evrenseki!", "review": "Where to start.. After a so-so vacation in Antalya last year, we gave the Turkish Riviera another try. This time at Sunis Evren Beach Resort & Spa near Side. It was the best choice we ever made!It's a beautiful 5-star hotel (albeit in need of some renovations). Not too big, but big enough to give the guests enough space to enjoy themselves. The staff is mostly very friendly (a few exceptions sadly). We were welcomed with cocktails and sweets and got checked in, in a knick of time.   The rooms (we had a family room) are good but need some attention (door of the bathroom with some water damage underneath). Airconditioning works perfectly and keeps the room very cool (if you want to). The mini bar gets refilled daily (softdrinks, water and beer).  There's ample storage space for your clothes and also a safe for your valuables.  They're a bit noisy though. You could hear... \"sounds\" from other rooms. A family we met had quite a few sleepless nights due to a baby crying all night long while her parents were fighting all through the night. Not really relaxing. We were lucky though to have nice and quiet neighbors.   Loved the food! The buffet restaurant offers great and varied food catering to the tastes of the different visiting nationalities. Never had a bad meal there. We tried the Mexican and Italian a la carte and the BBQ dinner. Food is abundant with 5 courses to choose from. We couldn't finish all the courses so we limited our order to 4 courses. The BBQ wat our favorite though! Each table gets one BBQ with is ready to go when you arrive. Great selection of meats and chicken. Great side dishes. When we managed to finish the meat, the waiter offered to put another plate of meat for us! Talk about service!  The beach is nice with warm waters (in August) but the sands get HOT from midday on. There are a lot of lounges underneath sunshades.  The beach bar is also very good and offers drinks and food, so you don't have to walk back to the hotel for lunch.   The pool area is very nice with a lot of palmtrees around. Due to the free form, there one area where the animation team does its stuff without the rest of the pool being bothered by the waterplay or music. The team of very friendly and do great stuff with the kids. But they're not abundantly present and aren't pushy for you to participate. Our kids enjoyed the 5 waterslides and played there daily. The lifeguards should do a better job at guiding people when going off the larger slides. I've seen many incidents where little kids got hit by others coming down the slide (from up in the tower you can't really see if the pool area in the \"landing zone\" has been cleared).  There isn't a run on the lounge chairs but some people do reserve chairs by the pool (at around 6:30 am) although it isn't allowed. But you could still get good lounges after 9 o clock in the morning.   The bars offer great cocktails, ice coffee (coffee with ice cream), tea, alcohol-free cocktails for the kids. Good service. The pool restaurant offers hamburgers, hotdogs, pizza, half chickens, baked potatoes and salads for lunch. And you can also get Turkish style pizza and pancakes with your choice of filling.  The lobby bar is opened 24 hours a day. There's a huge lounge area around it and it's nicely crowded in the evening.  There are some shops which sell fake namebrand clothing and accessories. And a shop which sells beach stuff, snacks, souvenirs and fake electronics.  The only thing we didn't like, was the photographer walking around the pool and pushing his services. He had a monkey with which you could pose but he treated him quite roughly. There were enough people annoyed by this. But hey if you like badly photoshopped vacation pictures, go ahead....  The crowd is mostly German, Russian/Eastern bloc and Dutch. Staff speaks Turkish, German and Russian and some English.   The surrounding area consists of bazaars where all articles are fake. Over and over the same fake brands. The same shops with Turkish delights and spices. And everywhere pushy shop owners.   All in all it was the best vacation we had as a family. We'll definitely return next year for another two weeks!   …", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1747320-r615200765", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Very nice trip", "review": "I had a long selection of the best money-service hotel at Side and my choice is Sunis. I really liked all my vacation here. I don't like a lot of animation and here my expectations come true. This is more quiet than party place for your holidays, much of visitors are families with children 2-16 y.o. A territory of the hotel is covered by pools, there is a baby pool - 30 cm depth, children pool, and general pool 160 or 170 cm depth. All pools are clean and comfortable by temprature and ph. Loungers and umbrellass are much enought. Beach and hotel crossed by public promenaude, however no issues here. Hotel's beach is also good and clean, quite silent and comfortable. Hotel's concept is UAI - you can find daily refilled room's bar (2 beer, cola, fanta, sprite, water), also at the…", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1747320-r597498247", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Nice Hotel for family vacation", "review": "Dear guest,  thank you very much for rating us here on Tripadvisor. We are happy to hear that you were satisfied with our concept and the facilities of our Hotel.  Regarding the Wi-Fi it is possible to get a code for using, after check out.   We would be happy to see you again and send kind regards,  Sunis Hotels Guest Relation", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1747320-r550892574", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great place for vacation", "review": "Just returned from an awesome trip from Sunis Resort.  Rooms: We were travelling with a 1.5 yr old & we were offered a family room which we changed later to a double room as it didn't suit us. With the room availability, they offered to change it after personally reviewing it. The baby cot was already placed. Family room is bigger with 2 small rooms were as the double room is 1 large room. We wanted a late checkout & after some convincing we got late checkout till 2PM. The neighbouring Hotel was quite noisy all day long - till around midnight. So may be a room not facing this hotel would be better.  We hardly used the mini bar as we had drinks round the clock were we can enjoy our drinks.  Food & Drinks: We checked in at night & they informed us that there is a restraunt below…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1747320-r518313312", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great Holiday", "review": "Dear Guest,  we as the Sunis Hotels family would like to thank you for your feedback and are very happy that we have met your holiday expectations.  We look forward to seeing you in the near future.  Kind regards to you and your family, Sunis Hotels Management ", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1747320-r507966880", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Very nice hotel... but the staff was rude and not helpful.", "review": "The facility and staff is really great. Also, the treatment in its spa & i suggest you yo take a full body massage treatment during your vacation in order to relax. The food and drinks are also good. We have been here for the second time and sure we will be here again in the future.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1747320-r502845945", "sub_review": {"Location": 4, "Sleep Quality": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Summer vacation", "review": "The hotel has a really good location and the inside pools are very nice and clean. The entire staff was very helpful and kind even there were a lot of guests around.  The foods are more than tasty!!! There are a lot to choose from and always re-filled  The beach is comfortable and the possible recreation activities are not overpriced", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1747320-r488814234", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nice stay with ultra all inclusive", "review": "Dear guest,  thank you for your kind feedback. We are so grateful to you for taking the time to review your experience on Tripadvisor.  We look forward to welcoming you back as our guest in the near future! Email us if you have any requests for your next holiday!: sales@sunishotels.com  Kind regards, Sunis Hotels  Please Like and Follow us on Instagram & Facebook ", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1747320-r310600656", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "good from the begining to the end", "review": "We have chosen this hotel because it was a late-decision, just some days before the travel date and it was far from the airport but it was still within reasonable distance, and the reviews and pictures were convincing. It is interesting that some members here wrote that the food was bad and they were starving, honestly this is the reason why we travel to Turkey so often that we can trust them from food point of view: it is always great. The soups, the main dishes, salads, desserts, cannot complain on anything. Here we also had freshly squeezed orange juice and it was fun that we had to press it ourselves, I liked it. The building of this hotel is ineteresting, all rooms have sea view, partly. On top of this, we had a view to the pool, garden and waterpark with slides, but due to…", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1747320-r310056165", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Budapest, Hungary", "review": "We were greeted at 4 am gently and effectively, even with a proposal for meals. The rest of the trip was then a string of satisfactions. Good location, Nice place, no stairs or sloping path, well-equipped beach, inviting pool. Many services, very nice staff. Abundant and varied food", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1747320-r299910957", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "great holiday", "review": "We stayed here for a week, from 26th of July. Firstly we were impressed by the beauty of the hotel, but after a day we were disappointed. The stuff is really rude, including all the waiters, also in the lobby. The food was horrible and boring. I was starving for a week. The pool was nice, and the beach too. The room was big and comfortable, the cleaning lady did a great job. I got some kind of virus there, so i was sick for a week after the holiday in this hotel. All in all, it was not bad, but its not an 5* hotel quality. ", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1747320-r224217858", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great hotel and food, excellent location", "review": "Positive: clean and perfect family room with 2 bedrooms, great variety of food all day long, 5 min walk to beach and to shopping street, friendly staff, good airconditioning, free and fast wifi in lobby, Coca cola and Efes beer daily in refrigerant, very comfortable bed, clean beach. Negative: very loud music from hotels beside, slide in pool for kids open only for 2x2 hours (afternoon from 2-4 at very high temperature, 4-6pm would be better), no lifeguard at pools, breakfast pancakes for kids run out daily.", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1747320-r217913938", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great service, great quality", "review": "We have spent nearly 2 weeks in the hotel which was far the best of the 4 Turkish hotels we have tried so far. Here are the reasons why:  * Overall cleanness (rooms, pools, restaurants, common areas...) * Friendly staff: from the waiter to the cleaner * Enough sunbeds at the pool: no need to occupy in advance, you can find free beds after 10am * Easy to know the place, reasonably sized: it's not a huge hotel, therefore you see no crowd, the area is easy to explore * Beach is close: no tricky routes, only a 15m wide passage to cross (no car transport) * Beach is covered by sun shaders * Speedy & free internet in the lobby (1-5Mbit/sec download, 0,5-3Mbit upload in case of good signal strength), however, coverage is limited to the lobby and part of the pool/theatre area * New,…", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1747320-r216835387", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Peaceful hotel, good location!", "review": "Just arrived from Side, Turkey. Stayed for 8 days in Evren Beach in Side, Alanya. Very nice hote, very clean and ok service. First thought that some of the workers were a bit rude for not to talk/smile a lot (as a 5 star staff should!!?) but after a few days were really happy how things worked. Rooms are clean, food is good and safe to eat! Receptionists willing to guide you for your trips and other guestions. Got a bigger room (2 bedrooms) without asking when travelling with a 5 years old son. Breakfast good. Nothing that we could have ask for more. Ok, you had to press your orange juice (fresh) yourself but took it with humor after all. Hotel arranges activities several times a day. Volleyball, water gymnactics twice a day, other excersices etc. 5 waterslides offered a perfect…", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1747320-r165028110", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great resort!", "review": "This was our first time in Turkey, based on comments I've found on Tripadvisor and Zoover we booked this resort for 10 days. The hotel was amazing clean, the staff very kind and helpfull, the food very very nice and every day something else to choose from the buffet, the (ice) coffee at the bar outside lovely, the guy from the miniclub attractive and soo nice with the kids ALL day, the spa and hamman great massages, the beach a bit dirty, the wines not so good, and not enough umbrellas at the pool, a lot of German -older- people but we didn't mind, no Russians, very good atmosphere in the garden at the pool, even it is forbidden everyone is doing the towell thing at the sunbeds in the morning, but definately we enjoyed our stay!!! Thanks everyone of Evren beach we had 10 lovely…", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1747320-r160444556", "sub_review": {"Value": 5, "Location": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Very good all-inclusive", "review": "We have been travelling to all-inclusive resorts for the last years mainly because it is very convenient when you have kids. My conclusion so far has been that the best all-inclusives are found in the caribbean, but this one comes pretty close.  It is located a bit outside Side. You need a taxi to go into the center. It is surrounded by other large hotels, so you will pretty much stay in the hotel area. Pool is great, beach is great. Five restaurants. The main one has a wide selection even if we got a bit tired of it the last few days. Rooms are ok. The bathroom was great with a very good shower.   This hotel is best for families, and there is no nightlife around. Germans are everywhere. So much that the staff always greet you in that language. Our daughter (2.5 yrs) very much…", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1747320-r136451032", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Dream family break", "review": "We have just come back from a wonderful 7 day break at the Evren Beach Resort.  We visited with our almost 3 year old daughter and she was in the middle of everything to do with the kids club, even though she isn't yet 4. The food, service and smiles will remain forever in our memories and we may sure visit again. Only single downfall is there was no internet available in the rooms, but only WIFI in the lobby / recreational area. Nonetheless, I can only recommend this to anyone who wants to truly relax!", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1747320-r135263849", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "just wonderfull", "review": "We liked the quality of your service and will look to book you again in June when we travel to the Antalya side", "date": "December 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1747320-r128189639", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Top quality but too expensive", "review": "Family holiday with my mother and my two dauthers. We had a woderful stay and the staff were very helpful and service minded! We spend 2 weeks here and had a wonderful holiday! Food were really too good! We tried all the resturants. They were fantastic in different ways. Big pool area, very near the beach! Easy to reach town with the transfer or taxi.", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1747320-r122520026", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Delivering a bit extra", "review": "This was a vacation hotel that actually lived up to its star rating. At several occasions we got surprised by getting better service than expected. Fantastic staff all over. Thanks to the medium sized hotel there was no need to stand in lines for food because there was more than plenty for everyone. Food was great with good variety. Also the location on the beach is just perfect. 10 minutes taxi ride to Side. Good to know for larger families is that taxi's do have 6 passenger seats.  Ala carte restaurants available free of charge as alternative to the buffe.  We were lucky to get a free upgrade for larger rooms so that the teenager had their own space.  Free wifi in the lobby.  Regarding the bech activities I can really recommend the sofa dragged after a boat. Well spent money. …", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d1747320-r116294487", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}]