[{"title": "Business stay", "review": "Rooms are clean and location well cared and quite. Not a big hotel but there’s attention to details. I have not tried spa and treatment. Breakfast is reach and good quality food. Prices in range. Recommended ", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1751301-r602307769", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Quiet as a church mouse", "review": "If you want peace and quiet, look no further. Very friendly and helpful staff. Comfortable room. Leisure facilities good but disappointed we had to pay to use them. Word of advice - don't arrive in the dark, it's not the easiest place to find! Breakfasts were great. However the 3 course meal one night included in the package was a big disappointment - the main course even arrived stone cold and had to be reheated. So we never ate in the restaurant again in the evening. We were probably just unlucky.", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1751301-r524176505", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Lovely boutique hotel, hidden gem", "review": "We originally made the hotel booking via voyage prive and found the hotel to be quaint and delightful. The staff are very friendly and helpful when organising dinners and trips locally - they made our stay very enjoyable. The location is away from the lake, but we found that perfect as you're away from the hustle and bustle, whilst remaining a short drive from all local amenities. I would definitely recommend to anyone looking for a quiet escape.", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1751301-r509314999", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very very quiet place. ", "review": " How we managed to find this place in the dark was a miracle! Thank goodness for Google maps but even so it was hard! It was very quiet! We learned that at this time of year the population of Manerba DG is about 3000 which increases to about 60,000 in summer so I'm glad we came in October! Renovation of next door did not bother us at all. If people are bothered about this then it says more about them. Do people expect them to close when renovating? They still have to make a living!! However the place was deserted which was eerie. We did not have any spa treatments so could not comment but we used the swimming pool both mornings and had it to ourselves. Ate at the hotel restaurant one night and it was super. Breakfast was lovely and had lots of choice from boiled or scrambled eggs to doughnuts. Coffee was at best only warm, not hot. I just think I'm not used to staying somewhere out of season and soooo quiet. A car is essential or you could be quite bored being stuck here. Beautiful scenery at the lake. We had no choice but to relax and do very little which was lovely. Got this deal through Voyage Prive. Make sure you ask about the menu included in the VP deal though. Robes and towels for the swimming pool etc are an extra €7!! This should be included I think. Staff very friendly and have excellent English!!!! I came to relax and that is exactly what I did. …", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1751301-r430406153", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Small average hotel, nothing to do with wellness nor poets.", "review": "We found this hotel through a misleading picture on the Voyage Prive web site - the picture showing by the lake has been taken off - but the misleading really starts with the name of the establishment. 'Borgo dei Poeti' suggests a connection with the arts, but the closest you get is the kitsch décor, including weird, sort of ceramic pictures on the walls, a couple of teddy bears on the landing and 'I love you' written on an information sheet. The female staff are sweet and do their best for you, but the management can be less cosy.  It is easy to find if you have been there, but we found it very confusing on our first arrival, with which the manager was not sympathetic. If you should go, you park in the car park opposite and below the entrance to the little lane, and the first thing you see is the restaurant - this is NOT the entrance to the hotel which is at the end of the lane on the left.  The outlook is pleasant enough, and there is a veranda with tables to enjoy an evening drink, but when we were there, there were major building works going on, and at times the din was horrendous. It is also less than poetic to be right next door to a building site - I think they are enlarging the hotel a lot, or it may just be a renovation. Inside, it's all clean enough, and great if you like kitsch. There is a television that is left on all the time with its sound off, I'm not sure why. We were kindly given the biggest room (101) on the first floor, which was quite large and had a good veranda, which had not been cleaned nor swept for some time. Bed clothes were red, which was different. The bathroom was decent, but the sink plug mechanism fell apart and our room was not made up on our 2nd day there (of 3). This may have been because we didn't leave the room till about 11.40am, but it should have been done. There was a decent choice for breakfast, and the girls did their best, but the coffee was only warm. However, you could ask for a coffee from the machine which the staff made on demand. Scrambled eggs were lying in a covered dish…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1751301-r424097084", "sub_review": {}, "travel_purpose": "", "rating": 2}, {"title": "Disappointing not a Spa Hotel", "review": "This was a week by Lake Garda to celebrate a retirement with friends and this hotel was disappointing in so many ways. The Spa had no treatments and the indoor pool area is lacking in furniture and comforts. There are NO views of the Lake from the hotel as it is situated at the rear of a B&B which has the Lake views. The terrace at the rear is tired however the furniture is new but has no padding so sitting out for breakfast was uncomfortable and there are large green frogs and gnomes situated around the terrace with little connection to the environment! We had a room that looked over the terrace and the building site as the property attached to the left is having work carried out and started work early. Our bedroom was very dated and tired,there were random items around the…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1751301-r417833781", "sub_review": {"Sleep Quality": 3, "Rooms": 2, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Would you like comfort and peace ? It's right place !", "review": "Fortunately there are very few people who think like you in our hotel, and probably for a good reason! We can understand that our hotel did not liked it, but the lies that she writes are really comical! In any photo and nowhere is it written that we have a view of the lake! So you should first learn to read!  The b&b is talking about, is not part of our hotel is 50 metr from our hotel, so why talk about it? The terrace is equipped with new pillows bought in June 2016, so this is a lie! The work in the house next door, are suspended from July, so there were never bothered you! The hotel was built in 2010, so how can they be old rooms ??? In the hotel there are objects to furnish as teddy bears and other dolls, which are always highly appreciated by our guests, it is not our fault if she does not have good taste! I remind you that our hotel has 12 rooms, and the bar is sufficient for all types of processing. If it had been more careful, she would have noticed that it was full dishwasher and glasses that sanitizes everything !!! Seen as you left the room, she should not talk about hygiene!  Finally, our SPA is provided with sauna, bio sauna, turkish bath, Kneipp, pool and whirlpool. We also provide a great service of massages and treatments written in 5 languages: Italian. ENGLISH, German, French and Russian can be found on our website, at the reception, and room on the table You probably did not notice many things, because they are too busy drinking beer or wine... not bought at the hotel ...on the terrace! our glasses have made you comfortable right? Do not worry, she has not been appreciated and we hope to never see her again !!! Lying People there have never liked them! To never again! ", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1751301-r403725173", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Peace and tranquility ", "review": "Summer brake in lovely and peaceful  place in the middle green valley.Would you like escape from buzz ?! Go to there but hire a car and relax. Explore one of a beautiful lake Garda. Our room was in nice Italian boutique style with big balcony and spacious barroom. All was nice but bad was too hard for me .", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1751301-r380464484", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Have a break !", "review": "What a little peace of Italian Heaven, this hotel is nestled in the hills above Manerba del Garda. Hospitality is second to none in this eye deceiving Hotel that delights at each turn of a corner. A car is a necessity to explore this beautiful area and your hosts Alessandra and Selene Stefano will help you plan your day to get the best out of your Italian visit. highly recommended as a thermal spa on the peninsular Sirmione. Other towns highly recommended are Salo, Riva del Garda, Largo d'Idro. Go on spoil yourself in this tranquil corner of northern Italy. ", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1751301-r179737575", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "Még esőben is szép", "review": "If you are looking for a break from daily routine and stress this is the right place ! The small and comfortable hotel is located in a ancient village near Garda lake; so it's far from the traffic noise and tourist crowding but in 15-20 minutes by car it is possible to rich landmarks as Salò or Desenzano or Sirmione.  The wellness centre has a right size and the team is professional and carefully.  Dinner and breakfast have a good quality.  No doubt about value-for-money. ", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664151-d1751301-r77143494", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}]