[{"title": "Great value, quiet location", "review": "Spent two nights here and the pluses are the pool, good sized rooms, wi-fi that works, a location that is 5 mins from the beach and 8 from the best restaurants in town, it is also just 10 mins from the centre of town.  There is also a very good coffee shop just over the road where we had some very good breakfasts. It also has parking.  For what it is I thought it was very good value.", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r726645380", "sub_review": {"Value": 5, "Rooms": 4, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Nice hotel away from the tourists", "review": "Had a long weekend stay here and the hotel was very nice.  Located a 5min walk from the beach and about 15-20 min walk to the main town this place is ideal if you want to stay somewhere that is not in your normal tourist spots.   The rooms are spacious and comfy with everything you need, the staff are very helpful and friendly and nothing was to much trouble for them. We only had breakfast at the hotel but the food was good and the restaurant was very pleasant.  The pool area is nice and quiet and because the hotel is a little out of town it’s never busy. The beach is clean and again does not get busy (there are more local people on it that tourists)  If you want to experience Spain in its every day to day life then this is the place for you.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r710322357", "sub_review": {"Value": 4, "Sleep Quality": 3, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Nice spot, close to the beach", "review": "The hotel is located near the beach in a very calm area but close to good restaurants. The staff is very kind and friendly, especially the restaurant staff. The room was very good but had no balcony which is not acceptable for a beach hotel where we have 5 towels and bathing suits to dry every day. We've asked for a room with a balcony and they wanted more money on top of what we've paid for 2w. 😳  -> The hotel should consider rooms with no balconies for shorter stays and less people per room. Good beds with good mattresses and sound isolation. We had always a nice sleep. 👌 The food was acceptable but nothing special for a 4 star hotel.  No pool for kids. Cleaning was excellent.", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r689457403", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Nice  friendly hotel  a  little off  beaten  track", "review": "Staff  friendly,-  Rooms clean & Comfortable-  Breakfast  was  fine   decent  choices However  the things  that  stood  out for  me  were  the  Terraza, &  the  pool .I  spent  quite a  pleasant  Sunday afternoon ,sitting  in  the  shade, reading & having a  beer- would  definitely like  to do the  same  again  sometime  in  the  future", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r685735746", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Beautifully Clean Hotel, in great location", "review": "A very clean and spacious hotel, in a geat location. The staff were superb and helpful at all times, The rooms were big and clean with TV and free wifi  Breakfast was reasonable and plentiful. Pool was just the right size for the number of guests and enjoyed an excellent bar service with the barman coming round, clearing and taking orders on a regular basis. It is located no more than 5mins from the beach and a 10-15min walk from the centre . Great place. will definately visit again.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r682532267", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Lovely staff, but not really a 4-star hotel", "review": "There are good points about this hotel.  Near the wonderful beaches, near the loooong riverfront promenade, near the Bajo de Guia bars and restaurants,  15 minutes stroll into the Old Town and shops and monuments. Garage very good.  Clean, spotlessly clean bedroom and bathroom. Handsome entrance. Charming and helpful staff.  But I cannot bring myself to give it more than 3 stars, and even the third star reluctantly.  The rooms do not have attractive views, and there is no garden, the pool being small and with a small tiled area. The rooms are not only view-less, they are not even attractive internally, being rather sparsely furnished. 4-star furnishings? It looks rather like the stark bedrooms in a student hall of residence – apart from the two beds. Spartan.  The difference…", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r661129597", "sub_review": {"Sleep Quality": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great choice and location ", "review": "Pros The staff were so friendly and the rooms were clean. We even asked for a room with views and to have one bed and not two put together and they were kind enough to accommodate us.  The room overlooked the pool area and there was a nice size balcony where both stretched after running.  The location is great. And I can guarantee that the neighbouring areas are safe and there's lots of parking around.  We didn't get the breakfast but there was a fantastic place right in front of the hotel where we had great coffee and breakfast everyday. We saved about 12-14 euros between the two of us. The bar had a great terrace that gets sun all morning. And they were attentive.    Cons Maybe some morning cleaning woke us up around 10:30 and I think there were some repairs being done as well.", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r656694312", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good choice all round", "review": "Great value for money, especially if you can get a deal and are staying room only. Free easy on street parking. Plenty of places nearby for breakfast if you aren't eating in. Great views of the river if you have a room with a balcony. The swimming pool is refreshing. The location is great: a short stroll along the river to the old town, and it felt safe coming back through the streets at night. The room was well sized and the bed excellent. No problems with the WiFi. All round a great stay for a good rate.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r619898590", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Ok location", "review": "Dear Customer, \t \t\t Thank you for taking a few minutes of your valuable time to move their comments about your stay at the Hotel Macia Doñana. \t\t We are glad to know that you have enjoyed a pleasant stay with us.\t\t We hope to see you again at the hotel on your next visit to Sanlúcar de Barrameda\t\t Best regards.\t\t \t\t Eva Humanes\t\t Hotel Macià Doñana Manager\t\t ", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r619894508", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Moto GP Trip", "review": "The hotel is located closed to the beach. We stayed for one night and it was ok, but not excellent. The staff was very friendly but the service was slow. Also very crowded and loud breakfast area when a bus of spanish pensioners had breakfast.", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r579457258", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Pictures are Deceiving", "review": "While the front desk woman was very helpful, this place is far from being worth the price. The first room I was given smelled like smoke and was right across from some horrid construction that sounded like it was happening in my room. I very politely asked for another room where they tried to convince me to upgrade and pay for another room, well... after seeing the first dated room, I was like umm no. So then I was given an inside corner room with 3 twin beds, at least it didn't smell like smoke, that the room next to me was able to look into mine; curtains stayed closed. Lastly, this place was a ghost town when I arrived, as in I didn't see a single other guest so when I decided to have wine on the patio in the sun, I thought I'd get some great service. Wrong, 30 minutes went…", "date": "November 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r545500599", "sub_review": {"Location": 4, "Sleep Quality": 2, "Service": 3}, "travel_purpose": "Traveled solo", "rating": 2}, {"title": "Wifi only lets You surfe, receive mail - but not send!", "review": "If it had not been for the wifi, I would have rated this hotel ****/good, but unfortunately the wifi will only let You surfe, receive mail, but not send. The second I connected to the wifi at my new hotel in Jerez later, all my mail in my out box were send, so it it not my mac that has a problem. You can park for free outside the hotel. It is only 2 minutes walk from the beach and 10 minutes walk from the city center. There is a nice pool area with sun-beds. The room is a good size with a good bed. There is fridge, A/C and half a wifi, You can say. Breakfast is ok. So sad with the wifi because that is the only negative thing to mention...", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r532452370", "sub_review": {"Sleep Quality": 4, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Mini moon ", "review": "We stayed here for 2 nights the staff were friendly the room was clean, room service was great, fab location loved San Lucar will 100% be back. Warning to English visitors outside the hotel not many speak English Spanish lessons or quick learning needed! X ", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r520594070", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Hotel Marcia Donana", "review": "It was fine. We visited with friends in the area. Room was OK, not great. Local food was also just Ok. The beach was beautiful.  Proximity to the sherry making was the real reason for coming and our visit to a  Sherry making operation was great.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r500838705", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Close to Beach and Restaurants", "review": "The hotel is a typical modern seaside hotel. The rooms were a decent size and very comfortable. The bathroom too was very spacious although the bidet did make it a little awkward getting in and out of the bath. We were able to take breakfast out on the terrace which was a very pleasant surrounding.  On the plus side, the hotel was in a great location, near to the beach and also the numerous restaurants along the port. The swimming pool was excellent, very clean and well maintained. Underground parking was free as was wifi.  The slight negatives. To use the safe you had to pay a daily charge; the mini-bar fridge in the room was switched off; the orange juice at breakfast was processed (not fresh); not sure what the breakfast coffee was made from but it didn't taste like coffee;…", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r493108539", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "no swimmingpool", "review": "the rooms are nice, staff is friendly, but was not so much able to give informations.  we booked this hotel also because of the pool --- when we arrived we got to know that the pool is closed in november. it is situated nicely in the city.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r445936979", "sub_review": {"Rooms": 4, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Exchange rip-off", "review": "The stay was fine other than the hotel was prety empty mid-week,  but they still managed to put all the guests in adjoining rooms and so we could everyone else coughing etc etc.  I don't understand why they cannot use every other room in quiet times.  The serious problem came at check-out.  The receptionist  stated the amount required without presenting a printed bill.  I asked to check it and she just turned the screen towards me.  It is difficult to read a bill on a screen.  When my partner asked me if the amount on the credit card machine was correct,  it did indeed show the amount in Euros( although when I looked back to the screen she had changed the screen).  It was not until we were on route home I saw the bill had been converted into pounds and we had been charged SIX…", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r443318705", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Curate's egg, good and not so good", "review": "It would be a four star rating if they hadn't completely ignored our request at booking and on arrival for a quiet double room away from the lifts.  What we got was a very noisy twin right next to them.  There was also very loud music at some venue by the beach on the Saturday night until 4 am.  We let it slide about the room because we arrived late to meet friends, we were exhausted after weeks of hard work and we just needed to settle in.  But it was a huge oversight and I regretnotcomplaining.  I usually would.  The good points, it's spacious, modern and comfortable, with nice modern rooms and a lovely spacious foyer.  The rates are very good, it's near the lovely beach and the parade of great restaurants on the paseo.  It has an attractive pool.  The restaurant is buffet…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r421862154", "sub_review": {"Location": 4, "Rooms": 3, "Service": 3}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Good affordable hotel with nice pool but a few niggles", "review": "We were in Sanlucar for a wedding celebration. The Macia Donana is a comfortable hotel near the beach with a lovely pool. A few niggles: a lot of things which are standard in other hotels you have to pay for at the Donana including pool towels and the room safe which we needed because the lock on the door to our balcony was broken and despite promises, never fixed. Also we got second hand smoke from neighbouring rooms.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r420439226", "sub_review": {"Rooms": 4, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good hotel, great swimming pool", "review": "Stayed here when attending a wedding in Sanlucar, the hotel was clean and had a peaceful atmosphere. We made the most of the delightful swimming pool and sun terrace, which was never that busy, and it made for a very pleasant and relaxing weekend. The rooms had everything you need, and our room had a nice sun terrace. There are many bars and small tapas restaurants nearby if you need to grab a bite to eat. The staff were very helpful, and friendly. Ordering us cabs and dealing with our queries in a courteous manner.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r384207257", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent price/quality.", "review": "This is not a small family runned hotel So some staff members are very friendly, others just do their job. Spacious, very clean en nicely furnished and decorated rooms. Bathroom, looks still new, very clean and with everything you need. Well organized hotel.  Can be noisy, on special occasions en when fully booked. But this his sometimes more to do with some bad mannered guests then with the hotel itself.  The hotel is situated a little bit out of the touristic center of Sanlucar (max. 10 min. walk), but with enough choice of bars and restaurants nearby.", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r324380414", "sub_review": {"Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good value Hotel!", "review": "Estimado cliente;  .\t\t\t\t\t\t\t Le agradecemos que haya dedicado unos minutos de su valioso tiempo para trasladarnos sus comentarios, instrumentos muy valorados por nosotros puesto que nos ayudan en nuestra mejora continua.\t\t\t\t\t\t\t Nos alegra mucho saber que ha disfrutado de una grata estancia con nosotros y estaremos encantados de volver a darle la bienvenida en el hotel en su próxima visita a Sanlúcar de Barrameda.\t\t\t\t\t\t\t Macià Hoteles le recuerda que dispone de otros establecimientos hoteleros en las ciudades de Granada y Cordoba  Saludos cordiales.  Eva Humanes  Directora Hotel Macià Doñana", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r318943502", "sub_review": {"Value": 4, "Location": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Excellent hotel.", "review": "This was a simple, contemporary hotel that provided a good, clean and comfortable accommodation for an over-night stay. The pool didnt catch any sunshine until well into the afternoon - and didnt fancy a cold dip, but looks like a great place for a plunge on a sunny Spanish afternoon.  The breakfast and coffee was basic, but adequate and the rooms were simple, but comfortable.  My room had a large balcony with great views to the pool and sea beyond.  The reception staff were very friendly, and even recognised my companions from a previous visit over a year ago!  Excellent base from which to explore the marina/beach-front seafood restaurants.  Lobster and seafood platter was exceptional!", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r272113123", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Dreadful service at reception but otherwise OK.", "review": "Estimado cliente: \t \t Le agradecemos que haya dedicado unos minutos de su valioso tiempo para trasladarnos sus comentarios, instrumentos muy valorados por nosotros puesto que nos ayudan en nuestra mejora continua.\t \t Nos alegra mucho saber que ha disfrutado de una grata estancia con nosotros. El principal objetivo de Macià Hoteles es la satisfacción de nuestros clientes, motivo por el que seguiremos trabajando en aras de prestar un mejor servicio. \t \t Macià Hoteles le recuerda que dispone de otros establecimientos hoteleros en las ciudades de Granada y Cordoba \t \t Saludos cordiales. \t \t Eva Humanes \t Directora  Hotel Macià Doñana", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r258185773", "sub_review": {"Location": 4, "Sleep Quality": 4, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Excellent hotel and good location", "review": "We came back yesterday from an organized bus trip Jerez and Seville. (I live in Spain). The Hotel is spotlessly clean and comfortable.  The staff are very friendly and do their best to communicate in English.  The food is good, not outstanding but a good choice at breakfast both cooked and continental.  The rolls were warm and crispy, plenty of butter and preserves. Fresh fruit also tinned peaches and dried prunes and figs.  Coffee was out of a machine but OK. There was hot water and T bags, plenty of fruit juice of different kinds.  Dinner, buffet style again.  Soup, a very good salad bar, a choice of meat, chicken and fish, pasta & chips. Pudding, there was a choice of about three different cakes etc., Ice cream & yogurt.  Plenty of fresh fruit, oranges, pears, kiwi, bananas. …", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r224254353", "sub_review": {"Sleep Quality": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good location, just what we expected", "review": "This place is a little corporate for our tastes. That said we knew that before we booked it and we chose it for it's location. Parking was easy (early May) in the street outside so no need to pay extra for private parking. Some more interesting hotels in the Old Town might be better but if you have a car, access and parking is a pain.  It's a 2 minute walk to the beach front restaurants and about a 15 minute walk to the old town and the highly recommended Casa Balbino.  Pool was good, rooms excellent, staff helpful.  No complaints. Straight forward place lacking any real character.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r204662435", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Convenient and functional", "review": "We came to Sanlucar for a few days to relax and this hotel fitted the bill perfectly. As you can see from the photos this is a modern hotel, so you get all the usual comforts. The pool is a little small, but when we were there in September there were few people in it and no problem getting sunbeds.  The hotel is in a good location, 5 minutes from the beach and 10 minutes from the bus station. Plenty of good places to eat, either on the nearby waterfront or 20 minutes walk away in the older part of town.  The breakfast buffet has a good choice which changes each day.  The one small downside to the hotel while we were there was that it was used by coach parties which sometimes created queues for breakfast.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r186525748", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Not old, but a bit tired", "review": "This is a standard hotel, built for local trade. This is fine, but is hardly a recommendation.  The rooms are large, bright and well equipped. The bathrooms are nicely organised, but nothing special.  Meal service is without character, and much flavour. (But that is not a problem because there are plenty of very good restaurants in the neighbourhood, just along the river front. Just turn right on the main road, pass the horse buggies and the Ice Factory and the first restaurants come into sight).  The pool is full of people during the summer season, so getting a lounger can be problematic. If sun-bathing is your scene, leave the hotel and walk the two streets down to the \"beachside\" river frontage.  The staff are cheerful and pleasant.  What to avoid: should you get a…", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r180681202", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Nice hotel and good location", "review": "The Hotel Donana is a block back from the beach in Sanlucar and about 10 minutes walk from the main town square inland. Our room had a lovely balcony and sea view and was very comfortable. No fridge though. Air con was fine and the bathroom spotless. The public rooms were light and  airy and the breakfast buffet was very good. The swimming pool was in a walled garden with plenty of loungers but no mattresses and the hotel provides towels for a 1.5 euro/day fee.  In mid September the town was very quiet and the fish restaurants round the corner on the harbour side were extremely quiet. The tapas bars in town were lively after 8pm We went to the Donana park by boat, nice but low key, and to a sherry bodega Pedro Romero where we had a good tour for 6 euro each including tastings…", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r141309946", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great Location, expensive for what you get.", "review": "I went to watch the horse racing with some friends, and this was the only hotel close to the beach we could get into. The prizes were very high (€134 per night) and I think this was just because of the Carreras de Caballos. Its not a true 4 star hotel.   It was a great location, close to the beach. Great selection of restaurants close by.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r141096547", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Very good Hotel", "review": "A really nice 4 star hotel in a good position for the beach and promenade. The hotel is very clean and is decorated in a simple classic way. The rooms are also decorated with a modern touch and are simple but generous in proportion. It looks like rooms on the first floor overlooking the pool and terraces have a large terrace and not a balcony. Other rooms have a balcony either looking over the pool or the front of the hotel onto a car park. The bar area and staff are very nice and drinks are reasonably priced. We did not eat in the hotel as we were socialising with visiting friends so can confirm that there are some very good eating places near by.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r139065094", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good hotel , not much character", "review": "The hotel is well situated, close to the beach and with lots of seafood restaurants just around the corner. Also close to the quay from which boat trips to the nature park leave. The tourist office is also just around the corner in an old Ice factory. The hotel has good facilities and a good pool area, however its a relatively modern international hotel with not a lot of character or atmosphere. The evening meal is buffet style and was OK but nothing special, breakfast much the same. Nothing to complain about, but is the sort you could visit anywhere in the world. The hotel has a paid parking garage, but you can park for free on the road directly outside. Unfortunately we had a room above the main entrance, overlooking the road, and could hear the main doors opening and shutting…", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r134035660", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great Hotel.", "review": "We spent 10 days in the Macia Donana. From the 24th July to the 2nd August 2011.  We really enjoyed our stay there, and would certainly recommend it. The food was excellent with plenty of choice, and with the option of eating on the patio, which was peaceful and secluded. All the staff were friendly and the bar never too busy. Everything is within walking distance, including the beach which is only five minutes away, and the centre which is no more than ten.  The Donana is one of the few four star hotels in Sanluccar and certainly deserves the designation. The room was clean and spacious, with a good sized balcony, although the sea view was partly blocked by a sports centre.The beds were really comfortable, with little or no noise from the hotel or outside. The only mirror in…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r117626759", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great situation", "review": "Hotel situated close to the beach. Has underground parking. Rooms adequate no english tv at all.  Good free wifi access.  Friendly helpful staff.  Buffet breakfast one of the worst we have encountered.  Hot food looked like it had been cooked the day before. Horrible coffee from a machine and juice not fresh.  Everything badly presented. Very interesting area to visit, we took the river trip but did not see the birds and wildlife we expected but pleasant boat ride.  Did not eat in the restaurant as there are so many to choose from on the nearby riverfront.", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r104259421", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Excellent value well located hotel with beautiful views over the river", "review": "We had previously stayed here a couple of years ago and were pleased that we got rooms with views of the mighty Guadalquivir river. All the hotel seemed to have been renovated in the last few years. The price of our stay at 55 euros per room including full breakfast for two was excellent.   Parking is free and easy outside the hotel and the hotel is situated a short walk from the excellent fish restaurants on the river nearby.  We asked for ice for the room from the bar and this was provided without a problem.  Good to bring in to the hotel a bottle of the local Manzanilla sherry and enjoy it on the balcony of your room.  Breakfast is a bit of a scrum downstairs but there is plenty of food to choose from including the usual hot breakfast dishes.  Sanlucar is a beautiful town…", "date": "March 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r101996440", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "first rate hotel", "review": "This is a frienly holiday hotel for predominantly Spanish tourists. This is not the Costas, which makes it delightful. The pictures of the rooms on the various websites do not do it justice. Although we had a room without a balcony at the front of the hotel it was large, light and airy with a big picture window. The beds were very comfortable and the air conditioning worked well. The bathroom was not large but perfectly acceptable. The public facilities were adequate but not luxurious although they do have a  central computer in the lobby with free internet access for all. The swimming pool is small and clean adjacent to the large poolside bar. Reception and bar staff were very accommodating and helpful. There is a choice of free outside parking or garage parking at a very low…", "date": "July 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r8108625", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Not impressed!", "review": "Hotel Donana, Sanlucar  Not impressed with this hotel at all.   Although the web site states that it is near restaurants and bars, it isn’t!   It is certainly situated very close to the beach but the surroundings leave a lot to be desired.   It is a good 20 min. walk into the old town, which is great.   Our hotel room was clean enough, with a balcony overlooking the pool, but it was purely functional.   The towels in the room were quite threadbare and, although obviously washed, looked as though they had seen better days.   Breakfast was self-service buffet, as in most modern hotels these days, but not a lot of choice.   Secure underground parking is available but we managed to park right outside the hotel without a problem;  however, it might get busier at the height of the…", "date": "February 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r5574442", "sub_review": {}, "travel_purpose": "", "rating": 2}, {"title": "De verano y más", "review": "El Hotel cuenta con los ambientes amplios, yo viajaba en esta oportunidad con capacidad reducida y  lo encontré asequible en todos sus espacios. Las habitaciones están acondicionadas con todos los pormenores necesarios para el verano, tendederos, amplias terrazas, cajoneras extras, hasta está a pie de playa,  es el Hotel ideal para el veraneo. Están muy limpias y se duerme tranquilo y sin ruidos molestos. El baño espacioso, limpio y acondicionado para mis limitaciones. Me supongo que el detalle de tener el Minibar no equipado y desenchufado es parte de las medidas económicas y del ahorro de energía, aunque se ve raro ( voy a pocos hoteles de 3 y 4 estrellas) se apoya la causa, quien lo quiera que lo pida, las estrellas del Hotel tal vez permite esto. Cuenta con una decoración…", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r549897519", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Sitio cómodo y agradable", "review": "Nos quedamos un fin de semana por un encuentro familiar. Fue un hotel cómodo para dormir y ducharse. Muy agradable el lobby de entrada y las habitaciones, que parece que están remodeladas. Lo único que nos parece más antiguo es el baño, que se ve anticuado, aunque limpio. También eche en falta un enchufe para las planchas del pelo (hay que modernizarse...). Otra cosa que no nos gustó es que había gente gritando y corriendo por los pasillos de madrugada, aunque esto no es culpa del hotel, es culpa de la poca educación de algunos.", "date": "November 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r546365447", "sub_review": {"Value": 4, "Location": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Pictures are Deceiving", "review": "While the front desk woman was very helpful, this place is far from being worth the price. The first room I was given smelled like smoke and was right across from some horrid construction that sounded like it was happening in my room. I very politely asked for another room where they tried to convince me to upgrade and pay for another room, well... after seeing the first dated room, I was like umm no. So then I was given an inside corner room with 3 twin beds, at least it didn't smell like smoke, that the room next to me was able to look into mine; curtains stayed closed. Lastly, this place was a ghost town when I arrived, as in I didn't see a single other guest so when I decided to have wine on the patio in the sun, I thought I'd get some great service. Wrong, 30 minutes went…", "date": "November 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r545500599", "sub_review": {"Location": 4, "Sleep Quality": 2, "Service": 3}, "travel_purpose": "Traveled solo", "rating": 2}, {"title": "Muy recomendable", "review": "Un hotel familiar y tranquilo, al lado de bajoguia, a 10 minutos andando del centro, con un largo paseo maritimo para disfrutarlo, aparacamiento muy facil y en la puerta del hotel. Personal muy amable.", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r539473516", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Amabilidad desde la llegada.", "review": "Las habitaciones son amplias y limpias.Terraza enorme con vistas a la piscina . Facilitan informacion para conocer Sanlucar y disfrutar de su gastronomía.Su proximidad a bajo de guia, es otro punto a favor.Las puestas de sol  frente a Doñana, son espectaculares.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080315-d1830878-r539130455", "sub_review": {"Value": 4, "Sleep Quality": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}]