[{"title": "SHAME", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "November 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r728383444", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Excellent budget hotel", "review": "I never had this type of experience ever. We have booked for 5 days, but 2nd day we left this hotel. It's very shame for them. Whey we are making check in no body was in reception, we had to wait for a while, in the mid time it was full of homeless people in front of reception. They were look to us as the are watching animals or something from another planet. When we booked we paid whole amount with all taxes and charges, but they asked me again to pay those charges, that receptionist may be Asian guy was too rude, un polite, and also stupid. From the entrance to room full of bad smell. I couldn't stay there for 5days,i check out after a day. Very shame for them. Worst service ever. I never come back.", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r696183050", "sub_review": {"Value": 5, "Rooms": 4, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Nice and cheap hotel", "review": "I stayed i this hotel for six nights in July/August 2019. I thoroughly enjoyed my stay, and simply cannot understand why so many reviews on this site are so negative.  Specifically:-  (a) The room and bathroom were spotlessly clean, and were cleaned every day with frequent changes of sheets etc. and fresh towels every day. There were no bad smells.  (b) Air conditioning worked very well, and the room was cool despite the vicious heat outside  (c) Breakfast was great.  Rolls, several types of croissant, cheese, meat, cereal, juice, bread (for toast) and excellent coffee.  Nothing was stale.  (d) It was comfortable and quiet at night (my room faced the rear)  (e) The tram from the airport is a 7 minute walk away (Buonsignori Liceo da Vinci); it also goes to the city centre.  Or walk to the city centre in 30 minutes.  The Hotel is VERY well placed for the San Donato university campus (10 minute walk) and there are plenty of places to eat nearby, as well as a good supermarket.  I had a thoroughly pleasant stay and would recommend it to anyone without hesitation.…", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r681278872", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Simple but nice ", "review": "I stayed there for 4nights. Quite well room, big bathroom. Everyday cleaning.  rather good compliance of price and quality. I liked it. But a little far from center. It is not a problem if you like to walk", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r670457806", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Clean and great staff", "review": "This hotel was good. It was close to a bus which took you straight into the train station. Bus tickets in the bus are dearer then from machines so grab them before jumping on the bus. We found a great Kebab shop which we left him with $5 note to display with his others from around the world. Hotel restaurant was amazing. You get 20% card on arrival so well worth a try. Breakfast was good. Plenty to choose from. Mosquitoes were really bad in this hotel but everything else was reasonable. ", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r655150159", "sub_review": {"Location": 4, "Rooms": 3, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "A 3 stars hotel really??", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "January 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r648552478", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "The receptionists are great and friendly ", "review": "When we first checked out the toilet wasn’t working so we where asked to move to another room going up and down to get the keys and no help with our luggage. We ended up in a room with two single bed next to each other even if we booked for a double bedroom bed. It was noisy and the mattress was so s*** that I woke up at 6.00am with back pain. I informed the rather old receptionist who was really annoyed to hear about this. I’ve actually never dealt with a receptionist that arrogant before. He also got annoyed that I wanted to pay the tourist tax by card when by law it’s a normal thing to do and told me with agressive manner that “ I was doing things the way I wanted and was arrogant ...” Crazy !! Then started speaking in Italian so could not understand! So rude ! I should put 1…", "date": "January 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r647209499", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Low cost hotel, breakfast is the worst!", "review": "I stayed at this hotel two days. The French man and Ms.Valentina were very helpful and friendly. They tried to solve all our group's problems. And finally it was easy to arrive to the city center. You can either go on foot or by bus number 22.", "date": "January 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r645579297", "sub_review": {"Location": 2, "Rooms": 1, "Service": 1}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Definitely One star... ", "review": "It is about 25-30mins by bus No. 22 and No. 17 from Florence Central train station, the bus stop is few mins walk from the hotel. The room is cold an old, toilet not working for 1st night, moved to another room is has poor visibility. Breakfast is the worst, cold and hard pastries, nothing fresh at all, serving staff was just plain rude! Kept reminding front desk to send us extra blanket as the room was cold! Very uncomfortable bed.", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r628764837", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "1 Star Hotel", "review": "Staying in astor hotel you get less than what you pay for. Super old building inside and outside: the TV is the smallest ever and not working and the mini bar is also useless. Advantages? It s clean and you have a bus taking you to the city center...", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r628257904", "sub_review": {"Value": 1, "Location": 1, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Meh...", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r614456102", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Fair price ", "review": "My husband and I are on our honeymoon and we needed to stay in Florence for one night that was cheap and had parking. We found that in Hotel Astor. You get what you pay, for it’s tiny, Bed is hard, bathroom is kinda creepy, WiFi is very poor. But the staff is very friendly, free breakfast and it had parking.   We didn’t plan on spending much time at the hotel and it was a last minute addition to the trip so it worked for our needs. ", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r533552816", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "NOT a 3 star hotel", "review": "Astor hotel is not so bad . Despite the old furniture and wall paint , the staff are friendly , breakfast are ok and bus stations are very close . If you use the bus line 22 you will arrive at the Florence Dome in 15 minutes .", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r532431824", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Good value for money ", "review": "the hotel is neglected. the bathroom is without aspiration and has a terrible smell of caca. the staff is friendly. Thos hotel is absolutely not for a three star hotel. at most it is two star. the hotel is not accessible for handicapped as there are many stairs", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r531941462", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Worst hotel I have ever stayed at", "review": "Hotel is located about 25 minutes walk from the town centre. I had a single room which wasn't very large but was very clean. Bathroom was normal size however shower was very small. Breakfast was tasty and fresh. WiFi worked perfectly as well. This hotel hasn't got good reviews but was fine for me and honestly I don't understand bad comments.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r524736417", "sub_review": {"Location": 2, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Not recommended ", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r491578574", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Budget friendly", "review": "The air conditioner doesn't work at all (and when we open the window the mosquitoes practically eat us), the key of the room broke and they make us wait 1 hour for a guy and we lost one of our tours. The only good was the breakfast.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r485341657", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Not bad, value for money", "review": "Budget friendly hotel with good customer service but very old-dated. Needs a renovation! We stayed 3 nights but the first night was terrible in a small room at the ground floor, the room was hot and noisy. Luckily we got an upgrade to the 2nd Floor which was better but still very hot and noisy. No airconditioning, lots of traffic noise. Hotel nearby shopping mall but far from city centre. Please be careful when taking bus 22 to the city. Lots of pickpockets! ", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r475186077", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Never back again ", "review": "The hotel is old and near the centre of Florence, it is clean and the team is friendly, and you can park your car for 15 Euro per night in next door car park. It worth £60 per night and you get the value you paid for the money.", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r473396520", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 1}, {"title": "Rooms smell of bleach, very poor Wifi", "review": "Full of Miskitos in the room and no wifi in room. The bathroom is okay but the place to take shower is so small. The pool is so small also the card machine in reception cannot work properly. It is so disappointing  ", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r464754788", "sub_review": {"Location": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled on business", "rating": 2}, {"title": "Avoid it!!!!!", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r439681659", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Disgusting hotel, do not stay here", "review": "So i do not know where to start!!! Not clean!!! Old! Mosquitos could let us sleep!! Breakfast was nothing special.. the lady at the breakfast buffet was the rudest lady every!! They say they have internet...only at reception!!! Wc after a shower was like a swimming pool!!bed was smelling like it was setted 1 year ago!!balcony door needed extra extra power to close!! I wouldn't recoment at eny cost!!! As possitive i would put the parking(open parking )!!", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r412592658", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Mould, moskitos, noise... Don´t go there", "review": "The hotel advertises free WiFi.. the only place you are allowed WiFi is in the reception. You actually have to stand in reception otherwise you cannot use it. No WiFi in any rooms or breakfast room. Air conditioning does not work anywhere throughout the hotel. I had a shower only to find the shower door broken and off the hinges, the shower itself was mouldy.  Hotel dirty and unkempt throughout. Not a nice hotel at all.  Breakfast was terrible, stale bread and croissants, plenty of stale cake. No milk. Very rude lady sering coffee, no pleases no thankyous just grunts and glares.  Hotel is in a poor area of Florence. We walked back and encountered a few prostitutes.  It is possible to walk to the old town so long as you don't mind a 40 minute walk. Bus stop is 20 minutes up the…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r404567445", "sub_review": {"Location": 2, "Rooms": 2, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Cheap hotel, out of the city centre but good bus service", "review": "Do not go there!   In the bathroom, there was mould on the ceiling - probably after a previous leakage?   Furniture - very old - like in the 1970s.   There were moskitos in the room.  Also, it was quite noisy in the hotel.  The airconditining was not working very well.  The wifi was very weak.  Breakfast - a complete disaster!  We stayed there for one week.  Several times,   there was no bread.  The breakfast room was full of people, there were not enought seats.  There were 4 slices of ugly looking fat salami for 30 people. When you asked the lady serving coffee to bring more salami, she said: TOMORROW!  Imagine, there were also pigeons flying in the breakfast room - we experienced this several times.  There was often no cheese, no yougurt. They only serve cheap sweat…", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r369583131", "sub_review": {"Location": 3, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Not recommended", "review": "We stayed at Hotel Astor for a week and were in a double room on the top floor at the rear which meant it was quiet. The staff were very friendly and the room was good and clean and the bed was comfortable. In Florence you need to pay top money for luxury so don't expect that here. This is a good budget hotel and rooms have en-suite shower and wc which was a bonus. Free parking area behind the hotel which is very welcome as on street parking is limited and always busy. It is a fair distance from the city centre but there is a frequent bus (no 22) which stops close by and provides an efficient service into town, buy your tickets at tabacconists, again there is one close by. Breakfast was the same every day but we found it sufficient to fuel up before going out each day and the…", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r369009864", "sub_review": {"Sleep Quality": 2, "Rooms": 2, "Service": 3}, "travel_purpose": "Traveled on business", "rating": 2}, {"title": "Will never return here", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r338602029", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Decent hotel", "review": "I didn't like the hotel at all. Yes, they were cleaning hotel every day, but it didn't seems to me clean, breakfast was not testy, no wi-fi connection at the room, we had to go and seat at receipton to us Inet. The only good thing was very friendly staff!  ", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r323021294", "sub_review": {"Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "good value for money", "review": "Its a decently built hotel which can be considered if no other good hotel is available. This one is a bit far from the city and all the main attractions. There is hardly anything around this hotel. Staff was nice though and breakfast was also good.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r321160904", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "not too bad", "review": "second time i stay in this hotel, the staff is very polite and helpfull, the location is very good, bus stop to the center is a 3' walk from the hotel. The hotel itself needs to be refreshed a bit.. old tiles and paint that could be renewed", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r318509510", "sub_review": {"Sleep Quality": 3, "Rooms": 3, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Not to be recommend", "review": "the hotel is far from eveywhere, but have private parking, good breakfast. We were there for one overnight and have good rest. In the middle of August the price was acceptable. Has airconditioning. But the additional child  bed - terrible", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r305819049", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Stay away!", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r288713797", "sub_review": {"Sleep Quality": 1, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "The most terrible hotel i have ever been", "review": "Hotel is located 9 bus-stops from the city center. It cost us €1.30 each way per person to get to the touristy part of the town. Hotel has secure parking on the back side that you can find and use only after check-in. On top of my pre-paid booking I had to pay €14 city tax. The hotel is really outdated and not maintained properly. Everything need repairs and update. Room was full of mosquitos. Killed mosquitos on the wall. AC did not work. I had to open window, but mosquitos’ problem become even worst. Wi-Fi did not work in my room. I had to use it in the common area. Breakfast had poor selection. Everything you touch you feel like hotel tries to cheat you on. The hotel manager can play in Sopranos. He was helpful and gave me a room upgrade, so I cannot complain probably. The…", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r285115445", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 1}, {"title": "Very outdated but clean!", "review": "I visit this terrible hotel in July 2015 and believe me is nightmare the room not have air-condition  i change 4 rooms and the air condition is not working and finally the staff tell me the air condition not work in hotel many weeks the room is hotel is old the room is terrible the window is broken is not closing in the bathroom the ceiling was full of holes the shower had no door but a very small curtain so ALL the water came out on the floor like you are in the sea the towels were so thin like a sheet it so full of mosquitos and the breakfast the worst i ever had no where the internet worked ", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r280338160", "sub_review": {"Value": 3, "Location": 3, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "There are better Hotels in town", "review": "The hotel is very old and it needs some serious renovation. The bathroom is so small that when you take a shower if overflows making everything wet. The curtain rod is actually a PVC pipe. The staff is extremely nice but they need to spend some money and update the place.", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r278927461", "sub_review": {"Sleep Quality": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good on budget hotel", "review": "When I booked this hotel I was looking for one close to the Airport. It appeared to be a nice older hotel with breakfast included. What I found was a hotel with lots of mosquitos in the room, electrical plugs hanging from the wall and a breakfast that had good cappuccino and lots of bread. I felt it was over priced for what you got. I would find a better hotel.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r273672994", "sub_review": {"Value": 3, "Rooms": 2, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Avoid unless you like to sleep with mosquitoes", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r271132703", "sub_review": {"Location": 1, "Rooms": 1, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Far out location with lots of mosquitos", "review": "This is my first ever review on TripAdvisor and I feel compel to warn others about this hotel. Like others have mentioned, breakfast is adequate with few selections. One thing that bothered me the MOST is the number of mosquitoes that 'somehow' snuck into our room even though our windows and doors are closed. Later on, I realized that the only possibility is the air ventilation! Like other guests who have stayed here, they also experienced the same problem. I suspect there's a small pool of dirty water/reservoir near the central ventilation compartment for the mosquitoes to breed then travel into the ventilation pipes into different rooms.  PS: Few spots of our room's wall is canvas of mosquitoes' carcasses squashed by previous hotel guests, then I added some too...  Stay away!", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r270414082", "sub_review": {"Sleep Quality": 1, "Cleanliness": 2, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "budget stay to visit florence sights", "review": "Florence is this incredible city in which most of the attractions are within walking distance to train station, hotel astor however is a thirty minute bus ride away. In addition the rooms aircon did not work, so we opened the window which allowed several mosquitos in. The beds were sunken & uncomfortable Breakfast is ok with several cakes   Avoid unless youre on a extremely budget hotel", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r270224693", "sub_review": {"Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "To avoid! Not clean.. Far away from center", "review": "stay one night in florence. good front desk help who recommended you take bus #22 to see the sights but we chose to walk instead( about 20 minute away to the first one). room was  clean, basic but it is a budget hotel in florence. parking in secure gated area. as many of the travellers also drive so the area was full in the morning so arrive early if you have a car. buffet breakfast was decent,good  cappuccino. we will stay here again for the location and reasonable value.", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r265190132", "sub_review": {"Value": 1, "Location": 1, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Great for traveling on a budget", "review": "It was far from the touristic center, altough the staff was very kind and gave us good directions to get there. They spoke well english and french. The sheets were clean, but the room itself needs serious work. It all looks old and neglected. Breakfast was poor and it most certainly didn't look like a 3stars hotel. Wouldn't go back there.", "date": "February 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r254618452", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "For low budget travellers", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r240684542", "sub_review": {"Sleep Quality": 1, "Cleanliness": 1, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "staff and morning coffee are great... but thats where its stops!!", "review": "This hotel is in very bad condition. It is placed outside center and there is a parking, but please drive carefully inside because there are not to much space on parking lots. There are lots of mosquitos. Rooms are in bad conditions, old furniture, old metal windows without door handle. This hotel not very close to the center of Florence, you need to take a but for 20-25 minutes to reach center. Cleanless is not positive side of this and bathroom is in very bad condition. After showering you have water all over the room! Wi-Fi is very bad, sometime is working, mostly not. If you have better option, mine advice is to avoid this hotel.", "date": "November 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r236014331", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "ADEQUATE, NOTHING MORE", "review": "They have a bad mosquito problem. They apear to come through air vents! We where bitten every night. The bed is really uncomftable and will give you a bad back. The walls are to thin, you can hear nexyt door with little effort. The breakfast is fair effort I suppose. Staff are great and very helpful. Its a shame. If they could sort out the air vents out and put up mosquito netting on the open windows. Bought new mattresses and invested in a little soundproofing between plasterboard walls they put up over night they could have a great hotel on their hands. I have stayed in worst but would not be recommending it to anyone I'm afraid.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r232593739", "sub_review": {"Location": 3, "Rooms": 2, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "There must be better options in Florence", "review": "A friend and I were visiting Florence for a few days and had booked this hotel via the Thomas Cook website.  Firstly, we were amazed that Thomas Cook had such a hotel on its books as it is not the standard we expected from this tour operator.  Having read other reviewers' reports of the hotel (admittedly AFTER we had booked), our expectations were low.  On the plus side, the reception staff were all helpful (I think we saw three different ones over the length of our stay) and although located a little out of the city centre, we were on a good bus route (euro 1.20 down to the railway station) and there was an excellent supermarket nearby.  However, the negatives sadly outweighed the positives.  The room was noisy as it overlooked the main road and in the bathroom, the shower…", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r220457903", "sub_review": {"Value": 2, "Sleep Quality": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Nightmare on Florence", "review": "This hotel not too close to the center of Florence (you need a bus that will take like 15 minutes to reach it). The room was small, but ok and clean. The wifi signal did not reach my room tough and that was really annoying. The staff of the hotel was gentle, but definetly there must be better options in Florence.", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r209274406", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Very old and run down", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r182143270", "sub_review": {"Value": 2, "Location": 3, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 2, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Not worth the money", "review": "Luckily was only here for the one night while heading towards Lavagna, man this place is so run down. The room was big enough, the beds were so unconformable, the bathroom was small and dirty and water leaked out of the shower, this place really needs a good makeover. Our room was right in front of the air conditioner unit (I think) so there was this constant loud buzzing noise, so we did not get a good nights sleep. Breakfast was limited and unimpressive. I probably would not call this place a Hotel, but I guess you get what you pay for. as this was one of the cheapest places in Florence.", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r180355900", "sub_review": {"Value": 1, "Location": 3, "Rooms": 2, "Cleanliness": 2, "Service": 3}, "travel_purpose": "", "rating": 2}, {"title": "Good base for Florence", "review": "This hotel is old and poorly maintained.   At the first glance rooms are looking good. But the disappointment when you enter the bathroom... Maybe they cleaned it but still seemed quite dirty.  It's small and  many tiles are broken or even missing,  shower floor is cracked plus the water stays in.  Madras is old with bumps on both sides of the bed.  It wasn't too expensive but definitely not worth the money. ", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r177893862", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Don't judge a book by its cover!", "review": "My wife and I stayed here as a base for Florence.  It's not in the city centre, but the bus stops right outside and only takes 10 minutes, there neighborhood is good with shops (including supermarket), and some good restaurants within walking distance (I suggest iTemplari, ask the staff and they will direct you).  And there is also free parking on site for those with cars.  Breakfast was good with breads, pastries cheese, meat and cereal with coffee brewed to order.  The room was good and the bed comfy, however the bathroom was rather small and the shower leaked.  I would stay in this hotel again.", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r174970438", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Nightmare!", "review": "Coming down the street to the hotel, it looked rather scruffy from the outside.  However, even though we were very early (11H00) the friendly desk attendant showed us the hotel parking at the back of the hotel. (Free - which is seldom found in Florence, or any other city in Italy.)  She quickly helped us with maps, directions and suggestions for the rest of the day, including restaurants nearby for the evening.  The hotel could do with a lick of paint and some renovations, especially the showers, which do not drain.  I reported this to the cleaning lady, but she must have not understood me or ignored me.  It was clean (no dust under the bed) and we received new towels on the second day.  The breakfast was continental, which kept us going until about eleven.  Bus stop to the city…", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r162281857", "sub_review": {"Value": 2, "Location": 2, "Sleep Quality": 1, "Rooms": 2, "Cleanliness": 2, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "not very good", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r151107293", "sub_review": {"Value": 2, "Location": 3, "Sleep Quality": 2, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Excellent value for money", "review": "I stayed in this hotel. It was a family trip. It was pretty bad. The room was small, there was no air conditioning. In the shower the water was not going out very well. The staff was not friendly. I don't really recommend this hotel.", "date": "December 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r148971932", "sub_review": {"Value": 5, "Location": 3, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Comfortable hotel in a good location", "review": "Very good value for money. We payed 112 euros for three nights for a double room traveling with our daughter. This included breakfast (not very substantial but still) and parking. The room was spacious and clean. The hotel is not very centric but the bus stop is 100 m. away and the ride to the historical centre only takes 15 mins. For us this was not a real inconvenience though it might be for some. I would definitely recommend this hotel.", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r146589792", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A decent stay in Florence", "review": "After door-knocking Florence hotels and finding them terribly expensive (especially if you add car parking charges) one hotelier (Leonardo) said he had another place out of town that was cheaper, with free onsite parking, and on a bus route into town. Leonardo came with us in the car and directed us to it, and then made phone reservations for us to visit the Uffizi Gallery and Dell'Academia next day. Although not over-impressive from the street, Hotel Astor is bright and pleasant inside, with clean and comfortable rooms, a good buffet breakfast, and helpful staff. At 75 euros per room including breakfast for each of us, it is good value for Florence and only a 10-minute bus ride away from the city. We would stay there again.", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r139085024", "sub_review": {"Value": 2, "Location": 2, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Standard hotel but friendly staff", "review": "The hotel is located a little bit away from the main attractions of Florence - around 20-30mins walk or a 10 min bus ride. However, we chose to stay here due to free onsite car parking. The room was large and clean. It was fairly pricey, especially given the location - but we had found Florence to be a bit more expensive that other Italian cities we visited.", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r136185093", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "It was terrible", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r136002113", "sub_review": {"Value": 1, "Location": 2, "Sleep Quality": 1, "Rooms": 2, "Cleanliness": 3, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "far out", "review": "It was the worst hotel witch i have been there, the water spread on the floor when i took a shower and the air conditionar was so terrible that i must wet a towel and drawed on my face during the day .the staff was so angry that when i was eatting breakfast ,she put the dishes in the basin and caused some noise in the area .there were terrible insects in the room and i had to take my wife to the hospital.", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r135637501", "sub_review": {"Value": 2, "Location": 1, "Sleep Quality": 3, "Rooms": 2, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Convenient & reasonable rates with car parking", "review": "My wife and I spent four nights in this accommodation - it was far out of town but on a main bus route to the centre.  Our room was damp with mould up to 50 centremetres high -  continental breakfast was very continental but what do they live on ?!!!   Staffing was understaffed and very obliging - not !! Situated well out of town in a very Italian area !!! Over priced", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r121005131", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Terrible service, mold in the rooms", "review": "We only booked this hotel the night before. It provided us with a secure car park out the back and a quick bus trip into the main train terminal. Staff were helpful and printed out entry vouchers for us. Breakfast was OK and the lady running it was efficient. Rooms were average but comfortable and suited our needs as we spent maximum time in Florence sight seeing. The bathroom was small & clean. We couldn't get the bar fridge to work but a lady arrived quickly  and fixed it.", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r119507586", "sub_review": {"Value": 1, "Location": 3, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Worst Hotel", "review": "I didn't expect a luxurious room, just standard and clean, we didn't even get that.  Upon arrivel they were not friendly, we got a room with mold on the walls, also in the shower, window couldn't close so the cold air got in th whole night.  The airconditioning was a hole in the wall, couldn't turn it into heating.   We asked for another room but ofcourse there was nothing available, we couldn't turn of the ceiling fan so they were going to send someone, still waiting for them! I've slept in cheaper hostels and they were nicer!  so all in all, avoid!!", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r118965289", "sub_review": {"Value": 1, "Location": 3, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Great Location, Friendly and Helpful Staff", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r118545976", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Cheap, but would consider staying again for its' location.", "review": "[+] The staff was very friendly and helpful, It is very close to the station and all the major attractions are well within walking distance  [-] The bathroom is really small (one area for it all, shower, toilet etc)  I was traveling with my mom and her friend. We only had 1 night to spend in Florence and we did not have any hotel there yet. We were scouting for a triple room along the streets near the station and we were fortunate enough to stumble upon Hotel Astor. With only 1 last room to spare, we immediately booked it on the spot and spent the night there.  The hotel staff was very helpful. The owner (or at least I think he was the owner) was very friendly. He gave us some tips on what to do we should do there and where are the best places to check out during out short…", "date": "October 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r117154674", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Worst hotel on 2 month European trip", "review": "On arrival they greeted us very cordially.  They had a lift, which was great.  On reaching our room it was very \"pokey\" to say the least, but we had already booked and paid for it over the internet ,so had no other choice but to grin and bear it.  No glasses to drink from, TV not working, Bar fridge not working, en-suite no larger than a loo on a plane. We were booked for 3 nights, but no service was ever carried out on the TV or Fridge, which meant we could not keep any food or drink cool, and I love my bubbles in the evening.  On saying this, for the price it was pretty good, beds comfortable, and always lots of hot water. Just a few steps to the marketplace, and 15 minutes to Il Duomo. Would probably stay again, but would insist on at least a working fridge!! Barbara from…", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r116911980", "sub_review": {"Value": 1, "Sleep Quality": 2, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Spacious rooms, great breakfast", "review": "We chose the Hotel Astor based on average reviews and the fact that it was located outside the historic area of Florence, which was very expensive and parking almost non existent. The only plus was a friendly manager, Leonardo, who spoke english and was helpful, and free parking.  The hotel itself was a disaster. There were holes in the walls, the shower had a paper curtain which turned the bathroom into a lake. The TV did not work, and the hotel for the most part was very run down. Breakfast was horrible; a few hard rolls, for the early risers, nothing for those that slept in. The coffee was mud. When people complained the staff just shrugged their shoulders, and decided they could not speak english. I felt bad for some older tourists, who had nothing to eat.  I did forget one…", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d1905017-r114667284", "sub_review": {"Value": 4, "Sleep Quality": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}]