[{"title": "not convinean room for peopleo our age", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "November 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r728618182", "sub_review": {"Value": 2, "Rooms": 2, "Service": 3}, "travel_purpose": "", "rating": 3}, {"title": "Excellent hotel staff makes for an excellent stay", "review": "we arrive at friday by car ...no body tell us you not alowed to get that area with car ..they send us to a parking belong to the HOTEL they charge 30 euro per day...spoke with friends that sleep at the area they pay in a public park 10 euro a day.. then we get a room second floor call a junior suite.. the room was funny the bed is upster need to walk up little hard stairs... i ask to be change no body care at from office .... tv didint work at all ...no also a litle light next to bed ... he was so hot at night try to open the window was a heavy one..no air... breakfast very continental ....no much choice .... the bellboy was very nice also the gil at front office but the guy who run the front office didint care about our needs... they charge turist tax per night ..extra 1euro to get permissionto park etc... nice locacion. internet very bad coneccion next room we have a family one child jumping and making noice ....…", "date": "November 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r725501687", "sub_review": {"Value": 5, "Location": 4, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Unusual, but very good.", "review": "It's a bit off the beaten path, about a 25 minute walk from the Unita train station.  This is not a bad thing, as you walk out the door and are not greeted by the rush of people walking by.  As other reviewers write, if you want to sleep in a bit of history, this is probably the right place, with some of the original frescoes still intact.  But for me, the staff really made our stay in Florence enjoyable.  They were friendly, attentive, and prompt.  They happily carried our bags up the stairs.  They greeted us in the morning for breakfast.  They got us (Americans :) ice when we wanted it.  My partner needs an electric fan to sleep and they happily accommodated that request.  When we checked in, the staff member asked us if this was our first time and when we said yes, she opened up a map and highlighted where everything was relative to our hotel.  And even though we had booked a junior suite, we got upgraded to a full suite.  All of this is to say that the staff made us feel very welcome and special.…", "date": "November 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r725147249", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "Very convenient location", "review": "This hotel must be unique. It's in a building which is reputed to be over 500 years old, and retains many of the original features and atmostphere. This is in some ways this makes it great for a stay in the historic city of Florence, and its location is ideal for visiting many of the attractions on foot.  The age of the building does detract a little if what you want are all the conveniences of modern Hotel (there are no lifts and narrow winding stairs to the upper floors for example.) The room we had was comfortably furnished in a style in keeping with the building and the bathroom excellent. Mini bar, wifi and other services very good although the TV had no access to English speaking channels. Due to the architecture, a little dark. The staff were exceptional,  always welcoming and very helpful and made our short stay most enjoyable. Breakfast was pretty standard continental but good in the small dining room. Unfortunately the weather was bad during our stay, as there is a very attractive open courtyard which must be idylic in better conditions. In summary the Hotel is small, welcoming, and full of atmostphere, well located for a short stay. \"Historic House\" describes it perfectly.…", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r723279210", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "An \"interesting\" place to stay", "review": "Very friendly and welcoming staff. a quiet location but within easy walking distance to Duomo and Santa Crocce. Comfortable rooms and an unique historic building . Breakfast  was fresh, meats and cheeses . Staff were very helpful", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r722110030", "sub_review": {"Sleep Quality": 3, "Rooms": 3, "Service": 5}, "travel_purpose": "", "rating": 3}, {"title": "Historic Visit to Florence", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r718668547", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "NIGHTMARE!! Its a lie!!", "review": "J and J Hotel is a great boutique hotel a few blocks from Santa Croce and The Duomo on a quiet street. The staff are friendly and welcoming. The bed is comfortable, and there are an assortment of pillows. The bathroom was very nice, spacious, and clean.We stayed in a very spacious suite. It was a great place to relax after several hours of touring the city. Breakfast is included, and it has great hot and cold selections, including espresso and cappuccino.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r717391241", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Cosy place", "review": "Compare the pictures to the web   - Tell me if this is a room for 3 (suposed to be a junior suite!!! Not an standard room!! So i cant imagine how an stardard room was...   -  tell me if this is to pay 390€/night - You dont have wardrobe - look at the Window views PLEASE!!  See the pictures and read (dont go! Is horrible!)  When you complain they tell you they dont give your money back and that you cant talk to the director  A blonde woman in de reception desk i think her ñame was rebeca, told me that if i wanted to write a letter to the director she would break it in peaces just in the minute i would leave!!  We lost 900euros and they were so rude!!", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r715700560", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Not as expected", "review": "Located just about 300-400 yards from the Doumo, sits on a very quiet street (opposite the police station) but next to the busy street with loads of cafes, restaurants and shops - this was the perfect location for our week in Florence! Very friendly multilingual staff, nice fresh breakfast and delicious coffee every morning, bar at evenings - anything to accommodate a nice stay. Our room was with clean on-suit, large bed and other convenient futures including a safe. There was a door to the small courtyard with plants and tables as well.  We had clean fluffy towels every day and bedding swap in a middle of the week too.  The building apparently is XVI century monastery converted in a hotel and you will see some historical futures left once you enter.  Lovely place, we really…", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r714152710", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Central with amazing rooms. Fab", "review": "The room was very disappointing. It did not meet our expectation. It is not what I would expect from a 4 star hotel (we normally stay at 4 star hotels during our trips and we are used to better rooms) .The furniture looked old and worn. The bed made noises with every movement and the mattresses were uncomfortable. Breakfast was also poorly (small selection and not very appealing presentation of food - cheese and sausage were served on wooden plates and didn't look appetizing. The cups were partly chipped on the edges). ", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r712642162", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Great Hotel", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r712203109", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great hotel in een great town", "review": "My husband and I stayed here for 7 nights beautiful place.bed was so comfortable.very clean.and it was central to all the sights on our bucket list.i would recommend it very much.staff were very friendly and helpful.would definitely go back.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r708731595", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Beautiful room", "review": "Very friendly staff, great sphere in een very uniek town. Perfect match for this town. If I visit Florence again I would choose this hotel one more time. I recommend to everyone. The room was spacious, watch out for bugs in old building bugs needs extra attention.", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r707226381", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Exceeded expectations in Firenze!", "review": "We stayed in one of the suites, and it was wonderful - high ceilings, great layout and decor, great atmosphere overall. The location is good, a short walk to lots of the most beautiful spots. The property is nice and was a good respite from the heat when we came back for a quick stop. Staff were friendly and accommodating. Breakfast was decent but not out of this world, very nice coffee though. This was one of our mini-moon destinations and we were very happy with it, very romantic. The only downside was the floor vibrated a bit when the upstairs guests were walking around -- historic wood building -- but didn't really impact sleeping and it was a clean, quiet room. I guess there were a few steps to climb to get to the room, but that was totally fine for us.  The only other…", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r702788298", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "A slice of Tuscan tradition", "review": "Wow! Where to start? We had an amazing experience in this hotel.   Our group  We are traveling with our two adult sons aged 25 & 22.   Arrival  We arrived to Firenze by train and walked to the hotel in about 25 minutes. The hotel is just a couple of blocks past the Cathedral of Santa María del Fiore in a beautiful quiet street.   Check-in We were greeted by Martina in the lobby/reception. It is a beautiful historical building and very tastefully decorated. She was very nice and registered us promptly. She gave us a city map and some recommendations for some things that we needed. She also got us an electrical current adapter to charge our phones which was very helpful and appreciated.   Our rooms Who got two rooms next to each other on the ground floor in the rear. Our sons…", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r700713244", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "All around good stay", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r699190366", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Beyond dissatisfied", "review": "Stayed here for 5 night and I have to say I was pleasantly surprised. The free breakfast was very nice. The staff are great and can speak English which helped because I'm Irish. They were on hand to give me any information I needed to enjoy my stay in Florence and I owe a lot of thanks to them for my wonderful stay.  Would recommend", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r695895994", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "NOt really what I expected", "review": "So I booked this for two nights for my wife and I. It was our first getaway without our kids in a long while. I booked the most expensive room they had with the intention of getting a room with a nice tub, a nice porch for us to relax on and what not. When we got to our room it had neither of those amenities. What it did have was stains, smell, and overall looking like it needed some real cleaning.   When they switched us to a room with a tub and porch (real small and useless) that room had real week AC and anytime we would walk or the people above us, the entire room would shake.  Our bathroom as well was unventilated and was hot like a sauna.  Overall I would never stay here again and not recommend it to anyone.", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r690544306", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Really Enjoyed Our Stay", "review": "Dear LevyHertzel,             We thank you very much for staying at the J and J Hotel and for taking your time sharing your experience with us. We are extremely very sorry that you were unsatisfied with the accomodation. As the building was an old convent of the 16th century, all our rooms are different from each other that is why we prefer to receive any special request at the time of the reservation. Hence we agree that there was some issue with the AC, however those days Florence was under a 42°C heat wave. Consequently this was giving some problem to the whole system which hopefully we were able to resolve later. Thank you again and we apologize for all the inconvenience caused. Warmest regards The Management", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r689621330", "sub_review": {"Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Beautiful, romantic and quaint!", "review": "We have been given a very shabby room, originally we were given room nr 6 but when we wlaked in it was soooo smelly of smoke we could hardly breathe. At the reception they said it is forbidden to smoke in all rooms but sometimes happens... right I understand that but why the housekeeping team did not do anything to make the smell go away ? why did they not even open the windows? why did they not advise the front desk about the smelly room ?  In exchange we have been given room nr 20 with the guarantee that is was the same category of room 6 .... not a chance in the world....!!! Room 20 is a shack, all walls are dirty and very badly maintened, yello spots bbelow the a/c system, dirty floor (my white socks where black in 2 minutes), tiles in the bathroom falling apart ... really…", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r685751087", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "not the best", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r683172004", "sub_review": {"Location": 5, "Cleanliness": 2, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Excellent quality room but noisy guests", "review": "We stayed three nights at this hotel and the best thing about it its the location. It was an old convent and there is no elevator so to reach our room we had to climb two steep flights of stone stairs. The room was a large quad with one small air conditioning unit on the wall which barely kept the room cool and which would turn off in the middle of the night. The staff was business like and competent. The breakfast was ok, but the coffee was usually burnt. the wait staff in the breakfast area were very nice and you could smell fresh croissants baking in the early morning. they tried!", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r682451622", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Wonderful Stay", "review": "Dear Valued customer,                           We thank you very much for choosing our hotel for your stay in Florence and for sharing your experience with us. We are very sorry that you were not too satisfied with the hotel. Yes you are perfectly right, the building was an old convent of the 16th century converted into a hotel, that is why it's particular from the other standard hotels. We don't have a lift as we are not allowed by the council to put one. As mentioned above, it is a historical building and preserved as cultural heritage so no modifications can be done.  Anyway we hope that this has not put you off for a next visit. We look forward to welcoming you in the future. Have a nice day Warmest regards The Management", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r682371003", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Location Location Location", "review": "This hotel was beautifully decorated. The hotel room was spacious and the bed extremely comfortable. The hotel is in a quadrangle so noise travels from the quadrangle up into the rooms. Because from 4pm to 5pm there was a huge commotion between a couple,  and a huge fight erupted, it sounded like someone was going to be thrown off the balcony and killed, and we invisioned police arriving. The hotel staff did not ask them to be quiet or to refrain from shouting and making a loud noise until we phoned reception to find out what was happening. The guy eventually left the hotel but came back at 11.39pm and the couple started having a shouting match again.  The hotel staff did not stop him until we phoned to say he was keeping us awake with the shouting , and it was totally…", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r682004613", "sub_review": {"Value": 3, "Sleep Quality": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Definitely not a 4-star experience", "review": "Dear LeazieK,                  We thank you very much for choosing the J and J hotel for your stay in Florence and also for sharing your experience with us. We are glad to know that you found the hotel nice and you loved your accomodation a lot. .  Our sincere apologies regarding the noisy couple that was staying just next to your room. It's not that we haven't tried to calm them. The reception staff already intervened when they were discussing in the lobby area however when they continued to fight in the room, it's quite impossible for us to hear that due to the distance. As soon as you informed us, the night manager called them back immediately although it was hard to make them understand as they were drunk. Sincerely we have never experienced such kind of issue in the past as it never happened before and that's why the staff hesitated to call the police. We apologize for all the inconvenience caused.  Concerning the breakfast, we apologize for this as well as certainly there have been some kind of misunderstandings. Our buffet is opened to all our guests but as we told you that morning, we don't have take away cups for coffee or special containers to pack food. Guests are free to take away fruits or croissants if they have their own bag.  Thank you and have a nice day Warmest regards The Management.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r681146370", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Not what I expected", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r680609543", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Character building, excellent staff", "review": "I had booked a suite so we would have space to relax in our room. The room was a shock when we saw it. It is entered by a small entrance hall off which is a very average bathroom with miniscule bath. The access to the bath is very difficult and not at all comfortable to use. Then there is a sleep stone staircase and a long landing before you reach a tiny sitting area with a two seat sofa and two stools. This area is cramped and not suite standard. Then its down a few more stairs to the bedroom area. Its a long treck to the toilet from the bed! We complained immediately that this was not our idea of a comfortable relaxing suite but were told the hotel was full and there was nothing that could be done. The suites are advertised as fitting up to 4 adults. I cant imagine where they…", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r679650964", "sub_review": {"Location": 5, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Room 20 is just fine", "review": "Dear Sir/Madam,                      Thank you very much for choosing the J and J Hotel and for taking your time sharing your experience with us. We are very sorry that you were not satisfied about the room and moreover we were unable to move you into another one due to unavailability. Having said that, we would like to precise that room number 19 is a beautiful Double Split level Suite with a small terrace, of course different from the other Suites that we have. We keep saying to our guests that the building was once a convent converted into a hotel and that's the reason why some rooms are different from the others even if they are from the same category. Images and information can be found on our official website. Concerning Family Suites you are right that we have advertised having Suites that can perfectly accomodate up to 4 adults but it's obvious that Suite 19 is NOT for 4 people. Your booking was for 2 people and you were assigned into a Double Suite.  Suites for 4 people are of course different, much more spacious to accomodate comfortably up to 4 adults.  Hoping that we have answered everything, we thank you very much and we wish a you a nice evening. Kind regards The Management", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r678834950", "sub_review": {"Location": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Historic Florence", "review": "Stayed here for three nights. great base to explore Florence - about a 10 minute work from Il Duomo. The room we had was a little basic but very comfortable. The building itself has a lot of character, and is nicely laid out. Best thing about this place was the staff, they could not have been more friendly and helpful", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r678268929", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Not as expected and pictured", "review": "Dear 588Lighthouse,            We thank you very much for choosing the J and J Hotel for your stay in florence and for sharing your beautiful experience with us. We are very glad to know that you love the hotel and enjoyed your stay. A big thanks from the entire staff as well and we look forward for your next stay.  Have a nice day. Kind regards The Management", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r674793460", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "A shabby hotel in need of investment that serves coffee in a teapot!", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r674123125", "sub_review": {"Value": 1, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Good location, great breakfast, kind service", "review": "We were thoroughly disappointed in this hotel. Our initial booking of a deluxe room was upgraded on arrival to a \"suite\" (room 4) basically a large room with shabby furniture and a outdated bathroom with no proper shower just a hose attached to the taps. The only window looked over the central internal courtyard and the main passage way for guests to access their rooms so you either had to have the curtains closed all the time or open for everyone passing by to see in.  We were so dissatisfied  we asked for our original deluxe room, that we had booked back in January. The only one that was available(allegedly) was room 20 and be aware that this room is ABSOLUTELY nothing like the rooms on the hotel website. It is painted completely white (dirty marks everywhere), no pictures or…", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r673808323", "sub_review": {"Location": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Amazing!", "review": "Dear Joanne,  We thank you very much for booking the J and J Hotel and furthermore for sharing your stay with us. We are extremely very sorry about your bad experience but at the same time surprised about all these complains that you have mentioned. First of all when we normally offer a free upgrade from a standard room to one of a higher level, 99.9% of our guests feel amazed however you were the very first guest that was totally unhappy and starting complaining with the hotel staff... Whenever we have the possibility, this is a kind of promotion that we offer, in accordance with the travel agents,to  our guests.  The building itself was originally a convent of the 15th century and then converted into a hotel, so it’s quite normal to have rooms different from each other. Of course it’s quite impossible to put all the pictures of all the 21 rooms on the website. Whenever a guest is not happy with his room, we try our best to give an alternative one however this of course will depend on our availability. Your complain arrived on the second day of your stay and that particular day, we had just a couple of rooms available. The hotel staff informed you that it was no more possible to make a second change as another Deluxe room was not available. The availability that you saw online was for different categories.  The fact that you don’t like rooms number 4 or 20 is your personal opinion and we respect it but it’s not nice to recommend other guests not to book them. We have many returning guests when  usually make their reservation, ask for these rooms to be assigned them. All the rooms are equipped with antique furnitures (not old) and concerning the bath of being too high, well it’s a normal bathtub with normal/standard dimensions. The purpose of offering you a bottle of spumante was not done in the hope to avoid any written complain…... This was specially requested by your travel agent.  Our main goal is to make our guests happy, by making them feel comfortable, by offering full assistance, service, and respect. If a guest has an issue, the staff is here purposely to listen and give assistance as soon as possible. A client is always right but still he has to give respect towards the other person to whom he is talking. If someone will shout to a lady staff, asking her to make continuous repetitions (as a student) of everything that he was “saying”, of course for us that person is rude.  Finally the manager was not making any kind of interruptions while your were talking...It’s normal that he has to give a reply or explanation after each comment that you were pointing out otherwise we will not get any conclusion if he just remains in silence…...  Thank you for your attention and kind regards.  The Management ", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r671077045", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Vacations", "review": "Spent 3 nights here while in Florence.  It's about a 10 minute walk to the Duomo area which is very handy.  It's on a quiet street which is lovely for sleeping.   A nice courtyard area would be lovely for afternoon / evening drinks when the weather is a bit warmer.  Breakfast is plentiful and varied.  Service is attentive but not overbearing.  We would stay here again if every back in Florence.", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r670383593", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely hotel", "review": "Dear Jackie, We thank you very much for choosing the J and J Hotel and furthermore for sharing your experience with us. We are very happy to know that you loved the hotel very much. A big thank you from the entire staff as well and of course we will forward for your next stay.  Warmest regards The Management", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r666967401", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "original cozy place close to the attractions", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r664390589", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Wonderful hospitality", "review": "we stayed 3 days at J&J's. the hotel is very original given by its roots as a monastry, all rooms seem rather different full with old and new stuff. the location is perfect to discover the attractions like the duomo, santa croce and others, all is within a 10 minute walk. we had a very quite room which allowed a good sleep to fully recover after long days of discovering florence. the reception and the breakfast morning crew was very friendly they e.g. booked for us a restaurant that turned out to be very good, and not a simple tourist trap! there are some steep steps to be taken to reach some of the rooms, so for people with disabilities maybe not ideal. overall a very pleasant stay, so we can really recommend this place!", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r660665924", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Excellent small hotel", "review": "Great location and wonderful hospitality from the entire staff.  The highlight is evening drinks in the charming lounge.  Each room is unique and tastefully decorated.   It's a short walk to the Duomo and there are plenty of great restaurants in the neighbourhood.", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r659217304", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Home Away From Home", "review": "The hotel is an ideal base for exploring Florence, and good value. Situated on a quiet road it's an easy walk to the Duomo and other major attractions. Tastefully decorated, well-equipped and comfortable rooms. Welcoming and helpful staff.  I have stayed in Florence many times but this is my favourite hotel.", "date": "January 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r646478540", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Very lovely place", "review": "Loved, loved, loved this cozy,chic hotel. It’s the perfect size, intimate. Staff will know you the second day. Service outstanding, everyone was focused on pleasing the customers. They also give you good recommendations for dinner within walking distance that are non-touristy. I will definitely stay again.", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r641759376", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Great hotel, in great location", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r640088512", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Comfortable hotel in a very nice location", "review": "Booking online from hotel website was easy and very good value for the facilities they provide. The hotel is in a very good & quiet location, yet within very easy walking distance of all the major sights, as well as many excellent places to eat that are good value and mostly non-touristy. We had a very comfortable room on the first floor with plenty of space & good facilities.  The staff were all very friendly & helpful & ground floor spaces were attractive & comfortable. Breakfast was okay and we would have been happy to pay a bit extra, for more choices. We were able to buy bottled water very cheaply at a nearby local supermarket.", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r638565629", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great hotel, amazing room", "review": "Dear Edward,      Thank you very much for staying at the J and J Hotel and for taking your time sharing your experience with us. We are very happy to know that you loved the hotel a lot. A big thank you from the entire staff as well. Thank you for pointing out the breakfast which will be of course taken into consideration. We hope that this has not put you off for a next visit. Have a nice day and of course lots of joy/happiness for the forthcoming christmas and new year. Warmest regards The Management. ", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r629973132", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Large and cozy", "review": "We only stayed here for 1 night, but would have liked to stay a bit longer. Very friendly and helpful staff. The hotel is located very near the heart of the city centre. The rooms were very nice and the bed was comfortable.", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r627035535", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Nice location and ambiance", "review": "Dear Fab, Thank you very much for staying with us and of course we look forward for your next stay. A great thank you as well from the staff.   Warmest regards The Management", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r621171620", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Perfect", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r618906031", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "a Hidden Gem just a few blocks from the Duomo", "review": "Perfect location, huge beautiful room for a reasonable rate, super-friendly staff, lovely lobby, lounge area and courtyard. Great breakfast. Lots of ambience throughout. I would definitely stay there again. ", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r616507985", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Gorgeous hotel", "review": "Dear Mr Mooney,   Thank you very much for choosing our hotel for your stay in Florence and as well as for sharing your beautiful experience with us. We are very happy to know that you loved the hotel a lot and of course we look forward for your next visit. A big thank you as well from the entire staff. This is a very big encouragement for them. Have a nice day and of course a happy new year  Warmest regards The Management ", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r615789582", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "I love J&J", "review": "We stayed 3 nights in this hotel that’s close to the key sights but just far enough away to be relaxing and quiet. The staff was friendly, engaging and informative. I’d recommend this hotel to my friends.", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r614679363", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Novelty for first time visitors to Tuscany", "review": "Dear Mr Marlow,   Thank you very much for staying at the J and J Hotel and for taking your time sharing your beautiful experience with us. We are very happy to know that we were able to offer you a great service and that you loved the hotel a lot. We thank you in advance for your recommendations and we look forward to welcoming you next time.  Have a nice day and of course a happy new year  Warmest regards The Management ", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r602920764", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Lovely", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r601257514", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Absolutely charming ", "review": "Wonderful.    Three females  and we could not have felt more welcome, safer, and in better hands.    To come \"home\" after a long day and have Patrick waiting with a glass of wine for us.  Nothing better.  Cannot wait to go back.   Rooms were just lovely,  location was perfect for walking,  and after the crowds so nice to have a quiet space in the beautiful little courtyard.  Thank you. Joanne Pagano", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r597760956", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Patricia", "review": "Dear Mrs Pagano,   We thank you very much for choosing the J and J Hotel and for taking your time sharing your beautiful experience with us. Thank you very much for your fantastic feedback. We always try to offer the best service possible and when our guest remain happy and satisfied about everything, for us it is a huge encouragement to carry on what we have done so far. A big thank you as well from the entire staff, especially from Mr Patrick and of course we will look forward for your next visit. Have a nice day and best wishes for the forthcoming christmas and happy New year.  Warmest regards The Management", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r596160872", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Charming hotel with super friendly staff", "review": "This hotel was first a convent built in the 16th century, but there is nothing austere about it. It is beautifully decorated and the staff is extremely friendly. If you go, eat at Natalino’s nearby. You won’t be disappointed. ", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r594306095", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Wonderful hotel", "review": "Dear Angelrich,                  Thank you very much for choosing our hotel and for sharing your experience with us. We are very happy to know that we have offered you a good sevice and you appreciated the hotel a lot. Thank you also for the reccomendation about the restaurant and we look forward for your next stay with us. Warmest regards The Management", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r593494882", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Gorgeous Gem ", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r592223143", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Great Old Charm", "review": "Gorgeous gem of a hotel away from \"tourist scene\".  Used to be a convent and has a labrinth of rooms and suites.  Definately not wheelchair friendly...no lift.  Welcome drink on arrival.  Beautiful breakfasts.  Friendly and helpful staff.  Beautiful courtyard area and the bar tenders make amazing cocktails.  Would love tp come back again.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r591028386", "sub_review": {"Sleep Quality": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great location but poor attention to detail.", "review": "Dear Mrs Birgit,           Thank you very much for taking your time to share the beautiful experience that you had at the J and J Hotel!! We are very happy to know that we wereable to deliver a good service and that you appreciated the hotel a lot. A big thank you as well from the entire staff and of course we look forward for your next stay with us.  Warmest regards The Management", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r590009221", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Både og ...", "review": "The charm of this former abbey-turned-hotel is terrific. Just a short walk to some good restaurants. Our ground floor room was very large and clean, with a comfortable bed. Employees were quite friendly. We ordered wine from the bar and drank it in the lovely courtyard. The breakfast was just okay - it could have been better. A lovely place overall.", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r587420831", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "boutique-hotel with shabby-chic-charm in good location", "review": "Dear Sir/Madam,           Thank you very much for choosing our hotel and we are very happy to know that you loved it a lot. The whole staff would like to thank you for this beautiful feedback. Thank you for your remark regarding the breakfast which is very helpful for us and of course will be taken into consideration.We look forward to welcoming you next time.  Warmest regards The Management. ", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r585571021", "sub_review": {"Value": 3, "Location": 4, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Rooms need Interior decorator advice", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r583493889", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Nice hotel, perfect location", "review": "Lovely  small hotel , but sleeping rooms need some interior decorating advice . There are minimalist looks , but these rooms seriously need a bit of  style ,to make visitors feel comfortable . Never stayed in such a plain room before , Rest t of the property had a lovely homely feel , but not the room .", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r572599786", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Stay at J&J Historic House", "review": "Dear Valued Customer,           We thank you very much for staying at the J and J Hotel and for taking your time to share your experience with us. Every comments that will help us to improve are the most welcome and of course will be notified to the management. We hope that this has not put you off for a next stay with us.  Warmest regards Customer care.", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r571567059", "sub_review": {"Sleep Quality": 3, "Cleanliness": 3, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Not true ", "review": "This hotel has an excellent location, a few minute walk from the Duomo !  The garden, full of white flowers, is fantastic. Very pleasant staff, helpful and polite.  Large Deluxe room (some shortcomings described below).", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r568111297", "sub_review": {}, "travel_purpose": "", "rating": 1}, {"title": "Top !", "review": "Dear Valued Customer,              We thank you very much for your beautiful comment which has been very much appreciated. A big thank you from all the staff and we look forward for your next visit.  Warmest regards Customer care", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r567623329", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Not what it used to be.", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r567330280", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 1}, {"title": "Honey moon stay", "review": "Was one of the great hotels of Florence. Staff are very kind but no management at all. Booked transfer didn’t arrive. Was woken up every morning by staff talking with loud voices. An hour for tea to arrive from room service.,bacon ran out at breakfast at .9.15 an and they refused to cook more. Mini bar restocked once on five nights. Ordered water for the room and it took 2 days to be delivered after three requests. Staff smoking in front of guests in internal courtyard. Worst managed hotel I’ve stayed in ever. So sad because it’s beautiful and was great but clearly the family that own it are trying to cut costs. Sheets not changed in five nights. Disgraceful fir the level they charge at., ", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r563232503", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "My stay at J & J for 3rd time", "review": "Dear Sir, We thank you very much for booking the J and J Hotel and for taking your time to share your stay with us. We sincerely apologize if you think that you had a bad experience with us. About the transfer, as already explained to you upon check in, the driver arrived for the pick up but unfortunately a bit late because several flights were delayed that day. Therefore due to this unforseen inconvenience he was not able to guaranty the service on time as originally scheduled.By the time when he was coming to meet you, you chose to take a taxi. We are really very sorry for that. Concerning the bacon, it can happen that it finishes before when the hotel is full and during rush hours but we will never refuse to prepare more. We can't do that as we have to guaranty the service till the end. May be you forgot but after 5/8 minutes fresh eggs & bacon were served to you and to other guests waiting. We apologize if you had to wait those 5/8 minutes. Room service is done everyday so bed sheets changing, cleaning are guaranteed by our staff. Minibars are checked and refilled regularly too. The hotel is managed directly by the owner so no point of cutting costs!! She always run it as her own house so that clients can feel at home and hence the staff will always offer their best to make the guests happy and comfortable.  We wish you all the best and hope to see you soon at our hotel. Warmest regards The Management", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r559010359", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "A lovely stay", "review": "The place is very cozy, boutique, and the service is great. Very willing to help and answer any questions. We booked a regular room and when we arrived we got the suite because of our honeymoon. I recommend of the place", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r555371007", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Out of season weekend stay", "review": "Dear Sir/Madam,  Thank you very much for staying at the J and J Hotel and it's a pleasure to know that you had a good experience with us. We look forward to welcoming you in the future.  Warmest regards The Management", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r553880706", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "It is definitely not  a 4 stars hotel", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "December 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r550515690", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Central location within 5-10 mins walk of all the main sites", "review": "We toke a suite, the Room was large but it is forbidden to eat inside in the room for “hygienic purposes”, just for using room service you are charged 10 euros regardless of service excluding the price of the service itself, beware the bathroom has stairs - very slippery , the cleaner entered the room without knocking while we were getting dressed regardless of us yelling don’t open the door and finally the buffet is till 10:30 however they don’t refill and you are expected to be there at 7:30. we went at 9:00am and there was no plates or cutlery on the tables, they assumed we don’t want breakfast. the decor of the room was authentic and beautiful and they have a small beautiful garden.", "date": "December 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r546609868", "sub_review": {"Sleep Quality": 4, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Absolutely wonderful!!!", "review": "Dear Sir/Madam,               First of all we thank you very much for choosing our hotel and for taking your time to share about your recent stay.We are very disappointed to read about your experience and we are sincerely very sorry about the inconveniences caused. We are aware that only apologizing will not alter the outcome of your experience but certainly we will address with the concerned party about the points you have mentioned and mainly about the poor service that you have received during breakfast.  Thank you very much for your nice comments about the room and the patio.  Again we beg your pardon and we hope that these events have not put you off a return stay with us again.  Kind regards The Management", "date": "November 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r544243344", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Wonderful Florence hotel experience", "review": "The best description would be slightly shabby chic although having said that overall we enjoyed our stay.    Could do with a lick of paint internally and the bathroom could have done with a few improvements such as fixing the radiator and having a bit more shelf space around the basin rather than under it.    Breakfast was acceptable although I thought they could have stretched to some fesh orange juice rather than the cheap sweet stuff offered.   Bacon and scrambled eggs only every day but good selections of breads, fruit etc.    The one daily irritation the fact that the heating in our room was timed not to come on before 6pm...after hard days siteseeing we wanted to have a rest to re-charge our batteries at around 4.30pm but the room was cold.   After pointing out to…", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r538793488", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Amazing Convent from the 16th century", "review": "Dear Sir/Madam,         Thank you very much for sharing your stay experience with us. We sincerely apologize for all the inconveniences and of course pointing out these problems will help us to improve a lot for the future. We hope that you will continue to be our return guest in the future.  Kind regards The Management", "date": "November 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r538327337", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Excellent location, ", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r536230429", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Advertisement no elevator many stairs!", "review": "This is a lovely hotel, with very friendly, helpful staff. The courtyard was beautiful and the 'happy hour' provided an opportunity to have a proseco or coffee after a full day of exploring Florence and surrounds. Breakfast was fresh and plentiful and could be taken outside in the pretty courtyard as well. Our twin room was very spacious, clean and very comfortable.  However, we could hear everything from the room above... EVERYTHING - not just footsteps and conversation!!!! If you want a quiet, undisturbed stay, don't stay in room 11! The only other point to note is there is no elevator. If you have mobility difficulties ask for a ground floor room. ", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r536206718", "sub_review": {"Value": 1, "Rooms": 1, "Service": 2}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Gem of a hotel in centre of Florence", "review": "Dear Helen,         thank you very much for staying at the Hotel J and J as well as for taking your time sharing your travel experience with us. We are very happy to hear that you liked quite everything about the hotel hence we wanted to express our apòlogies regarding the noises coming from the room upstairs..We are aware that we have this problem in some rooms as the building itself was a 16th century convent. We expect to resolve this issue in the future and we hope this hasn't put you off for a return stay with us again.  Warm regards The  Management. ", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r534768313", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Unique and beautiful retreat", "review": "We made reservations for the J&J Historic House hotel referral from couple that stayed 5 years ago.  Old building quaint, outside garden very nice.  When we arrived our room was not ready.  They held our luggage since we had tickets to museums.  Later that evening went to check in, we had three flight of stairs to the room.  The other couple had two flights of stairs.  Both rooms the bathroom was on first floor, bedroom had winding concrete stairs on 2nd floor.  The advertisement does not mention no elevator nor bathroom not on same floor as bedroom.  We had two rooms reserved for two couples, one person had hip surgery problem with stairs the other knee problems  Requested two other rooms, they only had one available that was four flights up to the room but did have bathroom on…", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r532201000", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "First time in Italy", "review": "Dear Sir/Madam,            Thank you very much for booking our hotel and we are very disappointed to read about your experience upon your arrival. We apologize sincerely for all the inconveniences caused and we are sorry that you didn't get a detailed description about the hotel from your travel agency. While all our partners always have a full information of how the building looks like, unfortunately it happens that sometimes they forget to pass these information to the guests. Our bad luck that day that we were unable to switch you to another room due to unavailabilty and hence we regret that you decided to check out. The hotel being a historical building of the16th century can't be granted a permit from the council to install a lift inside. We had this project years ago but then it remained like this.  We agree that upon check out there was a misunderstanding with the concierge about your cancellation policy and you were overcharged by mistake. Afterwards the extra amount charged was correctly refunded back on your credit card.  Again we apologize for everything. Warm regards The Management         ", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r531418510", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Wonderful authentic Italian experience", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r526707280", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A lovely spot with beautiful character - close to the sites in Florence!", "review": "We spent 1 night at the hotel in room 2. Very large bedroom and bath. The room is located right on the indoor garden area which can be good or bad if people are sitting and talking right outside your room. We did not have a problem with it. The hotel was full but very quiet. We had a late train to Rome the next day but were able to spend the day in the hotel all day off and on as needed. They allowed us to use the restroom and even have a cigar and cocktail in the enclosed patio area. The location is great and front desk staff very helpful.", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r526351081", "sub_review": {"Value": 4, "Location": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Beautiful, Relaxing Stay", "review": "Dear Sir/Madam,     A great thank you to you about your beautiful comment. We are happy that the hotel and staff met your expectations and made you feel comfortable and satisfied. See you soon!! Kind regards  The Management", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r526018766", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fantastic Hotel", "review": "This hotel is lovely...with calm and serene 'feel-good' sitting areas and patio.  It's location is ideal - close to walk to all the sites.  It is bright and has a very welcoming lobby, with friendly staff.  Beautiful historic building - which lends character to the rooms.  We stayed in Room 2 - and although we did not get to see the other rooms, I'm not sure it would be my first pick...it is close to where the patio is, as well as where breakfast is served, so there is some noise in the room in the mornings.  The room, however, was large and comfortable (for Italy standards!) so we did enjoy that when we walked in.  Delicious breakfast - and made to order cappuccinos made it an ideal place to sit and read a book and unwind.  Even the bar 'officially' closes at 9, the staff were…", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r526013999", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Somewhat disappointing", "review": "Dear Guest, its is great to hear that you had a memorable stay with us and thank you for praising our service. We invest a lot of time in effort to train our team to ensure the highest level of personalized service. All the best and hope to see you soon! warm regards The Management  ", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r525322900", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Quaint and quirky", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r523332953", "sub_review": {"Location": 5, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Peace and serenity !", "review": "Four stars - I'm not totally sure but 3 would be too few.  The breakfast room, sitting room and outside courtyard are quaint and original.  We never got to sit in the courtyard as it was full of smokers - come on hotel get in the real world.  Our room was a mezzanine affair with bedroom upstairs and bathroom downstairs and very old steep creaky stairs to get up and down.  If you don't like mozzies and spiders dropping from the rafters this is not for you.  Bed comfy but décor and walls tired and in need of decoration.  The bedroom window looks directly into other peoples houses - so you are steeped in Italian living.  the air conditioning was not working and it took them 2 days to fix it. Right bang next to the centre so position is 10/10. Breakfast very good.", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r519235954", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Disappointing ", "review": "This hotel is perfect ! Just perfectly located, peaceful and so cosy! We loved the moment we spent! Breakfast was great and very easy to reach by car Also. The patio is a huge place to rest and have breakfast ! ", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r519003812", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Fantastic hotel convenient location", "review": "I was looking for this stay at the J&J as comments read on social media were positive and pictures looked promising. However I was really disappointed, for the following reasons: - really poor a/c in the room and none in the bathroom - quite a nuisance when temperatures exceed 40C outside) - poor wifi - limited choice at the breakfast buffet  - really dirty cushions on the chairs of the breakfast room - poorly equipped bathroom with cheap tiny products - poorly executed shower: no support whatsoever to place your soap, you need to put it on the floor; only a shower head, impossible to shower without wetting your hair  The worse? When the cleaning person forgot her large trash bag in the middle of the room. Pleasant surprise when you arrive...  All in all, not the quality…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r513369230", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Unique hotel", "review": "This hotel was perfect. We had a twin room with terrace and fantastic bathroom. There was a mini fridge in the room which we stocked with our own drinks.  There was a hairdryer in the bathroom. Breakfast was very nice - scrambled eggs and bacon, croissants fruit and lots more. Staff were very polite and couldn't do enough to help. The hotel is ideally placed for site seeing, just 10 minutes from duomo. I have no negative comments about this hotel - it was perfect.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r503773787", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Beautiful", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r501131348", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Quixotic", "review": "Beautiful hotel downtown... they as well offer parking if you have rented a car... the interiors are well kept and very well decorated both in common areas and rooms... very good service ... thanks we will back ", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r498655425", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Beautiful and friendly", "review": "Lovely find in a sweet little neighborhood. Beds are great. Pillows not so much. Staff was extremely helpful but be prepared to climb stairs.  Breakfast is acceptable but local cafes are plentiful.  Don't go expecting the Ritz and you will not be disappointed.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r498464091", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "J&J Visit", "review": "My favourite hotel in Florence. All the rooms are beautifully decorated and are all different. The staff is super friendly and helpful. Nice and quiet location in easy reach of all the sights .Looking forward to coming back soon", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r496383862", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Family wedding", "review": "Just left this lovely hotel. My wife and I have been to Florence 4 times before this visit but never stayed here. When we were meandering around Florence on foot our last trip in we came across the J&J and stepped in to look. We both decided this was where we were staying our next trip in and I'm glad we stayed. We had a top floor suite with balcony which was very spacious and clean. The a/c worked well.  Daily housekeeping was perfect. Breakfast was included and more than generous. Front desk staff friendly and always there to help.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r491949026", "sub_review": {"Value": 4, "Sleep Quality": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Lovely hotel", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r489320851", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "J & J", "review": "We recently spent 5 nights at the J&J and it suited us well as we much prefer to stay in a quiet, peaceful  hotel. The beds were very comfortable, the linen and towels changed regularly, the bathroom was splended. We were in Florence in 30c degrees but the aircon cooled our room comfortably though it wasn't always necessary to have it on as the thick walls and high ceilings of the building kept the temperature down anyway.We loved the layout of the hotel which gave the rooms a private and secluded feel, there's also a little private outside area accessed from our ground floor room but the man eating mosquitoes made being outside a bit risky it still gave an airy feel to the room. Noise from other quests was at a minimum due to the way the rooms are situated.After walking around…", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r484505510", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Weekend break", "review": "Old world charm, set in the cobble stoned streets of Florence. The thought of once a monastery ,  gives it a nosatalgic feel .The rooms are set away from each other down long hallways or up staircases. Very private. Very close to the Duome, shopping and quaint shops.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r482603152", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Interesting building, lovely helpful staff, a few niggles..", "review": "The hotel is a converted convent and suitably quirky, for instance our bathroom was down a small fight of stairs. We loved it where as some reviewers hated it. If you like a friendly clean hotel with good staff and are not concerned about facilities such as gyms etc I would recommend it. Breakfast is a basic but pleasant continental style served in a lovely room with vaulted ceilings with an option to eat outside in a courtyard.  The hotel is a short walk from the main sights and in an area with some very nice restaurants. The street it is on is narrow but seemed safe, once you got used to cyclists and the electric taxis creeping up on you!", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r482151310", "sub_review": {"Value": 3, "Location": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Horrible Experience", "review": "Interesting converted convent building, perhaps best described as 'shabby chic' but we felt was in line with its boutique type description. We liked the slight quirky decor, overall happy with the room, big comfortable bed, lovely linens that were changed regularly throughout our stay. Nice walk in style rustic shower room, surprisingly with English toiletries! Mini bar prices were really good, we were pleasantly surprised.  Best feature was the staff; all we met spoke excellent English, and turned out to be a valuable resource, they were able to book us priority tickets for the major attractions. Fantastic. Which brings me neatly to a few downpoints.  Lack of hotel information in the rooms. There was a folder and a few brochures for local attractions, but not the comprehensive…", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r478984010", "sub_review": {}, "travel_purpose": "", "rating": 1}, {"title": "Tourism in Florence during Easter 2017", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r476766483", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Hotel close to Duomo", "review": "Good hotel, well situated near the historical center of Florence. Room 14. Quite large with a private terrace. Comfortable bed. Very spacious bathroom with all the commodities. Breakfast and cocktail (in the evening) complete and good. Negative points : the room lacks of lights and plugs (to reload the smartphones for example). Not so pleasant to shave oneself in the bathroom... Furthermore, there were ants in the room (Watch the biscuits or food you buy if you don't want bad surprises)... At last, some problem of insonorisation, but we had the chance to have neighbours that slept quite soon at night.", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r473102897", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Just OK Hotel not 4 *", "review": "The room was nice and the overall look of the hotel was vey nice. Good breakfast with good coffee. On the other hand I didn't have the best experience at the hotel. There was construction workers 2 meters away from my window working on the roof which started at 7:50am (which the hotel did not warn me about this). It was very unpleasant. They claimed they didn't know but i know by law that they would have. Secondly my room was not cleaned the second day i was there. Apparently when you leave the hotel you must leave your key at reception. Which they did not specify to me. I wouldn't stay again because of this experience but I'm sure others have had a difference.", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r469483144", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 2}, {"title": "Fabulous stay in florence - ideal location and hotel", "review": "Stayed here for 3 nights, staff really nice and helpful. Area safe and close to shops, bars & restaurants.  We stayed in Junior Suite Split Level, bed comfy with good quality linen. A real pain having to go down stairs to use loo in the middle of the night but that's not a big deal. Room is dull and sofa uncomfortable. Nice bathroom with great rain shower but the toilet is the most uncomfortable loo we have ever come across - it is half the width of a normal one and about 4 inches higher so you legs dangle and unless you have a very pert bottom, most of it will sit outside the toilet. We found the most comfortable way to use it was to sit facing the cistern as opposed to back to the cistern - it really was that bad ! I'm sure there are much nicer places in the Beautiful City of…", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r468863090", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Pleasant stay", "review": "We were thrilled with this small boutique hotel - converted Convent, with all the original features just beautiful.  The location was superb,just far enough from Duomo but easy to walk in every day. The rooms are lovely and all very different. We went for some amazing meals that the reception recommended each night, some local to the hotel some on the walk into the City - all fabulous.  the first night we went to the restaurant 3-4 doors up and the beef speciality was amazing.  Napolitano in a square towards city was great as was Gionva (there are two in the same street) i would advise always booking ahead as they were always busy. We booked the Tour cycle round Florence which was fab, and cycled up the hill to the Palace, was beautiful and we preferred to the walking tours.…", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r468380875", "sub_review": {"Location": 2, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Charming Hotel", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r461609569", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Charming Hotel", "review": "A nice Historic Hotel located near all what you want to see in Florence. The Room was clean and the Personal friendly. The Bathroom we think needs a renovation. Breakfast and Service was as we wanted it.", "date": "January 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r454429792", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely boutique hotel in centre", "review": "A former convent retaining many original features.  Set in a quiet location just five minutes walk from the Duomo.  We were upgraded to a suite which was very spacious.  Comfy bed, good quality linens and excellent staff.  Breakfast was plentiful with cold meats, cheese, fruit, yogurt, fresh bread and scrambled eggs. Would recommend the hotel.", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r449900571", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Disappointing", "review": "Very charming little hotel in the centre, 10 min walk to main square and ponte vecchio. Staff was friendly and room spacious, with overlooking mezzanine. Room was also a depandance in the internal courtyard. Very pretty! Definitely worth staying again. ", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r441159055", "sub_review": {"Value": 3, "Cleanliness": 2, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Updated Convent", "review": "Room (19...) was nothing short of fantastic but the smell of cigarette was everywhere, which was disappointing, especially since I always ask for a non smoking room.  Even though I asked if it would be possible to take care or reduce the problem, nothing was really done unfortunately. On the good side, the breakfast and the restaurant space were great and I couldn't have been more satisfied with the food and the atmosphere. The location in the center of Florence was also one of the high notes. Finally all the people (almost) at the hotel were extremely pleasant but I have to mention one instance that bothered me: I went back to the hotel at 1am with my daughter and one of her friend who needed a taxi; my daughter went inside to ask the night person who refused to call and…", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r426904100", "sub_review": {"Value": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Perfect place to stay in old town Firenze", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r426414971", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "What a find....", "review": "Wonderful location, very helpful staff, delicious breakfast.  Fun to have a bar on sight.  Only downside was the stairs though the bell person was always ready to accommodate us. Laura at reception was especially helpful, printing our boarding passes, suggesting restaurants, arranging tours, ", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r425870258", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "awesome boutique hotel", "review": "Besides being a wonderful hotel it is the staff that makes a difference ... everyone from the front desk to the bus boys could not do enough to make our stay outstanding.  This is a converted convent, but you would never know it.  Clean and modern, with a wonderful morning buffet.  Well located.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r423809742", "sub_review": {"Location": 4, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely old hotel", "review": "Awsome hotel, went to florence for a couple of days, close to everything...amazing room, good service, delicious breakfast, can't complain about anything, the staff seems to really care about the customers....", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r421654586", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Positive experience at J&J Hotel September 2016", "review": "I loved this hotel.  The location was central.  Very walkable to sites and restaurants..  We had a room in what must have been an old coach house.  The room had two floors joined by an old stone, winding staircase.  The hotel had a lovely terrace which was located outside our room.    I loved the place!", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r421445968", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "What a gem", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r420836201", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "great trip", "review": "My partner and I stayed here on our trip to Florence and we couldn't say a bad thing about this place. The location is unbeatable,it's so close to the Duomo and they even provide bicycles to explore the city, aside from the cobble stones it is the best way to get about!  The staff were friendly and always happy to help and our room was so unique and beautiful.  The hotel has so much character! This hotel is a must when visiting Florence. Highly recommend! ", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r419855110", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Small hotel on walking distance of the highlights of Florence", "review": "This was my favorite hotel we stayed at! It was in the perfect location for walking everywhere! Our room was so nice and big! We had 2 bathrooms, plenty of space and the air conditioning was so cold! Loved our room at the top of the stairs! One of the coolest hotels ever! Would definitely stay there again!", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r418901115", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Charming and intimate stay in this special boutique Hotel", "review": "Nice and good location and pretty room but no personal touch in service.  Would be nice if the reception of the hotel welcomes you !  The hotel has all the possibilities to upgrade the atmosphere! More eye for detail is necessary ! ", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r418465509", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nice luxury stay", "review": "Service was excellent in this convivial place. Very quiet time a night and very comfortable bed to recover from a long day working in Firenze.  This historic hotel has a lot of cache.  I recommend highly your stay there!", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r416167532", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Disaster. Booked 4 nights but checked out next day.", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r406155768", "sub_review": {"Location": 4, "Rooms": 1, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Great spot, glorious rooms, fabulous stay", "review": "Visited the hotel on August 9th, 2016. This is a maximum 1 star hotel although it is advertised as a 4 star hotel. They justify the poor condition of the hotel and furniture saying that it is \"old and historic\". So is the rest of Florence and Europe so don't fall for that.  The staff is very willing and tries hard to please but it very transparent that they are not professionals. They are willing but not very capable. At breakfast they came in their street clothes and delivered the pastries to the breakfast area that they purchased from some supplier. They run around like the hotel is a gym. Also at breakfast they start doing the dishes at the bar - manual washing, no dishwasher - that is right in the breakfast area, so you have your breakfast in the rumble noises of dish…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r402895026", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Could be nice", "review": "Our room was a Quad suite accommodating 2 kids and 2 adults.   It was perfect, and huge! The hotel was close to everything, the staff were overly accommodating and we couldn't have asked for a better place to stay.  We stayed for 2 nights. Loved the layout and the design.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r400272909", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Worst hotel I've ever stayed in", "review": "This could be a wonderful hotel if.. Breakfast was calm and serene, personnel was very noisy, I wonder if they need to change plates , glasses and cutlery every month. The room was great, but it was damp and had a strong cellar smell.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r399593840", "sub_review": {"Value": 1, "Sleep Quality": 1, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Quaint, elegant, quiet", "review": "Arrived late at night. No sleep all night due to the A/C in the room which sounded like a diesel train and could not be turned off. The room wasn't very clean, there was dust on top of mirrors, furniture, etc, and no wardrobe or anywhere else to hang clothes. The beds were small (anyone over 5 feet tall would have trouble), had no headboards, and oldish, itchy blankets. The mini-bar was a cool box. The following morning we were a few minutes late for breakfast but could not even get coffee, unless we paid extra.  Staff could not fix the A/C. Even when it was turned off it continued to operate. We covered it with pillows and blankets in an attempt to drown out the noise over the whole four days. Opening the small window wasn't an option either as the area right outside (we were…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r399240310", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Beautiful and elegant hotel in the center of Florence", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r398212652", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Charming hotel full of character", "review": "We felt really happy about this little gem that we found on Internet. The hotel is classic, elegant, cosy... everything was perfect for our honeymoon. The personal was really nice and profesional. We will go back soon.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r395888429", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Wonderful Boutique Hotel!", "review": "Fantastic quiet location just a short walk from the city centre. Our room was large and overlooked the courtyard. Breakfast was nice and the staff were very friendly and helpful.There were a few steps to our room which was not a problem for us at all.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r393177069", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Charming and cosy hotel", "review": "J and J was a wonderful hotel in Florence.  The location is great - it's a walk to many of the sights in Florence.  The breakfast is in a beautiful room and courtyard.  The service was wonderful and the room was very nice.  There are only 23 rooms each one is different.  Ours had a circular stairway to a small second floor balcony.  It was room 1 and it was right off of the courtyard.  I would definitely recommend J and J!", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r392982921", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Quaint hotel in Florence", "review": "The J&J is a charming and cosy hotel which was founded as a 16th century monastery and you can still imagine the scenery as a lot is decoratively preserved. The staff is not only friendly, but focussed on customers and not only wants you to have a unique and pleasant experience, they actually pratice what they preach.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r391409039", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good hotel in good location ", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r390868388", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Beautiful hotel - fabulous location!", "review": "Stayed for 2 nights  Good hotel in good location close to everything  Rooms were a good size and nice and clean  Breakfast was nice but staff always made you feel uncomfortable as they were always running around trying to reset tables and make coffee clearly they need more staff to take the pressure off  The only let down was the reception staff  they never went out of there way to make you feel welcome ,it always felt you were putting them out . They couldn't even be bothered to say goodbye or even ask if we enjoyed our stay  The staff can make all the difference to a great and memorable stay  Such a shame as its a really nice hotel   ", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r388572563", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great B&B", "review": "We loved our stay at the J and J.  The staff was very helpful, the rooms were beautiful and huge!  They have a lovely courtyard where we enjoyed breakfast and cocktails in the evening.  Breakfast was included in our room but was very disappointing.    This location was perfect.  An easy walk to all attractions and lots of great restaurants.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r386155629", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Nice interior but that's it", "review": "Dear Sir/Madam,                     Thank you very much for staying with us and we look forward to welcoming you next time.  Kind regards", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r386079608", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Great place to stay in a good location with friendly staff", "review": "Loved the J & J! Beautiful rooms, clean, fantastic continental breakfast and friendly & helpful staff. Great location. WOuld have loved to spend a few more days in FLorence. We would definitely stay here again!", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r385219107", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Just as wonderful 20 years later", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r384387452", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "J & J Historic House", "review": "20 years ago a friend in the travel industry recommended this hotel.  My husband and I were completely charmed and returned this summer with our teenage daughters.  We were not disappointed.  The staff is warm, welcoming and helpful.  The location is very convenient and our room- though different- was unique and put us fully into the ambience of Florence.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r383490073", "sub_review": {"Location": 4, "Sleep Quality": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "ABSOLUTELY BEAUTIFUL, LUXURIOUS HOTEL BUT........", "review": "J & J Historic House is a nice location in a quiet area, walking distance to Duomo, museums and most sites. Breakfast is very nice option rolls, meats, cheese fresh juices, including one hot item such as eggs, in an airly shared space. First room was on the first floor quiet and cool but had noisy upstairs guests, asked to move but could not accommodate until the 3rd night of 4 night stay.  Moved to the second room # 7 upstairs, very warm and you have to open windows for cooling air, but had no screens on windows, and we gotten eaten by mosquitoes. Window covering let in lots of lights.  Both rooms had nice big bathrooms.  Staff was lovely. Recommend screens or turn on the A/C.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r383117673", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Perfect stay in every way", "review": "I sincerely wish I could give this Hotel an EXCELLENT rating !!! The hotel was beautiful and very clean and the bed was soooo comfortable !!! The breakfast buffet was delicious however they NEED to keep their scrambled eggs warm-- 3 of the 4 days we spent here the eggs were room temperature to COLD  ( Not a good thing !!). My complaint with this beautiful hotel was the front desk staff--- they could really use a more friendly, customer oriented staff.... I really hate saying this as the staff brought down this hotel . The biggest complaint I have is that the hotel would not accept a large banknote we wanted to use to pay our hotel bill--- we gave them 2 -  500 Euro Bank notes to pay for our 845 Euro bill and the girl at the front desk said she didn't have the change ( 155Euro) …", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r382695996", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "everything we wished for", "review": "The J & J Hotel is perfectly positioned for visiting the central attractions in Florence - Il Duomo, Ponte Vecchio, Palazzo Pitti - they are all within 10 - 15 mins walk through the beautiful streets of this fabulous city. The staff can't do enough for you and the rooms are magnificent, each having it's own quirky lay out but not taking anything away from the wonderful architecture and original features of this old converted convent. You will find a lovely cool and tranquil courtyard in the centre of the building where you can sit and relax with a cold glass of vino whilst taking in the atmosphere which is steeped in history. I would totally recommend this hotel, and even if it is in quite a central position it is very calm and quite. My thanks to all the staff for making our…", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r381055155", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "The Best Hotel in Florence", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r380512255", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great small neighborhood hotel", "review": "The J & J Hotel is managed by charming, friendly, accommodating staff and is decorated with the upmost style and rustic elegance. A courtyard and luscious green garden with hydrangeas in decadent pots waits for you after a walk or bike ride around the best parts of the city. The hotel will lend you bikes with a basket on the front to carry your bag and any shopping you pick up along the way. Incredibly interior decorated suites that make you feel like a movie star in an old Italian film - quiet; away from main roads yet a central location perfect for sightseeing and strolling in the stunning, ancient stone streets of Florence. Take a wonderful breakfast of fresh juices, coffee, teas, cereals and hot foods in the beautiful dining room or in the courtyard with the sound of Italian…", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r379716333", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Romantic olde worlde hotel", "review": "We enjoyed our stay at the J&J.  I loved the shabby chic décor, and the staff was very nice.  The breakfast provided lots of choices.  There were many good restaurants within a short walk, and it was close to the leather shops and to the Duomo and other attractions.  The price was very reasonable for a nice hotel.", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r378895171", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Amazing Oasis", "review": "Florence was midway in our 3 week Italian holiday and we arrived for just the one night (cos i couldn't extend our Airbnb booking in Florence for an additional night) right on my husband's birthday.  Like most renovated old Italian buildings, the room you get will be very individual.  Reception area was like being in a stylish Italian house living room with vaulted ceilings. Helpful bellman hauled our heavy baggage up one flight of stairs.  The bedroom had a four poster bed, very clean, one small window (sufficient - no view), and a quirky staircase leading down from our bedroom internally into a rather dark but stylish bathroom.  Very comfortable bed and next morning had good very relaxed breakfast in inner courtyard on beautiful day - very romantic and classically Italian…", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r374645542", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "J & J historical hotel", "review": "Warm and welcoming staff upon arrival.  The boutique hotel that is a historic monastery is absolutely beautiful!  There is a lovely courtyard and the spread for breakfast was delicious and well presented.  Location is perfect!", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r373932615", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Quiet and central location", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r372983050", "sub_review": {"Location": 4, "Sleep Quality": 3, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "A good place to stay with reasonable price", "review": "Old and charming building, which also means that there is no lift and that the rooms are different in size and layout. Ours faced an inner courtyard (of the neighbouring house).The room itself was average, but the true gem of the hotel was the inner courtyard where You could unwind after a busy day with a drink, or even have Your breakfast. Great location with most sites within walking distance and plenty of restaurants nearby. Very friendly and versatile staff !", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r372048605", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Very charming with character", "review": "Dear Sir/Madam,            Thank you very much.  Kind regards The Management", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r371762715", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Beautiful hotel", "review": "This hôtel is very well located in a quiet street less than 1km from main touristiques places. The rooms are ok and thé service issus friendly.  The hôtel does  not have restaurant or room service. Therefore à good place to stay for an ok price", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r371014377", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Beautiful Hotel in a great location", "review": "Very charming with a lot of character in very quite area but at only 5 minutes walking distance of every most important site. Very comfortable room but in my point of view some issues with isolation. A perfect breakfast with a lot of choices. ", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r369807823", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "A Perfectly Lovely and Quiet Place ~", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r368734803", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Perfect location", "review": "When planning a trip to Florence, my daughter suggested the J&J as it is in close proximity to her apartment.  The location was perfect and we enjoyed the boutique hotel - a former convent, situated on a very quiet, but safe, side street.  We especially enjoyed the breakfast - served in a nicely decorated and comfortable set of rooms (dining and patio) just off the lobby - and were pleased with our rooms. (we stayed on two different weekends)  We were able to easily walk to all the areas of Florence we were interested in - both sites and shopping. Also worth mentioning is the fact the J& J hosts many interesting travelers - most English speaking - from Europe and the US - and everyone was friendly.  The Staff - including everyone from the front desk personnel to the breakfast…", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r366808792", "sub_review": {"Sleep Quality": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A little slice of peaceful Florence", "review": "The location of this hotel is perfect, you have in principle everything within walking distance.  Common areas very nice, feels like a home with a patio.  Our room (number 15) was the only disappointment. We had booked a deluxe room and it was OK in size but quite dark and unfriendly.  Very good and service mixed staff.", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r365387720", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely hotel", "review": "My wife and I needed a place to stay for 1 night in Florence before heading back to the states.  The J and J was great!  Large comfortable bed, large clean modern bathroom. Being 6'5\" tall and 280 lbs. I do not fit in most Italian bathrooms.  We loved the breakfast in the sitting area and courtyard. The staff was very attentive to anything my wife and I needed.  Florence is very hectic and busy.  The J and J was a beautiful and relaxing slice of Florence.", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r363626878", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Well looked after", "review": "We stayed in the J and J for 4 nights. Excellent location within easy walking distance to all the major sights. We were in a deluxe room, number 11 on the ground floor which was huge. The hotel is in a converted convent and is so peaceful and quiet. All the staff were very accommodating and really helpful. Excellent breakfast selection. Would highly recommend. 5*s ", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r362497278", "sub_review": {"Sleep Quality": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A wonderful stay in Florence", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r360832853", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Smart but cosy boutique hotel", "review": "Excellent Location - friendly efficient service - outstanding breakfast - could have had a better location for exploring the wonderful city that is Florence Easy working distance to the heart of the city - in a quiet street with little traffic", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r358070562", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Only ok. ", "review": "This hotel is well located close to restaurants and main sites.  But quiet!  Staff are very friendly, the decor is charming ....... It is in a former 16th century convent.  Excellent breakfast and lovely courtyard. We would certainly stay there again.", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r357723711", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Family holiday with my daughters", "review": "Located close to the heart of Firenze. A small but charming hotel. Unfortunately not a big fan of the stairs, very steep, relatively hard to reach our room on the 2nd floor with a baby. When we called to get room service at night around 8pm (for tea and milk) they said \"you have to come and get it yourself because we have no staff to deliver it\", so note to self get stuff you need before you go to your rooms. But mind you the staffs were very accommodating when they are around. The breakfast was ok could have been better -they could make changes to freshen things us every couple of days (we stayed there for 5 days). Our stay was ok, not enough to make us comeback. PS: don't bring car, the parking fees will choke you! ", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r357482902", "sub_review": {}, "travel_purpose": "", "rating": 1}, {"title": "Charming, Historic and Convenient", "review": "Booked the hotel via Very Chic as I have used them frequently over the last 2 years an they have never seize to amaze me with their picks. However The J&J Hotel is extremely misleading. I booked the hotel for its charm an the pictures on the website are very far removed from the reality. The hotel is not 4 stars, I would put it into 2 stars. The beds are sinking in the middle, walls peeling, and there's absolutely nothing charming about this place sadly.   It would appear after speaking to the reception that the rooms advertised reflects 2 of their delux suites the balance of the rooms are below par. If you looking for a romantic get away stay far away from this hotel. Would I recommend it to anyone else? Definitely not and sadly a huge disappointment ", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r356860737", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nice hotel in Florence", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r354154267", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Incredible boutique hotel in florence", "review": "The hotel was nice, close to all of the major sites in Florence.  The staff is really helpful.  The breakfast had a lot of variety and was quite good.  The room was comfortable and there was a nice selection of pillows", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r353570038", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Charming and tasteful", "review": "Our friends recommended this place for us and we can see why! We had booked a junior suite but for upgraded to the most beautiful suite I've ever stayed in. The hotel is authentic and exactly what I'd hoped for style wise, it's so elegant. The staff are great, breakfast is lovely and the location is perfect for walking everywhere. We cannot wait to come back!!! ", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r353506177", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Uncomfortable room, no elevator, poor service", "review": "This small charming hotel in a 16th century house is very tastefully furnished and extremely comfortable. No elevators but the beautiful authentic stone stairway will take you into another century. You'll feel you own a home in Florence. Want the real Italian food experience? We highly recommend the restaurant Acquacotta round the corner.", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r350469188", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "J and J was Molto Bene!!", "review": "We were surprised by how poor our stay was at Hotel J and J. There is no elevator, and the stairs up to our room were narrow and steep. The room itself was poorly lit, could barely connect to wifi, and uncomfortable. The bathroom, although it was nicely designed, was down a small flight of stairs from the bedroom, making things even more uncomfortable. The service was not good. There were loud noises right outside our room in the middle of the night. We called reception 3 times to see what it was, and nobody answered. Would not recommend.", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r350065730", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Wonderful stay", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "January 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r344299581", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "One not to miss", "review": "We stayed for three nights and were very comfortable.  This is a small and unique hotel in a 16th century house an easy walking distance to the centre and sites of Florence. The hotel staff are friendly, welcoming and very helpful in regard to recommending restaurants etc.  A really good buffet breakfast is available each morning. You are alsooffered a welcome drink on arrival. ", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r344139141", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Nice bedrooms and breakfast space", "review": "It is hard for me to share how wonderful this hotel is. The employees were so friendly and helpful. The breakfast buffet is incredible.  I will stay here in a heartbeat next time I am in Florence. The location is one of the best. The rooms are all different and I did have one room that had a very long staircase but I found that room one of my favorites. Please advise at booking if you have a problem with many steps. I sure did - 5 stars! PS - I am a travel agent so I have been to a few places to compare  Enjoy!", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r343124383", "sub_review": {"Location": 4, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "The definitive boutique hotel", "review": "If you enjoy European style elegance, thick walls, and character, you'll like this hotel. If, however, you're looking for huge rooms with modern furniture, this is not for you. We very much enjoyed our deluxe room, spread over 2 floors; felt like a small Florence apartment. The breakfast area is lovely and well curated, offering an assortment of italian style as well as continental breakfast items. Very good deal for Florence, where it's so easy to be disappointed.", "date": "January 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r342473942", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Unique and wonderful.", "review": "We enjoyed 5 nights at the J&J staying in one of the top floor suites.  A very large room and plenty of space.  The staff were courteous and helpful.  The breakfast room was a delight as was the lounge.  The breakfast fare catered for a wide variety from an uncluttered buffet table.    Getting around was easy with good local dining choices and an easy stroll to the main attractions.   We'd definitely return!", "date": "January 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r342419549", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Sweet hotel", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r340438448", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Friendly staff and convenient location ", "review": "The rooms were really sweet, and the breakfast good, although the hotel is located down not the best back alley. We stayed in one of the suites which was absolutely huge and had our own nice balcony where we could look out over the rooftops of florence.", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r330280041", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great November Weekend", "review": "Hotel has a friendly staff. Located just 10 mins walk from the Duomo. All the main attractions are nearby only. Breakfast was nice.  Room was not that big and a small bed too .   I would recommend this hotel as it's location is very convenient.", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r329787818", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great hotel!", "review": "Perfect location, less than 10 minutes away from the Cathedral. With safe parking across the street. Beautiful room in an wonderful old house/palazzo. Great service, great pricing, great breakfast. So close to the center of town, and yet so quiet and intimate! Don't forget to go to the market at Saint Ambrogio before breakfast - just 5 Minutes away!", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r329176522", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "The Most Amazing People work here and the location is Perfect!", "review": "The hotel was in great location, the staff was very friendly & helpful, their recommendations for restaurants were great :)... plus they were so thoughtful to upgrade us to a suit room because of my husbands 35th birthday :). the hotel decoration was amazing, it has a character!", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r323613440", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Florence visit", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r323385411", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Delightful hotel", "review": "My wife and I stayed at Hotel J&J. We found it a very pleasant and charming hotel, well appointed, conveniently situated on a side street near the centre of the city, with welcoming and helpful staff. A slight feeling of shabby chic which we liked.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r322759362", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Potential to be wonderful, but important details missing", "review": "We had a wonderful stay at this delightful hotel. Close to all the attractions but far enough away to feel we were in a peaceful area. Lovely spacious room which was only used as a base as most of the time we were exploring Florence. It was a unique hotel with helpful staff. Breakfast was great with plenty on offer. ", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r321384718", "sub_review": {"Location": 3, "Rooms": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Short Breaks", "review": "I was looking at hotels through Expedia and found J and J. The price seemed reasonable, but something happened and a page came up suggesting staying for less and I accidentally agreed to a non refundable reservation when I thought I had clicked on the refundable one.  I immediately called Expedia once I got the confirmation, which in turn tried to contact the hotel at that exact moment and several others over the the course of 3 days, to rectify the situation and revert the reservation to refundable, or just cancel it. However, for the first 2 days, nobody was available to take the call, or Expedia emails. On the third day, the manager responded, but was adamant in not changing it, no matter what we told him. He did upgrade us to a suite, without extra cost, mostly because there…", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r319489816", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Exclusive with a twist...", "review": "The staff has provided a very good and friendly service. We stayed in the junior suite and the room was spacious. The hotel is situated in a quiet street and is about 10 minutes walk to the  main tourist site and eating places. We will return to stay in the hotel again.", "date": "February 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r319097760", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Great value for money", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r318582083", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Beautiful room", "review": "Having just come back from Florence this past weekend, I definitely recommend the J and J hotel.  I've visited Florence twice before, and found that Hotels can be a little unreliable. Despite often paying above the odds, hotels are often a little disappointing in terms of the rooms they offer. J and J is definitely the exception in this instance.   We booked the Junior Suite, with the room being great value for money, and a very comfortable stay.  On previous visits, I have chosen to stay very close to the centre of town near the Duomo, however with the extra few minutes walk to the J and J, you benefit from a better room at the same price.  ", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r317068438", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great luxury suite, great stay", "review": "This hotel is in a great location and is boutique style accommodation.  I believe the hotel is a converted convent.  The rooms are beautifully appointed and the bathroom is lovely.  Loads of marble and an enormous bath.  Staff are friendly but not obvious.  Breakfast is buffet in a beautiful room overlooking courtyard.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r317013050", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A small truly individual hotel with excellent service.", "review": "We spent 2 nights in this splendid hotel in Firenze city center. We were so lucky to find the suite in promotion so we could enjoy a really nice vacation. The breakfast is delicious and the staff is super friendly and pretty. definitely recommended!", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r315582100", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Wonder Hotel with Great Location", "review": "A small truly individual hotel with excellent service in a quiet area within walking distance of all the sights and restauraunts. We first stayed here in 1999 and this was our first return visit, so it was good to find it was still here and had hardly changed. Very friendly, will come back whenever we return to Florence.       ", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r314389677", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Charming Hotel in a quiet but convenient location", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r313399463", "sub_review": {"Value": 4, "Cleanliness": 3, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Visit to Florence ", "review": "The best part of this hotel is its location.  It is within walking distance of the Duomo, the Uffizi, the Accademia, Santa Croce, and many good restaurants, but it is on a quiet street away from the big hotels and most tourists.  The ceilings are high and the rooms are spacious, although our bathroom, particularly our shower, was tiny.  Service was friendly and very helpful.  Breakfast was good and was served in a beautiful, peaceful room.  My only complaints are (1) internet service was extremely slow and (2) our sheets were never changed, even though we stayed for over a week.  (We know because one of us accidentally made a pen mark on the second day.)  If you're looking for an atmospheric hotel in an excellent location, this is the hotel for you.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r312560648", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Discrete & Delightful", "review": "An absolute beauty of a hotel,my compliments to the owners for retaining the charm and character of the building.   services were delightful and we were very happy with the front office lady Laura, who was very charming and was always smiling and ready to help.   Excellent experience.   Thanks.  Sumant Tivary ", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r311625581", "sub_review": {"Sleep Quality": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Aristocratic", "review": "Tucked away yet close to the city centre this hotel is a real 'find'. We were so glad of the coolness of our very large room to return to after a day's sightseeing. The staff were all very friendly. All the basics worked well but it needs some redecorating both in public areas and in our bathroom. It is quaint and comfy though.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r310672664", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Quaint and convinent", "review": "Been here for vacations.Exellent location near the center of the town which can be reached by foot.Beautiful building.Undescribable decoration placing you in another époque.The deluxe room we booked was so pretty just couldn't get enough of if.The bathroom was clean and actually I have never seen such a beautiful decoration style.Everybody in the hotel(staff) were so helpful,so kind and very polite.I would definitely stay there again.And the breakfast room is very nice with nice little tables.The breakfast buffet good enough,had fresh fruits and many other goodies.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r307901713", "sub_review": {"Value": 4, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great location, great atmosphere", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r307479347", "sub_review": {"Value": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "special place, with improvements needed", "review": "This hotel is tucked away from the large crowds but close enough to get to the major attractions with a short walk, it is on a quiet street. The hotel entrance and sitting area is well presented and a tranquil place to sit. We were upgraded to a suite, and everything in the room was well presented.  You have to climb steep stairs to  mezzanine bed and side room; they were too steep.The bed needed replacing, we were both rolling to the centre of the bed throughout the night. The bathroom and sitting area was downstairs; there was no tea/coffee making facilities, but the bar person was happy to make anytime. The bathroom was spacious but one thing that challenged us was the shower water could not be contained and splashed items stored under the sink. Breakfast was adequate. Coffee…", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r304041139", "sub_review": {"Location": 4, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Florence Hotel", "review": "This is a charming hotel, situated in the central area, within walking distance from the main attractions.  Everything looks old style, very nice. Internet is weak, almost non-existent. Breakfast is good, not with many options, but with good quality products. The staff is very attentive and willing to help. There are good toiletries, bathroom looks fine but needs adjustments (water from shower spills on the floor, there is no proper place for drying towels.", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r300740517", "sub_review": {"Value": 3, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Gorgeous little place - Amazing value", "review": "Nice small hotel, right in the heart of the city.  We really enjoyed our stay here.  The room was not that large and it wasnt very modern by USA standards, but it felt just right for Florence.  The staff gets an A+ from us.  The patio was very nice for breakfast or for a glass of wine after a long day of travel.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r293322962", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Excellent hotel in city center", "review": "Dear Sir,            Thank you very much for staying with us and for your kind review. We are delighted to note that you had a pleasant stay and we look forward to welcoming you back next time.  Kind regards The Management", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r292881938", "sub_review": {"Location": 4, "Rooms": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Charming hotel", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r287012035", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Quiet, Romantic Boutique", "review": "The J and J feels like a hidden gem.  It is decorated very tastefully, has an old charm to it but comfortable at the same time.  Every staff member was pleasant and happy to help everyone. We were in a large room because we had our children with us and it was really nice.  All I kept thinking about was how peaceful and romantic the hotel would be if it were just the two of us.  The bar was small and quaint and the breakfast was simple but well attended by the barista. The wifi in the room was not the best but it is an old building with thick walls. One warning is the stairs are steep and there is no elevator, however, it made it feel that more authentic to me.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r283019751", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Quiet and tasteful hotel", "review": "Dear Sir/Madam, We thank you very much for your feedback and we look forward to welcoming you next time.  Kind regards  The Management", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r281077690", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Perfect", "review": "My wife and I stayed here for a friend's wedding.  Most of the guests stayed at fancier hotels in town, but we really enjoyed this place.  The service is nice and attentive, albeit that of a small hotel with limited staff.  That was fine by us as we were not expecting all the fuss.  The location is great to explore your way around town.  The rooms are all different and we stayed in a lovely junior sweet with very comfortable living area, bed and bath.", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r278927771", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Not Impressed", "review": "Dear Sir/Madam, We thank you very much and we look forward to welcoming you next time.  Kind regards  The Management", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r277511999", "sub_review": {"Value": 2, "Cleanliness": 3, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Wonderful Hotel", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r275777578", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Adequate Hotel", "review": "Stayed in the beautiful J & J Hotel for four nights last week. Hotel was everything we expected. Beautiful period building. Room was tastefully decorated & had everything we required. Staff were friendly & helpful. The breakfast was fantastic from the lovely fresh fruit to an arrangement of breads,cheese & pasteries & fantastic coffee. Thank you for making our stay special & memorable. ", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r272680137", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Amazing one-off, characterful, boutique hotel.  Kind Staff", "review": "Dear Sir/Madam, Thank you very much for consideration and look forward to welcoming you in the future. Kind regards  The Management", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r270742543", "sub_review": {"Location": 4, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Vacation of a lifetime ", "review": "We found this hotel to be close enough to all the sites that were on our list of things to do. The rooms are clean but very bare. The bathroom was clean, but the shower had its challenges. Breakfast was enough, but would have liked to see some fresh vegetables, fresh buns and perhaps some fresh cut up fruit. The staff were very helpful.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r269594495", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Not the best but not the worst", "review": "Dear Sir/Madam, Thank you very much for choosing our hotel and that you as well for your point of view about the breakfast which has been taken into consideration.  Regards  The Management", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r266964822", "sub_review": {"Value": 3, "Rooms": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Worth visiting", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r263545664", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Different but not necessarily good!", "review": "This hotel is a four star hotel, and it shows! The staff were very attentive, the room was kitted out really well, and we enjoyed our short city break here immensely. I would love to come back again. The breakfast was of the continental style, they did have bacon and eggs, but it would be best to try this at the start of breakfast rather than an hour later. Very cosmopolitan clientele here.", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r261684442", "sub_review": {"Location": 5, "Rooms": 2, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Is it a 4star hotel ?", "review": "We thank you very much. Kind regards  The Management", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r259775553", "sub_review": {"Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "It Could Have Been Great !", "review": "This hotel is well located allowing for an easy walk to all the attractions of Florence. The staff were friendly and helpful. The rooms are all different and our room had two floors and was very spacious.  The bathroom was good and the water hot.  The bed was comfortable. However the rooms could do with refurbishment as they are a bit tired looking. Another big problem is that many of the rooms are located around an outside courtyard, our door opened on to it.  It is a pretty courtyard and a nice idea but, unless you go to bed in the early hours of the morning, sleep is not going to be an option as people obviously and understandably gather in the courtyard for social drinks and a chat etc - it was noisy even in March.  We had to keep the window closed and as the air…", "date": "February 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r255417415", "sub_review": {"Value": 2, "Rooms": 2, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Worth considering if you can get a deal.", "review": "The hotel is nicely located close to the Duomo and a 15 to 20 min walk from the trainstation. It is in a calm street and I've read that some people say it is in a bad neighbourhood but we didn't have any problems at all. The people at the reception were very friendly and helpfull. When we got our room we were dissapointed. It was room N° 1 on the groundfloor . Dirty carpet, just a shower (with a little sittingtub), a mezzanine you could get to by a spiral staircase and here you had a sofa and a warddrobe. A bit strange because it would have been difficult to get your suitcase upstairs.  Well we just wanted to wait and see. When we went to sleep we heard a really loud noise next to us. There was some kind of engineroom. We just couldn't get any sleep at all. So we phoned the…", "date": "December 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r252140457", "sub_review": {"Value": 3, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "A real surprise", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r250837559", "sub_review": {"Value": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "just enough", "review": "really didn't know what to expect (birthday surprise for my better half) but I will sum up by asking, how many hotels have you stayed in? Followed by how many do you remember? Trust me you wont forget your stay here. Yes its in need of a bit of a spruce up and yes its a bit tired but trust me the whole is so much better than the sum of its parts. Staff were wonderful. Nothing too much trouble. Please don't get me wrong in this day and age wifi (which we found fine in our room) is important but pales once you walk out of the hotel turn left and enjoy what is a wonderful city. I will be back. Hint Turn right (cant remember the name) and the restaurant on the corner will deliver a meal that you will talk about for ages. Ask at the reception. Must go as im salivating over my…", "date": "November 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r248806430", "sub_review": {"Value": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Weekend break away", "review": "It is a small boutique hotel, charactiristic for Florence, another has-been property. I was there the first time 10 years ago, all in all the 10 years are showing. Service is friendly but unprofessional, good willing , hard working but untrained staff. Breakfast buffet is not good , the orange \"drink \" nothing to do with orange juice. The coffee, disappointing for Italy. Let's say it is just passable. The rooms, I had a junior suite, very spacious, high ceilings. The hotel setting an old, obviously much too old palazio. The area is a dirty back street , just 10 minutes walk to the center. Not worth a special effort to get there, but not really too disappointing either. I won't recommend it, because most people will find fault with it, different faults. For myself, I won't book…", "date": "November 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r239769341", "sub_review": {"Value": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Style over substance", "review": ". For my boyfriend birthday I decided to treat him to this beautiful city for 3 nights at the beginning of November and our first ever trip to Florence. My overall impression we were left with was that it was rather a very beautiful and romantic short break away. It is in a amazing location with some very nice bars and restaurants locally. We received an upgrade as requested by myself due to it being my boyfriend birthday which was a very nice touch from the hotel at arrival. The room was very big and welcoming which was very nice. I was very happy with it. The staff were wonderful, helpful and friendly. Totally recommend this hotel, peaceful and charming. Also brilliantly positioned a 10 minute walk from the heart of Florence and not far from the station.  I would come again.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r226199768", "sub_review": {"Value": 3, "Location": 4, "Rooms": 3, "Cleanliness": 2, "Service": 3}, "travel_purpose": "", "rating": 3}, {"title": "Romantic & Beautiful", "review": "It was our honeymoon and we informed the hotel about this in April.   A really good hotel would have perhaps provided added extras. Nothing extra was provided and the staff were a little disinterested apart from one man on evening duty who was very nice and helpful.  The hotel is beautiful but there were some issues with our room. We stayed there for two weeks but towards the end of our stay there was an unpleasant smell coming from the bathroom sink.   The breakfast was very nice with a good selection of food to choose from.   Right at the end we were told about tourist tax which was a nasty surprise that hadn't been budgeted for. Perhaps the staff could have made us aware of this upon our arrival so we could factor it in.   Not a bad hotel by any means but considering our…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r225205308", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "2 nights at the J & J", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r223721660", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Location good", "review": "My 20 year old daughter & myself stayed here for 2 nights in July. It was a lovely building with character and the staff were very friendly & helpful. However, our room was not one of which there is a photo on the website - it was nothing like those on the website at all ! It was just ok but very small and somewhat disappointing with a view of a brick wall out of the back. I had been looking forward to the luxury I was expecting in our room from the website photos but I was really disappointed with the room. Our room was up an old narrow spiral staircase at the back of the hotel which was not too great with my mobility problems.  The WiFi also did not work well in our room. The hotel location is ideal to walk to the cathedral and to all sights. I wouldn't advise driving in…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r223716499", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Quirky, well located hotel", "review": "Dear Sir/Madam, We thank you very much for having chosen our hotel for your stay and we are very sorry about the inconvenience caused concerning the room choice. As you already know, the building was a convent of the 16th century which has been converted into a hotel. That is why all the rooms are different from each other. Moreover it depends as well on the category of room you booked. Anyway if you had reported this problem at the reception desk on the check in day, we could have changed the room for you or if you did so and we were unable to change the room for you, this was because we had no availability. So we are sorry again and we look forward to welcoming you in the future.  Best regards", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r220269029", "sub_review": {"Value": 4, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Weekend in Florence", "review": "Stayed for a couple of nights. Location great, room shabby and dark, had a very strange two floor layout with spiral stone steps leading upstairs like in churches. Door and windows opened directly onto courtyard where people ate on ground floor, had to be very careful when we switched the lights on! Breakfast ok. Parking very expensive although secure.", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r219709310", "sub_review": {"Value": 2, "Location": 4, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "NICE MEMORIES", "review": "Dear Sir/Madam,               We thank you very much for having chosen our hotel for your stay in Florence. Concerning the room description \"like in churches\", we agree with you as the building was a convent of the 16th century. Fortunately  we immagine that these are only personal opinions & comments as for the majority of our guests, the room is awesome. This is because before making a reservation, they already know about the history of the building but sometime it happens that who comes here don't know anything about how the hotels is like. Anyway we thank you very much and we would like to have you again among our guests next time.  Best regards", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r212840505", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Looks lovely but not great value for money", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r212483443", "sub_review": {"Value": 2, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Peaceful Florence Hotel", "review": "We booked this for its central location and ambiance. We had one terrific man at reception but the others were disinterested and lazy...really made a difference. Rooms small, no English speaking t.v...poor for the price!", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r210275948", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "This hotel is a must when in Florence", "review": "This is a gorgeous hotel down a quiet street very near the Duomo and walking distance to many great restaurants. It has a lovely courtyard which you can relax in and have a drink. The rooms are decorated beautifully and you can tell there has been real care and attention to detail with the interior design. The staff are very friendly and we had a lovely breakfast each morning. This is a true little boutique hotel.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r208783712", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A gem in Florence", "review": "I can't say enough about how enjoyable my stay was at Hotel J & J. I stayed for 6 nights and would have stayed another 6 nights!  First, this hotel is like walking into a very well appointed home that was prepared just for you. Every little detail was perfect. The comfy sofas and chairs throughout, the books, lighting, rooms, beds, breakfast in the morning and so on. The staff was very attentive and accommodating. Richard at the front desk was great.   The rooms were nicely appointed as well. We stayed in room 12 and it had a lovely terrace if you wanted to step out in the morning to have a nice up of coffee or tea. It was a nice little sanctuary in the morning and evening hours.  The hotel is conveniently located to the Domus and other attractions. Many shops, restaurants and…", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r207119963", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "not as the pictures", "review": "I have stayed here on three prior occasions in 2012 and returned this May.  This is truly a wonderful place with accomodating staff, excellent breakfast and comfortable rooms. No request was too much for the staff.  I have stayed now in 4 different rooms and they are all more than adequate with clean bathrooms, antique furnishings, and exude the charm of an old inn.My only warning is that one must be strong to get up the stairs to many of the rooms.  If not, request a ground floor accomodation.  Look forward to a return visit.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r206300324", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Wonderfull", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r205101505", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Style over substance", "review": "As you walk into the reception you see this is not just another 4* hotel, the furnishings are exquisite 2 Large sofas await and you are met by a very welcoming receptionist and you are taken through the dinning room into a courtyard where the smell of Jasmine knocks you back, heavenly. Into your room in our case off the courtyard the main room with the bathroom off and in the corner a old stone staircase leading up to a mezzanine with a comfortable chair and a wardrobe. The furniture was all beautiful and the room spotless. Breakfast was simple but adequate with scrambled egg and bacon. We came back to the hotel in the evening after our evening meal and would sit in the courtyard smelling the Jasmine and having a last drink of the day, heaven.", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r196518667", "sub_review": {"Value": 2, "Location": 4, "Sleep Quality": 3, "Rooms": 2, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Great value and location", "review": "A beautiful historic building tastefully renovated and furnished does not automatically make a great hotel. The place appears to be run by junior staff with a limited understanding of the hospitality business. With so much competition in this city service needs to be impeccable and the breakfast more than just a few packets and jars from the supermarkets opened.   We had a room on the first floor which had a nice \"trendy\" looking bathroom which was not fit for purpose (shower flooded bathroom as glass screen too small and water didn't drain from sink down the designer slit plug hole...). Internet service was a joke (we got reception sitting on one cushion of the sofa in the sitting room but not the one next to it).  This is nothing more than a well-placed over-priced bolt hole.…", "date": "February 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r193679370", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Charming place", "review": "This was an excellent choice of a 4 star hotel with good location in a studentish part of centre of Florence.  Near enough to everything.  Rooms are all different so check them out first - go far junior suite if you can", "date": "February 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r192574459", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "historical building, good location", "review": "The J and J hotel is is a real charming place. Central but in a calm area , chic and discreet. Rooms are very conforable and very well decorated and furnished. The staff is nice and helpful. Perfect for a romantic escape or to stay in an historic place but away from touristic crowd.", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r192433212", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "great find", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "December 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r192355041", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very nice!", "review": "The Hotel J and J is a terrific gem.  About 10 minute walk to the Duomo it is close enough to the sights but away from all the crowds, etc.  The staff was extremely helpful.  The rooms very spacious! And By Florence standards, a very good deal for what you get.   No elevator.", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r191574496", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Cozy, but...", "review": "I like everything and of course I will come back)the rooms are Stylish,staff are friendly,location is great.very nice hotel!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "date": "November 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r183295624", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Bad managment Bad experience", "review": "Overall, It was a pleasant boutique hotel (only 21 rooms) with a convenient location. The rooms are generally comfortable, and maintains the historic feel. I feel it's worth the price.   A few minor issues...  1. Food is not allowed in the room.  Huge inconvenience when you are traveling alone, and you decide to bring back a pizza to enjoy while you work. You may eat your food in the dining room for a fee. Who wants to pay to eat  when you've already bought your food. Very peculiar policy.   2. Keys must be returned to the front desk each time you leave (even to run next door and back), and the front door is locked later in the evening. IT's a bit inconvenient, as staff doesn't always answer the door promptly, and you may spend about five minutes in the ally waiting.  3. Wifi -…", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r181254411", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Great Location", "review": "Arrived at hotel to join a party of friends who'd travelled from the UK to find the hotel had shunted me into another hotel along the street and round the corner, obviously having seen mine was a single booking so it wouldn't have mattered to them where I stayed. No effort was made to contact me beforehand, no effort was made to remedy their problem nor could I speak to the director of the hotel, only the front desk staff who were apologetic but didn't want to find a solution where the 3 of us could stay together. Neither in a suite for 3 nor in the other hotel, he said we could go if we wanted to but not at their expense. Then he ranted a raved about how their hotel doesn't receive the money that I'd already paid for another month. I imagine they're having financial problems to…", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r178460856", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Good choice in the centre of Firenze", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r176229741", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "nice hotel , parking over priced !!!", "review": "Very nice und spacious room in a historic house close to the centre of Firenze, service could be more ambiguous, breakfast was okay but not really 4* level, but overall  a good choice for a faire price.       ", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r173599044", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Wonderful wedding venue!", "review": "cool hotel , nice cleen and big rooms. internet is fast , bathroom was nice and cleen. very romantic hotel ;) very good service , location was perfect !!  5 mins walk from \"the dome\" and close to \" bet habad \" :) the only  problem is the parking . 30 euro per day ?!?!?!?  so if you are with a car, i dont think this hotel is good for you. ", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r172250677", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "A unique historical stay in Florence", "review": "My family and friends recently stayed at the J and J for our daughters wedding in Florence.  From the moment we arrived until the moment we left we were made to feel more than welcome, and there was nothing that was too much for the staff to do for us. The rooms we cleaned and aired everyday and a pleasure to stay in.  Every guest was extremely happy with their rooms. We stayed in one of the dramatic, enormous and beautiful suites.  Some are obviously much bigger than others,  some are nicer, but as this is an old building (which has THANKFULLY not been 'converted' or 'modernised') so what you get is originality.  Our breakfast was not the best I have ever had in a four star hotel but it was perfectly ok with nothing to complain about and we were very happy with it.  The staff…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r168786702", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Historic in more sense than one!", "review": "I was in Florence for a short trip and was inspired to stay at J and J for the simple reason that it  was a convent. I had the room way at the top of the stairs and found it the be a spacious and peaceful stay. I found the location to be very convenient to some interesting sites and great restaurants. I would recommend the hotel for those that are interested in a spot that is more unique, historical than luxurious.", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r164514097", "sub_review": {"Value": 1, "Location": 3, "Sleep Quality": 1, "Rooms": 2, "Cleanliness": 2, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "J or not too J that is the question", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r162450370", "sub_review": {"Value": 2, "Location": 4, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Nice hotel off the beaten path", "review": "I have never written anything like this before, as hotels and restaurants are subjective to different tastes, so I shall enter the facts. The location, for walking into Florence was great, although area abit shabby.  If you have a car, the hotel parking is 30 euros a day, also going in and out of Florence costs more money, and tourist tax 4 euros a day each. The breakfast area was nice, but Internet really slow... And you have to get code every 24 hours to log in, then sit in corner of front reception to pick up signal, this is all very petty, especially as most people staying wanted to pick up their emails. We called our room, 'the prison' as it was dark and damp, being on the ground floor, just off courtyard, you could not open curtains, as people in courtyard could look in,…", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r161809270", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Perfect Anniversary", "review": "My husband and I stayed here on our honeymoon.  The room was large.  The staff were very nice; on our second morning there we came down to breakfast five minutes after it technically ended but the waiter did not rush us at all.  In fact, he made us fresh coffee and brought out items that he was starting to put away.  It was very accommodating.  This hotel was in a nice location -- it was away from the tourists but a short walk to the heart of Florence.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r160050318", "sub_review": {"Value": 4, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 5}, {"title": "City Break Florence", "review": "We have recently returned from Florence after celebrating our 1st wedding anniversary.   I booked the J&J Hotel on a little bit of a whim in December, and kept looking on Tripadvisor until our trip in May, I was getting a little worried that the hotel was not as perfect as described due to some recent reviews however on arriving all of these worries were dispelled.  After a short taxi journey from the main train station we arrived in a quiet back street at the J&J. We were greeted by a friendly man who made us feel very welcome and showed us to our room. We stayed in room 1 which was better than expected. There was a lovely mezzanine floor and everything that we required for our 3 night stay (including a well stocked mini bar). The features of the room and the whole hotel are …", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r158746353", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "city break", "review": "Brillianr location for seeing the sites of Florence, far enough away from the crowds but close enough to walk to the centre easily. The room was large and very clean with excellent quality bedding, the downside was that the room was on the ground floor in the courtyard so therefore exposed to cigarette smoke and the noise of late night smokers. The room was also very dark so whilst in the room the lights needed to be constantly on.  Breakfast was a total disappointment, everything had to be asked for as it had either run out or not been put out, simple things such as tea bags, rolls and the scrambled eggs. The fruit juice was totally watered down and tasted awful. Staff serving breakfast were very unhappy in their work unlike reception staff who couldn't do enough to help,…", "date": "March 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r158564404", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "DO NOT TRUST ALL YOU SEE WHEN YOU GOOGLE THIS HOTEL", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r158442021", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 1, "Rooms": 2, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Somewhat disappointing.", "review": "On arrival staff were more than helpful.    The room was dark and narrow and we had to walk down a flight of stairs to a large bathroom.  On complaining that the room was too hot we were told that the air-con had not been activated so far, they were unable to turn off heating thus the room & bathroom were very uncomfortable.  On asking for a different room we were told that the hotel was completely full.  The double bed was in need of change as it dipped in the middle, but the standard of sheets, towels etc were 1st class and everything was spotless.    The main rooms of this hotel are a credit to them - clean and homely and in-keeping with the character that the hotel must of been when originally a monastery.", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r158027797", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 2, "Rooms": 3, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Just beautiful", "review": "Four nights in April and out first ever trip to Florence, expectations ran quite high for this 4 star Hotel but the overall impression we were left with was that it rather overrates itself. It is a good location but most of the staff seemed rather disinterested. Soundproofing in our room at least was poor, with a big gap under the door and a construction that meant that any scrape along the floor in adjacent rooms disturbed us. Beds also squeaked at the slightest movement and we had to use (good) earplugs every night to sleep reasonably and not get woken up prematurely.   The other main disappointment was the breakfast with staff inadequate and long waits for a rather meagre spread of items to be replenished. The fruit juice was very watered down (another couple asked for…", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r157697331", "sub_review": {"Value": 4, "Location": 4, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "10 Days in Florence", "review": "Dear Sir,   First of all we thank you very much for having stayed at our hotel. We are very sorry that it appeared to you that the staff seemed to be disinterested and inadequate but unfortunately for me it is not like this as you can verify by yourself, we receive many positive reviews on our staff efficiency and courtesy. That is why I have the same group of persons working here for more than 25 years.  Concerning the soundproof of the room I am sorry to inform you that is not possibile  to make any amendment on it as the building itself was a convent of the 15th century, declared at the commission for the Architectural Heritage and having the plasterwork of that time.  Thank you for your comment on the breakfast as I always try to give the best to my clients and many things are fresh and prepared at home. It is normal that if somebody wants something extra that is not included in the continental buffet, for example the fresh squeeze orange juice, this will have an extra cost.  Thank you The Owner, Mrs Jacqueline Cavagnari", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r157342385", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great Stay at the Hotel J&J", "review": "Spent the first part of our honeymoon here. Just gorgeous,romantic place decorated in tones of cream, black and other neutrals. Short cab ride from the train station.  Good neighborhood in the Santa Croce area. This was more of a residential than tourist arrea (nice and quiet at night)  but still within walking distance of shopping, attractions,  restaurants (great place just a few doors down).  Comfortable lobby, lovely breakfast room with wonderful buffet style breakfasts, gracious service, reading room and courtyard. Our room (8) was HUGE with suite area and enormous terra cotta shower and antiques. The only weird thing about the bathroom was the shower stall (size of a small room) had no light and no ledge for toiletries The space was a medieval convent so there were lots of…", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r157174075", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "So relaxing, pleasant, peaceful (J and J Historic House)", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "March 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r156139291", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Simple...Staying in Florence?...Stay here!", "review": "I was at the end of my Italy trip (3 months) and what a wonderful way to end it. Because I had already had my share of less-than-adequate accommodations, my breath was taken away when I walked into my room -- Room No. 1. A quaint balcony with a winding stairway inside my room, a large comfortable bed, cozy seating either upstairs in the balcony overlooking the bedroom or downstairs, a lovely ample bathroom (with a shower curtain -- I noticed another reviewer didn't have a shower curtain), television with too many channels from which to choose.  Just outside my room, was a courtyard with several tables, and then easy access to a very comfortable sitting area and dining area of the hotel.  The staff were generous with their help and good attitude. I had a lot of luggage and they…", "date": "March 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r156083759", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "A real taste of Florence", "review": "Stayed here for 2 nights and wow what a hotel one of the best we have ever had the pleasure of staying in!  We where lucky enough to have a lovely room/Italian home on the courtyard. When we walked in the room was romantically lit, lovely old wood and beautiful curtains tied back throughout and an amazing archway to the bathroom. Bathroom had a lovely big back with huge showerhead over it perfect wake up call before the buffet breakfast!  Superb hotel not too far from everything in Florence but tucked away from all the hussle and Bustle!   Loved every second, if you are going to Florence dont think twice just stay here and ask for room 2! (even the woman behind the counter said it was a nice room)", "date": "March 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r155956277", "sub_review": {"Value": 5, "Location": 4, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 5}, {"title": "Great location, if they change a couple of things could be awesome", "review": "We recently stayed at the J and J Hotel and have to say there was very little to fault with this hotel. Although the hotel is hidden down a side street, it is easily within strolling distance of all the major sights and restaurants in Florence. Our room was spacious with an enormous and luxurious bathroom and with patio doors leading out onto a little terrace that given better weather would have been fantastic! Breakfast was simple but more than adequate, and we found the staff always extremely friendly and more than willing to help with booking restaurants etc.  ", "date": "March 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r155726292", "sub_review": {"Value": 3, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "Superb Hotel", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "March 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r154881303", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Absolutely loved this place!", "review": "The room was spacious, bathroom modern and both were spotlessly clean. The whole hotel was tastefully furnished. The staff were friendly,and very helpful. The breakfast was excellant with many choices. The location was just right. Not right in the centre but in with the local community and only 10 minutes walk from places of interest.An excellant hotel and one we would highly recommend.", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r150730580", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Amazing room,location,price....", "review": "The rooms are extremely spacious and the rural feel is unique. The service is good and the breakfast delicious. It's located right in the middle of everything. It's NOT right in the tourist centre, but near all the local bars and restaurants. Only 10 minutes walk to the main attractions though. I'd definitely stay here again!", "date": "December 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r147665486", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Perfect for our needs", "review": "The room was beautiful with an enormous bed, tasteful decoration and a couch and seating in a lounge area to seat 4 people, definitely felt more like a suite than a 'standard double'! The bathroom was clean and modern and bathrobes provided added a bit more luxury. The breakfast had a good choice of pastries,fruit,cereal,ham/cheese/bread and there is a picturesque courtyard for warmer weather!  We read in the room details that the usual room price was 440 euros,so felt an absolute bargain at the 75 euros we paid!", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r143387523", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Beautiful Hotel", "review": "When we travel, we enjoy being in another place. During the week we were in Florence we were out an about. We only spent enough time in our room to shower and sleep. The Hotel J and J was perfect. It was out of the mainstream tourist craziness, but within a five minute walk to the Duomo. The morning breakfast was great for both American and non-American tastes. The J and J is well worth consideration if you plan a visit to Florence.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r141518762", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "It 's an okay hotel", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r140796592", "sub_review": {"Value": 3, "Location": 5, "Rooms": 3, "Cleanliness": 3, "Service": 4}, "travel_purpose": "", "rating": 3}, {"title": "J and J Delivers", "review": "Depending on how much you pay, this is a good hotel vs not okay.  No internet on the rooms, which is really annoying. 300 channels of TV but not one in English. Room was huge but poorly furnished, musty and had one small window that looked into the smallest courtyard imaginable so the entire room was just very dark.  Bath was the nicest feature but had this very loud exhaust fan contraption that turned on and stated on if you even looked at the bathroom light switch. Oh, it would stay on for several minutes after you turn the light off.  I began using the bathroom in the dark.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r140704078", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Most Incredible hotel room ever", "review": "J and J hotel is nestled in the back streets not too far from the centre of Florence. To look at the hotel from the outside you would easily and mistakingly feel a bit disappointed at the place. Once you get inside the hotel it is like a little alladins cave with vaulted ceilings old yet tasteful furnishings.  The rooms are clean throughout and well sized when compared to a few hotels that we stayed at during our weeks stay in Tuscany.  The staff can't do enough for you! No problem is too small so just make sure that you turn up ready to enjoy yourself.  Trust me you will leave the place smiling.", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r139693318", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great stay", "review": "My husband, son and I traveled to Florence in May of 2012. The Hotel J and J was recomended to me by a coworker. It was fabulous. We had a Junior suite and it was HUGE. My husband said it was about 750 sq ft. Very comfortable. 2 twin beds, 2 pull out couches, desk, side boards and it was air conditioned! We also had excellent wireless internet. I chose all our hotels because they were centrally located to the sites and the hotel J and J did not disappoint. Very easy to walk to all the sites. Hotel staff were also very attentive. Allowed us to have breakfast early because we had to meet an early tour. Arranged tours for us. Very accomodating. The Hotel J and J was wonderful on every level - we would definitely stay again.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r139165261", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Charming Hotel in the Heart of Old Florence", "review": "We chose the non-refundable classic room option (clearly explained on the website). After an initial mix up with a previous option no longer available, an extremely helpful employee (Richard) upgraded us to the Deluxe room for no extra charge. What can we say, a fantastic spacious room at the front of the hotel, with modern bathroom, excellent air conditioning (needed with the high temps in August), and extremely clean. Fresh towels and sheets were provided/laid on a daily basis.  It was a beautiful hotel, situated in an ideal, quiet location. In my opinion, a hidden gem on a plain looking Florentine street. The main attractions were all in easy walking distance.  The breakfast was quite varied and we particularly enjoyed the option of breakfast cake. Breakfast included: fruit,…", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r136411937", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Buyer beware", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r136359241", "sub_review": {"Value": 1, "Location": 1, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Charming old and centrally located hotel in old Florence", "review": "Be extremely careful when booking with this hotel. When you select a room online, there is no mention that it is non-refundable, and the terms and conditions are misleading as they tell you cancellation can be made 48hrs in advance... you'll find that you can't cancel and you're only told it is a non-refundable rate AFTER they take payment.  A hotel that is unwilling to accept cancellations with 3 weeks notice, and uses misleading terms and conditions, suggests they are not confident in filling the rooms - I can understand why having read some of the other reviews.", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r135847808", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 2}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Great location, pleasant hotel", "review": "The Hotel J and J is an old, charming,  and pleasantly quirky hotel.  I enjoyed it but this place isnt for everyone.  I would highly recommend it for the type of traveler who can appreciate it and enjoy its charms. The hotel is a very old and  tranquil hotel in a centrally located part of florence.  You are within walking distance of many of the major sites.   There is a small courtyard in the middle of the hotel filled with flowers; a great place to take tea or coffee in the morning.  The rooms are very clean but also old and filled with antiques.  I was very comfortable here.   If you are looking for a modern five star hotel with impeccable service, the kind which will make you feel like you are in New York or Milan, this is not it.   However, if you are willing to enjoy the…", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r134122614", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Fantastic!!", "review": "Was this the best hotel I've ever stayed in? In short, no. However, its location was excellent, the staff were pleasant and friendly, the rooms had everything we needed (and were clean) and for 3 nights in Florence it suited us!  The lobby and court yard is very pretty and attractive.  Yes there isn't any wi fi in the rooms, but who wants to be on the Internet when you have Florence on your doorstep?  The breakfast was adequate and the coffee was amazing.  Upon arrival my girlfriend was called Sir on two occasions which wasn't ideal and when we asked for a recommendation on where we could have good beer in a great setting, we were pointed in the direction of a pretty grim Irish pub - says a lot on what Italians think of us Brits!! We were in room 2, which opened up in to the…", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r133990856", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Terrible hotel in a bad area", "review": "By far one of the best places we stayed in!  From the beginning we found this hotel to be wonderful. Patel, at the front desk, was friendly and welcoming. Our Rooms were outstanding. (Rooms 11 and 13) They were on the ground floor just past the open dining area. We booked a standard room as well as a suite. The basic room was beautiful with a beautiful doors that opened to a shared courtyard. The suite was enormous and was beautiful as well. The bathrooms were immaculate and modern. the furniture and bedding was top notch. Very comfortable! The eating/lobby area is very pretty with a wonderful rustic open air feel to it. Every night we would enjoy a bottle of wine in this ideal setting. Breakfast was great! I also liked the fact that you can request anything throughout the day…", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r133927589", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "no elevator!!!", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r132950419", "sub_review": {"Value": 1, "Location": 5, "Sleep Quality": 2, "Rooms": 3, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Clean, helpful, friendly, great location.", "review": "the hotel was nice and the decoration was amazing, the main issue is the elevator!! my parents are old and when we asked them to change the room they said we are fully booked. in the reviews there were nothing written about the elevator so that's was the real problem, I wouldn't consider it as a 4 star hotel! espicially that it was very expensive!!!", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r132454230", "sub_review": {"Value": 4, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Very nice place", "review": "Quiet street, just had a standard room (number 16) which was basic enough but had everything you needed - wardrobe, drawers, air con, comfy beds and pillows. Bathroom was lovely with bath inc a powerful and hot shower, very happy with that. Breakfast lovely, plenty of choice although eggs not always the warmest but delicious. Staff very helpful with whatever we asked so would encourage other visitors to ask and also for restaurant recommendations. I would definitely recommend the hotel and would love to go back and try one of their snazzier rooms when I  am rich!", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r132139027", "sub_review": {"Value": 4, "Location": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "A disappointing experience", "review": "a very nice surprise. This hotel has great character, nice decor and friendly staff. An overall positive feeling. Highly recommended", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r131958427", "sub_review": {"Value": 1, "Location": 2, "Sleep Quality": 2, "Rooms": 2, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Delightful J&J", "review": "A friend and I recently returned from a trip to Florence, 24th-27th May.  We stayed and the Jand J hotel which we had chosen on the strength of the recommendations both on Trip Advisor and in various guide books. We had decided to book a suite which was a very considerable financial outlay for both of us. When we arrived at the hotel we were taken through to the back of the hotel and and up two flights of dingy stairs which smelled of damp. We were shown into our suite which was dreadful. It was a large dark dank split level room. It did not seem to have been used for quite a long time. It was furnished hapharsadly with bits of old furniture which provided neither function nor comfort. The overall impression was of an impoverished hostel. We decided we were not staying in this…", "date": "March 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r131911586", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "quiet, central, boutique, out of the ordinary", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r130603902", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A pleasant surprise.", "review": "I booked this for three nights via BA. I was generally favourably impressed. There aren't many rooms. All of them (I think) look out over one of several small courtyards, to which the ground floor rooms have direct access. The rooms are charming, spacious, with high ceilings, and interesting modern decor that doesn't clash with the old building (former monastery). Beds are large, but are of the two twins make a double variety. The bathrooms are vast, but probably designed by a woman, as the mirrors aren't high enough and there's not enough light to shave. Aircon wasn't working, which gives you a choice between sweltering or accommodating the local mosquitoes. Manageable in May, but not in July I suspect. Breakfast is well above average, except the scrambled egg which, as ever,…", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r130396961", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "This is a four-star hotel ??", "review": "This hotel has many positives and just a couple of minor negatives…  The positives are: •\tThe super friendly, professional, helpful, and polite front desk. •\tThe gorgeous hotel room we had. This hotel is an old monastery so, we weren’t sure what to expect.  The room was spacious, beautiful, and comfortable. •\tThe bathroom was spacious and had all the amenities you need.  Double sinks, robes, etc.  I did find it odd that they didn’t provide shampoo or more than one bar of soap (two are always nice - shower and sink) but, I brought my own shampoo and conditioner so this wasn’t a big deal for us.  •\tThe location is very convenient to everything.  We only took a taxi to and from the train station.  Other than that we accessed everything on foot with ease.  The Duomo is the closest…", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r129657387", "sub_review": {"Value": 2, "Location": 4, "Sleep Quality": 4, "Rooms": 2, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "French Country Cottage in Florence", "review": "As our taxi pulled up to the J&J I was impressed with the location and the welcoming lobby, then reality set in. There is no elevator. I was fine climbing the two flights to our \"superior double room,\" but after proceeding along an outside gallery I was shocked to see that we faced ANOTHER stairway of TWENTY narrow stairs to get up to our room. Heat rises (and this was in mild late April) and the room was stifling. While large, it was shabby and furnished with what looked like purchases from a garage sale, and NOTHING like the photos posted on the hotel website. I descended the three flights of to question the guy at the desk who told me that the online photos are of their suite. I told him I was shocked by their misrepresentation and the prices they were charging for a dumpy…", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r129057666", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 2, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Best boutique hotel experience i have ever had.", "review": "We stayed in the J&J Historic House Hotel for two nights, but we enjoyed the casual atmosphere.  The hotel is on the east side of the city center, and was a quick walk to everything we wanted to see in Florence.  They had very nice evening snacks for guest along with a nice bar.  It rained while we were there so we did not get to enjoy the coutryard with French country decor.  The our room was two story, we a lovely wood stair case to the bed and separate room.  The bed, was hard as a rock, we both woke up sore and tired.  The pillows weren't any softer.  The separate room held the room safe, which was just sitting on a shelf, not attached, so we didn't use it.  The in room refrigerator was hidden in the closet under the stairs, but we didn't really need it.  The very modern…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r127897208", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Charming with a great location!", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r127670351", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Worth a stay", "review": "If you want a charming place to stay that has a convenient location, stay here! The hotel has so much character and history but it is conveniently located in a quiet neighborhood that is still close to all of the main attractions in Florence.   The lobby, eating area, sunroom, and patio are nicely decorating in what I would consider a French country mixed with shabby chic style. We had room four which was huge! It had a comfortable king bed and a siting area with two love seats. It had a huge window overlooking the courtyard.  I would definitely recommend this room.   The bathroom was a good size too. The water was hot but the water pressure low. They have comfy slippers and robes available for use.   The walls are somewhat thin but luckily we didn't have any noisy neighbors.…", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r127512669", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Extremely helpful and well located", "review": "We chose this hotel from Trip Advisor rather late after previous arrangements for staying with our extended family fell through.  Looking at the photographs we went for a deluxe room, expecting at our age to maybe need to sit and rest on occasion.  We were disappointed therefore to find only a single desk chair in the room (No 6).  That is, however, our only complaint.  Otherwise this interesting hotel met all our expectations, friendly,  convenient and very quiet at night. There is an excellent restaurant a minutes walk down the road and others nearby.", "date": "March 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r127138856", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Solid Choice", "review": "We spent 3 nights in March 2012 and we enjoyed the relaxing atmosphere of this boutique hotel. It has a superb location just five minute walk from the main Cathedral, shopping area and restaurants. Staff is extremely polite and helpful, rooms are tastefully decorated and spacious. Breakfast was lovely although not a lot of choice. Free internet was a welcome extra. The only problem was the leaking shower. There is a small panel and no shower curtain so all the water when you shower leaks on to the floor creating an incredible mess everywhere including the bedroom. Water does not dry for days so we had to ask the maid to mop our bathroom every day.", "date": "March 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r126697872", "sub_review": {"Value": 4, "Location": 4, "Rooms": 3, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Great ambiance and location", "review": "Rooms are clean and QUIET... We met  tourists staying right downtown, and they couldn't get a good nights sleep, where we had no problem.  We walked 10-15 minutes to the major attractions like the Uffizi and the Duomo.  Service is average overall, except for Monica (at the front desk) who is a superstar.", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r125221329", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Former monastery, not plush but nice.", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "January 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r123009380", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent location, staff, and comfort", "review": "My wife and I spent Christmas and NY 2012 celebrations here. We stayed at \"J and J\" for 6 nights. This small hotel used to be a monastery so don't expect plush and extravagant interiors. We had a junior suite that had a living area with the bathroom at the lower level and a bedroom with a walk-in closet at the upper level. This setup is not bad and looks romantic, but it gets a bit inconvenient at night when you have to use the facilities located one flight of stairs lower than your bed. Particularly relevant, if you have somebody who is pregnant  up there (my wife was in her 4 month and she did frequent the toilet!). The view from our room was what one could expect from a hotel in an old city center. Our room was clean, although the skyline window leaked once during a storm.…", "date": "December 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r122734406", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "It just made Florence all the more special", "review": "We spent from Christmas to New Year 2011 at the J and J. We loved the quiet location, so close to the major sights, and we found the staff to be superb. .For instance, no public transit runs on New Year's Day and taxi companies do not take bookings. The desk clerk found us a cab for the early morning trip to the airport.   My wife has worked for Four Seasons and Ritz Carlton and is very knowledgeable about hotels. It passed all of her tests!", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r122726372", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great Location, Quaint Hotel", "review": "The J&J made our trip to Florence all the more special.  It is only a short distance away from the Duomo and close to a number of interesting places.  It was a lovely surprise! A converted monastery, complete with frescoes, even in our room.  Simply picture-perfect in every sense.", "date": "December 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r121583352", "sub_review": {"Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great hotel in a Great area", "review": "Had a nice stay at the J&J. It's only a short stroll to some of the best resturants in Florence. We found it within easy walking distance of all the major Florence sights , and only 15 mins walk from the station. The hotel it's self was in a narrow side street. It looks small and unimpressive from the outside , but once inside it's very quaint. Staff were more than helpful with a great breakfast and as mentioned before, free wine in the evening before you venture out to fab resturants. This is not a hotel for someone who likes the \"Major hotel \" experience, but it was just what we were looking for. We were initially dissapointed by our room ( room 20 ) but we had booked using travel points so maybe other rooms were better ( they looked a bit more upmarket on the web site ).…", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r119854765", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r118827512", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great Historic Hotel with Fantastic Service", "review": "My favorite hotel on our trip. Very helpful staff. Large, clean room. Free wine in the evenings. Very nice breakfast. It was an Oasis after many 3 star hotels! Close walk to the main site in Florence. We will be back!", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r118282195", "sub_review": {"Value": 4, "Location": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Near sites but on quieter street", "review": "My hubby and I stayed in a number of amazing hotels while we were exploring Italy and the J and J Historic House was definitely one of our favorites. When we drove up, I’ll admit I was a bit scared. Located on a tiny side street and somewhat off the beaten path. My husband warned me not to judge a book by its cover, and thankfully I didn’t. The inside was welcoming and warm; we were greeted by a happy staff that immediately made us feel at home. J and J was converted from a convent and updated with all the modern amenities one could possibly need. Cool. Weird. Fabulous. We were upgraded to a massive room with high ceilings, a living room and a huge bed. Thank you LuxLyfe! The breakfast was fresh and tasty with local fruits, breads, cheeses and pastries. Every night there was…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r116980617", "sub_review": {"Value": 3, "Sleep Quality": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great Hotel with a Great Location!", "review": "Wound up here after a travel company booking issue left us stranded at the last minute.  This quaint hotel is in an historic building in Florence but is away from the big crowds on a narrow, quiet street.  It is within walking distance to the Duomo, Uffizi, and other main tourist sites in Florence even for someone who is fairly fit but who does not exercise regularly.  It was also very near the synagogue and a kosher restaurant. Short walk to one of the highest rated gelato places in Florence!  I would stay here again.  Not easily accessible for anyone with significant mobility impairment like wheelchair or crutches.", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r115728927", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Run and DON'T look back!", "review": "This is an amazing Hotel.  It is a former abbey that has been turned  into a hotel with character.  We had three rooms with the best room being room #10.  It takes up th entire top floor!  It was huge but with lots and lots of stairs.  The other two rooms were also very nice.  Staff was helpful and the breakfast was very good.  Stay here to have easy access to Florence downtown.  Take your GPS!  Very hard to find.", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r115103186", "sub_review": {"Value": 2, "Sleep Quality": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "not bad", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r113916955", "sub_review": {"Value": 3, "Sleep Quality": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "A wonderful place", "review": "My mother and I stayed here after finding that many of our first choice hotels here fully booked. We were not sure what to expect, but the price was a bargain at the time. We found the hotel to be a pleasant surprise. The breakfast was fine, nothing over the top, but if you want an over the top breakfast, we would go to a restaurant that was known for that. The rooms were large, but sparsely decorated. That didn't bother us. The bathroom was very large, which was a plus. There was a lovely courtyard off our room. The location didn't wow me. It was a bit of a walk into city center, and I couldn't tell if we were in a sketchy part of town or not. The front desk was not particularly helpful, but we didn't really need too much from them anyway. If the price of the hotel is near the…", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r112363728", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Charming hotel with patio areas, but 15 minute walk to town", "review": "The hotel is great... staff is very helpfull and very friendly. Rooms are very very nice. The hotel sitting areas are magnificent, and breakfast was good.", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r110461163", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 2, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Unique hotel in centre of Florence", "review": "I stayed 2 nights at the Hotel J and J in May, 2011.  This is a charming hotel with cozy lounging/breakfast area and nice patios.  The rooms are good sized, with good bathroom amenities, but I had no bathtub.  The furniture is not top quality, but the bed was comfy.  It's an OK location, about 15 minute walk to town.  The desk staff is very nice and super accomodating.  The breakfast was quite nice, with scrambled eggs, fresh fruit, juice, pastries and cakes.  There was door slamming noise, and not super insulated walls, but an enjoyable stay.  I enjoyed sitting on the beautiful patio with a cocktail.", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r106258602", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "It doesn't look like the photos - needs repainting", "review": "This is a very nice boutique hotel with spacious rooms and nice room and lobby decor. The staff were friendly with good recommendations for restaurants and sight seeing activities. The only complaint we had was regarding Wifi - the service was very slow and only accessible in the lobby. The hallways were also a bit smelly.", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r88206264", "sub_review": {"Value": 2, "Location": 4, "Sleep Quality": 2, "Rooms": 2, "Cleanliness": 2, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Excellent Hotel", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r83795755", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Peaceful and quirky", "review": "We had a magic stay at J and J. We were upgraded free of charge to a junior suite without us even asking. The room was magical as if you are taken back to the the early years of the convant. The hotel is nicely situated within walking distance of all the attractions. Friendly staff from Chacho the owners little dog to all the staff. Good breakfast. The hotel is close to the best restuarant for Florentine Bistec at Baldovinos. Thank you again", "date": "October 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r83120030", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Part of the city", "review": "We had a one night stay in the J&J hotel, we had a lovely room which overlooked the courtyard, the hotel is well furnished with antiques and has a cosy feel about it.  My only criticism would be that the breakfast was quite limited - no fresh orange juice, but otherwise a good find in Florence", "date": "October 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r82309944", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Fantasic bargain", "review": "The J and J is great and totally different to anywhere i have previously stayed.  In a good location within easy walking distance of the sites it was the perfect base for our break.  THe weekend trip to Florence was a wedding present and hence we had not chosen the hotel but as soon as we walked in were were pleased.  Unique in every way.  We stayed in room 2 whoch was just off the court yard.  In the day it was a little dark but other than that perfect.  Great powerful shower, really comfrotable bed and nice big room.  The only negative to the whole thing was that being off the courtyard we were awoken by other guest when they came back late at night and also disturbed during the day - it did feel like people were actually in our room having a conversation.  Breakfast was good…", "date": "May 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r78451625", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Former monastery gives this hotel an interesting feel", "review": "We stayed in May 2010. Thoroughly enjoyed our stay. Great location and an inner/upclass suburb away from crowds,central and easy walking distance to everything.  Booked a late deal for 3 nights, and were upgraded upon arrival to a junior suite.  Very spacious rooms with good bathroom amenities. Staff was help, with great food recommendations.  Breakfast was the only let down, limited choices but satisfactory", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r76363158", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Quaint, Charming, and Cozy", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "April 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r64323472", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A gem in Florence", "review": "My husband and I recently traveled to Italy to celebrate our 35th Wedding Anniversary. We chose this hotel on a friend's recommendation and would gladly return. From our first step inside we thought we had found a hidden treasure. The staff was always friendly but Deepak was especially helpful from the moment we arrived. My husband accidentally left his backpack in the taxi and Deepak was able to track it down and have it returned within 20 minutes. He also helped with directions, reservations for dinner & our biking trip in the Tuscany region. Breakfast was lovely and the common areas were comfortable and inviting. I would probably recommend a room in the newer section. For anyone interested, there is a synagogue within walking distance as well as a Chabad House.", "date": "April 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r62212696", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Not for the business traveller.", "review": "Booked a 3 night stay but was extended by an extra 4 nights because of volcanic eruption. Hotel and staff, especially Deepak and Peiris could not have done more to alleviate our inconvenience. They were extremely helpful with whatever was asked of them.The hotel was spacious, tastefully decorated and furnished and was just to our taste. Breakfast was very good and in a pleasant environment. Hotel in a quiet location but only a short distance walk from the hustle and bustle of the centre. We would not hesitate in highly recommending this hotel to anyone.", "date": "February 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r59056275", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Great!", "review": "The reviews for this hotel were so positive, that we changed from another hotel to here.  I was amazed when I walked in how dark the hotel looked compared to the publicity images, and that feeling never left. It was winter, but I like a bit more light in a hotel. The use of the internal small courtyard in summer may give a different feel.  There is nothing terribly wrong with the J and J though, but there are several niggles. The chairs are  very close to the floor - think  Snow White and dwarves.  This meant the table in the bedroom was too high to enable any work to be done and this, coupled with no internet in the bedrooms, meant this hotel is hopeless for the business traveller. An iron and ironing board are available on request.  The heating was a single noisy radiator,…", "date": "October 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r49077333", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Exquisite Gem in Florence", "review": "Thoroughly enjoyed our brief stay. Alberto at the desk was very accommodating and most helpful. The room was beautiful, clean and comfortable. Breakfast delightful!", "date": "October 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r48826646", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Amazing find... Beautiful place in the heart of Florence", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "August 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r42924732", "sub_review": {"Value": 5, "Location": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Superb staff", "review": "Place is a hole in the wall that actually turns out to be a godsend.  Boutique style hotel with really nice people working there.  Very close to anywhere you want to walk to.  Best value we had in all of Italy.  thank you!", "date": "December 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r23674325", "sub_review": {"Value": 4, "Location": 5, "Check in / front desk": 5, "Rooms": 4, "Cleanliness": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Awesome stay!", "review": "This is a nice , charming hotel (not cheap) in the city centre.  Best things about the hotel are:   -  Location: 7 minutes walking from the Duomo (cathedral), yet in a quiet street. Close to a nice little district with some good restaurants and shops, a popular market and the 19th century synagogue.  -  Staff: all of them are extremely kind and helpful, always ready to make your stay easy.  -  Building: an ancient nuns’ convent with original vaults and columns and a cosy inner patio.  -  Rooms:  some of them are facing the inner patio and are very peaceful. Our room was large and nicely decorated. Also, we had a room for the bath and another room for the toilette and the sink.  Issues that could be improved:   -  Breakfast is ok, but not excellent. Coffee is very good (very nice…", "date": "August 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r19509344", "sub_review": {"Value": 5, "Location": 3, "Check in / front desk": 4, "Rooms": 3, "Cleanliness": 2, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "fairly nice boutique hotel", "review": "Stayed at the J and J for three nights in mid August.  Awesome stay.  Had a room with a king size bed overlooking a small court yard.  Only three rooms had access to the court yard which was great.  Absolutely beautiful stay, breakfast was decent but not the best but it is included in the price so why bother complain.  Only down side was the noisy air conditioner in the room, constant humming got to be very annoying after a few hours.  Washrooms are tight quarters and they should really have a soap dish in there not to have to leave the soap on the ground. Reception staff was quite nice and spoke english fluently.  Would stay and recommend this hotel to others.  Awesome local restaurant at the corner of the street called La Pentola dell'oro!", "date": "July 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r19268721", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Some Kind of Wonderful", "review": "This hotel as noted by others is away from the maddening crowd. I found the steet that it is on tho a little shabby and the immediate area is of no interest at all.   We booked a double superior and were suprised to find no elevator.  As we climbed the stairs (63 steps) to our room I was ready to go to management to change it.  But once inside we were very happy with a HUGE loft style room with big balcony, 2 bathrooms, one with jacuzzi, the other shower, and views of florence from two sides. The furnishings were a little threadbear, and the service of the room only ok, turndown happended about 2 hours after the bed was made and soap and towels were forgotten 2 out of 5 days. Breakfast is served in a nice courtyard and was more than continental, with bacon and other hot meats.…", "date": "July 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r18102301", "sub_review": {"Value": 4, "Location": 5, "Check in / front desk": 4, "Rooms": 5, "Cleanliness": 3, "Service": 4}, "travel_purpose": "", "rating": 5}, {"title": "Not as great as we'd hoped", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "February 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r17186863", "sub_review": {"Value": 2, "Location": 1, "Check in / front desk": 3, "Rooms": 2, "Cleanliness": 3, "Service": 2, "Business service (e.g., internet access)": 1}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Away from the crowds", "review": "The bedroom was ok. The bed fairly comfortable but bedding a bit shabby. There were no tea/coffee facilities in the bedroom and nowhere to relax apart from on the bed. The room was dark. The bathroom was the highlight of the accommodation with a huge bath and cascading shower. The breakfasts were absolutely shocking for the standard of accommodation. Stale bread rolls and pastries, dubious looking scrambled egg every other day. Yoghurts and cheese (?!). Bad coffee which was disappointing given we were in Italy. We wouldn't go back!", "date": "February 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r13991220", "sub_review": {"Value": 4, "Location": 3, "Check in / front desk": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4, "Business service (e.g., internet access)": 1}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Cute and cosy", "review": "My Mum and I stayed at this hotel in February. We booked a junior suite using lastminute.com.  We arrived at the hotel at 8pm and were taken to our room. We were initially given a very large room on the ground floor (no.11 I think). The bathroom was very large and recently modernised (all marble fittings and very nice). Unfortunately, after staying one night in this room we had to be moved as the heating did not work. The following day we were given another room which was also a junior suite with a mezzanine. The mezzanine had room for a double and one single bed (see photos) and downstairs there was a small lounge and bathroom. Again, the bathroom had been recently modernised and was very nice.  We found the hotel staff to be very helpful and the breakfast was fine although a…", "date": "March 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r13306517", "sub_review": {"Value": 4, "Location": 4, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "The perfect place for lovers...", "review": "Our third stop in Italy was Florence. We once again chose this hotel after reading reviews from TripAdvisor members.  The quaint, cosy setting particularly appealed to us. We had booked  a double deluxe room and were upgraded to a Jnr Suite. The room had all the charm we had been hoping for. A cosy loft style bedroom and ample lounge area downstairs. The bathroom was finished in stone and was a perfect, homely feeling hotel.  The hotel was only a short walk from the Duomo with supermarkets located  close by also.  The dining area was small and personal, with a common area with comfortable lounges and reading material for a quiet moment between seeing Florence's wonderful sites.  Highly recommend this hotel to any travelers passing though Florence!", "date": "January 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r13037525", "sub_review": {"Value": 5, "Location": 4, "Check in / front desk": 4, "Rooms": 5, "Cleanliness": 3, "Service": 3, "Business service (e.g., internet access)": 2}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "This little jewel in Florence has style", "review": "After a long search between charming hotels in Florence, my choice was at J AND J... My bet was won! Since the hotel is a real jewel of Florence.. It's like discover a secret place.. you'll never imagine that in that street you'll find a place like this! The 19 rooms are all different one to the other since the hotel was a medieval coventry once.. The suites are enormous.. we slept in room N° 5 which was a deluxe and I really suggest it because it's special.. there is also a bathtube at the side of the giant bed! The only disappointment was the breakfast.. too small for a 4**** hotel.. Also the foreign service could be better...", "date": "August 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r10087734", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely stay at the J and J Hotel", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "February 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r8700722", "sub_review": {"Value": 5, "Location": 4, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Intimate,Far from the madding crowd", "review": "This is a great little gem of the beaten track. All the attractions of Florence are within a 15mins walk and it feels less busy than in the centre of town where most of the hotels are located.  Looks and feels like a Boutique hotel with a little seating area in the front and the breakfast room overlooking a lovely courtyard. Staff were extremely helpful. I ordered a bouquet of roses for my partner to be in the room on arrival and they turned out to be the largest long stemmed red roses I had ever seen. Staff also made great restaurant recommendation. One evening we dined in a small restaurant in a part of town where most tourist wouldn't go. I must say it was one of the best meals we ever had with the antipasto platter being freshly prepared in front of us. The room we stayed in…", "date": "August 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r8607680", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Best secret in Florence", "review": "After extensive searching for the perfect hotel in Florence, we found this intimate well located hotel, filled with charm and character which matched our needs. Situated in East Florence, the J&J is away from the hustle and bustle of the madding crowds, but within 5 to 20 mins walk of all the main tourist attractions and restaurants. The rooms are individually decorated and the air-conditioning is a must in the summer months. Be warned about the mosquitoes which are ubiquitous throughout Florence, and ensure that the plug-in insect repellent the hotel provides is on throughout the day. The breakfast is a little bit repetitive but the traveller must decide what their priorities are... (Ours certainly wasn't breakfast!) The hotel is within easy reach of rustic trattorias and for…", "date": "June 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r7802534", "sub_review": {"Value": 5, "Location": 4, "Check in / front desk": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5, "Business service (e.g., internet access)": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Hated the j and j", "review": "You will absolutely love this renovated convent in the heart of Florence. The rooms are fabulous and the staff couldn't be more gracious. The hotel is int the middle of all of the sights on a small street that oozes history and makes you feel as though you are in the middle of the 12th century.  Absolutely would recommend this for anyone wishing to have a great taste of Florence. ", "date": "April 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r7544199", "sub_review": {"Value": 1, "Location": 4, "Check in / front desk": 3, "Rooms": 1, "Cleanliness": 1, "Service": 4, "Business service (e.g., internet access)": 4}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Paid for it, but didn't get to stay there", "review": "Selected it because of the high rating of the Michelin guide.  It was a big disappointment. Rooms are poor, not clean, shabby furniture, unpleasant bathrooms.  The staff was ok. They showed us several rooms since the hotel was quite empty. All looked poor.  Breakfast was a disgrace. A buffet full of nothing. Unbelievable how poor it was. We visited Florence many times and plan to visit it again. Will never stay at this hotel. ", "date": "September 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r6008323", "sub_review": {"Value": 1, "Location": 2, "Check in / front desk": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Charming and friendly", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "May 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r5932023", "sub_review": {"Value": 4, "Location": 4, "Check in / front desk": 4, "Rooms": 2, "Cleanliness": 4, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "pros and cons for this hotel", "review": "My wife and I stayed here for 4 nights on our honeymoon.  The place is described as being an old convent and it oozes the charm of old Florence.  The staff are friendly and excellent; all speak English and the front desk staff do so very well.  The warm buffet breakfast is alright.  Our room, I think, was not one of their best: narrow, extremely high-ceilinged with a not-so comfortable bed.  The bathroom was very nicely done: clean, sleek, modern, and roomy.  The neighborhood is authentically Florentine, set away from the big tourist draws but close enough to walk to them easily.  Nearby are plenty of non-touristy restaurants chock-full of real Florentines.  The price was right for a piece of old Florence. ", "date": "June 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r5353587", "sub_review": {"Value": 3, "Rooms": 2, "Cleanliness": 2, "Service": 3}, "travel_purpose": "", "rating": 2}, {"title": "Wonderful experience with the J&J!!", "review": "We had a large family suite here which though very roomy with nice bathroom was a bit on the musty side.The carpets looked as if they have been there for many, many years and were very dirty.The big problem was we were eaten alive by mosquitos during the night ! On the plus side...nice staff and good location on a quiet, convenient street. ", "date": "April 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r5299960", "sub_review": {"Value": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Don't accept Room 1", "review": "I was so surprised to read negative reviews of the J&J.  I was somewhat nervous about staying here due to the paucity of reviews available, but was drawn in by the website and my pre-booking contact (via e-mail) with the staff.  We had such a wonderful experience with the hotel and every person with whom we dealt (especially Deepak - he deserves a raise!).  The J&J is located on a quiet street, yet close to pretty much everything.  We were able to walk virtually everywhere in Florence that we wanted to go.    We were a group of 7, and had 3 rooms, all double deluxe.  We found our rooms to be reasonably sized and loved the updated bathrooms.  The only tiniest bit of a complaint about our rooms would be the somewhat dim lighting in the bathroom.  Not a big deal.      The common…", "date": "May 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r5188853", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Absolutely Awful!", "review": "The communal areas of this hotel are as in the website pictures - very attractively decorated and furnished. The service is friendly and the general location is good.   However, we were allocated Room 1 which was not a room whose pictures appear on the website. The bedroom is on a Mezzanine balcony within the room which has the attraction of being unsual but is accessed by a very narrow stone spiral stairway which is definitely not to be negotiated after a bottle of Chianti. The TV is upstairs in the bedroom rather than downstairs in the sitting area. But the biggest problem is that this ground floor room looks out on to the communal courtyard and the breakfast room. This means that it is impossible to open the curtains because of privacy and hence the room gets no natural…", "date": "May 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r5057908", "sub_review": {"Value": 1, "Rooms": 2, "Cleanliness": 1, "Service": 1}, "travel_purpose": "", "rating": 1}, {"title": "Florence at its Best", "review": "Stop and stare at the beauty and symmetry of the Basilica of Santa Croce any time day or night. Unraveling around it are a number of architectural and artistic masterpieces, from the Synagogue to the Central National Library. As a hub for young people, the area gets busy with people who want to have fun: a continuous flow of tourists and locals become animated by songs and dances.", "date": "April 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r4997317", "sub_review": {"Value": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Super city centre hotel", "review": "The rooms are just as the pictures show.  The room and furniture are all wonderful.  I didn't know what to do with all the space.  The bathroom was almost half the size of the room.  I would recommed staying here.  Close to all the attractions.  Very close to great restaurants too. ", "date": "January 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d191163-r4371200", "sub_review": {"Value": 3, "Rooms": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "", "rating": 5}]