[{"title": "Lovely and feel like home.", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "November 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r727656524", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Perfect Location to explore Old Istanbul. Clean", "review": "Simply lobed it !!!! Out side view to high street  Back side view to sea side If you stay there u don't need taxi to move around almost all attractions are by walking distance.so stay smartin budget :) What a lovely place to live, Staf is extremely helpful and kind. Breakfast was excellent. Simple and kind. P.s : If y ever need to go to Izmir by tain  Plz have a look as it explains you how to take ferry and tgen way to train. Thanks for everyone in the hotel wo really made us feel like home.", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r719965733", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "nice place to stay", "review": "This hotel made our Istanbul stay perfect. Our first hotel, was too much of a walk and would have involved taxi's and sore feet getting to our locations. This hotel was minutes away from all the main tourist spots and a short walk to the tram station. Ozkan welcomed my family to the hotel and organised a connecting room for us. We would not hesitate to return to this hotel and would recommend it to anyone. Breakfast was simple but sufficient with great rooftop views. This is a simple hotel, but clean, friendly atmosphere and a perfect location to explore Istanbul", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r691395675", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Standard place to stay, central, clean", "review": "After the 2 awful hotels finally we found a normal one where we can stay. It has a nice view on the top where we had our breakfast. Nice guys at the reception who speaks several languages.  It was clean and closed to the downtown", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r672426566", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Nice hotel", "review": "Quite a clean place, a bit cramped but central within walking distance to most of the tourist sites. Very good breakfast on the rooftop with a beautiful view. Like most family run places, there is some personal touch. Team rather helpful and accommodating", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r635649022", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Very good", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r577478258", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Very good", "review": "I reserved 5 nights the stuff are so gentle so good the person at entrance is very kind he does everything to make clients happy with the stay. Location is amazing close to all tourist places I highly recommend this hotel ", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r569473680", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Friendly staff, great breakfast", "review": "I would like to thank you for taking the time to write a review about your most recent stay at our hotel.  I am happy to be acknowledged that you had a very good stay with us and you appreciate your experience.   I have also shared your very kind comments with my staff in order to make all our colleagues pleased about your feedback.   We are looking forward to seeing you at our hotel again in the near future. ✨  Best Regards,", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r569328794", "sub_review": {"Value": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "DIRTY ROOM, avoid this hotel", "review": "Excellent location, most of attractions are on walking distance. Beautiful city and nice food in local shops. Trams are best for travelling to far places. Best weather is in start of April. Not too hot and not too cold. Emiregan gardens, Topeka pi palace, grand bazar, Bosporus trip, Galata tower, taksim square ( shopping malls), spice market and galata bridge are the must places to visit.", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r566271559", "sub_review": {"Value": 2, "Sleep Quality": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Thank you", "review": "I would like to thank you for taking the time to write a review about your most recent stay at our hotel.  I am happy to be acknowledged that you had a very good stay with us and you appreciate your experience.   I have also shared your very kind comments with my staff in order to make all our colleagues pleased about your feedback.   We are looking forward to seeing you at our hotel again in the near future. ✨  Best Regards,", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r559329529", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great Place! ", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "December 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r553169230", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Great location and nice people but..", "review": "We loved it! It's run by a family and even the employees are treated like family, and in turn, they ALL treat you like family! We loved it and we absolutely missed it when we had to leave! We called one of them from the airport as we needed help to get there and they were super helpful! Definitely going back there! ", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r534902027", "sub_review": {}, "travel_purpose": "", "rating": 2}, {"title": "Good staff, bad room", "review": "Hello Piumie! Thank you for choosing our hotel, and for taking the time to write a review. We look forward to welcoming you back to our hotel in the future. Best Regards", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r483594427", "sub_review": {"Sleep Quality": 3, "Rooms": 1, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 2}, {"title": " Great Hotel", "review": "...sadly, I don’t think I’d stay here again.   Firstly, we had booked a standard room, which from the photos shows a table and chairs and a larger room but I think we were put in an economy room (London room). We arrived at 2pm and the room wasn’t ready despite check-in starting at 1pm.   There was also no fridge meaning we couldn’t store our water bottles. The TV didn’t work properly either, which was fine as we didn’t really need it, but still should have been working.  The AC took a long time to reach a basic level of cool, which again for this time of year was fine but I don’t think anyone could cope with the level in the hotter seasons.   The room itself is pretty basic, which was expected. However, the wardrobe sliding doors didn’t work properly. There was also no bin in…", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r479815759", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "average", "review": "Have spent 4 nights there. I should say that hotel itself deserves 1 for rooms and 10 for staff. Entrance to hotel surprises a lot - little metal stair, similar as ladder in auto service, glass door with sliding mechanism, driven manually, but glass handle has sharp edges (have cut my finger once).  Room was dirty, dusty (lot of dust on the lamps, under carpets, under bed - terrible for allergic, going further, the bra above bed was not fixed to the wall, and was hanged on the wire! WC was leaking, and producing permanent noise. Towel were totally worn out.  Breakfast was pretty good. Staff is only asset of that place - young man on the \"reception\", which is table with computer was very helpful and kind (there are two young men and two tables, I mean not the guy who sitting…", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r444129646", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Central Location", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r421711544", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Wonderful location and amazing staff!", "review": "This was a very nice hotel that balanced affordability and location. We were never more than a few minutes away from anywhere we wanted to go, and there are a ton of taxis in the area if you're looking to explore.  The room was a bit dated, but comfortable; however, the bathroom needed a deep clean very badly. The cups they provided to brush our teeth still had a significant amount to of residue at the bottom, which we solved by just not using them! They offered a delicious breakfast though, which was the highlight of our stay.  Overall, we very much enjoyed our stay. ", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r404556658", "sub_review": {"Value": 4, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Very nice hotel in Istanbul", "review": "We had an early flight which ended up in us arriving at 6 a.m at the hotel, much earlier than our check-in time of 1 p.m. It was a family trip and the staff didn't hesitate to lead us to our rooms right away! No extra charge.  Breakfast was fair. If you are picky then not exactly for you. The hotel offers a variety of different types of cheese, bread, boiled eggs or omelet, fruits, as well as tea and juice for drinks. AMAZING VIEW AT BREAKFAST. Simply lovely and you can either sit outside, or inside. The location is perfect, 5 min walk to the blue mosque and Ayasofia. Our rooms were big, however the mini fridge did not work and some black dry fragments fell from the AC. We did not complain about it, however I am sure that they would have accommodate us if we had. They are very…", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r381108616", "sub_review": {"Value": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Ideal for a quick tourist or business trip", "review": "Lovely hotel near Blue Mosque and SultanAhmed. The owner is very nice and always eager to help. The room was clean and with a nice view to Bosphorus (Warshaw room alt 2nd floor). For sure we will reccommend this hotel to our friends and we will come back soon ;) The breakfast was very good, with a nice view over the sea.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r373368372", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Location Location Location", "review": "I would like to thank you for taking the time to write a review about your most recent stay at our hotel.  I am happy to be acknowledged that you had a very good stay with us and you appreciate your experience.   I have also shared your very kind comments with my staff in order to make all our colleagues pleased about your feedback.   We are looking forward to seeing you at our hotel again in the near future. ✨  Best Regards,", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r353690564", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Worth every dollar/euro/lira", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r325869854", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Perfect location ", "review": "The location was the biggest highlight. The hotel is close to all the big attactions, right in the center of the city so plenty of shops, restaurants, and bars to visit. The public transport under 10 min walk. My room was small but had more than enough room to put my stuff, sleep, and venture out. Full size comfortable bed, plenty of closet space for luggage and a shower in the bathroom. Tv mounted on the wall with english channels. Wifi was free and worked well. There was a good selection for the free breakfast. Old style decor and furniture but clean (room cleaned everyday). They even provided free slippers with the towels. Air conditioning in every room and big windows to let the air in. The staff was super helpful! They set up airport pick up and drop off at a rate much…", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r325608009", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "You get what you pay for - 10* experience at this small b&b", "review": "Only few minutes away from the Blue Mosque and Hagia Sophia.  Rooms are small but very clean, breakfast was brilliant with lots of choices . We stayed for 4 nights and we are planning to come back. If you are looking for a place to stay in Istanbul this is the one. ", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r323567611", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Perfect location", "review": "Don't be fooled by 4* hotel, it's a lovely, economical bed and breakfast, not a luxury hotel with all the mod cons, but we LOVED it, cannot recommend enough as an excellent base to explore Istanbul from.  Rooms - (you get what you pay for, we loved it, no complaints as we were there to sleep in the room only, not spend lots of time there, but here are the things we noticed) - AC works but noisy. Walls very thin, can hear neighbours and noises from restaurant above if on second floor. Very clean overall, excellent shower facilities in room, hot water with good pressure, safe and mini fridge, cupboard space, mirrors, kettle, coffee, tea, mugs and wine glasses, no spoon to mix sugar with though... Warschau room (2nd floor), double bed, very small but very comfy. Double doors lead…", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r321896140", "sub_review": {"Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "excellent location  and team that wants to help 24 hours a day", "review": "Hotel staff was happy to organise pick up from airport, organised by e-mail before arrival and helped us with transfer back, too. Superb location everything is nearby in Sultanahmed area and easy to hop on to tram to go to the other side or with a light walk to reach ferry station for Asian or European side. Hotel was clean and pleasant. Breakfast was Turkish selection but very nice.  One of the staff was absolutely amazing, kind polite and helpful. Others weren't like that but were still OK. Lovely area and all was fine. I would recommend it. If only the rest of staff were a little bit more friendly (they were not impolite), it would well worth the 5 stars.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r320184646", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Lovely area", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r319261335", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Linda London", "review": "Spent 3 nights here. Lively street/area one block from Hagia S and Blue Mosque. Sultanahmed closest tramstop. Great restaurants to choose from outside hotel. Had a triple room but were 2 and its just right in size for 2 people. Had room \"Sydney\" at back which was quiet. Breakfast was good with a lovely view over the Bosphorus. Friendly and attentive guy at reception. Had a pleasent stay and would return to this establishment.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r310538283", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Excellent Hotel & Location", "review": "I went recently in September 2015 and stayed in broken column hotel in sultanahmet. I had an amazing stay, the hotel is close to the main sites: blue mosque, Hagia Sophia, top capi. A tram close by and can take you to key places...Imununo, kabatas, etc......and plenty of restaurants: expensive and affordable ones. The hotel is clean, the breakfast is varied and people working there very helpful. However, Hakan working at reception speaks perfect English and provides help whenever you need it. The whole experience was amazing and would highly recomend it. Special thanks to Hakan for the help during my stay.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r309006386", "sub_review": {"Value": 4, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Nice but not luxurius", "review": "Stayed two nights here on a stopover to Tbilisi from Scotland, as requested the arranged Taxi picked us up at the Airport and we were at the Hotel in about 40 minutes. Fast check-in and good welcome at the Hotel, we booked two single rooms and I was lucky enough to get a room with both a double and single bed, the room was quite large and spotlessly clean. Breakfast in the morning was good with a good selection to chose from, coffee was very good, great views from the roof top restaurant as well. Lots of Restaurants and bars in the area as well as many tourist attractions.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r308089533", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Friendly,Clean and Convenient", "review": "This hotel was the best we could find. Most of the others were either overpriced or very bad. Everything is new inside and of good taste. The location is perfect for tourists. Free wifi on good speed. Has a safe. The receptionist was a very nice guy and friendly. The cons are the fact that the reception is actually next to a touristic shop. The sink in the bathroom was tiny. The quality of the materials inside was low. We found it very hard to make oursefves up cause the mirrors and lights were placed in bad locations. And finally and most importantly, they use a thin blacket for a cover instead of sheet which was inconvenient due to the heat and also we stayed 4 nights and they didn't change this blanket. I hope they changed from the previous guests! I'll take the opportunity…", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r295389329", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good place to stay in the very center", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "January 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r294838798", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Location, Location, Location", "review": "Nice rooftop terrace. Clean rooms. Very welcoming staff. Superb location! Hot water, hairdryer, soft pillows :) The rooms looking inner yard are more comfortable for sleeping, as the rooms with the street view are illuminated by the acid-blue facade backlighting.              ", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r294038846", "sub_review": {"Sleep Quality": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great for a quick visit", "review": "I have stayed twice at the Hotel. Both times I had arrived by 8 am and although I was unable to check into my room, I was invited to leave my bags and have breakfast on the terrace. After 15 hours of traveling, that is very welcome. The terrace view is truly amazing and in the mornings you can enjoy a quiet cappuccino, take advantage of the free WIFI and watch the cruise ships sail in. The rooms and baths are small but nice and clean. The location is wonderful being steps away from Aya Sophia, Blue Mosque, and a short walk to Topkapi, Grand Bazaar and other museums,  It is also maybe a 10 minute or less walk to the Sultanhamet tram station. We were able to get there from the airport with bags on the tram.  The price is very reasonable for American travelers because of the strong…", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r291466940", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Awesome location for a good price ", "review": "Excelent location and the staff is very helpful and kind. Located near the most important cultural and historical attractions and in na area with many restaurants, gift shops, etc. We can walk to anywhere.              ", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r290620026", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Good budget hotel in the heart of Istanbul", "review": "We knew we weren't going to be spending a lot of time at the hotel so we didn't want to shell out a ton of money just for a place to sleep, and after a lot of research (mostly browsing through trip advisor) I decided on this one. My main concerns were location, breakfast and cleanliness, all of which were met wonderfully by Hotel Broken Column.   I booked online through booking.com and got a sweet deal, would definitely recommend doing that rather than booking through them directly because the rates on their website are pricier.    Amazing location, walking distance from all the main attractions in the Sultanahmet  (Blue mosque, Hagia Sophia, Grand Bazaar) and the street itself was very lively with lots of restaurants and other hotels.   Breakfast was included with the room and…", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r289555827", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good value for money", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r289193070", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nice and comfortable", "review": "Nice staff that speak good english, exellent breakfast and beautiful view on sea, perfect location, good and free wi-fi... We would totally recomend it to all the travellers that want to go to Istanbul.               ", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r286318074", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Most helpful staff!", "review": "Had a realy nice time staying there. A great location, very comfortable rooms, nice interior, splendid view from the terrace, nice breakfast, variety of TV channels and very friendly staff, and all of that for a reasonable coast.   Отличное соотношение цена-качество: удобное расположение, приятный интерьер комнат, отличный вид с террасы, приятные завтраки, большой выбор ТВ-каналов, приветливый персонал.", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r283344397", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 3, "Rooms": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "fantastic staff and location!", "review": "This hotel is conveniently located in the middle of the historic part of Istanbul. From there you can walk to the Hagia Sophia or the Blue Mosque. Your choice of restaurants are on the same street making it very convenient. The breakfast room has an unbelievable view and the breakfast was very tasty as well. But the best thing about this hotel was the friendly and helpful staff. They were extremely nice and helpful. My husband and I would definitely stay there again.        ", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r282799076", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "LOVELY AREA / GREAT STAFF / GOOD VALUE", "review": "It is a small hotel in the old city centre. Walking distance from Hagia Sofia and the blue mosque. The included breakfast is served on the roof top terrace which overlooks the harbour - such a nice view. It is located on a small street with many cosy restaurants and shops.   The staff were so nice and helpful, we really had a wonderful stay there.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r280099803", "sub_review": {"Value": 4, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Good becouse of location.", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r274354503", "sub_review": {"Value": 3, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Well worth the money", "review": "The hotel is located in the area of Sultanahmet, all of the major attractions of the old town just a few dozen meters. We got a very small room on the ground floor - in a smaller room, I have never lived. In general clean but stuffy and very closely. Breakfast included, usual breakfast buffet on the system, but it is served on the terrace - there wonderful view of the Bosphorus, the city rooftops. In general, romantic. We never ordered dinner at the hotel, but sometimes buy own food and local wine, and brought to the hotel and you can eat on the terrace – it is great. Very nice staff, friendly. Offers a wealth of sightseeing. If you are in Istanbul for the first time - do not rush to buy them in the city can be found much cheaper. Oh, and do not rush to dinner in a restaurant…", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r269911810", "sub_review": {"Location": 4, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Loved this hotel!", "review": "A stay of 4 nights including breakfast Positives : Great Location Room has safe, fridge double bed and acceptable bathroom very Helpful staff Nice breakfast Negatives: Room could do with freshening up.  It was clean but was looking at bit worn in placesw. Overall Terrific value and would really recommend it if you are ona budget", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r268844967", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Nice hotel with good location", "review": "As a single women I was worried about where I would stay in Istanbul for 2 nights.  Broken Column was perfect. The area around the hotel is busy and felt safe.  The Blue Mosque is just around the corner as are other key sites.   The staff was very friendly (especially Hakan) and within a half hour of arriving he had booked a Bosphorus Cruise for me.  He also booked a full day tour for the next day so that I could maximize my time in Istanbul.  I would not hesitate to recommend this hotel.  My room and bathroom were small but it was fine and I was pleased with the cleanliness.", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r267387285", "sub_review": {"Value": 5, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "great customer service", "review": "A nice, clean and priceworthy hotel in perfect location in the old town close to all the \"must see\" sightseeingspots. Very helpfull staff that gladly recomend places to go based on your preferences.  It's not a luxiurous hotel but well worth the money and a good 4 points on a scale 1-5.", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r266009774", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "The best location a hotel could offer!", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r265263838", "sub_review": {"Location": 5, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great location, friendly staff, comfortable hotel", "review": "We stayed at this hotel at the end of March this year for about a week, and it was great! Located just by the side of Blue Mosque, it takes only a two minute walk from the hotel to land you up in the main Sultanahmet Square, in the garden squeezed between Blue Mosque and Aya Sofiya. From this hotel all the main sightseeing areas are in walking distance. The staff is super friendly and special mention goes to Mr.Hakan who never misses to give you a warm greeting. The rooms are moderately small but very clean, comfortable and nicely decorated. The hotel provides a pretty strong Wi-fi, the breakfast is very good and you can have a wonderful view of the Bosphorus from the breakfast hall which is on the terrace, while you sit back and enjoy your meal. From some of the rooms you can…", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r263419225", "sub_review": {"Sleep Quality": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great hotel in a great location.", "review": "I would be happy to recommend this small hotel to anyone visiting Istanbul's historic peninsula. The hotel has everything needed for a short visit, including a good local breakfast and the staff are friendly and helpful.", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r262479211", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Great Place to Stay!", "review": "Super friendly staff. Great location 2 minutes from the Blue Mosque. Very comfortable rooms, very clean, and a nice breakfast spread. I'm definitely looking forward to staying here again the next time I visit Istanbul.", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r261354367", "sub_review": {"Sleep Quality": 4, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Excellent location and full comfort", "review": "The staff at Hotel Broken Column is wonderful. Everyone is pleasant and helpful. Several of the front desk workers went beyond the call of duty to help us locate unusual things we wanted to do, assist with airline problems, and deal with a taxi driver who was trying to cheat us. The location is great--in the heart of the historic area, and just a few minutes walk from many of the key attractions. There are great restaurants less than a block away. Our rooms were pleasant and clean, the wi-fi worked well, and the breakfasts were varied and filling. We will be staying there again every time we are in Istanbul!", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r255040270", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Friendly staff, proximity to the historical center", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "January 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r251382995", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Thank you!", "review": "The hotel is small and clean. The staff is very helpful and friendly. The hotel provides very good wi-fi, if you need to work and is located 2 mins away from the most beautiful mosques in Istanbul. It is also close to palaces and nice restaurants.", "date": "November 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r241571417", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Perfect location and staff", "review": "This was my first visit to Turkey and I'm glad I stayed here. If you want to nice, quiet, reasonably priced place to stay in the middle of all the action, this is it! Hotel broken Column has a lovely breakfast buffet on the rooftop with a view of the Bosphorous. The service is wonderful, and you'll find shops, restaurants and landmarks all within walking distance. If you have not traveled to turkey before, this is an excellent part of Istanbul to visit.", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r238590928", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Excellent service!", "review": "For me and my friends this hotel is the perfect accomodation for istanbul visitators. It was the second time we stayed there and from year to year we are more happy to be a guest in their hotel. The staff is very nice and helpfull and you can always get help from them. The hotel is clean and nice, with a very nice view of Bosphorus. The breakfast has various sorts of food and the restaurant is on the roof of the hotel, wich offers the guest a very nice view in order to start a day in a perfect way. The best thing about it is the location, it's 2 minutes away from Blue Mosque and Aya Sofia Mosque and Sultanahamed area  (the old city is the main attraction for Istanbul). So we cannot wait to go back there again and enjoy a nice and fun vacation.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r236858561", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Amazing stay ", "review": "I stayed at this hotel during the month of September with my 2 cousins and have had a very pleasant experience. The staff make you feel like you're at home away from home. The hotel is very close by to the city centre and main attractions. The rooms are very clean and service is provided with no delay. The staff are very friendly and are always ready to help with whatever query or help needed. Great price for the amazing experience! Thank you to the staff for their quality service. Ilkay A.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r234054241", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Excellent!!", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r233851140", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Wonderful location, great place to stay", "review": "We stayed here in September-October for 2 weeks with my sister and this has been our fourth stay over the last 4 years. We have always had a very pleasant experience. Masallah, Hakan, Emre and the rest of the hotel staff are all incredibly kind, very helpful and attentive. Rooms are clean, spacious and with free wifi. Breakfast choices were good and the view of the terrace is priceless! They also have a restaurant as well and the food is good.  Location is great and just 2 minute walk to the Blue Mosque and is in close proximity to most sites. Walking distance to wonderful restaurants and shops. For those who want to use public transport it’s only a few minutes walk to the tram.   The benefit of staying at a smaller hotel is that the service is very personalized and this hotel…", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r233104591", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Jo London", "review": "Dear Esra,,  Thank you very much for your precious and nice comments. It is really nice and proud to hear that you are satisfied with your accommodation and services in our hotel.  It will be pleasure for us to welcome you for your next visit to Istanbul in the near future.   Kindest Regards,  Hakan TASTAN Front Office&Sales Manager", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r232249850", "sub_review": {"Location": 5, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Great place to stay for a short city break", "review": "We stayed at the Broken Column Hotel because it was so close to everything we wanted to see.  We were not disappointed.  The hotel staff was very friendly,  they even directed us to several reputable places where my husband could purchase a leather coat.  The view from the roof terrace at breakfast was outstanding.  It really started our trip off on the right note.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r231680333", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Great place for all", "review": "A group of seven of us booked the Broken Column Hotel because of the fantastic location in the Old City, the hotel had a roof terrace with a view of the sea, the Trip Advisor reviews were good and we liked the name!. The rooms were a bit on the small size but as we spent such little time in them it mattered little. The breakfast was substantial and the manager and the attention we received was courteous, obliging and informative. I would recommend the Hotel wholeheartedly and hope to be able to return someday!", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r230645280", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Great Location", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r229993301", "sub_review": {"Value": 5, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good for location!", "review": "The room we stayed in was on the small side but adequate for two people, I think it may have been to cosy with 3 people in there which is what the room was meant to take.The staff were great very friendly and helpful. Breakfast was very very good and the view from the breakfast room amazing .Would we stay again yes but in a bigger room. Only negative we had only three hanger in our wardrobe, but that's not the end of the world but could cause a problem if you stayed for a week we were only there 3 nights and managed. Overall great value for money.", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r217987874", "sub_review": {"Value": 2, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Perfect place for first time Istanbul visitor", "review": "The best part of this hotel would be the location. It is right behind the Blue Mosque and Aya Sophia. The restaurants on the street surrounding the hotel were decent. Although the rooms were equipped with AC it didn't work well. Our room was also located directly above the restaurant and the main street which were quite noisy. The biggest issue we had with the hotel was the fact you had to pay cash for everything. It was not always easy to find a bank to take our more Euro or Lira. The breakfast setting was over looking the Bospherous which is beautiful.", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r213410594", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "HORRIBLE service", "review": "We selected Broken Column Hotel as result of Trip Advisor reviews and because we just liked the name. We were delighted with our choice and stayed four nights in total. Perfect location for visiting all the old city sites as well as easy access to the tram for going further afield. Our room was very clean and comfortable and certainly good valure. It faced the street but this was not a problem as there was air conditioning and the windows are double glazed. We especially loved the upstairs terrace which overlooked the Sea of Marmara and breakfast consisted of all sorts of Turkish cheeses, eggs, meats, olives, breads, and fruit.  The very best thing about the Hotel for us had to be the friendliness of all the staff and especially the ever so helpful manager, Cengiz. He went out…", "date": "March 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r209382684", "sub_review": {"Value": 2, "Location": 3, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Breakfast with a view", "review": "We've checked in to hotel around 12 pm and they told us that room was available and we honestly liked it a lot! We left our luggage, locked our money and passports in the safe deposit box and left some stuff on top of the deposit box like medicine and other necessities. Since we've been in Istanbul already and did already sightseeing, so booked this hotel on our last two days after visiting Izmir before we go back home to just try it out.   We returned to hotel around 11 close to midnight to find out that THEY TRANSFERRED OUR THINGS to the other room without our consent ! They moved our luggage and just left our things at the safe deposit box and already other guest moved in our previous room! So we were very frustrated and had to wait till the morning to get our money,…", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r208683944", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "very nice stay in Istanbul", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r206637698", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Great location. Great staff", "review": "We were looking for a reasonable hotel that could accommodate our group of friends and  booked the Hotel Broken Column based on Trip Advisor reviews. I was really just looking for a location close to the Old City and a good price. We were totally thrilled with the hotel. The location was not just good but amazing! The street was filled with cafes, restaurants and shopping. It was a few blocks walk from  the Blue Mosque,  Aya Sophia, Topkopi. It was about 15 minute walk from the Grand Bazaar and the Spice Bazaar. It was also extremely walkable to the Sultanhamet Metro station from which you could get almost anywhere including the airport.   The rooms may have been a bit small and I never figured out the TV but those were totally minor issues.  Breakfast is included and is served…", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r206064738", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Very Nice Boutique Hotel in the heart of Sultanahmet", "review": "Booked sight unseen but very happy with this accommodation. Location cannot be beat. Very reasonable rates and staff offered very good suggestions for us. No elevator. Not recommended for mobility impaired but then neither is Istanbul", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r202017404", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Would choose it again and again when i am in Istanbul", "review": "This is a wonderful and fairly inexpensive boutique hotel in the heart of Sultanahmet. The Blue Mosque along with many attractions and restaurants are all within walking distance.  The staff, especially Cengiz spoke great english and was a wealth of information when it came to setting up tours or where to eat.  The rooms are nice, clean and a bit small, but we did not spend a whole lot of time in them. Front of the hotel, has a nice little sitting area where you can relax and watch people.  We would stay here again.  ", "date": "December 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r190171157", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Super!", "review": "Nicely Decorated, AWESOME HOSPITALITY , VERY Friendly , Beautiful, Clean Rooms and a breakfast with a fantastic VIEW. I would definitely choose this hotel again when i visit Istanbul.   Zorica, Macedonia", "date": "January 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r189787025", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "The Guest Service is Excellent but I'll still give 3.5 stars.", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "November 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r184643062", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Great location.", "review": "We were bought over by the reviews that Hotel Broken Column had a great breakfast spread and had great views of the Bosporus Sea from their Terrace and selected it because of this mainly.  Breakfast The variety in the breakfast spread would be considered great, if you stay 1 night or max 2 nights at the hotel. By our third morning, we didn't quite know what else to try. Every morning, the hotel would provide 3 hot dishes of which one would consistently change. The other two, i.e. the fried eggs and the fried bread with eggs (quiche like dish) was the same. There was about 12 different kinds of cheese, 5 different kinds of cold cuts and 3 types of breakfast cereal (cornflakes which the dispensing knob was broken and NOT replaced after 3 mornings), coco pops and muesli) and quite…", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r184400452", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Very clean and well maintained", "review": "Set in a pleasant street with other hotels and lots of choice of restaurants only moments from many of the main attractions in Sultanamet the location is great. The pleasant roof top terrace serves breakfast and has sea views. Friendly and helpful staff with info and advice on the city if needed.  Modern well equipped rooms. We had a large first floor overlooking the street below which wasnt too noisy.  My daughters room was on the ground floor and overlooked the back garden altho quieter outside there was some noise from reception/lounge.  We felt it was good value and everything you need for for a pleasant city stay.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r183954780", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "1 night but will stay again", "review": "Small hotel in excellent old city location, within 10-15 minute walk from all major sights – Blue Mosque, Hagia Sofia, Topkapi Palase. My room was charming and very clean with lovely décor and a comfortable bed. Every room has a name Paris, Moscow, London…, I found this very cleaver. The staff at this hotel is fantastic. They took the time to sit with me upon arrival, explaining everything about the hotel, the city and answering any questions I had. Breakfast room on the roof with terrace has excellent view.  Excellent service carried on through my entire stay right until the very moment they waved goodbye as my service car pulled out upon leaving.    I would highly recommend Broken Column Hotel to anyone visiting this unique city.", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r182917639", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Delayed Honeymoon", "review": "This is the second time I have stayed in the Sultanamet area of Istanbul, my last stay was at the Amiral Palace hotel around the corner from this one. In comparison the Hotel Broken Column was a bit cheaper, offered great customer service and comfortable clean rooms. The highlight is the roof terrace for breakfast which has a wonderful view of the Bosphorous.   Overall no complaints about a good hotel at a good price.", "date": "November 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r179383714", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely hotel, excellent staff", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r177090298", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 5, "Rooms": 3, "Cleanliness": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Good hotel", "review": "This was our first trip to Istanbul & it was amazing. The hotel is in an excellent location, within walking distance to the historical sites in Sultanahmet & many great restaurants. Travelling with an elderly parent, we had a few special requirements & the hotel staff were very accommodating. The reviews from fellow tripadvisors were very helpful in determining our choice, so I may repeat some of them here. The stair case was very steep. We asked for a ground floor room & from the reviews New York was the best option. It's big (we asked for 3 separate beds) & was overlooking the garden, so it was quiet in the evenings.  Breakfast was served in the terrace, with an excellent view of the Marmaris Sea. If you can't go up the stairs, breakfast would be served to your room.  The room…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r168793428", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Loved the country, the people & evrything!", "review": "We were in this hotel from the 10th to the 16th July 2013. Perfectly located between Santa Sophia and the Blue Mosque. The hotel is clean, the staff is amazing, the size of the room is quite good. Bathroom is perfect with new appliances. Breakfast on the terrace was abundant and the view was nice. Great value for price.", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r167994964", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "great location, friendly staff", "review": "Our 1st holiday in Istanbul and we loved the city :) The historical places to visit were amazing and travelling around was very easy. Although it was summer, the wind was cold enough to keep us cool all the time. After choosing several hotels in Istanbul, i chose broken column eventually. The hotel was very near to all the major attractions such as the blue mosque, topkapi palace, hagia sofia musuem and lots of eateries once you are down from your room. A very beautiful view of the marmara sea awaits u every morning at the breakfast area.Everyday our rooms are cleaned and towels are changed w/t fail. Our room had a french balcony which had a sea view. We had ample space in our standard double room but however no complimentry water bottles or coffee/tea making facilities in our…", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r165037178", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "great place to stay", "review": "We were two female friends visiting Istanbul for the first time. The first night I was on my own; the hotel manager was very helpful and friendly, and at no time did I feel anxious about being alone. The hotel is in a great location in Sultanahmet, especially for all the things that are good about Istanbul such as the Blue Mosque, Aya Sofya, Topkapi Palace and Grand Bazaar, all of which are within walking distance.  Our hotel room was compact and bijou but perfectly respectable and extremely clean. Initially we were disappointed not to have a view, but soon realised that this was more than made up for by its quiet location resulting in good sleeps! Would definitely stay again.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r162002790", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Comfortable", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r160136026", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great hospitality, great location", "review": "Our standard twin room on the 1st floor was nice and spacious and it had a safety box and a small refrigerator. The location was excellent, near all attractions with nice shops and several restaurants in the surroundings. The insulation between the room and the street was very good, but not quite satisfactory between the rooms. If you want to read by night you better bring your own torch as the light in the room was rather poor. This goes for the bathroom as well. I mirror in full size would also have been appreciated.  Spite of these inconveniencies we are happy to recommend this hotel and if going to Istanbul ever again we would gladly stay in this hotel.", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r157814008", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Home away from home in Sultanamet.", "review": "This is a fabulous little hotel in the best location, literally a 2 min walk to the Blue Mosque.  Its located on a lovely street with lots of lovely restaurants and a couple of bars.  This street is not the usual street you would find so close to the tourist attractions which are bustley, with bad overpriced restaurants, it really is one of the nicest streets I came across during my whole stay, very pretty restaurants serving good food, lovely atmosphere, not too busy (I was there Easter weekend), and reasonably priced, all literally on the door step of the hotel.  Cengiz, who I think was the manager, spoke very good English and could not do enough to help you.  One of the days was sunny, so he even set up a bed on the terrace so that I could lie out for a couple of hours and…", "date": "February 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r152873808", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "The hospitality cannot be beaten and the location is excellent", "review": "We stayed for four nights in the slow season. Very good value for money; nice clean room in a boutique style hotel right in the middke of the old town in Istanbul.  The staff were brilliant,  very friendly and helpful.  Beautiful views of the Bosphorous from the rooftop terrace, and a lovely Turkish breakfast served up every morning. Highly recommend this hotel.", "date": "January 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r151173571", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Could not fault it", "review": "I cannot compliment this hotel enough. Centrally located and within minutes walking distance from all the main attractions in Sultanahmet (1 min walk to the Blue Mosque using the shortcut!) The staff were very friendly and more than willing to go out of their way for us. The hotel is very clean and each of the rooms are named after a city instead of having room numbers.   The staff are very knowledgeable about the local attractions and assisted us in finding great deals on excursions and even helped book us in for a Hamam bath at an alternative place for half the price offered in the local Hamam!  We were always welcomed with tea on arrival which went down as a treat in a cold January especially on the days it snowed. Breakfast selection was very good considering the size of the…", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r150773508", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great location", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "December 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r150347340", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Charming hotel", "review": "Stayed here on for 4 nights recently and was more than happy with the hotel. Our double room was a little on the small size but clean and tidy with a great bathroom. Breakfast is on the roof terrace several floors up (no lift) and was more than adequate. The hotel's best feature though is its location, really close to the Hagia Sophia and blue mosque and is on a really nice street full of great bars and restaurants. Would certainly stay there again.", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r150285744", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Excellent location and very clean and comfortable", "review": "I was in Istanbul with my son in May 2012 and stayed in Broken Column for the location, really all great historical objects of sultanahmet with the few minutes walkdistance. Also the hotel is situated on the street with many nice restaurants and cafe ( for examle, one step from here is located oceans7 restaurant and cafe - i reccomend). We lived in triple room - very clean, beatiful, with new equipment, good beds, two windows ( the noise from the street is not problem if it closed) and small balcony - this room is named \"Istanbul\" . Breakfasts were standart like everywhere but fresh and good. Very comfortable that during all day and night you can drink hot tea at the lobby without additional money. If you didnt bring the laptop you can use the computer near reception - no…", "date": "December 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r150086393", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "super 4 night in hotel", "review": "We stayed here a few weeks back on the way to India, the hotel is set right slap bang in the middle of the old city and in the heart of the tourist attractions.  Check in was prompt and efficient and the guy carried our bags to the room,  the room itself was clean warn and had plenty hot water and fresh white towels.  The breakfast was a mix of continental and a hot and cold buffet with lashings of tea, coffee and fruit juices.  The hotel let us leave our bags in reception and organised a taxi for us for the airport.  If you are looking for an affordable comfortable stay in old Istanbul then book here.", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r142995292", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Perfect Stay in old town Istanbul", "review": "We was 2 adults + 2 infant in triple room and we had very nice holiday in this hotel. Helpful staff, nice brekfast, clean room. Super view in Terrace at brekfast time. Big thanks for Ahmed and Gulshen. Good management. Hope see you next year", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r142475725", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "i love that place", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r142410731", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great deal", "review": "The building is sweet and the beds are comfortable. The room was clean, the price very reasonable, and overall we enjoyed our stay very much.The staff are friendly warm and welcoming. The situation is perfect. The breakfasts are feasts of delight.i had an amazing stay at this great hotel", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r141840793", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Great location, lovely hotel", "review": "A year apart, I stayed twice in this hotel, one night each time.  The rooms were comparable  (impeccable, modern, awesome bathrooms, fully equipped).  A beautiful, bountiful buffet-like breakfast was served in the terrace (I stayed during summer), with a breathtaking view of the Bosphorus.  The lobby is not the most attractive section, especially since divided into two, but once you are in your room you have all comfort, not to mention the described terrace.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r141810979", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Excellent hotel", "review": "This is an interesting hotel!  It’s been open for around a year and half and is well located in Akbiyik Cadessi, just behind the Topkapi Palace.  The rooms are very tastefully decorated – handmade lamps with curling grapevine leaf features, and very comfy beds. The shower was the best we’d had on our entire trip and the bathroom is well appointed, although a bit cramped. For such a new hotel the room was showing some unexpected signs of wear and tear – it appears as though they’d had a leak at some point and the wall at the top of the window was quite badly marked.  There is almost no street noise in the rooms – the windows appear to be double-glazed which is a good feature, as the street is fairly busy with taxis and tour buses.  The hotel has now completed their roof top…", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r136855074", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "great location adn service", "review": "Our family had a great experience of Istanbul, thanks in part to this hotel. We felt welcome from the moment we arrived, before 7 am in the morning. We were invited to have coffee and tea on the magnificent roof-top terrace, given a room right away and invited to breakfast. The staff is friendly and helpful. The location is very convenient, close to all tourist attractions, yet you can rest comfortably in your room and and enjoy the piece and quiet and the great views from the terrace all day long. I would not hesitate to go back to the same hotel next time I am in Istanbul. I highly recommend it to anyone travelling as a tourist to Istanbul.", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r134587812", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Best location in Stamboul", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r134212687", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Best Hotel in Area", "review": "We spent 3 nights in June, best time before summer crowds. Room on 1st floor was small but whole hotel has been modernized. Great breakfast. Very helpful reception. Free wi-fi Enjoyed evening meal on roof-top terrace of building next door - terrific view!! Easy walking access to tourist attractions and waterfront bridges and ferries. Don't miss the old Orient Express Station & steam engine.", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r134106258", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great Hotel, great service, super location.", "review": "You get what you see , very nice new and clean. Good location , near Topkapi square. The stuff was great , no lift but it is not problem it is only 2 floors high.", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r133315638", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great place to stay", "review": "Just came back from Istanbul staying 10 days at Hotel Broken Column. This is our third visit to Istanbul staying at different hotels. This hotel was the best. Very nice, clean, super location. The triple room we had was spacious & luxurious. Plenty of space, the bathroom was good size too.  They just opened their roof terrace for breakfast and the view is breathtaking. They had a great selection of food for breakfast.  Traveling with two teenage girls, they loved it.  The staff are very kind, nice, courteous & very helpful.  Mr. Pasha, Taner and all the staff are very friendly & super nice.  You can walk from the hotel to the Arasta Bazar, Blue Mosque, Topkapki Palace and many other places. The Grand Bazar is about 15 mins walk or you can take the tram for 2 turkish liras from…", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r132074031", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great service, great location", "review": "We stayed here 4 nights and enjoyed it very much. It's in a great location - walking distance to all the sights. The rooms are spacious and luxurious, with interesting light fixtures and bed heads. The bathroom is modern and very clean. And the staff are great - very helpful, and speak English very well. Definitely will recommend this place to people visiting Istanbul.", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r131472807", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Nothing too much trouble", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r131030264", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Super hotel in a super location", "review": "Hotel Broken Column in situated in a fabulous part of Istanbul, right near the Blue Mosque, Hagia Sophia, Topkapi Palace and a vast array of restaurants. From the moment you arrive Pasha is very welcoming. I chose this hotel based on previous Trip Advisor comments and I was not disappointed with the service provided by Pasha. His English is excellent and he provides valuable advice from sights and culture to customs to where to eat. The rooms are not glamorous, but they are practical, roomy and spotlessly clean. It is everything you could want....but Pasha is the draw card and the reason I would recommend this hotel. ", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r130959586", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent hotel", "review": "This hotel is to be highly recommended. The rooms are spotless, the staff are friendly, polite and extremely knowledgeable. The location however is exceptional. Truly (not guide book speak) a stone's throw from the Blue Mosque, AyaSofia and Topkapi. The street is lined with cafes and  restaurants, but the hotel is quiet (great double glazing) and air conditioning too, so you always feel comfortable. I would definitely stay there again.", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r129815458", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Excellent hotel, excellent location", "review": "We really loved this hotel. It was in great location, the main attractions was within 5-10 minutes walk. The street where is a hotel was a really nice with a lot of restaurations, shops, really nice area not only in day but also in night. The hotel has great staff, our room for three persons was a really nice, size was enought for us, beautiful bathroom, comfortable beds, I think nothing wrong. Breakfast was good, you can have a coffee, tea, water all day for free. If I go to Istanbul again I would definitely stay in Hotel Broken Column.", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r129274344", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Excellent hotel in the heart of Sultanahmet", "review": "This hotel is the perfect place! Excellent location, a few minute walk to Sultanahmet, Ay-Sofia, Topkapi Palace. Great street with many restaurants and bars.  My single room there was of a decent size, quiet and comfortable, it was kept super clean at all times, safe deposit box, mini-bar and coffee and tea-making facilities. The free WiFi was both entirely reliable and fast. Hotel is 100% smoke free! A buffet breakfast with a good selection of a few hot and many cold options. However, what really makes this hotel is its exceptional customer service. Right from the outset, when I received a warm welcome, cup of tea and informative orientation chat on arrival, nothing was too much trouble for Pasa on the reception desk.  Masallah Bay and Orhan Bay is  two brothers and owners of…", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r128542830", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "GREAT PLACE TO STAY", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r126810792", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Fantastıc place,frıendly staff - excellent hotel", "review": "The location of this hotel could not be better if you want to stay in Sultanahmet.  All the staff are very friendly and soooo helpful.  Bulent, the main man on the reception, goes out of his way to be helpful and always has a smile on his face, no matter how silly your questions might be (or how many times you've asked the same question!).  The manager is also very pleasant and helpful as is the night time receptionist.  Some of the rooms have 3 beds in them which is fine if you are one or two people but 3 would make it very, very hard to manoeuvre. I had loads of luggage and Bulent went out of his way to give me a room where they and I would fit and also be able to move around with ease. All the back rooms have view over garden and next door's garden - front rooms over street. …", "date": "March 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r126320725", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great hotel!!!!", "review": "we stay ın the hotel Broken column four nıce days. The hotel was nıce, clear and bequem.  The place ıs fantastıc: near the hıstorıcal places (200m to Ayasofıa, Blue Mosque). From the roof terrace yuo can see Ayasofıa, Blue Mosque, and the Bosphorus, Asıa sıde,... The staff was very frıendly, helpful. The welcome ıs very frıendly - maxımal. They helped us ın every questıon: from to solve the problems wıth packets, to fınd good restaurants, to get good programmes, where to do the shoppıng, etc. The room was clear and the furnıture are new and modern. The lıghtıngs are wonderful. The bath ıs also good. The breakfast ıs good, we enjoyed the dıfferent sort of cheese and marmalade. All day there are good cafe and tea for free. We can recomed thıs place. The prıce-value ıs excellent.", "date": "December 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r121852263", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "excellent hotel", "review": "This is a fantastic hotel; the guys at the hotel are very friendly people, who were very nice and took good care of me in my 6 nights stay there. One of them (I forgot to ask for his name) took great efforts in helping me to arrange for my daily tours with a local travel agency within Sultanahmet. He even took the extra mile to show me around the heart of Sultanahmet on my first night in Istanbul. This hotel is also within walkable distance to many monuments/world heritage sites within Sultanahmet and to many eating places. Although the hotel room is small, but my room is always very clean, neat and nice. I will definitely stay in this hotel again in my future visits to Istanbul. Thank you guys! You made me stay in Istanbul great!!! :)", "date": "November 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r120728504", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Fantastic Place to Stay!!!!Same like your HOME!!!", "review": "I recently stayed at the Hotel Broken Column and was most impressed with both the standard of the hotel and the service and friendliness of the staff. It is a fairly new hotel well located in Sultanahmet area. The buffet breakfasts offer good choice and the facilities are very modern eg well appointed rooms, flat screen tv  etc  . The manager is very knowledgable and helpful regarding tourist attractions. Highly recommended. from ian - Adelaide", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r120136549", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "location, location", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r119291520", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 3, "Cleanliness": 3, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great Hotel", "review": "This small hotel is located on a busy street with many restaurants and shops in the Sultanahmet section of Istanbul.  Great location, 5 minutes to Blue Mosque (dont miss) and less than 10 to the Tram. We were routed to this hotel when the hotel we had reserved months before cancelled on us 2 days before our visit. The first room we had was too small for 2 people and opened right on the fire escape. They were fully booked but after 3 days we were moved to larger room on the ground floor.  Much better, but right on the lobby-breakfast room, so pretty noisy. While we were there it seemed they were housing groups (middle European) who did not seem aware that they were overly noisy, even late at night.  Management needs to be more diligent about stopping the noise. The staff was…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r118763503", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "disappointed", "review": "Only one complaint about this hotel the front windows are open at all times and it is so cold, cannot sit comfortable while I have my tea and read, also when they are open you can hear so much noise with cars, street cleaners traffic, etc. I notice when they are closed it is quiet and peaceful. Other then that everything is excellent, hotel staff very courteous and extremely helpful, they go out of their way to make you feel comfortable and at home.", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r118619726", "sub_review": {"Value": 2, "Location": 5, "Sleep Quality": 2, "Rooms": 3, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Make this your hotel", "review": "After so many positive reviews written on this hotel I was really disappointed. I visit Istanbul every year and this hotel didn't meet my expectations at all. We booked three rooms and two of them were really small with a very small bed. One room was even in the basement. The shower head in our bathroom was broken and the room in general was not so clean. Every morning we heard all the guest leaving from their rooms because of loud banging doors. Althought you can book a single room or a double room on different websites, there is just one type of a room. The breakfast was poor as well. Every day the same bread, salty cheese, ham, yoghurt and few fruits. They don't even serve any cake. If you come later than nine o'clock there is nearly nothing left to eat. After the hotel staff…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r118537096", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Well-located, friendly, lovely terrace", "review": "Good value hotel.  Absolutely ideally located.  Close to main sights.  Nice road .  Pleasant near environment with bars, eating places, busy enough but relaxed feel.  A welcoming hotel .  Very friendly and helpful staff but wonderfully relaxed with it.  That's probably one of my strongest recollections.  Clean and well kept place everywhere including bed, bathroom etc.    Sitting outside on the table at the roadside eating our breakfast was a really nice touch.  You can't get this honest atmosphere in many places.   Fabulous views of the Bosphorus from the (underused) roof terrace.  Bring a beer or glass of wine up with you.  Our room - Madrid - was rather small and cramped but we saw (when others were being cleaned) that others had a little more space.  They're not quite as in…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r118111703", "sub_review": {"Value": 4, "Location": 5, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Absolutely fantastic hotel!", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r116608341", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "The best place ever", "review": "Loved this hotel!!  The aesthetics are excellent - it is very bright and modern and the location is unbeatable.  It is near all the major attractions which is great for being able to drop off your stuff or take an air conditioning break.  The streets around the hotel also have some great restaurants and are always busy so I felt completely safe at night.  My room was very clean and comfortable.  It has quiet air conditioning for sleeping and satellite tv with a ton of channels - you can choose between big bang theory or conan and the best part is no commercials:).  I did not meet one unkind person at this hotel, the staff is outstanding. They are so friendly and will go out of their way to help you in anyway possible, amazing people!  Highly recommended!", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r116088750", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "The best value for money hotel", "review": "Best location,room-very clean and modern,5 star service from the staff, the breakfast was excellent.Thank you to everyone for making our stay so wonderful esp. to Buljan.", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r115236209", "sub_review": {"Value": 5, "Sleep Quality": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "The best location", "review": "This hotel is located just 5min (walking distance) from main attractions, has very spacious & clean rooms which are better than many 4 & 5 star hotels. The staff is very friendly and helpful. I highly recommend it!", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r113958727", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "It was awesome place to stay", "review": "Hotel was in a great location close to Sultanahmet tramway near many restaurants. The surrounding area was lively and had lot's of character but the main plus of the Hotel were the staff. They are incredibly friendly and willing to bend over backwards to help. They know the local area well and are happy to point you in the right direction. more than that they are great people and i've been happy to chat away with them. Top blokes.", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r113590246", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Will definately go back", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r112032008", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Ticks all the boxes", "review": "The Management and staff was excellent. Assisted us in whatever we requested. The room was fairly new and very comfortable. Not huge but adequate for the needs of a couple. The breakfast was good and healthy.  The location excelent if you want to see the sites such as the Blue mosque, Hagi Sopia and Topkapi Museum. Also surrounded by plenty of restaurants and small markets.  The internet is available in the foyer if you do not have  laptop. There is nothing we dislikesd and will go back should we return to Istanabul. They kept some of our luggage in store whilst we went on a tour of turkey.  Found them extremely hospitable. Ahmed and Mashallah your the best.", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r109095187", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Modern place in the Old City", "review": "Planned to stay 1 night but added another 2!  Greeted by warm, friendly and genuine staff.  The room was spotless and very modern!  Beds and linen were very comfortable and showers were as hot as you like. It was great value for money and I'd recommended it in a heartbeat.", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r108697397", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Excellent value hotel", "review": "We loved staying in the Broken Column Hotel, which is located in the heart of the Old Istanbul. This hotel is so new and modern looking. We stayed there for 3 nights and had a great experience. Mr. Massalah helped us with arranging transportation from the airport and even though our flight was delayed twice - he still send someone to pick us up. One day we had a meeting in the hotel and we were nicely surprised by the hot tea we were served at no cost.  Mr. Massalah, thank you for your wonderful service. We are looking forward to staying in your hotel in the future.  Please check hotel's website: www.hotelbrokencolumn.com", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2015190-r104095644", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}]