[{"title": "Good for a short Stay", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r725517110", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very Nice Hotel but Not Near Sites", "review": "Centrally located clean and very accommodating! The buffet breakfast was plentiful with many choices! The staff was very friendly and spoke English which made it much easier to obtain directions and recommendations! ", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r725201505", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Stayed here during the Florence Move chess tournament, amazing housekeeping staff", "review": "The hotel is very nice and clean.  The lobby bar and area are welcoming, especially the automated massage chair for guest use.  The only draw back is it is about a 20-25 minute walk to the city sites.  There are many restaurants very close to the hotel.", "date": "November 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r723538389", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Perfect for our stay", "review": "The annual Florence Move chess tournament was held here from 1st-3rd November 2019 and players got a special rate for a room and breakfast. I had a junior suite on the 4th floor with a wooden floor, approximately 27 square metres but it felt a bit small and wasn't as spacious as it looked in the management photos. There wasn't enough space between the bed and the desk and it was a tight squeeze when sitting on the chair at the desk.  There was a huge couch with lots of cushions and on that side of the bed there was plenty of space but the TV on the wall opposite the bed didn't rotate to face the couch and the remote control was difficult to activate from the couch. The bed had two single mattresses with a mattress topper but I still noticed them and would have preferred one large mattress. However, the bed was very comfortable and so were the pillows. The wardrobe had two parts, one with hangers and the other with shelves, a safe and the minibar which had a nice selection of drinks and you get two free bottles of water every day. The Wifi worked very well throughout the hotel.  There were no individual toiletries in the bathroom which had no shelf space except for a small ledge under the mirror, just a dispenser of liquid soap and shampoo. The shampoo wasn't the best and I had to wash my long hair twice in two days. When using the bidet I had to go over to the soap dispenser first to get some liquid soap. There was a shower cap and a vanity set with cotton pads, Q tips and an emery board. There was no body lotion.  Some people complained about the noise but I didn't notice much noise.  There is a small gym in the basement with a bike, treadmill, stepper, multistation, benches and barbells which is fine for a workout.  The breakfast was alright but I hated the sugary juices and you had to pay extra if you wanted a freshly squeezed juice.  I had dinner and lunch at the hotel restaurant in the lobby and it was just alright, nothing special and the Caesar's salad with chicken for €10 was smothered in mayonnaise and not a real Caesar's salad dressing. It also just had a few slices of cheese on top instead of grated parmesan. There are some restaurants nearby either on the other side of the street towards the centre or turn right out of the hotel and walk to Via Il Prato where there are quite a few along with a laundrette and a Carrefour Express.  When you go out of the hotel turn right to go to the tram station for Tram 1 and get on on the same side as the hotel and the Torre della Serpe to go into the town centre. It's one stop to the end of the line Alamanni - Santa Maria Novella then you can either walk into the centre or get Tram 2 one more stop to the end of its line Unità. Tram 2 also goes the other way to the airport. Tickets cost €1.50 and you can buy them from the hotel reception.  The hotel is a 10 minute drive from the airport. Come out of the airport and turn right, go to the end of the building then turn right again to find the taxi stand were the prices are prominently displayed. It costs €22 during the day to go into town, €24 on a Bank Holiday and €25.30 at night (10pm - 6am) plus a supplement of €2.70 when catching a taxi from the airport and €1 per suitcase. However, beware of the drivers when paying by credit card. I took taxi Atene 18 and when we arrived at the hotel, the driver took my contactless credit card and before I knew it, he'd added €3 for paying by credit card. I insisted he gave me my €3 back in cash so before you hand over your credit card, make sure you see what the charge is and some of the taxi drivers obviously just can't help themselves (and I speak fluent Italian!).  The staff on reception were very friendly and I really have to compliment the amazing housekeeping staff who made up my room to look like new throughout my 4 night stay. It was a real pleasure to come back to a perfectly made-up room and this is one of the reasons I'm giving this hotel 5 stars.…", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r720894586", "sub_review": {"Location": 4, "Rooms": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Very Nice Hotel.", "review": "Dear Guest,  We are glad to hear that you appreciated your stay in terms of product, quality of service, and cleanliness.  We have shared your positive impressions with all hotel staff and your kind words make us very proud. Thank you for choosing Starhotels and we hope to host you again.  Kind regards,  Laura Marina Rodio – General Manager ", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r719468154", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "A modern hotel Good access to the city", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r713586107", "sub_review": {"Sleep Quality": 3, "Rooms": 4}, "travel_purpose": "", "rating": 5}, {"title": "not great location, but very good hotel", "review": "Our third hotel with Great Rail holiday. From the station it is about a 30 minute walk or a 10 minute tram ride. Excellent breakfast on Good restaurant. Our room was clean and modern with tea and coffee and a nice clean shower, we had a small balcony on the First floor.", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r713553271", "sub_review": {"Location": 2, "Cleanliness": 4, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Very nice!", "review": "Dear Guest,  Thank you very much for choosing Starhotels Michelangelo Firenze and for highlighting our priorities in your comments, such as comfort and cleanliness of our room along with good breakfast and restaurant service.  We hope to have the pleasure of hosting you again in the next future,  Kind regards,  Laura Marina Rodio - General Manager ", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r711239646", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Modern Hotel, right outside the city center", "review": "I like this hotel, is not a high luxury hotel but they have retouch the rooms to give you that feel and receive you with a free bottle of water. The location is not very good, its like 15 minutes walking to the central train station but to walk to the center is like 20 minutes and in  the middle of the summer is not few. Although will recommend it if you get a good price and want a good room (and dont have problems with walking)", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r711203293", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Nice Hotel, not in the city center", "review": "Dear Guest,  Thank you for sharing your views on Starhotels Michelangelo. We are happy to learn that you had a pleasant experience here. Regarding our location, we have the pleasure to inform that just in front of our buiding is possible to catch both bus or tram towards city centre.  Kind regards,  Laura Marina Rodio - General Manager ", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r699139441", "sub_review": {"Value": 4, "Location": 4, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "Modern hotel, clean and good location", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r689547860", "sub_review": {"Location": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Worst hotel ever!!! Michelangelo would be ashamed.", "review": "Contained the amenities that most Americans expect: clean, modern and the A/C worked well.   While I used to take all of these things for granted, 1 week into 2 week tour around Italy, I no longer do.  Comfortable bed, quiet room but still within walking distance (1/2 mile) from all the historic places to visit.", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r687203859", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Great room...", "review": "Dear Guest, thank you so much for choosing Starhotels Michelangelo Firenze. We are glad to understand that your recent stay was pleasant and measured up with your expectations. Looking forward to welcoming you in Starhotels once again, kind regards  Laura Marina Rodio  - General Manager", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r678848179", "sub_review": {"Location": 3, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Modern Hotel", "review": "I chose this hotel after reading reviews mainly suggesting that the hotel is clean, spacious and modern. It is NOT any of that.  1- The room is so tiny and the bathroom is even tinier!! I couldn’t place my stuff anywhere! 2- The room smelled SO bad we had to spray half of our perfumes to cover the bad smell! 3- It is not modern! It is gloomy classic and needs A LOT of maintenance ! There were scratches all over the floors and the walls. 4- The staff are not friendly or nice! They had an attitude!  5-You can’t sleep well because u hear them moving furniture ALL the time! Our stay was non- refundable, but we only were able to make it the first night. It literally felt like staying at a 2 stars motel. After only one night we had ENOUGH and we moved to another hotel.", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r678104116", "sub_review": {"Value": 3, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Will not stay here again.", "review": "We stayed in the hotel as part of a large group tour.  Our room was modern and well-appointed.  The hotel staff was friendly and helpful.  The hotel was not necessarily convenient to downtown.  I would not have walked to get to all of the shopping and local sites.  A taxi ride was about $10 Euros.", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r675383535", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Very noisy hotel", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r667988260", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Nice clean, spacious hotel", "review": "Won't come back to this hotel. Staff don't care about your relaxing.  Moving furniture that it sounds everywhere in the hotel. You can hear everything (really everything!!) from the room beside you. Location is good. Takes 20 min by foot to the downtown on the riverside. ", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r661907879", "sub_review": {"Location": 3, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Definitely not a 4 star hotel", "review": "The hotel is not located near the city center so walking to main attractions takes awhile but the hotel is very modern and spacious and we really enjoyed our stay.   We would definitely stay here again.", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r658259874", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Comfortable, helpful staff, convenient", "review": "Dear Guest, thank you very much for your positive comments about Starhotels Michelangelo Florence. We hope to have the pleasure of welcoming you back in your next stay in our Starhotels chain. Best Regards, The Management", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r658233743", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Excellent Hotel With Excellent Staff.", "review": "+breakfast food was really okay +the design looks luxurious   -they gave us a room that had scaffolding in front of the windows. Unpleasant, but we didn’t report anything yet -on our last day, we woke up to WORKERS AT OUR WINDOW -another morning surprise was waking up to the sound of those workers doing repairs near our window -even though there were just a couple of people at breakfast, some hotel employee insisted we should sit at a certain table just for two, far away from the buffet when there were plenty of empty tables closer.   I won’t recommend, this was just a waste of money for a way below average hotel.", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r646287861", "sub_review": {"Location": 3, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice, clean hotel - not located in the city center", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r643528101", "sub_review": {"Location": 3, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Good stay and good meal", "review": "Overall, we had a good stay at this hotel. It was clean and the staff was very kind and helpful (especially with booking various tours of the city). However, it is not located in the city center, but is located near public transportation if you are comfortable using it! Additionally, the shower water temperature constantly fluctuated (which was frustrating). Other than that, this is a good hotel!", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r638843963", "sub_review": {"Sleep Quality": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Highly recommended and as a hotel chain", "review": "Dear Guest, thank you so much for your review and for your signalization regarding shower temperature. Our Maintenance Dept. has immediately been involved in order to solve the issue. We look forward to welcoming you here again in the future, kind regards  Graziano Luddi  - General Manager ", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r633268684", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Modern and elegant", "review": "We decided to have a stay at Michelangelo for one night. We arrived at around 20:00 and unfortunately the hotel's parking was full. They kindly suggested us to leave the car by a parking near the hotel (only 50m). Then we had a very good dinner with some pasta very well cooked. The room was clean and there was all you need for your stay.", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r631746972", "sub_review": {"Value": 3, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Comfortable, close to public transportation.", "review": "Dear Guest, It's such a pleasure to hear that your experience with us was good and we want to thank you for taking the time to write few words on Starhotels Michelangelo. We have shared your positive impressions with the restaurant staff Staff, your kind words make us very proud.  Thank you for choosing Starhotels and hoping to welcoming you again in the not so distant future.  Kind regards, Graziano Luddi", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r628209449", "sub_review": {"Rooms": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good, comfortable hotel", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r621339774", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Not quite the 4star", "review": "Stayed three nights here. Had to ask for a room change on arrival because the room window was covered with scaffolding. Changed without any problems. Room was comfortable although a little on the small side. The hotel is handy for trams and buses into central Florence and sell the tickets at reception. Breakfast adequate. Didn’t try the restaurant.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r618972764", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Not the best accommodations ", "review": "Dear Guest,  We are glad to hear that you appreciated your stay in terms of room comfort, quality of service, and location. Thank you for choosing Starhotels and we hope to host you again.  Kind regards,  Graziano Luddi – General Manager ", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r618286206", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Beware Building Works", "review": "Stayed at this hotel for a few nights recently when visiting the beautiful city of Florence. On arrival the entrance, foyer is dark but attractive. However the dark theme continues in the rooms which although may be the design , therefore the desired effect , made the rooms too dark and lighting was inadequate, as was the storage. The breakfast was okay, but unless your choice of cooked breakfast is scrambled eggs then you would have to pay extra for an alternative. Reception and waiting staff polite and pleasant, however the Maitre d despite having no one to welcome did not offer assistance to his busy staff.Room always cleaned to a good standard. An easy walk along the river to the centre", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r617728630", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good property with professional Staff", "review": "We were part of a tour group so we had no say in the choice. The location was okay. The room was fine, nothing special.  The breakfast was good with the best coffee of the trip. The dinner that was included in our tour was the worst meal of our entire trip. The crepe starter was too rich, the entree horrible and the dessert inedible. Eataly better step up their game Cannot recommend staying here.", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r617206769", "sub_review": {"Value": 4, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Very modern, spacious and welcoming", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r616924719", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Good Hotel with friendly staff", "review": "Very nice hotel have just stayed there for three nights. We were at the rear of the hotel on the first floor. Room was very spacious and to a high standard. Large bathroom and well equipped. Breakfast was generally good with a wide selection of choice on offer. Although breakfast tea bags often hard to come by. Only issue we had was the noise in the morning, presume from the kitchen area or people throwing things into the bins. Otherwise very good and about twenty minutes walk from the centre.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r616637336", "sub_review": {"Value": 4, "Sleep Quality": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Terrible", "review": "I would recommend this hotel.   Very friendly staff, well organised and we checked in with ease. A lovely room -with sofa to relax. Large breakfast room with many choices for breakfast - very clean and food/drink is continually stocked up. I would visit again!", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r615515551", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "nice hotel - warm friendly staff", "review": "Maybe it was a 4 star hotel long time ago, but not anymore. Don’t trust the pictures, It’s completely different from what you see in the pictures. I didn’t like the breakfast. They really need to renovate the hotel if they don’t want to loose their business.", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r609273476", "sub_review": {"Value": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Michelangelo was great!", "review": "We had two rooms for a two night stay here. A little out of the way but we were fine with getting the exercise and took in the nice views on our walk along the river into the main areas - 15-20 minutes away. We received a very warm greeting on arrival and we checked in alot quicker than at some other places on our journey. A large tour arrived just as we were checking in but the hotel was very organized. They handed their tour director pre organized envelopes with room keys and that crowd quickly dispersed to their rooms.   Our two rooms connected and they were a decent size. Beds were comfy and had nice linens.  The bathroom was an okay size. We couldn't see out of the room as there was scaffolding up the side of the building so that was a bit disappointing. There is a large…", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r606188681", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Very nice hotel and rooms, although not centrally located", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r600016691", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Michelanglo", "review": "We stayed at the Starhotels Michelangelo as part of our tour and while the hotel had very nice, modern and spacious rooms the hotel was located on the outskirt of the city. Really the walk along the Arno was only a few minutes to get to Ponte Vecchio and other attractions but it wasn't in the center of Florence.  The hotel had a spacious bar where we watched the World Cup 2018 Final right off the lobby. The service was accommodating even though the hotel was quite busy with both several weddings and tours.  If you don't mind walking it is a great value in Florence with great rooms and good amenities.", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r599313014", "sub_review": {"Location": 4, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Average City hotel", "review": "This was a nice Hotel and had a very modern style. They offered breakfast which had good selection. Many other options upon request. Within walking distance to the river and many local historical sites.", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r596711704", "sub_review": {"Location": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good location but noisy rooms", "review": "Dear Guest,  Thank you for sharing your views on Starhotels Michelangelo. We are happy to learn that you had a pleasant experience here.  Hoping to have the chance to host you here once again, kind regards  Graziano Luddi - General Manager  ", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r593855945", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Lovely stay at StarHotels", "review": "The hotel is situated conveniently near one of the tram stations for access to the station and from there to the northern part of Florence. It is some distance from the centre if walking. The rooms were comfortable but there is a distinct lack of wardrobe and draw space for clothes (see photo). We were a couple spending 5 nights in the hotel and had 8 hangers between us and one small draw each. This meant living out of the suitcases for most of our clothes. The reception area and \"lounge\" is spacious and reasonably comfortable. Breakfast is served in the dining area on the lower ground floor with a very wide choice of food available. There is a \"fitness room\" but I did not visit this. The average rating is perhaps a little harsh but I do not think that it can be classeed as…", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r590548980", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Decent location", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r588998952", "sub_review": {"Value": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Wonderful rooms and the best bar tender in Italy", "review": "My boyfriend and I stayed here last week and though the hotel was in a good location. It is a few minutes walk away from the river, 15 mins away from the train station and 20 mins away from where lots of the attractions are.  We stayed on the 5th floor, the room was adequate and clean however it was extremely noisy at night. We had the window close but heard every ambulance (and for some reason there were a lot) going past in the early hours. The staff were not particularly helpful or welcoming. I thought the stay was slightly over priced as we stayed in cheaper accommodation in Italy with much better service.", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r581548504", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "A few things to improve", "review": "Dear Guest, thank you so much for dedicating your time to convey your views on Starhotels Michelangelo. Your comments are important and help us to improve the quality of our service.  We look forward to seeing you here again in the future,  Kind regards,  Graziano Luddi – General Manager ", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r579023325", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Great hotel, very nice rooms, good breakfast", "review": "We had a great time in Florence and Gabriel made it even better. He was at the hotel and made us feel like family and treated us so cordially. At the end of the day it was so relaxing to talk to him and enjoy his company.", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r574579162", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good modern hotel but a little out of the center", "review": "Dear Guest, Your review was such a delight to read! I am so pleased to hear that you appreciated the calibre of service delivered by my team, especially by Gabriele, with whom I look forward to sharing your kind words. Thank you for your comments and I look forward to seeing you again soon.  Kindest regards,  Graziano Luddi - General Manager", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r571742790", "sub_review": {"Location": 2, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Fantastic hotel! ", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r570357067", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Disappointing ", "review": "This hotel was lovely! Very modern and clean. There’s facilities in the room for hot drinks - this is very rare in the other hotels we have stayed in whilst travelling around Italy. The bathroom was very clean and I’ve just read a recent review about the shower which I’m surprised to read as we had no problems at all.  The breakfast was good and although we did not go I think there’s a fitness centre.  The hotel is about a 25 minute walk the the min centre where the famous bridge is.  Around the corner you can catch a C2 or a C3 bus which costs about €1- we got a ticket every time however no ones checks! This was by far the best hotel we stayed at on our travels and we will definitely stay in a starhotel again.", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r559980991", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "DISAPPOINTING HOTEL ON OUR HONEYMOON", "review": "Dear Guest, It's such a pleasure to hear that your experience with us was pleasant and we want to thank you for taking the time to write few words on Starhotels Michelangelo. We have shared your positive impressions with all hotel Staff, your kind words make us very proud. Thank you for choosing Starhotels and hoping to welcoming you again, kind regards   Graziano Luddi - General Manager ", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r556416098", "sub_review": {"Location": 3, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Beautiful stay?!", "review": "We booked for 5 nights a mix of business and pleasure. The staff where very good and friendly hence 3 stars. They upgraded us to a de Luxe room  still very small but adequate on the 2 nd floor. Breakfast OK but limited same EVREY day. Showers where the worst either boiling hot or ice cold ended with just having baths, complained told it was that part of the hotel had a problem!!! The room we where staying was very noisy even with 2 double glazed windows it doesn't help the hotel seems to specialise In large groups mostly from Asia and are very noisy, we did complain but we shouldn't have to just to get a good night's sleep. In general the hotel and rooms need a major revamp. I loved Florence and will he back BUT staying at  a other hotel, the location also us not great for most…", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r556030613", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Could be a great hotel, if they just fix some important things!", "review": " Dear Guest, thank you for your comment regarding your stay in our Starhotels Michelangelo. We are sorry to know that the experienced was not positive at all. Your highlighting is  important and helps us in the  improvement of our services, that we want to provide to all the guest. We  hope to welcome you again here another time.   Sincerely.   Graziano Luddi – Manager ", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r554560563", "sub_review": {"Value": 3, "Rooms": 3, "Service": 2}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Great Customer Service", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r553163867", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Good location ", "review": "The guys working here are great.  My daughter stayed at this hotel and left her boots behind. They have gone above and beyond to get them mailed back to us. I can't thank them enough as the boots are her favorite pair and I cannot find them anywhere to repurchase. Amazing customer service and I would like to send a special thank you to Anso.", "date": "November 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r551515952", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Seems like a nice hotel - unfortunate experience.", "review": "Dear Guest, It's such a pleasure to hear that your experience with us was pleasant and we want to thank you for taking the time to write few words on Starhotels Michelangelo. We have shared your positive impressions with all hotel Staff, your kind words make us very proud. Thank you for choosing Starhotels and hoping to welcoming you again, kind regards Graziano Luddi -   General Manager ", "date": "November 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r542445632", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 2}, {"title": "Very nice & centrally located", "review": "The hotel is clean and well maintained.  Shops are located within the area and the train station is just 10 minutes away by foot.  The breakfast selection is the same every day and not that extensive and you don’t get any information from the front desk because they don’t speak English well.  On our 2nd night we did not get any air conditioning and complained about it but it was only on our 4th night that somebody admitted that the entire hotel did not have air conditioning on anymore.  If you are particular about this, do ask before you book this hotel.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r535500863", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent staff on reception", "review": "Dear Guest, we thank you so much for the review about your experience in our Starhotels Michelangelo. We apologize for hearing that your stay by us was not measured up with your expectations and we will take in consideration your signalization in order to improve the quality of our services. Usually the 4th of january in Italy is very cold and we have the heater on.  Best regards.   Graziano Luddi – Manager ", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r534512347", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Location is not that Central", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r534202691", "sub_review": {"Value": 3, "Rooms": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Clean and very nice rooms", "review": "This is a nice hotel with large rooms a nice breakfast and attractive common spaces.  The hotels location was not near any major tourist attractions and required considerable walking to reach the city center.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r533518824", "sub_review": {"Value": 5, "Location": 3, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Fine business hotel", "review": "We stayed here for 2 nights and enjoyed our stay. The beds were very comfortable and the showers were great. The location is about a 15 minute walk from the main sights in Florence, or a 10 euro taxi ride. It was a quiet hotel and very comfortable. We were on a Gate 1 tour, which was a wonderful tour that I would highly recommend! I will use them again when we come back to Italy.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r532676702", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Nice and clean!", "review": "The hotel is mainly directed to a business customer in my opinion, with a conference center and a bit far from the center, even if it is reachable in around 15 minutes walk. The room was nice, with a cool wardrobe built as a stack of suitcases. The breakfast was nothing special, and the room where it is served (in a basement with no windows) was quite bad. Finally they should work on the internet connection, too bad for an hotel of this kind. Nice people working there.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r530230100", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice holiday!", "review": "We stayed two nights in this hotel during our Italy tour with Gate 1. The hotel is modern and very clean. Our room on a 1st floor was spacious and clean, with lovely toiletries. We had a kettle with supply of coffee and tea which was replenished by housekeeping next day. The bed was very comfortable. Unfortunately, we were could not fall asleep because of outside door banging constantly and making a very loud noise. Housekeeping was efficient. There are not enough drawers in the room or inside the closet, and only one place for a suitcase. During first night we were struggling with mosquitos and my husband had to ask front desk to spray the room. Seemed it worked. Location of the hotel is a little bit away from main attractions but not too far. There is a nice walk to the river…", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r526559768", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Not a 4* hotel!", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r526545480", "sub_review": {"Value": 2, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "It is not a 4* hotel", "review": "Had to negotiate steps with suitcases to get to reception.  Room had magnificent view of a brick wall and lots of pipes!  No bottled water in the room, No non-slip bath mat.  No WARDROBE! only a small hanging rail, only two drawers, no bedside table drawers.  Only one chair.  Only room for one suitcase - the other had to go on the chair, as we had to live out of it!  Very expensive food - don't eat there, turn right out of hotel, couple of blocks, turn right.  Great restaurant, not expensive.  Hotel is quite a way from centre.  Too far for me to walk.  Caught tram.", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r525456303", "sub_review": {"Value": 1, "Cleanliness": 2, "Service": 1}, "travel_purpose": "Traveled on business", "rating": 1}, {"title": "Two night Stay", "review": "I stayed here for 5 night and I didn't appreciate nothing. The room was old and noisy (and it was a DELUXE!) and the staff was really rude. For the price I paid, I expected a lot more. I'll never come back here!", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r522857565", "sub_review": {"Sleep Quality": 4, "Rooms": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Superb hotel proper 4star", "review": "We stayed at this hotel for two nights as part of a Gate 1 Tour. The staff were friendly, the rooms were on the large size, modern and nice bathroom. The breakfast was ok, however they didn't change the selection the next day. The location is a bit far from museums and shops. The river is about two blocks away. We walked along the river to get to the Uffizi Gallery. It was about a 25 minute walk, but a nice walk.", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r521752481", "sub_review": {"Location": 4, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Perfect location", "review": "Dear Guest, thank you for your comment regarding your stay in our Starhotels Michelangelo. Your highlighting is  important and helps us in the  improvement of our services, that we want to provide to all the guest. We  hope to welcome you again here another time. Sincerely.   Graziano Luddi – Manager", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r519615754", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Staff attitude a let down and indifferent; location remote", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r515276667", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Mrs . Dina ", "review": "This hotel is rated four star therefore to receive what a four star hotel should be in terms of room being nice etc is a given.  In my opinion, what makes a hotel stand out is the staff and among all hotels we stayed at in our four week Italy trip, this hotel had the worst staff attitude.  First off on arrival there wasn't any staff to open doors or assist with luggage when theirs is the most inconvenient set-up of an entrance- there is about 5 steps down from the street to reception with no ramp whatsoever for guests to comfortably wheel their suitcase in or out (I saw a young woman try to carry her 2 massive suitcases).  Then at checkin not much greeting was given.  When we got to our room, even after a note to our booking months ago of a request for a \"true\" double bed, quiet…", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r512647409", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Clean and comfortable", "review": "The hotel is very near to all the major tourist places in Florence . The bus stop is a minute walk . The staff was extremely polite and helpfull. Had a pleasant and comfortable stay here . The rooms were neat  and comfortable too . ", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r507025766", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Tuscany now", "review": "Dear Guest, we thank you very much for your kind review of our hotel. We are  happy that you’ve valued positively the experience by us, both in terms of products and quality of the service, our priorities. We’ll wish to host you here soon again. Best regards. Graziano Luddi - Manager.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r500896339", "sub_review": {"Value": 2, "Location": 4, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Loved our stay here", "review": "Front desk staff bilingual and very friendly. Got a free map with the major attractions circled. They even assisted with bus tickets and the relevant routes. Onsite parking available. Lift access. Rooms very clean and tidy bathrooms. Nice breakfast. A little out of the way of the hustle and bustle but that is exactly what we liked about the location. Trem and bus stops within a block from hotel. ", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r497525516", "sub_review": {"Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "business hotel in unpleasant area but close to tranvia", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r497083441", "sub_review": {"Location": 2, "Rooms": 3, "Service": 3}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "My favorite city - Florence ", "review": "The rooms are very small, the service is inconsistent, I have stayed there several times for work. I had problems with double bookings, request to pay for breakfast even though it was included in the booking, problems with airco, there are often very large groups who come for seminars which causes internal traffic problems. The decoration at the entrance and the bar/restaurant is nice, but the rooms are pretty bland", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r496694011", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Comfortable Stay but bad wifi", "review": "Thank you for your review. Best regards  manager Graziano Luddi", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r496367425", "sub_review": {"Location": 4, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Clean spacious room, little far from attractions", "review": "This was my second visit to Florence. Star hotel locates within the city limit and is an 10 minutes walk to the heart of Florence. Hotel is rather new and super clean and very comfortable. It definitely deserves a 4 star plus rating. ", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r494942749", "sub_review": {"Location": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Fantastic! ", "review": "Dear Guest, we desire to thank you a lot for the positive comment regarding your stay in our Starhotels Michelangelo. Your comments make us feel so proud and help us to do all our best to enhance the quality of our service. We are waiting for you in one of Starhotels. Best regards. Graziano Luddi – General Manager", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r494134654", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Modern hotel, few blocks from the action", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r493635978", "sub_review": {"Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Comfortable hotel on group tour of Italy", "review": "Stayed here with a group. Hotel and rooms had a very modern feel. For me, that meant the chair looked nice but was somewhat uncomfortable. When you walk out the front door, you're on a busy street, but not in an area with shops and restaurants; you have to walk a few blocks to get to that kind of \"scene.\"  The provided breakfast was very comprehensive. Overall, a nice hotel but not quite an optimal experience.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r492808914", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Decent hotel in group tour", "review": "Dear Guest, thank you very much for spending your time in describing the stay in our Starhotels Michelangelo. We’ve shared with all the staff your good impressions, which help us to do always the best in our work. We’ll expecting to see you again. Best regards. Graziano Luddi – Manager", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r492025310", "sub_review": {"Location": 4, "Sleep Quality": 5, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Ok hotel which is 15 minutes walk from the centre of Florence", "review": "My husband and I were impressed when we entered the hotel. The location is a very industrial area of Florence but not too far from the city center. It was definitely one of the more upscale hotels we stayed at during our tour. We were quite comfortable and the staff was friendly. The breakfast was also nice. Our room even had a balcony!", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r488820377", "sub_review": {"Sleep Quality": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Decent hotel", "review": "Dear Guest, thank you very much for spending your time in describing the stay in our Starhotels Michelangelo. We’ll expecting to see you again. Best regards. Graziano Luddi – Manager", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r486659921", "sub_review": {"Location": 3, "Rooms": 3, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Excellent location", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r485189661", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Perfect Located", "review": "Stayed here on the end of a tour with \"Go Ahead Tours\".  I was on the top floor, room 705 & it had a lovely view of the city & of the Duomo & the Tower of the National Museum.  The tram station is basically a few metres from the hotel.  The River Arno is about 2 blocks from the hotel.  I travelled as a single & my room was somewhat small with a queen-sized bed but was well-appointed.  The lobby is quite lovely but rather dimly lit.    While we were there we walked along the riverfront, saw a small waterfall along the way & went to the rooftop lounge of the Westin Excelsor Hotel for happy hour & a magnificent view of the city, river, it's many bridges, & the sunset.   A cocktail & some h'ordeurves was €20!  Go early as it was very busy!  ", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r480910165", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Take your insect repellent!", "review": "Dear Guest, thank you very much for spending your time in describing the stay in our Starhotels Michelangelo. We’ve shared with all the staff your good impressions, which help us to do always the best in our work. We’ll expecting to see you again. Best regards. Graziano Luddi – Manager", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r480635160", "sub_review": {"Rooms": 2, "Cleanliness": 3, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Not impressed", "review": "The hotel is located in front of a tram station that takes you all around. The rooms are spacious and very clean, we were given an extra bed for our daughter at no extra cost, very cute and modern! There are a few good restaurants close.", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r479285931", "sub_review": {"Value": 1, "Rooms": 2, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Very good place", "review": "Dear Guest, I was so pleased to hear that you enjoyed a family stay at Starhotels Michelangelo. It is great to read that you appreciated our location and that the attention to detail from the team did not go unnoticed. Thank you for taking the time to write such kind words. We hope to welcome you again in the not so distant future. Kindest regards, Graziano Luddi ", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r477969223", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Nice place to stay", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r476079095", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Not all expecatations met", "review": "If your look for a place to spend the night and don't care about amenities then this hotel will be fine. The food is a bit below average. Free wifi. No air conditioning. The staff is friendly. Location is walking distance to city center and other locations. ", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r475516779", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Nice location", "review": "Dear Guest, I’m glad to hear that your stay here in our Starhotels Michelangelo was pleasant and measured up with your expectations. We thank you very much for choosing us for your stay and we hope to welcome you once again in Starhotels. Sincerely. Graziano Luddi – Manager  ", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r474659447", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "one of the best hotels I've ever stayed at", "review": "Loved the location of this hotel! Beautiful views!! Other positive was the breakfast! Good for a full belly:) Room was spacious and nicely equipped. Big, Super negative was the staff and expectations. We were told via our itinerary that we would receive a voucher for a drink at the bar for each traveler. We received a voucher for the lead traveler only and had to be very stern in order to receive our other drinks. Also, we were told that we would receive a complementary bottle of water each day per person. Upon arrival, no water in our room. After calling twice, we received only 1 bottle and were told that is all we would be allowed. Day 2, same story! Day 3, same story! I did not think I would need to call for my water each day and still not received what was promised.", "date": "January 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r458656004", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Updated and very good location", "review": "Dear Guest, we thank you so much for the review about your experience in our Starhotels Michelangelo. We apologize for hearing that your stay by us was not measured up with your expectations and we will take in consideration your signalization in order to improve our services.  Best regards  manager  Graziano Luddi  ", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r457730010", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Very Beautiful from the time you step in the door", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "January 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r452035654", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Wished we could have stayed an extra night!", "review": "The hotel is beautiful and very well located to the Central Train Line. Rooms were very comfortable and well laid out for 3 people. We had room to place 3 suitcases (ours were large). Wish we could have stayed longer. Staff were courteous and I love that everyone is bilingual and so language is not a barrier. Thank you.", "date": "January 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r451947614", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "smells like a sewer inside , just awfu;l", "review": "Dear Guest, I’m glad to hear that Your stay here in our Starhotels Michelangelo was pleasant and measured up with your expectations. We are proud of it and that makes us to do always the best in our job. We thank you very much for choosing us for your stay and we hope to welcome You again in on of the hotels of Starhotels chain. Sincerely. Graziano Luddi – Manager", "date": "January 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r449515911", "sub_review": {"Sleep Quality": 3, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "A very  comfortable, well decorated hotel with spacious  rooms", "review": "Stayed here on our last night of an extended vacation in Italy. Since we were flying out in the morning, we wanted something quiet, something not right in the center. This was perfect. We were a mile walk from the Duomo, walking along the Arno and cutting over from there. For us, this was a good thing--it might be a little *too* on the outskirts for those who don't care to or cannot walk a lot. Check in was quick, easy, and professional. The staff spoke English but let me speak Italian 😊 The room was not big, but not small either (and I think we had just a standard room). It was, however, *meticulously* clean, the towels were super soft (not always the case at hotels in general), and the bed was the best I slept on since we've been away from our own. There was some noise coming…", "date": "January 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r449231404", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Beautiful modern and clean rooms, but minor issues with acoustics and Internet meant it wasn't perfect.", "review": "Dear Guest, thank You very much for spending your time in describing the stay in our Starhotels Michelangelo. We’ve shared with all the staff your good impressions, which help us to do always the best in our work. We’ll expecting to see you again. Best regards. Graziano Luddi – Manager", "date": "January 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r448570968", "sub_review": {"Location": 4, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Sewage stink hole", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "January 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r448433424", "sub_review": {}, "travel_purpose": "", "rating": 1}, {"title": "Beautiful hotel with continental breakfast", "review": "If you like the smell of raw sewage you will love this Hotel. From the moment you arrive in the lobby you are welcomed with a stench to rival any treatment plant. Shower has two settings - freezing cold or skin blisteringly hot. Smokers among us will feel right at home whilst breathing in the stale tobacco scented room air. unapologetic, rude and unwelcoming staff. This hotel is overpriced, underwhelming and without a doubt one of the worst I have ever stayed in.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r445103640", "sub_review": {"Rooms": 4, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Poor Customer Service", "review": "Dear Guest, we thank You so much for the review about your experience in our Starhotels Michelangelo. We apologize for hearing that your stay by us was not measured up with your expectations and we will take in consideration your signalization in order to improve the quality of our services. We’ll  wish to see you here again. Best regards. Graziano Luddi– Manager ", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r441768818", "sub_review": {"Location": 2, "Sleep Quality": 2, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Good location and very attentive staff", "review": "The hotel is very nice, but not as clean as newer places. Continental breakfast is good, but let's be honest, lunch and dinner is what Italians excel at. Service is fine, but the main selling point is the hotel's central location.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r440384643", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Excellent", "review": "Dear Guest, I’m glad to hear that Your stay here in our Starhotels Michelangelo was pleasant and measured up with your expectations. We are proud of it and that makes us to do always the best in our job. We thank you very much for choosing us for your stay and we hope to welcome You again in on of the hotels of Starhotels chain. Sincerely. Alessandra Bragoli – Manager", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r439550911", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Amazing experience", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r439542583", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Incredible!", "review": "I must admit, florence wasn't what I expected on my walk there from the station. I'd come from Milan which seemed like a mini London to me, the part of florence i visited didn't have much going on, we went for a wedding, and although the venue and nearby river were stunning, this hotel was the highlight of my trip. The minibar to the comfortable beds and air conditioning, to the great service with the staff and the overall ambience, I'd definitely come back. Three of us spaciously fit into a double bed, the bathroom is also lovely and very very spacious and even luxurious. Quality stay and not a single mosquito in sight. Great bar also and restaurant, and very quiet hotel", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r437333601", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Incredible!", "review": "Dear Guest, we thank You very much for your kind review of our hotel. We are  happy that you’ve valued positively the experience by us, both in terms of products and quality of the service, our priorities. We’ll wish to host You here soon again Best regards. Alessandra Bragoli - Manager.  ", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r436770229", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Comfortable stay ", "review": "What an absolutely unbelievable hotel. We stayed here for 1 night and I couldn't express how amazing this was. We were able to walk in and out of Florence so easily -  no need for a taxi or anything!  We arrived super early but the receptionist said there was a room available for us if we wanted to check in. Which was great because we were bale to relax and rest for an hour before exploring!  Room was divine and so comfy. The breakfast was all you can eat so you could stock up for your day!", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r435491698", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "comfortable and expensive", "review": "Dear Guest, I thank You a lot for the positive comment regarding your stay in our Starhotels Michelangelo, also in the name of our Staff. Your comment makes us feel so proud that we’ll absolutely enhance the quality our service. We are waiting for You in one of our hotels of the chain. Sincerely  Alessandra Bragoli", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r434885146", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "This was a very spacious comfortable hotel.", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r432808694", "sub_review": {"Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Comfortable Stay, Good location!", "review": "I enjoyed staying in this hotel very much.  It was clean, it was spacious.  The beds were comfortable and the sheets were soft.  Many of the sites are within walking distance and Florence is breathtaking.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r432431606", "sub_review": {"Location": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great place to stay!", "review": "Dear Guest,  We would like to thank you for taking the time to convey your comments regarding your recent stay in our Starhotels Michelangelo. We are really glad to hear that you appreciated our hospitality, in terms of quality of the service/product, location and cleanliness. Any suggestions or opinions related to our service is highly taken into consideration and, if in any way this service can be improved, be well assured that our will is to achieve this goal. Thank you for choosing Starhotels and hoping to welcoming you again, kind regards. Alessandra Bragoli - General Manager", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r428242444", "sub_review": {"Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Robbed in the basement level breakfast room", "review": "We stayed at this Hotel for 3 nights with a bicycle tour group. We walked from the Train station to the Hotel which was probably a good half mile on rough sidewalks and streets with luggage which is doable if you are strong and traveling lightly. We had a 70 lb bike case and large suitcases so it was a bit of a struggle! I really liked the location even though it is outside of the area of most attractions.  It is still a lovely 3 bridge walk to get closer to the famous attractions but I liked being away from the crowds at night. The rooms are modern and well equipped. The bathroom was very clean, modern, but little space for toiletry bags for two people. We had a nice view of a park, light rail system and Sunsets. The windows open for fresh air! There are small stores nearby for…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r424835380", "sub_review": {"Sleep Quality": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Excellent Stay in Florence", "review": "Dear Guest,  We would like to thank you for sharing your thoughtful comments, following your recent stay at Starhotels Michelangelo.We are very pleased to learn you enjoyed many aspects of your recent stay, in terms of quality of service and product, location and cleanliness. Any suggestion is highly taken into consideration in order to improve the quality of the service we deliver to all our Guests. I will share your words of appreciation with the team and we look forward to welcoming you again soon. Kind regards, Alessandra Bragoli – General Manager. ", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r424760693", "sub_review": {"Location": 4, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Very nice hotel but...", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r423960925", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Modern hotel with immaculate rooms and great breakfast", "review": "We stayed at the Starhotels Michelangelo for 4 nights while in Florence. This hotel was very nice. Very clean, modern and updated interiors. Centrally located, layout of the room and bathroom was nice, however their towels are very old! It did not fit at all with the hotel. My mom asked for newer towels but was given the same older looking ones. This hotel needs to invest in new towels. However, the service was quite great! The rooms were always cleaned well. The front office staff were always ready to answer questions and make reservations for you. It was my dad's 70th birthday and we told them, the next day they gave us a cake and champagne for him! Special mention to the head of breakfast, sorry I did not get your name, Sir, thank you for your kind accomodation. Great staff…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r422793961", "sub_review": {"Value": 4, "Location": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "good staff", "review": "Dear Guest,  We would like to thank you for taking the time to convey your comments regarding your recent stay in our Starhotels Michelangelo. We are really glad to hear that you appreciated our hospitality, in terms of quality of service and product, location and cleanliness. Any suggestions or opinions related to our service is highly taken into consideration and, if in any way this service can be improved, be well assured that our will is to achieve this goal.  I was immensely pleased to learn that individual team members helped create such a memorable and enjoyable experience for you, and I look forward to sharing your kind words of appreciation personally with our Staff and with Carmelo, the head of breakfast. Thank you for choosing Starhotels and hoping to welcoming you again in the near future, kind regards. Alessandra Bragoli - General Manager", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r421254027", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Good Service.", "review": "We stayed here for 2 nights in September and were pleased to see how clean and modern this hotel is.  Our room was large with a nice size bathroom.  There was a safe for our use and plenty of towels for the bath.  AC worked very well.  Breakfast was more than ample. This hotel is located on a quiet street with a couple of restaurants within walking distance.  If you are looking to be located in the very heart of Florence, this hotel will not be for you as it might require that you walk a distance or take a cab to reach tourists areas.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r421190411", "sub_review": {"Value": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Perfect on every level", "review": "Dear Guest, Your review was such a delight to read! I am so pleased to hear that you appreciated the calibre of service delivered by my team and enjoyed a comfortable nights sleep in our Starhotels Michelangelo. Thank you for your comments and I look forward to seeing you again soon. Kindest regards, Alessandra Bragoli - General Manager", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r417252556", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very nice hotel!", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r416530128", "sub_review": {"Rooms": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Nice location, comfortable", "review": "By reading reviews beforehand, I was pleasantly surprised with my experience at the Starhotels Michelangelo Firenze.  Although not centrally located it was easily accessible by public transportation and not far from the city center (if you were up for a walk).  The hotel was decorated nicely and I was pleased with the spaciousness and layout of my room.  The breakfast was just average, what you'd expect for a continental breakfast.  The front desk staff were efficient and helpful if asked a question but did not go above and beyond. The breakfast room staff were very friendly and accomodating.  It does take a minute to get used to the low light level in the lobby but the complimentary fruit infused water was a welcome touch after a day out in the hot sun.  The fitness room was…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r416234621", "sub_review": {"Value": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Good location ", "review": "Dear Guest,  We would like to thank you for taking the time to convey your comments regarding your recent stay in our Starhotels Michelangelo. We are glad to hear that you appreciated our hospitality, in terms of quality of the service/product, location and cleanliness. Any suggestions or opinions related to our service is highly taken into consideration and, if in any way this service can be improved, be well assured that our will is to achieve this goal. Thank you for choosing Starhotels and hoping to welcoming you again, kind regards. Alessandra Bragoli - General Manager", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r413653451", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Worst hotel I've ever been in!", "review": "Family of five, enjoyed our stay here. Location was nice, very close to the Arno river,  convenient, not a bad walk anywhere! Rooms were clean, modern, roomy and very quiet! Breakfast perfect for our family. Would stay here again.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r412742172", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Definitely Would Not Recommend This Hotel", "review": "Dear Guest, I was so pleased to hear that you all enjoyed a family stay at Starhotels Michelangelo. It is great to read that you appreciated our location and that the attention to detail from the team did not go unnoticed. We pride ourselves on being a family friendly hotel and are so glad your family had an enjoyable stay. Thank you for taking the time to write and look forward to welcoming you back in the not so distant future. Kindest regards,  Alessandra Bragoli - General Manager", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r412231980", "sub_review": {"Value": 2, "Sleep Quality": 3, "Service": 1}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Unfriendly welcome and front desk continued to be aloof", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r412166784", "sub_review": {"Value": 3, "Location": 4, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Nice hotel", "review": "The general level of service means a good hotel becomes an average one. We arrived after a long journey by car exacerbated by Florence's one way system which means it is easy to waste ime circling round the hotel to try and access it if you do not have an up to date sat nav. We were welcomed by an aloof and unfriendly front desk who seemed to think they were belonged to a byegone era when only the right clients get service Florence is expensive to park so we ended up paying to park at the equally expensive hotel car park. The car park opposite was not recommended by the hotel  Hotel itself is outside the city but it is a pleasant 20 minute walk away only along the river Hotel itself was largely pleasant and surprisingly quiet- I had to ask them to switch lights on in the small…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r405861893", "sub_review": {"Location": 3, "Rooms": 3, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Simply 'modern'", "review": "Dear Guest, I was most disappointed to learn that we failed to extend the high standards of service, attention to detail and professional courtesy expected by our guests and that we were unable to satisfactorily address and recover these shortfalls during your sojourn. I truly appreciate you taking the time to bring your concerns to my attention and completely understand that these shortfalls detracted from the enjoyment of your visit. Whilst I am unable to turn back the clock, I hope you will accept my assurance that your experience is not typical and should you ever consider staying with us in future, I would be grateful if you would contact me directly, so I may ensure we have the opportunity to fully restore your image of Starhotels Michelangelo. With all good wishes, Alessandra Bragoli - General Manager ", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r401639594", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Early June Showers In Firenze", "review": "Nice quite hotel located in the edge of the center area. Rooms were Ok ,clean and staff were nice and helpful especially Lura,She was very nice,helpful and cheerful.The only thing i did not like is that the location on the map(GPS) was not accurate and I told them that so they can fix it.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r396019465", "sub_review": {"Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Very nice hotel", "review": "Dear Guest, Your review was such a delight to read! I am so pleased to hear that you appreciated the calibre of service delivered by my team, especially Lara, who personally thanks you for your nice words. I am also glad you enjoyed a comfortable nights sleep in one of our rooms. We appreciate you told us about the wrong location on the GPS map, be well assured that this has been taken into consideration.  Thank you for taking the time to write and look forward to welcoming you back in the not so distant future. Alessandra Bragoli", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r392742180", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Wonderful surprise room 310", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r392407580", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "NO AIR CONDITION", "review": "My family of 4, had booked a room, and spent two nights at this hotel from the evening of July 13 to the morning of July 14. It's an excellent hotel for the price, so full marks here. It's also spotlessly clean and well maintained. We stayed in room 310 It's a decent sized room with a comfortable double bed. The window fittings were firm which helps to cut noise, It's actually very quiet around. The decor had a fair deal of old world charm too. The best area was the dinning/bar area. The decor here is rather simple but the ambience is very elegant. And now the best part: The breakfast is just awesome. It may not appear so at first look, but believe me, the spread is substantial, cooked with care and very tasty. Carmelo who was I front supervising the dining area take excellent…", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r391136822", "sub_review": {"Value": 1, "Rooms": 3, "Service": 1}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Perfect", "review": " Dear Guest, we thank You very much for your kind review of our hotel. We are  happy that you’ve valued positively the experience by us, both in terms of products and quality of the service, our priorities. Alessandra Bragoli - Manager. ", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r391123548", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great stay", "review": "This hotel is remodeled and clean but do NOT fall for the air conditioning advertisement.  They suggest they have air conditioning in the rooms.  There is one little vent that blows out HOT air.  I was up the entire night.  Had 5 maintenance people in our room which was a show.  The main reason it doesn't work is because the front desk reception area controls all the temperature levels.  When you leave your room...they shut off the air conditioning.  When you come back after a long day of being out touring and sightseeing...you come back to a boiling hot room.  I had to sleep with cold rags and water bottles all over me just to try to stay cool.  I spoke to management several times and they did NOTHING about it.  Just a caution if air conditioning is important to you.  Prior to…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r389184649", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very Nice Hotel", "review": "Dear Guest, we thank You so much for the review about your experience in our Starhotels Michelangelo. We apologize for hearing that your stay by us was not measured up with your expectations and we will take in consideration your signalization in order to improve the quality of our services. We’ll  wish to see you here again. Best regards. Alessandra Bragoli – Manager ", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r388869205", "sub_review": {"Value": 3, "Location": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Modern feel in the renaissance city", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r388221837", "sub_review": {"Value": 4, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great hotel in Florence ", "review": "On the approach, the Starhotel Michelangelo does not look much like a hotel - more like an office building. The entrance is on the corner so the door are at a 45 degree angle to the street and walking in the lobby opens before you, with whimsical touches of the 60s - note: this is intentional and now becoming quite the trend. Some other reviewers apparently aren't aware of this. The reception area steps down into a large room with multiple sofas that are very comfortable and provide a good place to wait for others. There is another smaller room that has one of the really high end massage chairs - this is adjacent to the small bar and restaurant. The night we arrived they were having a happy hour and had put out a few items for patrons to snack on.  The rooms were among the most…", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r387052739", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Quiet and Restful", "review": "thank you very much for our review. Best regards Alessandra Bragoli ", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r382354401", "sub_review": {"Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Lovely spot", "review": "Great Hotel in Florence. The outside of the building does not look like much but the rooms are amazing. The Hotel lobby is a bit retro but very cool. Gabriel and others at front desk are very helpful with recommendations. Really loved it and would go back. ", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r379549107", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Average", "review": "thank you very much for your kind review .we hope to welcome You again in on of the hotels of Starhotels chain. Sincerely. Alessandra Bragoli – Manager", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r375891529", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "First night in Florence", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r375463656", "sub_review": {"Sleep Quality": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Very average, actually a bit disappointing.", "review": "A bit far of a walk from the train station.  Doable but awkward with luggage - just far enough for a taxi probably if you have heavy luggage.  Excellent value.  Great rooms.  Don't bother with breakfast.  Close to river - solid 15-20 minute walk from central Florence (e.g. Duomo) but good way to start and end your day.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r373667485", "sub_review": {"Value": 2, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Lovely  hotel", "review": "Thank you for your kind review. Best regards Alessandra Bragoli Manager", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r373289293", "sub_review": {"Location": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent location still in a quiet surrounding. ", "review": "In plus - staff was very friendly and polite. We asked to change room several times and although they did not know how to fix 'loud sound in the rooms' issue we had they always proposed another room - location is quite good - very nice lobby   in minus: -paper thin walls. You can here everything that your neighbours or people on corridors are doing. I mean everything. - very poor breakfast. They have nice restaurant but breakfast choice is again very poor (1-2 kinds of cheeses, 1-2 kinds of ham of not great quality, no fresh veg at all, no hot tea!! etc). On the top of that even that poor food was not being re-filled in a timely manner. - we had to change our room 3 times before we got a room with no loud buzzing (funny thing is that no staff were able to say where is the buzz…", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r372958164", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Quiet, clean, and comfortable, but basic", "review": "Dear Guest, thank You for your comment regarding your stay in our Starhotels Michelangelo. We are sorry to know that the experienced was not positive at all. Your highlighting is  important and helps us in the  improvement of our services, that we want to provide to all the guest. We  hope to welcome you again here another time. Sincerely. Alessandra Bragoli – Manager  ", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r372462891", "sub_review": {"Sleep Quality": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Comfortable and stylish home base.", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r372357570", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Great night's sleep", "review": "Friendly and helpful staff. Very clean nice sized rooms; lovely linen, towels and powerful shower. Nicely appointed and designed rooms. Quiet and well equipment. Close enough to centre of Florence to walk everywhere far enough out to be away from the madding crowds. Enjoyed our stay; breakfast could have a little more zip to it would be only critique.", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r371591144", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very nice hotel", "review": "Dear Guest, I’m glad to hear that Your stay here in our Starhotels Michelangelo was pleasant and measured up with your expectations. We are proud of it and that makes us to do always the best in our job. We thank you very much for choosing us for your stay and we hope to welcome You again in on of the hotels of Starhotels chain. Sincerely. Alessandra Bragoli – Manager", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r363464816", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Friendly, Helpful staff in a clean modern hotel close to the Arno River", "review": "A modern and comfortable mid sized hotel located in a quiet spot, a block from the Arno River - an easy walk from the Ponte Vecchio.  Modern appointments, impeccably clean.  Front desk staff helpful.  Great night's sleep.  Breakfast included in my room rate.  Short walk to several outstanding dining options.", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r360042627", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Very comfortable, moderate hotel, good location.", "review": "Dear Guest, thank You very much for spending your time in describing the stay in our Starhotels Michelangelo. We’ve shared with all the staff your good impressions, which help us to do always the best in our work. We’ll expecting to see you again. Best regards. Alessandra Bragoli – Manager", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r358943952", "sub_review": {"Sleep Quality": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "First class hotel", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r358161760", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "good hotel... bit far", "review": "We spent ten nights in Italy on a tour with stops in Rome, Sienna, Florence, Venice and Milan and this hotel was clearly the best.  We liked the rooms, especially the bathrooms. Breakfasts were excellent. ", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r343500282", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "A bit far from attractions but great hotel", "review": "Dear Guest, I’m glad to hear that your stay here in our Starhotels Michelangelo was pleasant and measured up with your expectations. We are proud of it and that makes us to do always the best in our job. We thank you very much for choosing us for your stay and we hope to welcome you once again in Starhotels. Sincerely. Alessandra Bragoli – Manager", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r337032660", "sub_review": {"Value": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Business Hotel", "review": "very good hotel to book in Florence, clean and tidy rooms, very helpful and friendly staff, breakfast wasn't the best as in food quality and buffet location, bit of a walk or transportation needed to visit city attractions and shops", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r334737847", "sub_review": {"Value": 4, "Location": 3, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Don't open the windows!!", "review": "Yhank you for your kind review, we take note for the breakfast buffet.  Best regards  Gaetano gatti", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r326983301", "sub_review": {"Value": 1, "Sleep Quality": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Modern and Clean.", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r325269330", "sub_review": {"Value": 3, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Impossible to sleep : no air-con and lots of mosquitoes! Poor service ", "review": "We stayed 3 nights in October and had a very please experience.  The hotel is modern and our bath even had a tub!  It was very clean and staff was very pleasant.  The bed was very firm but is typical of Europe.  I will say the location is not central but its easy to catch the bus right down the street.  We even walked home one night and so its not too far.  Wifi was average.  The breakfast was good but the eggs seamed to be powdered so i'd skip those.", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r323817821", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Stylish hotel with an Italian finish", "review": "Thank you for your kind review. Best Ragrds Gaetano Gatti Manager", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r322765965", "sub_review": {"Value": 4, "Location": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Clean but not great or welcoming", "review": "Reading another review complaining about the same, I realise I am not the only one who has suffered a sleepless night. The manager answered to that review but they decided to do nothing about it! To the manager : there are those anti mosquito devices that you can plug and last all night, even with the windows open. How come only a smelly spray is offered as a solution to the customers? How come you didn't buy some of these devices? They're very cheap! You definitely don't care about your customers, this is so easy to fix.  We were only given an spray, that lasted nothing with the windows open (impossible to sleep otherwise, since it was so warm, and no air-con!), and mosquitoes were coming again and again.   Then there was the breakfast... In other hotels, when they say that the…", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r319406929", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Decent hotel ", "review": "Dear Guest, we thank You so much for the review about your experience in our Starhotels Michelangelo. We apologize for hearing that your stay by us was not measured up with your expectations and we will take in consideration your signalization in order to improve the quality of our services. We’ll  wish to see you here again. Best regards. Gaetano Gatti – Manager", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r317856543", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Incredible best choice", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r316849091", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Pleasant stay in Florence", "review": "Incredible and so close to town. If you arrive at main train station your 2 stops on the new tram away or within walking distance. this hotel is about 1/2 mile if that from river to walk along it, and only a mile from downtown area of florence. We felt very safe walking at night. The staff was incredible helping with bookings of tours and where to go. The breakfast was well the same at every hotel not awesome however fruit, yoghurt is a great way to start your day. the room was clean and the bed was comfortable. We got lucky with this hotel and would stay again and recommend to anyone. ", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r315948796", "sub_review": {"Value": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great stay", "review": "Dear Guest, we thank you very much for your kind review of our hotel. We are  happy that you’ve valued positively the experience by us, both in terms of products and quality of the service, our priorities. We’ll wish to host you here soon again. Best regards. Gaetano Gatti - Manager.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r315941216", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Modern Hotel with Good Transport Links", "review": "Hotel was good, rooms were nice and clean, location was not in the center, though getting to the city center is not far and pretty easy. Free wifi was good, staff were friendly and helpful, breakfast was also pretty standard. It was a good stay, no complaints.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r315843627", "sub_review": {"Value": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Nice hotel, but not close to city center", "review": "Dear Guest, I’m glad to hear that Your stay here in our Starhotels Michelangelo was pleasant and measured up with your expectations. We are proud of it and that makes us to do always the best in our job. We thank you very much for choosing us for your stay and we hope to welcome You again in on of the hotels of Starhotels chain. Sincerely. Gaetano Gatti – Manager", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r315162514", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Nice modern luxury hotel.", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r314893784", "sub_review": {"Value": 4, "Sleep Quality": 5, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Nice place on outskirts of tourist attractions", "review": "Nice modern luxury hotel. Lovely foyer mostly nice staff, with the exception or one desk manager who being technically challenged was unable to charge my credit card correctly and almost refused to give us our pre booked room,even though it was 11.30PM at night and my 1&3 yr old children were falling out of their standing wanting to sleep.He did eventually apologise after yelling at us that it was impossible.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r314480126", "sub_review": {"Rooms": 3, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Ideally Suited to Tour Groups ", "review": "Dear Guest, thank You for your comment regarding your stay in our Starhotels Michelangelo. We are sorry for the incovenience, by the way we need a credit card in order to guarantee all the reservations we have. The receptionist asked you a credit card at your arrival (very late in the evening) as per our procedure, because we receipted your reservation without it.  We  hope to welcome you again here another time. Sincerely. Gaetano Gatti – Manager", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r311939504", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Highly recommend ", "review": "We were part of a tour so no issues checking in or out.  The lobby is nice and breakfast was OK.  Lots of pastries and cheese.  No hard boiled eggs but they were able to accommodate gluten allergies.  Rooms were nice and modernly furnished.  Free wifi but no washcloths (take note American travelers!) We were near the water but not on it so no real place at the hotel to go and enjoy being outside with a view that I saw.  It was a pretty good walk to get to the Duomo and the Uffizi, but if you're a walker it's not a problem.  Service was OK.  I was able to get change at the front desk but my Aunt asked the next day and they said they couldn't do it- so you be the judge!  Nice places to eat around the hotel and I never felt unsafe walking around in the area.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r309232143", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Nice Hotel", "review": "thank you for your kind riview. Best regards Gaetano Gatti Manager", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r306962666", "sub_review": {"Value": 4, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Not bad - but nothing standout", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r302466779", "sub_review": {"Location": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Great location", "review": "Is a decent hotel, about 15 minutes by cab from the Florence Train station and is not too far away (about 30 mins walk) from the sights - Uffizi, Bridge-Pente Vecchio etc. Breakfast is reasonable, housekeeping efficient, room was averagely large (we only look for hotels with rooms larger than 20m/200 sq ft and this was) Since we were midway in our trip we were keen for a laundrette nearby and 5 minutes walk was one - also next to it is a Carrefour and some really nice restaurants. We'd booked the hotel about 2 months prior to trip so got a decent rate (though still quite expensive when compared to Rome), however the rack rate running at the hotel when we checked in was more than double what we paid...and at that price it is just not worth the stay...there are many more hotels…", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r301500581", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Nice Hotel in Nice Firenze", "review": "Dear Guest, thank You for your comment regarding your stay in our Starhotels Michelangelo. We are sorry to know that the experienced was not positive at all. Your highlighting is  important and helps us in the  improvement of our services, that we want to provide to all the guest. We  hope to welcome you again here another time. Sincerely. Gaetano Gatti – Manager", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r294912584", "sub_review": {"Location": 4, "Rooms": 5, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Highly recommended! ", "review": "Stayed at this hotel with a group of friends, very helpfull front desk team they were always helpfull with transport; suggestions and also helped with wifi  Breakfast was great in the mornings room very nice and clean with addition of great coffee.  Great location only 10 minutes walk from centre to the hotel, train station and shops close by.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r291609106", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "a wonderful treat of space", "review": "Dear Guest, we thank You very much for your kind review of our hotel. We are  happy that you’ve valued positively the experience by us. We’ll wish to host You here soon again Best regards. Gaetano Gatti - Manager.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r285779342", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Stylish hotel in Florence", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r284864613", "sub_review": {"Value": 4, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Trip to Florance", "review": "We were booked into this comfortable 4 star hotel with a group tour. The décor is contemporary, the spacious lobby is on several levels, and the room was large, well equipped and quiet. It's about a 15 minute walk from the popular attractions in Florence., but the footsore traveler can take a cab back, as we did. The staff made a special effort to locate and return a personal item that had been left behind in the breakfast room.", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r284124063", "sub_review": {"Value": 5, "Rooms": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "holiday", "review": "Dear Guest, thank You very much for spending your time in describing the stay in our Starhotels Michelangelo. We’ve shared with all the staff your good impressions, which help us to do always the best in our work. We’ll expecting to see you again. Best regards. Gaetano Gatti – Manager", "date": "January 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r283064817", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great, Clean Hotel in Florence", "review": "We stayed at starhotels Michelangelo in October 2014 the hotel is nice but the location is a bit far from the attractions, the room was average size the reception staff were nice, breakfast was included but was terrible nothing exciting about it and very low quality and cheap and to top it up the breakfast are staff were not happy to see the guests, they couldn't be bothered to welcome the staff, specially the floor manager! Overal good hotel but don't get have breakfast", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r281703531", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely hotel within 15 minutes of city centre", "review": "Dear Guest, thank You for your comment regarding your stay in our Starhotels Michelangelo. We are sorry to know that the experienced to our restaurant was not positive at all. Your highlighting is  important and helps us in the  improvement of our services, that we want to provide to all the guests. We  hope to welcome you again here another time. Sincerely. Gaetano Gatti – Manager", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r280061147", "sub_review": {"Value": 4, "Rooms": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very comfortable", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r276606747", "sub_review": {"Value": 4, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Cute hotel at the edge of town", "review": "We stayed here for 2 nights during a recent trip through Italy. After a very uncomfortable 2 nights in Venice, this was a welcome surprise.  The room was quiet, quite large and surprisingly modern. It is located a bit of a walk from the Duomo, Ponte Vecchio, etc. so that was a bit of a negative. The breakfast buffet was good, but also limited relative to other hotels that we experienced during this trip.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r274300121", "sub_review": {"Location": 3, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "2 nights in fForence", "review": "Dear Guest,  Thank you for dedicating your time to share your experience at Starhotels Michelangelo. We are glad to hear that your experience at our hotel was positive and that our standards have surprised you. We make a great effort to ensure that we meet our guest expectations.  Hoping to welcome you soon in one of our Starhotels,  Kind Regards, Gaetano Gatti General Manager", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r273825138", "sub_review": {"Location": 4, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Thought it would be better", "review": "Starhotels was the first hotel stop in our tour of Italy. Its set a great tone for the trip. Our rooms were great and the overall hotel was nice, cute and modern. Great service by staff on all levels- from the bartender to front desk to the breakfast wait staff. The hotel offered free breakfast every morning which was a great spread. Only cons: there is one iron for the entire hotel (which is quite comical) and the wifi SUCKS!  Otherwise it was a great stay!", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r273116459", "sub_review": {"Value": 3, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Very nice room, small details need to be fixed.", "review": "Dear Guest,  Thank you for sharing your experience of Starhotels Michelangelo. I am glad to hear that your experience was overall positive. Your feedback helps us and it is really crutial in order to improve the quality of our service and I am happy to share with you that we have increased the number of irons in the hotel.  Hoping to welcome you soon in one of our Starhotels,  Kind Regards, Gaetano Gatti", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r270797367", "sub_review": {"Sleep Quality": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Easy, comfortable hotel", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r264599684", "sub_review": {"Value": 4, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Not Bad For A Boutique Hotel", "review": "Definitely the most comfortable bed I've ever had in any hotel! Big, clean, firm, felt great!!!  Spacious room, clean. Well fitted bathroom, clean, everything you need.  Breakfast was included, but cold bacon and cold scrambled eggs don't cut it for me.... why not have someone make them fresh for those who want it? Rest of breakfast is fine, fresh fruit (important!), good rolls and croissants, good cereal selection and very good coffee.  Nice bar though I would suggest they either change the video on the big TV screen, it becomes really boring really quickly, or turn the thing off entirely. It serves no purpose once you've seen the ad for the Starhotels about 50 times in an hour. And because the screen is over the fireplace, you are drawn to look at it.... Reception fine,…", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r263758772", "sub_review": {"Value": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice stay", "review": "Dear Guest, we desire to thank you for the time you dedicated for us with your kind feedback. Comments and suggestions of our guests are really appreciated and help us to improve the quality of our services. Hoping to welcome you here again, best regards,  Gaetano Gatti - General Manager", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r263747827", "sub_review": {"Rooms": 4, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Updated hotel but a few glitches", "review": "Location of the hotel is definitely not central , so don't expect lots of shops , convenience stores or pizzeria nearby. There is however, a bus and a tram station near the hotel , which would be advantageous for local residents who are on a mini vacation. Lobby is small , but it was beautiful . It has subdued lighting , but somehow you could feel the tranquility of the place. The room  is quite small for my standards, but expected for European hotels. Yet it is still functional, and provides the basic necessities . And worth mentioning is the nice bathroom, flat screen television and comfortable king sized bed for me and my spouse. Wireless internet is complimentary, and fairly fast enough to catch up with my e-mails and social media networks. Breakfast is served buffet style,…", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r259114536", "sub_review": {"Value": 4, "Location": 3, "Rooms": 4, "Cleanliness": 5, "Service": 3}, "travel_purpose": "", "rating": 3}, {"title": "Predictable quality", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "February 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r255405309", "sub_review": {"Value": 4, "Location": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Close to Firenze Airport", "review": "Elegance and comfort, convenient location and professional service. That’s what we expect when booking our stay with the Starhotels, a small group of Italian family run hotels originating here, in Florence. Classic design with contemporary touch, spacious yet cosy lobby where you can always find a place for yourself. Catch up on calls, or just relax browsing their selection of travel, art and design books. There is a small bar, and the coffee is really good too.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r247210331", "sub_review": {"Location": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Convenient Location and Spacious Rooms", "review": "Dear Guest, thank you for the time you spent to convey your views about Starhotels Michelangelo Firenze. It is a great pleasure to hear that your expectations were satisfied. These kind words motivates us to reach our high standards day by day. Hoping to welcome you very soon in one of our Starhotels, Kind Regards  Gaetano Gatti - General Manager", "date": "February 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r247104131", "sub_review": {"Location": 4, "Sleep Quality": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A nice stay", "review": "We stayed here for one night, as we were to fly out of Firenze. We arrived from Siena to Firenze's train station, took a short taxi ride and arrived at this hotel two hours earlier than check in time. The staff accommodated us as they had an available room-which was a pleasant surprise.  This is a modern hotel, large, with a bar and exercise room. Front desk staff were courteous, multi-lingual, and took time to answer questions about restaurants and sites nearby. A tram was conveniently in front of the hotel and it was a short ride to San Lorenzo marketplace.  Room was very spacious, modern decor, couch, and amenities. The surrounding area was quiet and mostly residential. I would stay here again.", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r242305946", "sub_review": {"Location": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Pleasantly Surprised", "review": "Dear Guest, Thank you for the kind words you shared on Starhotels Michelangelo. We are glad to hear that you have appreciated both the quality and the service of the hotel: our priorities. The positive experience you shared make us proud of our property and company.  Thank you for choosing us and hoping to welcome you soon in one of our properties, Best regards  Gaetano Gatti General Manager", "date": "November 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r241227119", "sub_review": {"Value": 4, "Location": 5, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "MEMORIES SAVED", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r239924275", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A bit noisy", "review": "I want say that I am very impressed with your hotel staff and their service.  I received my Painting in its Tub in excellent condition and In less than a week after leaving it there by mistake. We were able to save our memories through this hand painted canvas. I highly recommend your hotel & staff anytime.  Your professionalism is impressive, it made a huge difference on our vacation and memories. Regards, Santia Pons", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r239097864", "sub_review": {"Location": 3, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Can't sleep here in November!", "review": "Dear Guest, thank you for the time dedicated to write a review of your recent stay with us, we are really glad to realize that you have been impressed by our service. We have shared your positive impressions with all hotel Staff, your kind words make us very proud. Hoping to welcoming you again in Starhotels, best regards,  Gaetano Gatti - General Manager", "date": "November 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r238680743", "sub_review": {"Value": 3, "Location": 4, "Rooms": 2, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 2}, {"title": "Nice Accomodations", "review": "Well located hotel. Room is simple but a bit noisy due its proximity with the lift. Staff was polite and provided proper info about transport, landmarks and available for any request. There are 2 bus lines close to the hotel that connects to the downtown.", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r238298768", "sub_review": {"Value": 3, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Super convenient", "review": "Dear Guest, thank you for your comment regarding your stay in our Starhotels Michelangelo. We are sorry to know that the experienced was not positive at all, due to noise in the room. Your highlighting is important for us and will help in the improvement of our services. We hope to welcome you again in Starhotels.  Best regards,  Gaetano Gatti – General Manager", "date": "November 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r238058453", "sub_review": {"Location": 5, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Pleasant Surprise", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r234922455", "sub_review": {"Value": 4, "Rooms": 4, "Service": 3}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "It started in a wrong way...", "review": "Clean and modern this hotel definitely surprised me with its superior quality ideal for business travelers.  This hotel seems to be geared towards large groups and conferences.  I would not particularly recommend it for families or couples.  Not centrally located, but rather close to the convention area.  For tourists looking for shops, galleries, sites, and restaurants - this is not an ideal area and not the nicest part of town.  However, the hotel amenities are nice.  I did have to drag  my suitcases into the hotel.", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r234835086", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Really nice Hotel", "review": "Dear Guest, first of all thank you for the time spent on giving us a feedback. It is really a pleasure for us to hear that we met your expectations in terms of cleanness and facilities. We deeply apologize for the inconvenience occured with your suitcases. In the Lobby a Poter is alwaiys at disposal to help Guests with luggage, probably at your check-in he was delivering someone else bags. Your comments are really important, helping us to improve the quality of our service. We hope to welcome you again in Starhotels, Kind Regards,  Gaetano Gatti - General Manager", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r234424359", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Wonderful Hotel", "review": "When I came receptionist said \"We have a problem for your first night...\" - due to overbooking. And of course, I wasn't very happy. OK, it happens, I expected a nightmare but at the end it was great how they managed it. I was personally taken by porter to the hotel in the neighborhood , got free parking for my car and they upgraded my double room into junior suit when I came back next night. Instead of \"lousy\" my rating was changed by their actions into \"excellent\" - problems can happen in any kind of business, the way of managing them make distinction between bad and good.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r232270732", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Wonderful Hotel.", "review": "Dear Guest, first of all we want to thank you for sharing your impressions on your recent stay with us and for the kind comments about our service . We are really sorry for the unusual unfortunate inconvenience occurred during your check-in but it's a great pleasure for us to come to know that you anyway appreciated the attention our Staff gave you on arrival.  We sincerely thank you for your time you dedicated to us and hope to have the possibility of welcoming you once again in Starhotels. Best regards  Gaetano Gatti - General Manager", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r231232086", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Comfortable and modern hotel", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r230762861", "sub_review": {"Location": 3, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Nice Hotel", "review": "We stayed here on a Globus tour.  The room was comfortable.  The facilities were good.  We found, however, that it was a little too far out of the city centre for us.  We moved on to another hotel right in the middle of the city next to the Duomo.   The cost was considerably more but it was worth doing.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r230391541", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Worst hotel based on service in all of my travels to Europe", "review": "Dear Guest, Thank you for the your time spent to convey your views about Starhotels Michelangelo Firenze. Your feedback helps us to understand the perceptions of our guests. It a priority for us to meet  your expectations and we are glad to understand, despite our distance from city centre, that our service and facilities got your satisfaction. We sincerely hope to welcome you again in Starhotels in the future, Kind regards,  Gaetano Gatti - General Manager", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r229417984", "sub_review": {"Value": 2, "Sleep Quality": 4, "Service": 1}, "travel_purpose": "Traveled on business", "rating": 2}, {"title": "Good hotel, close to the train station but service was lacking", "review": "The staff wasn't super friendly, but the room was very spacious and clean. The location wasn't the best, but by taxi it was pretty close to things. There isn't a whole lot to do in the neighborhood. Also, the food at the hotel was only average. However, if you need to catch a train or want to stay at a nice hotel on a budget this is a great hotel for it!", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r228505561", "sub_review": {"Rooms": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Nice hotel, but not best location", "review": "Dear Guest, Thank you for spending your time to write about our Starhotels Michelangelo. We are glad to hear that you have enjoyed your stay with us, even if we were not able to impress you at all. Your comment really helps us to understand the perceptions of the guests and to find the right way to improve. Hoping to welcoming you again in Starhotels, Best regards  Gaetano Gatti - General Manager", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r227479389", "sub_review": {"Value": 3, "Location": 3, "Service": 3}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Tough review to write...Lots of + but the small (-) make it a 3 * experience", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r226979840", "sub_review": {"Value": 3, "Sleep Quality": 4, "Service": 3}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Great location and average services", "review": "So off the bat, the location isn't bad at all. 15 minute walk from the station, and 20-25 minutes to the center. The walk through to the center is through the cool neighborhood with cafes and good restaurants all over. The quality of the hotel room is great with premium fixtures and bedding. The rooms on floor 1 are larger than the rest, and should be requested.  The breakfast as per other reviews is terrible. They really need to do something about this. Scrambled eggs made from egg beaters, no fresh juice and stale coffee. YUCK!.   Now the bad parts. Hotel staff control the room temperature from the front desk, and the AC in the rooms leaves a lot to b desired for. I am an industrial engineer, and I know they were not running the AC at capacity. We even had to change rooms…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r226656671", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Loved this Hotel", "review": "Dear Guest, Thank you, first of all, for finding the time to write this review, any suggestions or opinions related to our service is highly taken into consideration. We understand what you had experienced during your stay was unpleasant and want to apologize for this. We have carefully verified all the details involved with all our Staff, and work to better offer customer satisfaction and an impeccable service. The inconveniences occurred are very regrettable and we will do our utmost to avoid similar situation in the future.      Hoping to welcoming you again in Starhotels,  Kind Regards,  Gaetano Gatti - General Manager", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r225896353", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Ideal apart from breakfast", "review": "We stayed in the hotel 3 nights during our visit to florenc The Hotel location was great as it is 10 min walk to the city Center, also the same to the rever. There was only 2 restaurants which are 5 min walk The rooms were adequate for couples but we faced problem with the availability of soup and shampoo which we requested many times with no reply!! This really annoyed us The breakfast was poor even no toast bread was available during our stay We found that the star Hotel chain is only decent and not worth the money paid ( we also stayed in the same chain in Milano due to the reservation done by our travel agent) To be honest the triple room was spacious and have more facilities", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r225754853", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Breakfast service was a total mess.", "review": "Dear Guest, thank you for your comment regarding your stay in our Starhotels Michelangelo. Your highlighting relating our service is important and, if in any way this service can be improved, be well assured that our will is to achieve this goal. We are really sorry to hear that you were not impressed by our services, we think that the problems you refer about bath amenities in the room and toasted bread at breakfast are isolated accidents and we will do all our best to avoid this kind of inconveniences for the future. We  hope to welcome you again in Starhotels, Best regards  Gaetano Gatti – General Manager", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r222281930", "sub_review": {"Rooms": 4, "Cleanliness": 5, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "4 beds in 1 room is not a family room", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r221429821", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Decent clean rooms, free wifi in rooms but weird breakfast set-up", "review": "Hotel pictures suggest 2 rooms for a family room. In reality 4 beds are placed in a standard room (sofabed + extrabed). Apparently business travellers do not require privacy when travelling with their family. Not really funny.  The airco is not up to its job.  ", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r221015240", "sub_review": {"Sleep Quality": 4, "Rooms": 4, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Modern rooms but dreadful service. ", "review": "Dear Guest,  we thank you for taking the time to write your experience in our Starhotels Michelangelo. We are really sorry to understand that your stay was not measured up with your expectations. Our family rooms as per our site are huge rooms with sofa bed where an extra bed can be easily fitted. We thank you again for your review and wish to see you here again in Starhotels.  Best regards.  Gaetano Gatti – General Manager", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r220820153", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "A modern hotel with a classic touch", "review": "We stayed here for a couple of nights for a sightseeing trip at the beginning of August. The hotel has a lovely reception area. It was quite dark and cool, which was pleasant after the hike from the station (only about 15 minutes, but it was very warm and sticky). The reception staff were professional and welcoming. The location of the hotel is okay: only about 20 minutes walk from the centre. Not the most gorgeous area, but you get what you pay for in terms of the room which was of a reasonable size for Florence and quite modern and clean. We had asked for a quiet room away from the lifts, which the staff honoured. It was very quiet with the windows shut. Unfortunately, the staff cannot predict the antisocial behaviour of your neighbours and so we were rudely awoken by the…", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r219348873", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Wonderful modern hotel", "review": "Dear Guest,  Thank you, first of all, for finding the time to write your review on Starhotels Michelangelo, it is really important for us to listen to the feedback of our Guest in order to improve our service. We deeply apologize for the inconveniences occurred during breakfast time, we have met the breakfast management and highlighted the different issues you have spotted. We did our best to solve these problems and decided for a new organization of breakfast staff, to be sure that matters like those you have reported will never happen again in the future. Our Guest satisfaction is our priority and we regret when we don't achieve what we aim at.  Hoping to see you soon in Starhotels,  Best regards,  Geatano Gatti  - General Manager", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r218920495", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Super modern, sleek, and classy", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r218040012", "sub_review": {"Value": 4, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good location, Nice place to stay", "review": "My husband and two teens stayed here 3 nights as part of a Globus tour package. This was a very nice option in Florence; maybe our favorite of the trip. We were able to get two adjoining rooms, which was nice.The rooms were very modern and sleek, but on the small side, which was fine. There were many things within walking distance...the ponte vecchio bridge, restaurants and shops. Very comfortable beds and bathroom facilities, very clean, and courteous employees.", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r216600318", "sub_review": {"Value": 4, "Location": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Adequate, but lacked ambience", "review": "Dear Guest,  we are glad to hear that your stay here in our Starhotels Michelangelo was pleasant and measured up with your expectations. We are proud of it and that makes us to do always the best in our job. We thank you very much for choosing us for your stay and we hope to welcome you and your family once again in Starhotels.   Best regards, Gaetano Gatti – General Manager", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r216497513", "sub_review": {"Value": 3, "Sleep Quality": 3, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Neat hotel in central location", "review": "We had 2 rooms & had stayed from 13/7 to 15/7. the room were neat & clean, the staff was helpful, Tram station is very close 1 min walk & 15 min walk to the main station, breakfast spread was good, overall good experience to stay at this hotel", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r216159216", "sub_review": {"Sleep Quality": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Sexy modern hotel a bit out of town", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r215798625", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Excellent Hotel - Location only (slight) negative", "review": "Great hotel with an ultramodern, lowlit lobby that makes you feel like James Bond and a great breakfast. A bit of a walk to the important sites of the historical center but the city bus C this departs from practically outside takes you there in just a few minutes. Ideally placed for Fortezza da Basso, Cascine. The rooms are generously sized and very comfortable. The wifi had major problems when I was there which compromised work I had to do, though.", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r211577950", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Great Place in Florence", "review": "Dear Guest,  thank you very much for spending your time in describing the stay in our Starhotels Michelangelo. We’ve shared with all the staff your good impressions and comments, which help us to do always the best in our work. We’ll expecting to see you again.   Best regards.  Gaetano Gatti – General Manager", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r211043839", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Nice place. Nice location. Nice buy!", "review": "Stayed here during business for 3 nights in June 2014.  From the outside, the hotel leaves a lot to be desired and doesn't present the best vibe.  However, the inside and especially the rooms, more than make up for it.  Friendly staff, very large room with modern amenities, a King bed, a sitting area, and a Huge bathroom.  Breakfast was European standard; staff was very friendly - special kudos to the bartender.     Only negative is the hotel is quite a walk away from city center and the historic era near Ponte Vecchio.  But it is walking distance (about 1/3 of a mile or so) from the Train Station at Santa Maria Novella.  This is the only thing preventing me from giving it 5 stars.", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r210480388", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Brilliant at the price", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r207726949", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "pleasant stay", "review": "A very good hotel at Florence and I must have been lucky to get the room at a very good price or they must be selling low. It's a star hotel and is very close to the station while the location of the hotel is away from the hustle and gives a good feel of the beautiful Tuscan city. The hotel is a bit far off from the historical centre but considering Florence to be a small city, you are never too far off and can be covered even by walking. However, you have the tram and bus stop right near the hotel. Reception staffs are very courteous and truly serves with a genuine smile especially the lady who took care of my check in. The room was very good, modern and the breakfast was a good elaborate spread. I will surely recommend staying in this hotel", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r207288249", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Hotel with Globus Tour", "review": "Dear Guest,  I thank you a lot for the positive impression regarding your stay in our Starhotels Michelangelo. Your comment makes us feel so proud and helps us to do all our best to continuously enhance the quality of our service. We are waiting for you in one of our Starhotels.  Best regards Gaetano Gatti General Manager", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r207099725", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "A pleasant stay", "review": "I recently had a very enjoyable 3 night stay.  The hotel has good sized, clean, quiet rooms and the excellent wifi connection made my stay easier.  Breakfast was good too.  I walked to most of the attractions from here but there was also a bus stop nearby and a tram stop almost in front, only one stop away from the central train station.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r206162163", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Fresh Property", "review": "Dear Guest, thank you very much for spending your time in describing the stay in our Starhotels Michelangelo. We’ve shared with all the staff your good impressions, which help us to do always the best in our work. We’ll expecting to see you again in Starhotels.   Best regards Gaetano Gatti General Manager", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r205571743", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Nice, could be better", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r205124611", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Ok hotel", "review": "Three of us stayed in one room for one night in May, a spur of the moment visit to Florence.  We asked for three single beds, but were given a double bed and one single. To be fair, we didn't bother telling the staff about the mistake or asking them to change rooms.  The hotel looks nice and our room was modern, lovely and big. Because we were only there for one night, we didn't unpack so I can't comment on the storage space for three people.  Reception staff were very helpful with a map and information on transport and how to get to the attractions.  One member of staff gave us quite incorrect information on getting to the outlet mall though.  Our key cards didn't work when we returned to the hotel at night, so we went back down to the lobby to sort it out, and were told that…", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r204904732", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Clean, modern and helpful staffs", "review": "Dear Guest, fiirst of all we would like to thank you for taking the time to convey your comments regarding your recent stay at Starhotels Michelangelo in Florence. Any suggestions or opinions related to our service is highly taken into consideration and, if in any way this service can be improved, be well assured that our will is to achieve this goal. Together with the entire hotel staff and management, we would like express our apologies for the inconveniences caused. We aspire to certain essential priorities, among many, such as courteous staff aimed at customer satisfaction and impeccable service. We  hope to welcome you again here another time. Sincerely. Gaetano Gatti – Manager", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r204864402", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Very pleasant stay", "review": "Just came from a 3 night stay at the Starhotel Michealangelo in Florence.  It was an ok hotel, but nothing special.  When I originally arrived in my room I found many hairs and stains on the bed sheets.  I called the front desk and they promptly called someone to change them.  Other than that, the hotel seemed very clean.  The bathroom was newly remodeled. Beds are hard, but that is quite common in Europe.  Hotel is easy to reach from the SMN rail station - it is just 1 stop (5 min) on the tram.  It is about a 15-20 min walk to the heart of the tourist district, but I enjoy walking so it wasn't a big deal for me.  The area felt very safe.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r204135315", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good, friendly hotel", "review": "Dear Guest, thank you very much for spending your time in describing the stay in our Starhotels Michelangelo. We’ve shared with all the staff your good impressions and your experience with us, which help us to do always the best in our work. We’ll expecting to see you again. Best regards. Gaetano Gatti – Manager", "date": "February 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r195431416", "sub_review": {"Value": 5, "Location": 3, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Beautiful modern hotel", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "January 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r191729939", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Good Hotel", "review": "We recently held a conference in Florence, and the hotel has good conference facilities, eager staff, but of course not five star quality. Brilliant rooms and cleaning services, but no iron. Great experience all in all, would visit again!!", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r186182661", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very nice and luxurious", "review": "Clean, spacious and modern. Luxurious rooms, bathrooms, lobby. Breakfast was nice- continental  (scrambled eggs/bacon available  for those who enjoy a cholesterol rich start to their day) Good location near to the tram and bus stops, offers a nice walk into the centre along the river. Receptionists were helpful. Overall really enjoyed it, my number one choice every time I'm in Florence given the cost-benefit analysis.", "date": "November 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r185296901", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Funky hotel", "review": "Luxurious hotel, helpful staff, very clean rooms but too expensive (16 euros for a hamburger + 5 euros for the \"room service fee\" and 4 euros for 330ml of water from the mini-bar) and with many facilities charged as extra (e.g. WiFi).", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r184197086", "sub_review": {"Value": 3, "Location": 3, "Rooms": 4, "Cleanliness": 5, "Service": 3}, "travel_purpose": "", "rating": 4}, {"title": "A Mixture of Experiences...", "review": "The hotel is really vibrant and fun. Good service, yummy breakfast, functional gym facilities. The wifi system was really annoying and we thought given what we paid to stay there the hotel would be good enough to offer free wifi to guests in their room, rather then in the lobby that times you out every 30 minutes. The hotel was a fair distance from the main center of Florence and dining options etc are fewer, however there were great sights to see on the walk into town", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r183461238", "sub_review": {"Location": 3, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Florence average hotel", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r183083475", "sub_review": {"Value": 3, "Location": 2, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Excellent Stay, Great Location with Friendly Staff", "review": "Modern decor. On a side street not close to the sights. breakfast was good, not much fresh fruit. The bar in the evening was very nice with good service. Front desk service was inconsistant, sometimes excellent and sometimes poor. Rooms were small beds were not that comfortable. Internet worked well. just okay for the money", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r182713739", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Enjoyed our stay", "review": "We had a great stay at Michelangelo Hotel in Florence, Italy.  When we arrived by train, we hopped onto the tram and got off at the first stop.  The hotel was just steps away from the tram stop which made it very convenient, when carrying luggage from the train station.  When we arrived we were greeted by very friendly hotel staff, who showed us a map of Florence and places to go.  The lobby was very modern, with comfortable couches, fireplace and bar.  Our room was exceptionally clean and modern, with a larger then normal size bathroom for European standards.   Breakfast is served in the lower level in a large dining area.  They had a variety of pastries, eggs, bacon, fruit, juices, coffee, cereal , and yogurt to choose from which is included in the cost of your room.   My…", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r182537370", "sub_review": {"Location": 4, "Sleep Quality": 3, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Nice and Clean", "review": "This is a very modern, sleek hotel.  Beautiful lobby with a fireplace, bar, and free massage chair.  We had a triple room with two single beds and an alcove with a separate bed, chair,TV, and private terrace.  Breakfast had a large variety.  Two minor complaints were regarding the room.  The bathroom door was a frosted glass which means that if you're in there at night, the light will shine in the room.  Also, everything echoes due to the minimalist design and wood flooring.  My mom dropped a necklace on the floor and it jolted me out of my sleep.  Otherwise, great location near the Arno River.  Highly recommended.", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r182382902", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Can't use phone and Ethernet at the same time", "review": "They have remodeled most of the rooms. We had a room on the first floor that has not been updated yet, but it was nice and spacious! When we arrived our room was not clean and the offered us an upgraded room. They came to clean right away and everything was great! Mistakes happen especially at a busy time of year! However they did a good job of resolving the issue quickly!", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r182379595", "sub_review": {"Location": 3, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Excellent", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r182236502", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Very nice hotel near the tram", "review": "Great location. Within walking distance from attractions. Rooms were clean and spacious.  Service was great.  Breakfast was fantastic.  Wifi was free. The lounge was very inviting and drinks were reasonable.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r179089592", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great Hotel in Florence. A Bit Of A Walk", "review": "Very nice hotel right across the street from the tram for easy access to other areas of town.  The staff was pleasant, the bed comfortable.  The room was nicely decorated. The bathroom was a typical European bathroom, a little small by American standards, but very clean and worked fine for us.  The breakfast has a good variety of meats, cheeses, eggs, pastries, fruit, juices, coffee and tea.  Our room on the first floor even had a nice, private patio.  We were on a tour, so I don't know the prices at this hotel. I would recommend this hotel.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r177628239", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Not all that it is hyped up to be....", "review": "The hotel was nice and comfortable.  It was a bit of a walk to all of the restaurants and nightlife in Florence.  The staff was very helpful and guided us to the places that we needed to go.  They even helped us find the rental car agency that we were looking for.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r176346175", "sub_review": {"Value": 2, "Location": 4, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good modern hotel", "review": "There is no doorman...so if you drive over from France..as we did...run in and let them tell you how to get to car park that costs 23€ a day. Fine ...this trip was a 2 night gift and we were just happy to be in Florence.The hotel is well placed, not slap bang in the action but a stones throw from the river Arno and in the \"consulate\"area of Florence. The room was perfect,lovely modern decor and very roomy and clean.Ok... the window overlooked the entrance to the car park and the back of some building but who cares! We were here for the Uffizi and the David...need I say more. Well I should about this 4 star hotel: the shower is a trickle of water and whenthe weather  was as hot as it was...a trickle is very disappointing. Let us move on to the towel...it was threadbare and had…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r176047673", "sub_review": {"Value": 5, "Location": 3, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great service, excellent rooms", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r175343251", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Very good deal", "review": "This is my first TripAdvisor review, and I just had to write one for this hotel. My two friends and I stayed here for 2 nights and had the most amazing experience. The room was impeccable and comfortably fitted the 3 of us (3 single beds). The bathroom was nice and modern, and we got free internet in our rooms simply by checking in on Foursquare. The free breakfast was very nice (eggs, oatmeal, delicious nutella croissants, etc.), but what topped it all off was when I called to get a wake up call at 4am for my flight, the front desk took the initiative to ask if I wanted a to-go breakfast. I didn't even know that was possible, and I just really appreciate it when staff really think about your needs - Sure enough I got a to-go bag of fruit, yogurt, and crackers that helped make…", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r173621790", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "nice hotel, nice location but beware", "review": "The hotel is very good, well designed and with a good breakfast. The room was what we need with a great bathroom. Te location is also nice, not in the center (but public transportation works well in Firenze) but close to everywhere. We really appreciate staying 3 nights there and enjoyinig the many attractions of Firenze.", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r172013482", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Welcome rest and relief", "review": "They say they offer free internet but it is only in the lobby. They say they offer cribs, but only in certain rooms. My daughter had to sleep between us on the double bed, they could provide us a crib on the second day.  They say there is no need to reserve a parking place but the hotel has only 10 parking lots, so we couldn't get one. They work with an external garage where they can keep the  cars with the same rate (23 euro per night) but they charged us extra to bring cars back and forth.", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r171292676", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Nice hotel but far from tourist attractions", "review": "Slightly on the edge of the central action - and thank goodness for that - Florence in July/August really is wall-to-wall tourists (armies of large tour groups being your biggest inconvenience) so after a full day of exploring the unmissable historical centre and all its attractions whilst enduring the queues all in very hot conditions, your reward comes even as you make your way back to the hotel with quieter, wider streets. The hotel was modern and our room (a quadruple) was very well laid out. The air conditioning was so effiecent and the beds so clean and comfortable. Robes and slippers and a spotless bathroom just added to the luxurious, efficient feel. We loved breakfast. Bacon and eggs being the hot staple but there's an enormous range of meats, cheese, cake, fruit,…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r170656008", "sub_review": {"Value": 4, "Location": 2, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Loved it", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r168828918", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Excellent hotel! Highly recommend!", "review": "We got upgraded on arrival so our review may be a bit biased.  Room was clean, modern and had a comfortable bed. All staff were friendly even though at times they were clearly stressed. Wifi is free in lobby but not always working. Massage chair is free and highly recommended just don't overdo it! Location is about 15 min walk to the city  centre and 10 min walk  to the train station. We got tram to and from station due to luggage which is 1.40 euros. It's only one stop and hotel is just across road. Breakfast is good. Bacon, scrammbled eggs, fruit, pastries, yoghurt, juices,  cereals.  Would definitely stay again.", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r168767717", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "All it lacked was strong Internet", "review": "We arrived at Starhotels for a 4 night after a 5 night stay in venice. As we walked in it was clear the hotel was immaculate. The decor was fantastic and the lady at the front desk was more than helpful and very welcoming and polite. We had a double standard room, it was perfect. Spacious, clean, air con and again decor was second to none. Fresh towels and toiletries everyday. The location was good also but only good if you are willing to walk 15/20 minutes in to the main part of Florence and we were more than happy to. It's just a beautfiul walk down the River Amo and then when you get to the famous Ponte Vecchio bridge you turn in to the centre of Florence where you can see all the best attractions. The hotel was great value only down side being that you only had free wifi…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r167523084", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "More than you expect!", "review": "Here's what was very good: -  The rooms and bathrooms are newly renovated with a fresh modern feel and lovely hansgrohe fixtures -  The rooms are very quiet, with double-paned heavy windows blocking out the traffic below -  The bed and linens are very comfortable and high quality -  The people who work there are focused on your happiness, and are very service oriented -  The bar American is a great place to relax after a long day of sightseeing  What you might be disappointed in: - Wireless Internet access is quite poor.  If you are hosting a business event and need a lot of broadband, go wired or reconsider -  The food in the restaurant is so-so.  With so many great places right outside the door, it should not deter you from this hotel", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r166529875", "sub_review": {"Value": 5, "Location": 3, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Family friendly hotel as well as business hotel!", "review": "Stayed here for one night when visiting Florence. It looks a bit old from the outside but it's nicely decorated and the rooms have everything you need. My room even had TV in the bathroom and a selection of 4 different firmness pillows to choose from. The buffet breakfast is very fresh and complete. Wifi is free in the common areas (reception/bar).", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r165513272", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "It's the best you can get from a 4 stars hotel", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r165339638", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A short break", "review": "We just checked out from a 3 nights stay in this hotel in Florence. This hotel is definitely different from any other hotels you can get in Florence. The building itself looks very different from all the ancient buildings around, but it's not too modern that look awkward. I like how it looks very much. The whole hotel looks very hip.    We arrived the hotel at 11:30am, the room was ready for us already. The reception staffs were very friendly and professional. Apart from just checking us in, they offered a brief introduction of the city to us, which is very impressive.   The room is quite small actually. There is only one corner in the room that I can open my suitcase completely. But the room is very new, clean and nicely decorated. The bathroom is very spacious and beautiful.…", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r165053095", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "If only the bed had been just a little softer", "review": "We stayed only for one evening so i didn't have time to check out all aspects. it has a charming  modern  design of common areas and well appointed spacey rooms. Convenient location to enter/leave the city from the north when traveling  with a car. Nice breakfast. A bit pricey though", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r164338331", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 1, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great stay in Executive room", "review": "If only the bed had been slightly softer than a slab of granite this hotel would have been wonderful. The staff are among the most helpful anywhere and the rooms extremely good value at the rate which we obtained (Eur93)", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r164112209", "sub_review": {"Value": 5, "Location": 3, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good Hotel! Good Location. Great Breakfast Buffet", "review": "We booked online and turned out to be a great stay. 'Executive' room (in the 2nd floor, I believe it was room 212) was very comfortable. Excellent sommier and pillows. Everything was very clean. The staff at the reception, was very helpful. Also breakfast, is very complete: including hams and cheeses, eggs in different styles and bacon, fruits, yogurts, juices, breads, etc. Coffee is prepared by the personnel according to your order. To  be improved: Wi-fi connection is free only in the lobby (... you need to renew  your password, every 30 minutes). Anyhow, the lobby has very comfortable sofas, with plenty of seating, and books or magazines to read. A must: the chair massager, which is a great relaxation after a strenuous day, walking around Florence. Not so good: this hotel is…", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r163193832", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Recent stay- May 2013- Great location", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r162817932", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Enjoyable", "review": "Great location- Walking distance to the center of Florence for shopping and restaurants. This was the best hotel we stayed at in a 10 day Globus tour we were just on, so not sure what we paid as far as value, but it was the nicest we stayed at compared to Rome, Venice and Milan. Rooms are new, clean and up to date. The lobby was clean and roomy. Nice bar with enough area for people to relax. Very friendly staff. Nice people they make you feel appreciated. Wonderful place would recommend to anyone to stay.  Only negative was bathroom is a bit tight. The door going into the bathroom comes inches away from the sink.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r162273922", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent, but expensive", "review": "Our room was nicely redone and clean and comfortable.  In addition, one evening we dined there was we were too tired to travel out.  We had a great meal and excellent service in the small dining area adjacent to the bar.  At first glance it was so small we doubted the meal would be much more than average but we were wrong.l  The bartender did an excellent job of serving us and the food was quite good.  A nice surprise after a very busy day touring the art and history of Florence!  Definitely recommend it.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r162063376", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Hit or miss half-renovated hotel", "review": "We enjoined our stay at Starhotel Michelangelo. In walking distance from city center (20 minutes). The hotel was perfect (rooms, breakfast, service, cleanliness etc), but the price for a room (EUR 200 per night incl. breakfast) too expensive. ", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r161906035", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Clean, nice rooms", "review": "I care about nothing but a clean, safe room to sleep in when travelling. Walking into this hotel, I thought I had hit the jackpot, really nice entrance that looks recently renovated. At check in, I got the basic service, card to the room and information on where the breakfast would be served. No map of the city offered (though they do have one available, so feel free to ask). Also, WiFi is free in the lobby, they won't tell you this either (you have to get a username and password from them, valid for 30 min - but you can get more than one paper with this info at a time). Then the real fun begins, you can either be assigned a newly renovated room or an old one. In my case, I got an old one and even though I had requested a non-smoking room, I got a smoking room. No matter what…", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r160979005", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Super", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r160026132", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Excellent Value - Exceeded Expectations", "review": "Lovely hotel close to the centre of Florence.  Very clean with all modern conveniences.  Staff very helpful free wifi. Close to tram and buses, lots of great restaurants close by. Would highly recommend this hotel.", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r159963833", "sub_review": {"Value": 5, "Location": 3, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Modern & Clean Hotel; Great Location!", "review": "We got an excellent rate (84 euros per night) for a long weekend we recently spent in Florence.  The hotel really was fantastic.  We took the train from Rome to Florence and after we figured out where to ride the tram (go out the station to the right as you leave the train platforms and down the stairs), all was good.  It is the first stop on the tram from the train station, about 2 minutes ride.  Purchase the ticket in front of the tram stop from the electronic kiosk, 1.20 euros and validate in the yellow box on the tram.  The hotel was right behind the 1st tram stop and easy access.  The lobby is large and very friendly and helpful staff.  They gave us a great suggestion for a very popular pizzaria nearby as well as other transportation options around the city.  The rooms were…", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r157238849", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Average", "review": "Among the 3 hotels we stayed throughout this trip, this is my favorite. The hotel is very modern and clean. The location is great, conveniently located in the central area. Our room is on the top floor so I had somewhat great view from our bedroom window. Love it!", "date": "March 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r157093297", "sub_review": {"Value": 3, "Location": 3, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "", "rating": 3}, {"title": "Elegant hotel with good location", "review": "Stayed for 3 nights last week. We thought the room was right above a loading bay as we heard loud noise from machines/lifts every morning. Hotel reception told us the noise might come from street level. Anyway, the rooms are not sound proof. We can hear clearly when the room next to us flushed the toilet.  Hotel is 10-15 mins walking to the center. A taxi to train station cost Euro 8. Average hotel.", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r156976780", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Lovely modern hotel", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r156976099", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "No a/c in rooms;too far away", "review": "Nice modern rooms... Very clean... It's a bit further from town, so if you are looking for a hotel in the heart of the city then this hotel is not right for you. However there is bus stop right outside & it takes 5 mins by bus to be in the city centre. In fact it's nice to be a bit away from city noise. We really enjoyed our stay for 4nites. Breakfast is nice. I wouldn't say superb... I definitely recommend this hotel...", "date": "March 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r155582478", "sub_review": {"Value": 3, "Location": 1, "Sleep Quality": 2, "Rooms": 2, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Clean neat place", "review": "I stayed for four days at the Michelangelo and I won't go back. They don't provide air-conditioning in the rooms at this time of year, I assume to save money. What that meant for me was i could either sleep in a hot stuffy room or open the window to the VERY cold air and listen to the noise from the very busy road outside. Even a cheap motel in the U.S. provides year-round a/c ! Breakfast was served on the lower level in a windowless room whose decor was as bland as the limited buffet food. Don't look for oatmeal, omelets, fried or poached eggs, pancakes, waffles or anything special. The hotel is too far away from the City Center which means when you leave in the morning you're gone for the entire day and can't run back to your hotel to use the bathroom, change clothes, drop off…", "date": "February 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r152400007", "sub_review": {"Value": 4, "Location": 3, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "A Lucky Find", "review": "Nice rooms... Great service... Not so great location but... Overall nice place... Very starish... Big rooms quite unlike other European hotels... Very friendly staff... Ensure that u hv a grappa at the bar", "date": "December 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r149488836", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good quality hotel", "review": "Upon arriving at the Hotel after a long day of traveling and touring, we were greeted by a friendly and caring front desk clerk.  Throughout our stay, the front desk was extremely helpful, especially when they had to arrange for 2 cabs to rescue us on the highway somewhere between Florence and Sienna on Christmas Day.  The rooms and baths were new and clean.  The breakfasts were wonderful.  The location was an easy walk from all of the Florence attractions.  I would stay there again and am sorry that we didn't book its sister hotel in Rome.", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r147051214", "sub_review": {"Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Contemporary Hotel", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "November 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r146080578", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Great renewed rooms", "review": "The room we had in this hotel was \"picture worthy\" though my daughter has the pictures.   Beautiful room with hardwood floors, flat screen tv, bathroom with bidet, coffee pot in room, hair dyer.  Everything very clean and modern.  Breakfast buffet was very good and we had dinner at hotel and was also very good.  Would return and would try other Star hotels.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r144783211", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Don't stay in a handicap room if you don't need it!!!!!", "review": "Had the perfect experience in Florence. The hotel lobby is very beautiful and the renewed rooms are great. If you are riding by car there is a public parking lot right in front at the hotel and on the weekends it's free.   The room was very clean and really nice. The breakfast was ok, not the best I ever had, but it was ok. Would certainly stay again in this hotel.", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r144187771", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Value for the money", "review": "This is a nice contemporary hotel, but we were booked into a handicap room when we didn't need one.   The problem is that the shower has no curtain or shower wall.  You have a shower head on the bathroom wall and if you take a shower the total floor of the bathroom will be very wet.  They were at capacity at check-in so we couldn't be switched to non-handicap room. To accomodate us, they brought up 4-5 extra towels that we could wipe the floor down after a shower.   This would be a 5 star hotel if it wasn't for our handicap room experience.", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r143207652", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Great Rooms - Inside Gems", "review": "I have stayed in this hotel on 14th of October with my other 2 friends / 3 rooms. Generally good and spacious room, please note we are in the suite. Bar- special thanks to the bar attendant, (forgot the name) who made us feeling so comfortable with his smiley face and energetic service Restaurant- there was nobody in the dining hall except us, but the same bar attendant make our dinner so lively and he is very active. Opening the room little different than other hotels. the card reader is in the wall left side to the door, and once yuou insert the card, you hear a sound of 'kkrkrkrk' and you need top push the door inside by hand to open, I was inserting the card waiting for the sound and turn the knob, nothing happen, at last asked for hotel assistence.  Breakfast buffet was…", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r143007129", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great Hotel - Location Better than First Impression", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r141014699", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "What a dump!", "review": "When we first rode the train to the hotel, we were concerned about location.  The area itself seemed a bit sketchy at first but it ended up being a great location near the river and Central Park just across the street.  For those of you who are runners like we are, this is a perfect place to get in daily runs with the locals while escaping the overly crowded city.  The room itself was a nice size by European standards and it was nice that they provided a electric kettle for coffee and teas.  The hotel had a nice bar in the lobby area which was a nice place to hang out after a long day and to enjoy a beer or cocktail.  Breakfast was included which was a nice amenity to have and convenient.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r140106571", "sub_review": {"Value": 1, "Location": 1, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Quite nice hotel in convinient place", "review": "This is the typical hotel that posts amazing pictures and when you get there, from looking at the building, you start praying.... The lobby is great, they do provide free wi-fi in \"executive\" rooms and the breakfast is very decent, front office staff are great, available umbrellas for rainy days..... Now, once you get out of the elevator, to go to your room, you start to fear the inevitable... A nasty looking room.  The carpet that used to be bright green is brown.  How do I know that it was green? Well the carpet that decorates the wall seems to be of the sme color. We did not take our shoes off.  The bathroom smelled old.  No electric plugs to charge all the electronics that are now used in this modern times.  My son woke up in the morning with bed bug bites (about 3), big…", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r140102237", "sub_review": {"Value": 4, "Location": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Excellent - the best place to stay in Florence", "review": "Dear Guest,  we would like to thank you for taking the time to leave your opinion about your stay in our hotel and we are really sorry to understand that your experience with us was not so good as you expected. Any suggestion or opinions related to our service is highly appreciated and taken into consideration in order to improve our quality of hospitality.  We like to inform you that most rooms of the Starhotels Michelangelo (around 70%) and common areas like lobby, bar, restaurant,  etc. had been recently renovated,  2010/2011. The posted pictures in Trip Advisor, Expedia, Booking.com, etc, as you can see present the renovated rooms and  old rooms too. Executive rooms are big enough to accommodate with comfort familes, for a maximum occupancy of 4, but are located in the non-renovated areas (1st and second floor), even if they will be object of a complete refurbishment (new materials, parquet on the carpet, new bathroom) early 2013. Our hotel chain invests for refurbishment a large amount of money every year to update the product.  About the bed bug you wrote in  your comment, we want you the be sure that we never had  such a problem in our property as you can easily see from the many reviews present in Trip Advisor, Expedia, etc., and we completely checked all the rooms of the 1st and 2nd floor after we received your comment and fortunately  we didn't find any bed bug.   We apologize once again for your unpleasant experience, we trust in the positive comments we receive by our guests, even on this website, hoping you might reconsider your opinion to our Hotel and let us welcoming you again in one of our Starhotels.  Best regards,  Gaetano Gatti - General Manager", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r139793911", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Very nice hotel and central!", "review": "I stayed in this hotel for 2 nights and satisfied with my stay. It is in 1 min walk from tram station. Tram comes directly from train station and only 1 stop and you are here. Tram works every 5 minutes. It costs 1.2 eur per person.  To walk to the city centre is easy, but it will take from 20-30 minutes. Especially in hot days not quite pleasant walk because there is no any shadow area in your way along riverside. And even nowhere to sit  Hotel description says free internet (WiFi) in hotel lobby, actually this is not true, the device shows the availability of internet and that is all. It doesn't work at all. I asked staff and the only reply which i got is that pay 10 eur per day and internet in the room will be better. Actually nobody was in hall so they can't say that too…", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r139121781", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Good Modern Hotel 15 Minutes Walk from the City Centre", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r136923870", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Sufficient for business...", "review": "Stayed here for two nights in July. Good location. On site secure parking at an extra charge. The lobby is very nice with free wifi. Service was good. Rooms were nice, clean and modern however slightly cramped. The hotel was fair for the price. I would stay again. ", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r134817455", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 2}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Nice, Contemporary Hotel, Good location", "review": "I would recommend this hotel for business people only given the good corporate rate I got.  It's a bit of a trek from the city centre & central train station if you're rushed; the interior is clean & functional.  I stayed for several nights & ate dinner one night only - limited choice & expensive.  The rooms were OK but a bit dated.  Big downside is there's nowhere to sit outside with a drink in the evening! Staff were not very helpful when I had a travel query & generally seemed more concerned with their own discussions than the queue of waiting customers.", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r131477045", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Spacious room", "review": "Good location, close to Train station. Hotel rooms were nice, clean and had very modern finishes. Friendly Hotel staff and breakfast was great! Would recommend this hotel.", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r128985477", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Not our favorite", "review": "It's a pain driving around Florence, but we managed to get to the hotel by just asking people which way to the Ponte Vecchio. Once I arrived at the river I just followed it until we located our hotel. We arrived and they upgraded me to a room with a balcony. Be aware that parking is expensive no matter where you park. For convenience park inside the hotels parking lot. Our room was nice and spacious, but the balcony was dirty with bird droppings so we did not use it. Spend at least two nights in Florence as there is too much to see and the queues can take up some of your time. The buffet breakfast at the hotel was good and offered a good variety of breads, cereals and coffee. The hotel is a 15 to 20 minute walk to the Ponte Vecchio, which is fine  because there are restaurants,…", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r128598273", "sub_review": {"Value": 3, "Location": 2, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Very comfortable beds, low water pressure in shower", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r128248023", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Business as Usual", "review": "I'm used to hard beds so the one at this hotel was wonderful.  The shower leaves a bit to be desired... Low water pressure which takes a bit of getting used to. Other than that, staff are friendly although free Internet is only available in public areas. There are newly refurbished rooms on the upper floors, so try to ask for this when making your booking.", "date": "March 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r126771105", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Michelangelo", "review": "I joined my husband on a business trip to Florence.  The Michelangelo is clean, efficient, modern and perfect for business meetings for groups (it has a conference room and food service for meetings). If you are a tourist, however, know that it is situated in a nondescript area, a little far from the sights of Florence, at least a 20-30 minute walk from the center of the city.  The walk is pleasant enough, but it is definitely out of the way.", "date": "December 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r125302220", "sub_review": {"Location": 4, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Good hotel. Good location", "review": "Many Thanks to everybody who are working in this hotel.  With  big pleasure  I will stay here again in my next trip . It is a really nice hotel! Large, comfortable rooms.  Nook, pleasant and beautiful lobby bar.", "date": "January 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r123914834", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 2, "Rooms": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Great hotel, highly recommended", "review": "Stayed in the hotel at the end of Jan 2012. Large and clean modern interior. Beds are rock hard, so I had a hard time sleeping most nights. Breakfast every morning, selection of breads, fruit,  cereal etc. The \"american\" breakfast is scrambled eggs and bacon, ham and swiss cheese... Would be better if they put out some of the wonderful italian meats and cheeses, but it is good and makes a good start to the day.  The restaurant is upscale, so not alot of simple italian dishes but its good. Some of the service staff is great, a few are not and come off as very snotty. They do have roomservice.  Ponte Vechio is about a nice  20 min walk down the river, which leads to many shopping and museums. Also makes a great meeting place for people who arn't sure how to get around the city to…", "date": "January 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r122924955", "sub_review": {"Value": 5, "Location": 3, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "wonderful convenient to many places..", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r121458694", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good stay in Florence!", "review": "I love going to international Flea Markets on my vacations---staying at this hotel is right across the street from a lovely park which houses the Mercado Delle Cascine Flea Market on Tuesday mornings...a great Flea Market....The hotel is close to buses, about a 10 minute walk to the center of town. You won't find many restaurants near to the hotel, but the staff is very courteous, the room was clean and spacious and the breakfast certainly adequate. /we were able to obtain bus tickets, good suggestions about the neighborhood and they even had free umbrellas when it rained.", "date": "November 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r120979314", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "nice, but could be a bit better", "review": "We booked this hotel last mins and surprisingly it become one of the best hotel that we stayed during our trip in Italy. Good value of money, great location ( 1 tram stop to station or 15 mins walk for station is walking distance to the center of Florence )  We managed to check in earlier. Room was not so big, but it was well-decorated and comfort. Bathroom with bathtub is decent and clean.  Staff was very friendly and helpful. We enjoyed our stay and would like come back definitely !", "date": "November 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r120377456", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Nice place to stay", "review": "I got a great rate on expedia for this hotel for one night, but stayed the next 4 nights for a conference.  The hotel staff was top-notch during the days, but a little lack luster in the early morning or overnight hours.  I was impressed with the room size and accommodations. The bathrooms were small, but it did not create any problems.  The only complaint for the rooms, is that the doors are not at all soundproof.   You can hear EVERYTHING in the hallways.    The bar staff were very helpful and stayed HOURS past closing to serve the conference guests.  The breakfast was ok, not great.  The free internet in the lobby was embarassing.  Slow and unreliable.  They should either make it free all over the hotel (the room internet for $ was very fast and reliable) or just get rid of…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r119916708", "sub_review": {"Value": 3, "Location": 3, "Rooms": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "", "rating": 4}, {"title": "Stylish Hotel", "review": "Dear Guest, we would like to thank you for taking your precious time to say a few word about your stay at our Starhotels Michelangelo. Any suggestions or opinions related to our service is highly apprecieted and if in any way this service can be improved, be well  assured that our will is to achieve this goal.  My staff and I would like to express our apologies for the inconveniences you had about the slow internet connection in the lobbly. Probably  many guests used the internet connection at same time. We have requested our supplier to verify   and possibly  improve the service. Once again we apologize for the  troubles caused and hope to have the pleasure of welcoming you again in our Starhotels Michelangelo. General Manager", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r118845806", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Comfortable hotel catering to foreign tour groups.", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "March 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r118202118", "sub_review": {"Value": 4, "Location": 3, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "A very comfortable hotel if  bit away from the centre", "review": "Large, comfortable rooms and baths. English speaking staff is quite helpful at making suggestions and reservations for sightseeing and dining. Location is away from the core of old Firenze and also quieter. City bus stops are nearby. Great lobby and bar area for lounging. The complimentary breakfast was very good-obviously targeted more to American tastes. One negative was the wi-fi, complimentary only in the lobby for 30 minutes at a time.", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r117697066", "sub_review": {"Sleep Quality": 5, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good hotel, be prepared for a stroll", "review": "Like most reviewers, we found this hotel to be more than satisfactory.  We came here with a Globus tour and were pleasantly surprised at the facilities.  The room was well equipped - very spacious bathroom - although the view was of the back of the hotel.. Breakfast was excellent but best of all was the bar - soft drinks with lots of ice!! Snacks were served with drinks and the service was great.  Public Internet access was readily available. There was a very good family style restaurant - Vecchio Carlino -  about a block away; the food was so tasty that we ate there twice and took friends.", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r116801589", "sub_review": {"Value": 4, "Sleep Quality": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Business hotel near the river", "review": "Great hotel - service was really good, the man at the front desk spent a frustrating time reserving us tickets for the the Uffizi but he persevered and was very helpful. Rooms are spacious, clean and well-appointed. Breakfast was,one of the best that we had throughout our Italy stay.  One, I think,, minor downside is the location - it's a twenty minute walk to, say, the Ponte Vecchio - but this is a very pleasant walk along the river and well worth it for a such a decent hotel at such a decent price - plus there's always the tram right outside that will take you up to the station when you're legs are tired!", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r116747775", "sub_review": {"Value": 3, "Location": 4, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "", "rating": 3}, {"title": "Very Satisfactory", "review": "It was nice but a little old in the rooms. More expensive than the sister hotel in Bologna which is better by far.", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r116267354", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Chain hotel yes, but a very worthy option", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r115987672", "sub_review": {"Value": 4, "Sleep Quality": 5, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great hotel and staff", "review": "Chain hotels often get overlooked on this site I find. Granted, they mostly all look one and the same, with very little difference in features and service, from one city to the next, all very uniform. However, when you're looking at a tourist city like Florence, complete with tourist prices, these places can be a godsend, and this hotel was better than average...  Stayed here for three nights in July 2011 with the other half. A pretty good location, just over 10 mins walk from the main train station and airport bus stop, and about 20 mins from all of the attractions. The neighbourhood is nothing to get excited about, but safe enough, and only a few minutes away from the river Arno, making it a pleasant walk in.  As for the hotel itself, I'd say its a lot more stylish than most…", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r115173928", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Excellent choice in terms of position, price and services", "review": "Room was great -- modern, spacious, a/c worked great.  Catch the tram right outside train station, first stop right at hotel. Breakfast was great and included.  Staff was so nice.  We left something  in the room and they mailed it to us in the states free of charge.  Definitely a great choice especially if you need to be close to train station.", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r115103485", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Comfortable and pleasant", "review": "In one expensive city such as Florence where simply B&B in the wide center range costs a lot, it's really surprising find modern, ellegant hotel with good services and almost in the core city centre at reasonable price. For this advantage, this is more than excellent choice for everybody who prefers good quality/money ratio.  The position is good - its not in the core city centre (centro storico) but its reachable by walk in 15-20 min all city attractions such are Ponte Vecchio, Duomo, Uffizi ecc. It's recently renewed furnished well in modern, ellegant, japanese/european style, simply but trendy and ellegant. Rooms are spacious (which is surprising especiallly for standard/normal room) and furnished with the style. Bathrooms are great, modern. High sleeping quality with the…", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r114730157", "sub_review": {"Value": 4, "Sleep Quality": 5, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great hotel, but a bit far away", "review": "Firstly I did not think this was that far out the way, it is 10 mins walk to Santa Croce square and 12-15 to the Duomo, it was nice to vary the routes to and from the hotel and visit the less touristy but equally nice side streets that Florence has on offer.  It is also right next to a rather large and nice park and an even better walk is to leave the hotel walk down to the Arno river and walk in to the center via the Arno. All in all, it is only a long way if you have mobility issues.  There were elements to this Hotel that were 4 star as I know it and elements which I thought were 3 star. Considering the distance, the quality of other Florence   Worthy of 4 Stars:  Friendly Bar staff and the best bar snacks in any bar I have been to, which are put out in the evening.  Friendly…", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r112686797", "sub_review": {"Value": 5, "Location": 3, "Rooms": 5, "Cleanliness": 4, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Nice, modern hotel; location a little out of the way", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r112494440", "sub_review": {"Value": 4, "Sleep Quality": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "What I expected excellent service", "review": "I stayed at the Michelangelo for two nights as part of a tour group.  The hotel was modern, clean and the rooms were quite large.  The staff were exceptionally helpful with questions and directions.  I had some trouble using my room key and the front desk staff came with me to show me how to use it, which was very much appreciated after a long day of travel.  The staff also provided a map of the area and gave directions and information for restaurants and a laundromat.  I did not eat in the hotel restaruant, but had some drinks at the bar and they were very reasonable, and the bar had munchies, too!  There is a fabulous restaruant called The Steak House which is about a 15 minute walk from the hotel.  Highly recommended.  There is also a pizza shop (along the way to the steak…", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r103633396", "sub_review": {"Value": 3, "Location": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "Try another hotel", "review": "Really convenient first stop on new tram from central train station bus runs from outside to all tourist sites. Very clean if a bit dated", "date": "March 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r101903104", "sub_review": {"Value": 2, "Location": 3, "Sleep Quality": 2, "Rooms": 1, "Cleanliness": 2, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Excellent accomodations with friendly, personable staff.", "review": "We stayed here for one night and while we received help on check in and they even \"upgraded\" us to an executive suite, I would advise you to avoid this hotel at all costs.  The upgraded room was bigger than the others however it was not updated like the pictures on the website would have you believe the room looks.  Additionally it smelled like smoke, probably from before you were banned from smoking in the room.  The main problem we had occured the day we were checking out, we had arranged at check-in to have a  car pick us up and do a winery tour the next day, and the staff said we had to pay them $200 Euro in cash before the car picked us up at 2pm...I went to the ATM and my bank (US Bank) had put a freeze on my account and I had to call them to unlock it.  When I went to the…", "date": "March 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r101523029", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "choose another hotel", "review": "Well situated hotel with comfortable rooms and an attractive lobby.  The food in the restaurant is delicious, and the bar area is attractive and comfortable.  I would definitely stay here again.", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r99929542", "sub_review": {"Value": 1, "Location": 2, "Sleep Quality": 3, "Rooms": 2, "Cleanliness": 2, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "faster than light customer service", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "March 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r99924716", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Nice hotel, but a bit deceiving", "review": "i come to florence from NY every year to attend the food trade show Taste and always stay at the Michelangelo which is across the street from Stazione Leopolda, where Taste takes place. in terms of convenience, nothing can beat  this hotel. i checked in today. as i walked in, i noticed a big improvement in the decor of the hotel. it has been completely renovated, the lobby has beautiful metal screens made by an artist and they resemble all old florentine patterns. when i returned to the room, after a very long and tiring day, i realized i didn't have any toothpaste and asked the reception desk. do they have any? i had not hung up and somebody rang the door with the tooth paste. i was amazed. and very grateful. thank you!!!", "date": "November 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r91034696", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Too far away from anything..", "review": "From the outside and the lobby, Hotel Michelangelo looks like a very nice place.  But go a little deeper and you'll see a few haphazard repairs and crappy cover-ups of an older more aged building.  The staff is friendly and basically helpful.  Our room was large and had a fairly large bathroom.  But if you're planning on capatalizing on the breakfast included with your stay, don't.  The staff in the breakfast restaurant is rude and careless.  The food was absolutely terrible, right down to the coffee.  They served the usual croissants and breads, but the other eggs and meats they offered were truly wrong.  The lobby and hotel bar area have a trendy feel to them and the location suited us just fine.  The hotel is located a bit off of the main parts of Florence, but no more than a…", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r86694577", "sub_review": {"Value": 3, "Location": 1, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 3}, {"title": "Good for business travellers -not for families", "review": "Michelango Hotel Florence  My room stunk of smoke even though it was supposedly a non-smoking room.  It was quite overwhelming and was so bad, it made my eyes sting on the first night.  I aired out the room so it improved for the second night.  The hotel was located on the outskirts of the city so it was a fair walk to the main shopping area.  The service was very good and the staff were helpful.", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r82855577", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "The hotel needs renovation and is not a modern hotel.", "review": "It is a good hotel, but lacks character. Good for the usual business traveller but not for family atmosphere. There are other better options in Firenze.   Breakfast is poor. There is a waiter hanging around you all the while you are eating. He keeps a close eye on your table and is very keen to take away the plate even if it means that you are not done with it. The bread is served but not the types you get in supermarkets in U.K. Meaning you cannot apply butter or toast them. They are round, porous and hard.   Location is ok, not in the heart of the city but is navigable. Air - conditioning was not very good.  Overall OK, but unfortunately lacks the ambience for a family outing.", "date": "May 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r66465334", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 4, "Rooms": 2, "Cleanliness": 2, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Nice hotel... need a car to move around...", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "March 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r60690538", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Do not stay here............", "review": "The hotel was very nice... staff very good... and the food was delicious... the hotel is very far from main attractions so if you stayed here rent a car or move by taxi...", "date": "October 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r48400558", "sub_review": {"Value": 2, "Location": 4, "Rooms": 2, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "nice", "review": "Needs improvement  The weather was somewhat warm. There was no airconditioning working in our room so we left the sliding door open, it didn't lock anyway. There are also huge garbage recepticals across the street from the hotel and every morning they would crush the trash in front of our room for hours. Smashing bottles and glass constantly.  The maid did not clean the toilet.  The ceiling had mold and water damage.  The bed was as hard as a piece of plywood.", "date": "July 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r40426286", "sub_review": {"Value": 4, "Location": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Nice hotel close to the center", "review": "we were upgraded to executive suites and were very happy with our hotel.  The staff was excellent and very helpful. We took the bus into the city and it was very easy but coming back was a nightmare. The bus drivers were ignorant and not very helpful we waited an hour until we could finally get some locals to help us. We had an excellent meal beside Il Duomo.", "date": "August 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r40145534", "sub_review": {"Value": 5, "Location": 3, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great Hotel! Close to the mains atractions, clean and comfortable!", "review": "One more nice stay at this hotel during august 2009 helpfull staff nice clean rooms free parking and close to the river only 2 blocks away.and 1500m from Ponte Vechio.", "date": "July 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r33826475", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Modern and Clean", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "May 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r30819340", "sub_review": {"Value": 4, "Location": 4, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Cosy", "review": "We stayed here as part of a Globus tour. Our room was charming, clean and neat. Our breakfast buffet was included and there were lots of choices. The concierge staff was friendly and there was a funky spot across the street for a pleasant dinner. There was some construction going on in the street but we were not bothered by it. Others have mentioned that it is a bit of a walk to the historical area but it is doable. If you have been on your feet all day, you might find it a bit too far but it is easy to find the hotel if you keep the river on your left when heading back to the hotel.", "date": "April 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r28966787", "sub_review": {"Value": 4, "Location": 3, "Rooms": 5, "Cleanliness": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Value for money", "review": "We stayed 2 nites in this hotel. Location is a quite a way out from the heart of Florence but can still be done easily by walking 20/25 mn. Staff is professional. We had an executive room for a family of 4. It was quite spacious and cosy. The bed for the adults was large with good quality and recent/comfortables edeirdown & pillows. Bathrobes and slippers were provided for all the guests. The WiFi was available but with extra charge. The breakfast was a buffet. Not terrific but good enough. In summary a charming and cosy hotel. I was actually quite surprised (nicely surprised) by its quality. As it belongs to an hotel's chain (StarHotels), I will most definitely include them in my short list for my next trips to Italia", "date": "April 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r28833252", "sub_review": {"Location": 3, "Check in / front desk": 5, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Nice but smelled like cigarettes", "review": "Stayed one night in April 2009. Spacious room. Very clean.The bathroom was clean and large. The hotel restaurant was good. A little out of the way from the core. Disable people might find it difficult to negotiate the steps down to the front desk from the street. The desk staff was very courteous and helpful.", "date": "April 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r27955328", "sub_review": {"Value": 3, "Location": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "out of the way but nice", "review": "Stayed at this hotel in early April. We were upgraded to the executive room as they saw we were in the system from staying at the other starhotels while in Italy. The room was nice. The bad thing was that the air didnt work. Realized that the air didnt work at any of the starhotels we stayed in. We couldnt open the windows at this hotel because there was a lot of street noise. The hotel also smelled like cigarette smoke no matter where we were. The hotel is very close to the train station. Also, it appears that there will be train lines running next to the hotel in the near future so it might be very noisy at some point. The hotel is okay for the price.", "date": "August 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r20263405", "sub_review": {"Value": 4, "Location": 2, "Check in / front desk": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4, "Business service (e.g., internet access)": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "I (hearted) Starhotels", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "August 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r16321018", "sub_review": {"Value": 5, "Location": 3, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Friendly staff, good price", "review": "My boyfriend and I visited Italy in the Summer of '06, and while in Florence we stayed at the Starhotels Michelangelo, and it was fantastic.  Granted, the hotels in Venice and Rome we stayed in were cheaper and a lower class, but this is still the nicest hotel I have stayed in in Europe for under $100 a night.   I am a hotwire.com supersleuth, and always manage to figure out the actual identity of the hotel.  Expedia is its partner site, and you can usually compare the star ratings and amenities to narrow it down, and if they give you the original price on hotwire you can be 99% sure of the hotel.  So, we managed to book this hotel for $99 a night, which added to its charm.   While it was a bit difficult to find and a decent walk from the center, the interior more than made up…", "date": "April 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r14806950", "sub_review": {"Value": 4, "Location": 3, "Check in / front desk": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5, "Business service (e.g., internet access)": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good Experience", "review": "We stayed two nights in Florence, in the Starhotel Michelangelo. The hotel building doesn't look very promising on the outside, but the inside is recently renovated and has all you would expect from a four star hotel. The personnel at the reception desk is very friendly and allways prepared to help. The rooms are very comfortable and clean, small minus is you have to pay for wireless internet access.  Distance to the city center is approx. 1.5 km, but this is more then compensated by the relatively cheap price you pay for a four star room and there are also busses to the center every seven minutes (bus stop in front of the hotel). Would certainly recommend this hotel to everyone who's looking for a comfortable place to sleep in Florence at a fair price.", "date": "October 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r11004136", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Fantastic Rome", "review": "We booked an executive room in the hotel, which was really lovely, it had it's own sitting room which made our stay even nicer, particularly after a busy days site seeing.  Florance is wonderful and well worth a visit.  I would stay in the hotel again, however, the breakfast was poor and tasteless and what is it with Italian hotels they don't know how to serve a hot cup of tea!  I would recommend this hotel, but go out for breakfast.", "date": "November 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r10887448", "sub_review": {"Value": 3, "Location": 3, "Check in / front desk": 2, "Rooms": 4, "Cleanliness": 4, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Very nice place to stay", "review": "StarHotel Michelangelo is really close to St Peters (5 Minute walk) and you could see it from our room, if you stuck your head out of the window 3 foot. The room was of a good size and standard and clean but you would expect that from a 4 star. However the reception were not very helpful and were only interested in selling us expensive tours, the breakfast was really good but evening prices were high and bar prices for a drink were to.  There are quite a few places just around the corner to eat and drink at which are half the price of the hotel. Get a Roma Pass for 20Euro, you can use the public transport for 3 days for free and you get 2 entries and discounts to museums.  Buses run from the corner of the street, take the number 64 to Piazza Venezia and from there you can walk…", "date": "October 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r10242221", "sub_review": {"Value": 5, "Location": 4, "Check in / front desk": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Beautiful city", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "August 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r8592223", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "great place", "review": "We stayed at the Star Hotel Michelangelo - a wonderful hotel.  Great breakfasts; extremely clean - we really couldn't fault it.  The only small minus was that it was a good 10 minute walk to the centre, though it was a pleasant and varied route through some lovely shopping areas.  However, it had the bonus of being very quiet.  We felt extremely safe in Florence, even late at night.  We saw a lot of Florence on a \"hop-on and hop-off\" open top bus and did our own trip to Pisa by train. I would highly recommend both the city and the hotel. ", "date": "July 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r8452116", "sub_review": {"Value": 5, "Location": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "Great Choice", "review": "As part of a tour, my husband and I stayed at the Starhotels Michelangelo for 2 nights - and were very pleased!  The rooms were spotless and was more 'North American' than some of the other hotels we stayed at in Italy.  It was equipped with TV (in the bedroom AND bathroom), mini bar, coffee machine, PPV with internet access plus slippers and robes.  Twin beds were joined to make a larger bed but was very comfortable.  For the tourist attractions, it was about a 30 - 35 minute walk.  All you needed to do was just turn left when you leave the hotel and follow the river down - very easy.  Buffet breakfast was included in the package.  The usual breads, croissants, cereal, fruits, cold cuts, bacon, eggs, etc.  A decent selection.  The service was friendly and helpful as well. …", "date": "May 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r8140870", "sub_review": {"Value": 4, "Location": 2, "Check in / front desk": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4, "Business service (e.g., internet access)": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Nice business hotel", "review": "After spending fours days in Rome, I spent three days in Florence and stayed at this hotel where I had a wonderful experience. The hotel is about a 15-20 minute walk from the trains and a 20-15 minute walk from the Duomo.   This hotel looks pretty plain from the outside but it is wonderful on the inside. The interior is beautiful and the front desk was incredibly helpful. The rooms are very nice. They are spacious and modern, and the beds are very very comfortable.   Free breakfast is provided every morning. It was a great way to begin to the day. While the walk from the train and the Duomo is not too long, its a bit annoying after a long day of sightseeing. It appears that several buses stop in front of the hotel but we didnt take any of them.  Even though this was a wonderful…", "date": "August 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r7712909", "sub_review": {"Value": 4, "Location": 3, "Check in / front desk": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Comfortable but lacks atmosphere", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "August 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r5760962", "sub_review": {"Value": 3, "Location": 3, "Check in / front desk": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 4}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Nice Rooms, Nice Lobby -helpful front desk and wait staff", "review": "I chose to attend a conference in Florence at the last minute and this was one of the listed hotels. The lobby and indivual room furnishings are certainly worthy of 4 stars.  The hotel itself is located on the edge of the historical city - in fact my 4th floor room has a very close view of one of the watchtowers.  The staff were without exception courteous and helpful.   Room service seems to be linked to the good but rather pricey hotel restaurant, ending at 10pm, which may be a pain if you arrive late and paying 5 euros for a bag of minibar peanuts doesn't appeal. A small supermarket two small blocks north and to the right stopped me having to pay minibar prices for bottled water in the stifling August heat.  I was slightly disappointed by the breakfast as reviews on here had…", "date": "March 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r4824744", "sub_review": {"Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Excellent value hotel", "review": "Hotel was centrally located within 10 min walk of Ponte Vecchio. Rooms were clean -we only had a shower however others on our tour had a tub. Each room varied in size- Nice firm queen bed  Breakfast was good-usual fair, rolls, fruit,eggs etc however our tour included a dinner which was very skimpy. My husband was hungry after dinner. ", "date": "August 2005", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r4721827", "sub_review": {"Value": 5, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "very nice hotel", "review": "Stayed here with my husband on a short city break in August 2005. On arrival at the hotel we found that we had been allocated a smoking room. A phone call to reception sorted out that problem and within minutes our luggage was transferred for us to a non-smoking room. The room was nicely furnished, clean and modern. We were impressed with the facilty to select the type of pillow you most prefer!   Breakfast was good but you have to ask for cappucino or latte. It seemed that if you weren't Italian you didn't get this unless you asked the staff directly!   It was a fair walk into the city centre, about 15-20 minutes on a hot day, but you can stroll along the riverside if you don't want to walk through the streets.  Loved Florence and would definitely return and stay at this hotel.", "date": "December 2005", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r4344680", "sub_review": {"Value": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Great Hotel", "review": "the starhotel michelangelo is a typical 4 star business hotel but it also offers some great services that are not that business-orientated. a lot of other reviewers have mentioned the delicious breakfast buffet and the free internet. but to me and my girlfriend, the free bike rental service added a lot of fun and charm to our trip. we asked for two bikes on the day of our arrival and rode along the river before sunset, the scene was truly beautiful. the hotel isn't exactly in the city center, so it's really great to be able to ride a bike to wherever you want to go in less than 10 minutes. we got a great deal on hotwire, for less than $100/night, so it was absolutely worth it and we'd love to return. ", "date": "November 2005", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r4155013", "sub_review": {"Value": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Starhotel Excellence!", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "July 2005", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r4081835", "sub_review": {"Value": 5, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "breath of fresh air", "review": "My girlfriend and I stayed in 3 different Starhotels in Italy and found the all to be quite nice. I was pleasently surprised by the Starhotels Michelangelo. The room was very clean and modern. The staff was quite friendly, one lady at the front desk in particular that helped us find our way around. We spent some time at the bar in the lobby after a long day of touring and found it to be very relaxing. They also have a fine dining restaurant downstairs that looked good but pricey. The only drawback is that it was outside of the town center. It takes about 20 minutes to walk to the Duomo or 5 minutes by cab ride. Other than that I would definitely stay here again. ", "date": "October 2005", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r4069079", "sub_review": {"Value": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Nice 3 Star - Kinda like the Marriott", "review": "checked reviews before i book this hotel. one of my favorite hotels in several trips to europe. staff was great always their for any questions. room was better than nice, breakfast was very good. it is a bit away from the center of florence, but considering the nicenest of the hotel its wort it ", "date": "October 2005", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r4053686", "sub_review": {"Value": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "Definite 4 Star hotel", "review": "Using hotel standards in the US, I would say this hotel is a solid 3 star like a Marriott. It's not a four star because the decor is not quite there. Our room had somewhat tacky decor - with red carpet being used as the decoration up to the 'chair rail'. Also, the room size is average.   It's a good business style hotel. A HUGE plus was that they had excellent airconditioning that was still on in October. My friends stayed in a 5 star hotel where they airconditioning system had been turned off for the season and they were attacked by mosquitos all night.  Starhotels Michelangelo is really nice in that it has: air conditiong, good comfy beds, clean rooms and bathrooms, nice soaps and shampoo, nice towels, hot water with good water pressure, double sets of windows (to act as a…", "date": "May 2004", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r3659498", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "very nice", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "May 2005", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r3520363", "sub_review": {"Value": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Great for walkers", "review": "We really liked this hotel.  The rooms were large, clean and well decorated.  The hotel is about a 20 minute walk from the Duomo, but we enjoyed walking off some of the food and wine.   I definately recommend this hotel.    We found 2 great restaurants in the heart of the city with very fair prices... Trattoria Angiolino Via S. Spirito 36/R  Trattoria 4 Leoni --------- ", "date": "July 2004", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d202962-r3348907", "sub_review": {"Value": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 4}]