[{"title": "Average", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r714551411", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Ruuuuuuun", "review": "We stayed in the hotel for 3 nights and it was OK. The staff are friendly and helpful, the room was clean, the breakfast sufficient and the location good. The negative side includes the stone hard pillows that were not changed after we complained the first night. The WiFi was very weak. The coffee/tea boiler would be nice to have in the room. Some maintenance needed too.", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r705757626", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Worst nightmare of Tuscany", "review": "I checked out after around one and half hour.  They have rooms under the ground smell damp and mold.  It looks my room was a cellar or basement then converted into a hotel room with a so small window near the ceiling.", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r701123085", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 1}, {"title": "Comfortable, clean rooms with excellent service", "review": "Dear Mr  Rafat   We thank you for the time you spent to review our Hotel.  We are sorry for the inconvenient occurred, if the client is not satisfied by the room assigned, we promptly provide to change the room.  Best regards  Letizia   ", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r692192123", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Hot rooms, good breaky", "review": "If I am to do one good deed in my life, let it be this, warning you, the reader, from staying at THIS hotel.  I was visiting Florence over the weekend and had booked a one-night stay. In my effort to stay close to Roma Termini station, I ended up choosing a very poor location for sightseeing as the public transport was very unreliable. I was allowed to check-in and drop off my bags one hour before scheduled check-in time. The room was on the roof and had a very odd configuration, probably the result of being an attic converted to a hotel room. The AC was barely having any effect, as a result. That was the first red flag. I left for my explorations without thinking much about it.   When I returned back, around 10:30 PM, I discovered LIVE BUGS on both of the beds. There was no lack of diversity as they were different kinds. I promptly took photos and called in the manager. On his first appearance, he perfectly portrayed the role of an innocent, aghast manager who was unaware of the failings of the cleaning staff and as if this was the first ever occurrence. That part was untrue as I later discovered in other reviews. He also apologized for the pathetic excuse of an AC, promised me a room change and went downstairs to make arrangements. Meanwhile I was trying to channel my inner chakras so as to be able to levitate and not touch the carpet.   He called after 30 minutes and offered me fresh bedsheets as the promised room wasn't available. All my frustrated ramblings fell to deaf ears. While waiting for his arrival with bed sheets, I started frantically searching for hotels nearby. Unfortunately, it was around 11:30 PM already and nothing was available. I resigned to my fate. The manager came back with the sheets and seemed reluctant to perform the task of changing them as it was beneath his vaunted pay grade of night manager of a rundown bug-dump. Eventually he relented and changed the sheets. He left promising to make a note and alert the morning manager to offer me a compensation for my \"inconvenience\".   For the next two hours, I  tried to use my phone's flashlight (as the room was dimly lit) to turn over the mattresses and thoroughly search for signs of an infestation. The mattresses had dark stains on the underside. Finally, exhausted and having somehow convinced myself of the inevitability of the situation, I choose to turn in for the night.   The breakfast was mostly thawed out frozen bakery items. While checking out, the morning manager was completely unaware of my situation. The valiant night manager who went above and beyond his duty to change the sheets had apparently fallen short on his promise. Anyway, the new manager expressed his regret for not being able to help me right away as it was a prepaid reservation. He asked me to contact the travel agency in two weeks to check on my compensation. I have traveled enough to see through the ruse. And right fully so, it has been a week since I started my inquiry through the travel agency and no inroads have been made on the compensation front. I'm quite sure the morning manager forgot to make a note of my inconvenience as well.   In short, STAY THE HELL AWAY from this nightmare of a hotel. …", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r689206884", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Worst Hotel in Italy!", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r682916859", "sub_review": {"Value": 1, "Rooms": 1, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Disaster", "review": "Hotel had no air conditioning so we were told to open the windows.  When you open the windows the room fills up quickly with mosquitos.  When we complained they offered mosquito repellent!  Horrible hotel and rude staff.  Rooms do not look like the pictures posted on the website.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r680866751", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Our nightmare", "review": "It is disaster.clima was not working. Mosquito was in the room. Personal is reception was so rude. He was fighting with customer. I couldnt suggest any more. I stayed during pitti uomo time.price was like 4 stars.room was not clean.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r680731092", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "RUDE RUDE RUDE...!!!!", "review": "The air conditioning didn’t work here and I don’t think it ever does. When it is 85F outside and you are walking in the heat all day, you need a comfortable place to rest. We weren’t able to sleep because it was so hot, even after cold showers. The beds were rock hard, pillows were thin, and there were bugs in our bed. Our room was right on the street—when we opened the window, people walking down the sidewalk could have reached in. The locks on the doors are universal so that my key could open my neighbor’s door too. The person at the front desk couldn’t even get us a taxi when we were trying to leave. Find an AirBnB or spend a little more on a nicer hotel during this hot season because you will regret it if you don’t!", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r678006291", "sub_review": {"Value": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "COSTUMER SERVICE", "review": "it is not a hotel it is a nest. and the staff makes it a hell. They are very rude. Mr Federico is not ready to listen complains. In summers they stopped AC saying that it is not so hot here. When they have charged for AC room then why they are not allowing to use that when it 28 degree temperature...AVOID THIS HOTEL.", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r675617484", "sub_review": {}, "travel_purpose": "", "rating": 1}, {"title": "Very good. But could be better.", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r669057826", "sub_review": {"Sleep Quality": 3, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Umm!! ", "review": "Nice hotel. It is located about 10 minutes walk from the railway station. The area is very quiet. Room is quite comfortable. Breakfast is served at geound floor.  PS: noise isolation is very poor, so you can hear everything happening outside you room.", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r666447555", "sub_review": {}, "travel_purpose": "", "rating": 2}, {"title": "Rustic", "review": "Stayed here with my Wife for three nights ( well two as they double booked us ) hotel is noisy, and no coffee making facilities in rooms, it’s not that far from the main attractions, but we will not go back!!", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r663218339", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Don't Waste Your Time And Money!", "review": "This hotel was clean but “rustic.” Breakfast was good. WiFi was horrible.  Neighborhood was quaint. The night front desk clerk was an absolute jerk. This hotel has some good and bad. It was an okay place to stay. ", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r658751846", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 1}, {"title": "Cheap but not cheerful", "review": "Stayed at this hotel for 2 nights as was unable to get a hotel in the city centre.  The staff are very rude, arrogant and unhelpful.  The duty manager needs ro be sacked,  he has no customer service skills whatsoever. I asked for am iron, and was rudely told that they do not provide. I was told to go and find a laundry shop,  luckily there was one 2 blocks down the road. The rooms are small, they refused to put air conditioning on, even though it was 21 degrees outside and even warmer in the room. Too much noise at night from people talking outside, you can also hear the guests in the room next door. The breakfast is ok, if you like burnt croissants!  It's also a 25 minute walk from the main railway station.   Avoid at all costs.", "date": "February 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r653480532", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Great hotel", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r613223996", "sub_review": {"Location": 4, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Small hotel in a quite street", "review": "Price was low but it was a great experience. Hotel manager was polite and available 24hrs. Room was beautiful and comfortable.Nearby grocery market in case you need something basic, walkable distance to many attractions.", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r612273242", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "bad location otherwise good hotel", "review": "The hotel's main advantage was being quite and situated in a calm street. While I was there the disadvantage was that, even if it is at a walking distance from the city center, the road is almost impractical due to constant urban works ", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r596601198", "sub_review": {"Sleep Quality": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Good Hotel", "review": "We stayed in a double and triple room in July in this hotel . It is an average 3 star . rooms are basic but neat and clean. However not luxurious.The staff is efficient.  But the worst part is that it is mentioned on their website that hotel is 900 m which I dont believe is true We were misled by this information. It is quite far around 1.5 km and not possible to walk. The bus or taxi is the only option.   Thirdly the location is not good because it does not even have good restaurants nearby for any dinner. The area is quite isolated.", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r585558618", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Excellent hotel, friendly & helpful staff, in a good location", "review": "Friendly staff, clean rooms and good breakfast. Turn left out of hotel and another left takes you to via di San Jacopino (opposite II Pane Del Mattino) there is Bar San Jacopino where we had a great welcome. Does lunchtime food, and snacks with bread from Del Mattino.Nice beer as well. Highly recommended. ", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r585365403", "sub_review": {"Value": 4, "Location": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "They stole my jacket ", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r579854945", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Outstanding", "review": "I stayed here with a group of friends, and I forgot my jacket on the coat hook. I realized that I forgot it about an hour after we checked out, and went straight back. They told me that the lost and found was locked and to leave my information and they’ll mail it to me. Well, I emailed and called them, and they said they found it and that they would mail it to me if I paid them for the mailing fee. Then I called the next day, and they told me they never found it, and that they don’t know what I’m talking about. It was a very expensive jacket, and I’m sure one of them is wearing it right now. It’s also extremely far away from the centre, like an hour walk.", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r577471631", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Select Hotel Floris", "review": "We called very late at night and they had a room for us. They were super friendly and helpful. We stayed another night and wanted to stay a third. We accidentally double booked ourselves, and they actually gave us our money back for one night! The breakfast was very good. Big bathroom and comfy beds. We really enjoyed our stay and the hospitality!", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r569595945", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Teeny tiny room", "review": "Historical, cozy, clean, cute, a bit strange and unusual and very quiet little hotel, there are no free parking of any kind. On premises parking is 16€ per night and the unattended parking in front of the hotel is 1.5€ per hour. Facility wise  and equipment wise, it does not have much to offer but for a tourist stay its quite good and the citytax is 4€ per night for each person, the breakfast is not much.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r547075132", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "The beds were very uncomfortable", "review": "This hotel is situated about a 10 min drive from the centre of Florence. Easy enough for us to get a taxi, reception called one for us.  Our room was really small, one of the smallest we had in Europe. Our double bed was pressed against the wall to make room to walk around.  Hotel in general is very nice through, nothing flash, but has a bit of old charm. Breakfast was pretty good.  There are a few flights of stairs up to the rooms, and the lifts are old and slow and not very large.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r534709988", "sub_review": {"Sleep Quality": 1, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Comfortable hotel", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r513928266", "sub_review": {"Value": 4, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Cheap Comfortable place to stay", "review": "This is a clean and quiet hotel. The air conditioning was good with comfortable beds. I appreciated the spacious bathroom and nice \"American\" stye shower. The breakfast was typical for Italy. The hotel is a few blocks from the bus so it was not difficult to get where we wanted to go. It was about a 20 minute walk from the train station and it felt a little desolate. But, sometimes after being in the crowds of tourists, this is a good thing. There were not many places nearby to dine so if you stay here you should plan on returning to the hotel after dinner. I would stay at this hotel again.  Good value.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r495527780", "sub_review": {"Value": 5, "Location": 3, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "It's a place to sleep", "review": "A stay in this hotel is very cheap but does come at a cost of a 20-30 walk to the city centre.  However, there are a few buses #22 #23 close by that takes you into town for $1.2euro and back as well.  The room was clean and the size of the room is huge in Italy standard.  The breakfast was average, just your typical american style breakfast.  There are a few highly rate restaurant near by but I believe its more for the locals as they didn't have an English menu.  Staff were very friendly and told us where to go and how to get there.  Very pleasantly surprise of how good of a stay we have here.", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r475728076", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Best hotel", "review": "Dear guest, Thank You for your review, we're so happy that you enjoyed your stay here with us. We invite You to come back soon.  Kindly regards", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r431282375", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Found a different hotel after about a hour", "review": "It wasn't our favorite, but it is clean and quiet (for the most part). Walls are on the thinner side so people in the hall sound like they are at your door.  It's about a 20min walk from the main train station but about a 5-10 from the smaller out skirt station.  The breakfast was not the best, we basically opted out and just got the cappachinos every morning and adventured out for food.  If you just need an inexpensive place to sleep this is it, but it wasn't the best we have stayed at. ", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r427440384", "sub_review": {"Rooms": 2, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "I would give this 3.5 out of 5 - It's a good hotel", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r406081296", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Poor/decent hotel", "review": "We stayed here for 3 nights and tried to extend our stay an extra two (on a days notice) and, not surprisingly, it was fully booked.   It is a good hotel. All be it a little dated, the rooms are clean, beds made everyday, and the bathroom is good quality and also clean. It's not amazing but it is everything a decent hotel should be.   The staff are very nice and available 24/7. They always serve with a smile and speak multiple languages. 5/5 for them.   The breakfast isn't great, gonna be honest, sorry but it's free so you can just have a coffee or take it or leave it.   The slight downside is that it is kind of 10 minutes too far a walk from the centre of town. It's not the end of the world as the price does reflect this, but if you're not up for walking maybe it's not the best…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r405721545", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "A value hotel in residential area", "review": "Dear Charlie L,  First of all thanks for choosing us during your stay in Florence.  We also want to thank you for your good review, we will take note about your precious suggestions, whom will help us to improve our sevices.  We hope that you will choose us for you next trip to Florence, and we stay at your complete disposal  Best regards", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r377113361", "sub_review": {"Sleep Quality": 3, "Rooms": 3, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Good but...", "review": "The hotel room had this strange sound and was poorly designed. The hotel itself was situated 30 minutes from the inner city in a neighborhood where nothing happened. It was decent value for the money but will definetely not recommend it. The breakfast was also boring.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r374987952", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Amazing value hotel, lots of antique and very comfortable", "review": "Dear Malte, We are sorry not having met your expectations, we work every day to improve our services.   We invite you to come to our place again, giving us another chance to make you live a better experience.   Regards", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r370878216", "sub_review": {"Location": 3, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nice Room", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r369223127", "sub_review": {"Location": 4, "Sleep Quality": 3, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice Hotel", "review": "My wife and I recently stayed here during our tour throughout Tuscany. The room was clean, bed was comfortable, and the bathroom was well equipped. The breakfast was quite tasty and provided a nice/quick option to start our day without the hassle of having to go out and find a place to eat every morning. That said, the location is somewhat away from the main station and positioned within a residential neighborhood that can be (quite) noisy during the night due to all the trucks and scooters. Otherwise, not a bad deal overall. Enjoy!", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r347726129", "sub_review": {"Location": 4, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great value", "review": "Dear DruBones, Reading your review, we assume that you had a nice stay by the Hotel Select, and we are happy that you shared your experience through the web. In fact our future clients, can read about the variety of our breakfast, the comfort of our beds, and the cleaningness of the room. Thanks again, and hope you come back to visit us!", "date": "January 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r339644702", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "TERRIBLE HOTEL, REALLY DIRTY!", "review": "We booked this hotel on the edge of Florence but a 20 minute walk into the centre as it was a fair price with good transportation and a walking distance to all the sights and restaurants and bars. Nice clean room, and basic breakfast...did the job for us...", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r326738906", "sub_review": {"Location": 3, "Sleep Quality": 1, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Decent Budget hotel", "review": "Dear Jamespierra, thank you very much for taking the time to review our Hotel on TripAdvisor and for your compliments. We are pleased that the Hotel did the job for you, your satisfaction is the most important thing for us. Hope we can meet again soon. Best Regards ", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r326474967", "sub_review": {"Value": 4, "Rooms": 3, "Service": 3}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Do Not Stay Here! Horrible Staff, Far From Everything", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r325499166", "sub_review": {"Value": 3, "Location": 1, "Service": 1}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Good budget hotel.", "review": "I stayed there for two nights, and upon checkout I realized I forgot my jacket in my room. They told me to come back in an hour after my room was cleaned. When I came back, they told me their lost and found office was locked, and to leave my information and they'll send me my jacket. They never contacted me, and so I called them and they said they had my jacket and to send them my credit card information. They never contacted me after that, and when I called again a few days later, they said that I was misinformed and that they never found my expensive Northface jacket in the first place. So, someone at that hotel is currently wearing my brand new jacket. Also, the hotel is really far away from everything, and it's kind of in a sketchy area. I definitely wouldn't walk back to…", "date": "January 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r323986072", "sub_review": {"Value": 5, "Location": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Room ok and helpful staff but breakfast average and wifi coverage poor", "review": "We stayed in the Select residence across the road. Nice modern little apartments. We had to cross to the main hotel for breakfast which was typical continental but plentiful. Good location away from city centre but easily accessed by great bus service. Would definitely stay here again", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r309972753", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Great value, modern room, great stay!", "review": "Gentile 0sayitlik, grazie per aver lasciato una traccia della sua esperienza presso di noi. Nel suo messaggio evidenzia i nostri punti di forza: la vicinanza al centro storico ( 15 minuti a piedi ) la facilità di trovare mezzi pubblici nelle vicinanze la colazione abbondante e la pulizia delle camere. Ancora grazie siamo anche felici del fatto che ha espresso il desiderio di tornare, noi siamo qui l'aspettiamo volentieri Cordiali Saluti", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r308264381", "sub_review": {"Location": 4, "Rooms": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "nice", "review": "Ok for a weekend break - easy bus journey into the centre. Staff helpful and rooms clean if a little dated. However the breakfast is poor and wifi coverage patchy. Both of these things could be solved very easily which would markedly improved the experience. That said for a city break you don't spent too much time in the room so it's a good place to stay if you plan to be out!", "date": "November 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r307451903", "sub_review": {"Sleep Quality": 5, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Central and comfortable room", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r304695714", "sub_review": {"Location": 4, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good", "review": "Fairly central location (20 minute walk to the centre), comfortable room although a bit small, and free wifi always a plus.  A bit of inconsistency regarding the 24 hour service (had to wait for a few minutes around 1130pm with no-one at reception), but nothing major.", "date": "January 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r267627568", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Average hotel, you got what you paid for", "review": "We stayed in this hotel in January. Our check in was fast, but the receptionist stinked so much,  unbelievable, it was like he didn't wash his uniform for months. Hotel was all right,  but we got room right next to elevator and door to other corridor which was very noisy.  Specifically if everybody went for breakfast in the morning. Hotel is like 15 minutes far from town by bus. We had cold continental breakfast, which included everything,  it was nice. ", "date": "February 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r262449361", "sub_review": {"Location": 3, "Sleep Quality": 3, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "good", "review": "Dear Suzanna,  Thank you for your review, we are pleased that the hotel met your expectations  About the problem of the bad smell, although we think is not fair to question the level of hygiene of our staff, we apologize for what happened  We hope to welcome you again in our hotel to prove again, if it were needed, our professionalism.", "date": "February 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r252578650", "sub_review": {"Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "I would avoid", "review": "Booked the quad room for my family. The room looks a little old and run-down but since we did not spend much time in the room, it was alright. Breakfast selection were pretty alright too. Staff were really friendly and helpful whenever we had any enquiries. Hotel is quite a distance from the Florence central, would recommend getting a hotel nearer to the central as it will be more convenient.", "date": "December 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r246288713", "sub_review": {"Value": 1, "Location": 3, "Sleep Quality": 1, "Rooms": 2, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "needs some TLC,", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "November 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r240440338", "sub_review": {"Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Travel agent review", "review": "this hotel we came to stay in by chance . As we arrived with a confirmed booking made with Clear sky holidays, to find out there was no booking, This hotel also has a sister hotel which is hotel select executive - which is across the road from the Western select. The receptionist was very helpful, looked at my paperwork and found us a room, but in the hotel select, after a day of travel we were very grateful. The hotel is old and in parts scruffy, clean but tired. The room was large and the bed very comfortable and the bathroom was small but functional. Breakfast was basic, continental buffet. There is no bar or lounge here and it is a good 25 minute walk into town.", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r235104654", "sub_review": {"Location": 2, "Rooms": 2}, "travel_purpose": "Traveled on business", "rating": 2}, {"title": "would not recommend", "review": "Although the staff was very friendly the hotel, or at least the room I received was near their water pump or something that went on and off all night so I had to put on my headset in order to sleep. Definitely off the beaten path and need a taxi to get to the center.  Not a hotel I will recommend to my future clients. The water pump is very disturbing!   As for the hotel itself, for being a best western. I was surprised at its out dated ambiance.", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r235055190", "sub_review": {"Sleep Quality": 3, "Rooms": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "OK hotel, wonderfull staff", "review": "Dear Darrigom,  First of all thanks for taking your time to complete the TripAdvisor survey. Your opinion is important to us, it helps to work better in the future. The Hotel front desk staff is very helpful and friendly as you noticed. We always try to solve problems, in order to keep the client' satisfaction high.  I am very sorry if you couldn't sleep well during your stay. Did you tell the frontdesk about this problem? Regarding the \" Definitely off the beaten path  \": The Hotel is positioned in via Giuseppe Galliano 24, 950mt away from the main trainstation, 15 minutes walking, or 10 by bus at the cost of €1.20. The position cannot be changed, but yes it can be checked once you reserve, to avoid complaints later. Nevertheless we do hope you still could have good moments in our beautiful city Best Regards", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r232732522", "sub_review": {"Location": 4, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Unforgettable.", "review": "We Stayed 2 nights before flying home.  The hotel is quite a walk to any of the sites downtown and is the middle of a residential area.  The staff could not recommend anywhere near by to get a bite to eat.  Better eat downtown before walking all the way back to the hotel.  Don't bother using the \"Do not disturb\" sign on your door either.  The house keeping staff I guess does not know the meaning of the sign, and knocked on the door anyway.  When we opened the door to see who it was she walked right in.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r232377564", "sub_review": {"Location": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "one to miss", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r231417365", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 1}, {"title": "Best Western Hotel Select Florence, Italy", "review": "My 'executive' room was falling apart, full of damp and smelt of mold...... not a great night! If you do have to use the hotel plan on parking being a issue, drove around the block 4 or 5 times before finding a space.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r226939125", "sub_review": {"Sleep Quality": 3, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Stayed on points and that's about the only way we'd stay", "review": "Dear Mr Brian K,  many thanks for completing the TripAdvisor survey.  Your opinion matters, especially when it seems we did not exceed your expectations. I am sorry to read that your stay by us wasn't good enough for you, I just wonder if you told the front desk staff about the room.  Usually we do consider the option to change the room, if you don't like the one we assigned. Regarding the problem for parking your car, we do have our little parking for €16.00 ( and it is €10.00 in case of superior room ) and also in case it is full we do offer a valet parking for the same price. Of course you can also park in the street where available. Nevertheless we do hope you have good memories of our beautiful city Best Regards", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r215411044", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "OK for one night, but would not stay for a week", "review": "A bit far from central Florence, but close to bus stop. I ordered a family room for (4) and got a single bed, a double bed and a roll out bed. The beds were on the firm side, but the way we like them to be, but the roll out was so soft you could feel the metal bars below. The room was small and difficult to maneuver in and the wifi didn't work. The free breakfast was ok and well stocked. There are no ice machines available, but you can request ice be brought to your room. Luckily, we only came back to sleep. Next time, I would probably stay closer to the center of Florence and get a bigger room.", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r214888614", "sub_review": {"Value": 3, "Location": 3, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "", "rating": 3}, {"title": "It was good for what we needed ", "review": "Dear Megan888,  thank you in advance for completing the survey of your stay in Florence. I am extremely sorry you did not enjoy your days with us.  Unfortunately the location we can not change, even if it is well described in every internet site. At the end we are just 1km away from the SMN train station which is in the city centre, and also our hotel is well served by the public transportation. You are right that in the period you came, we experienced some issues with the wi fi. In case of necessity we usually  offer the use of the computer at the front desk.  Also I am sorry the room was too small for you. Did you try to contact the front desk and ask for a change room?  I am telling you this because our front desk staff is always happy to help you out. But even if you would probably book another hotel right in the city, I still hope to see you again here, maybe you could find some improvements. Best Regards", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r214770164", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Best Western in Florence was pretty good for us...", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r201356682", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "home away from home", "review": "Even though we wish it was closer to the downtown, we all liked it much. The parking place is a bit tough but if you take care of parking on the street you are fine. The price was reasonable. Rooms were packed with furniture compared to its size but design was pretty good. Food was great as well (breakfast). Best of all, I like the managers there on duty.", "date": "March 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r201122599", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Hot.  Really, really hot.", "review": "this hotel is out of florence about 15 minutes, but a great place to stay. our room was like an efficiency, with refrigerator, microwave, coffee pot, and we could get  cooking utensils if we wanted. the room itself, was spacious and very comfortable. it was across the street from the main hotel in another building. the staff was always helpful and very friendly. the breakfast every morning was plentiful and fresh.  the  bus ride into downtown florence on bus 22, was very easy to navigate, both going and back.", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r201052643", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 1, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Budget property in Florence", "review": "The good-  We stayed at this hotel through a Groupon voucher.  Nice, clean and comfortable- for the most part.  We stayed on the top floor, with stairs leading down into our room, which was odd.  The size of the room was great, huge bathroom. The staff where polite and friendly.  Location was fine- about a 20 minute walk to the Duomo.  Breakfast was included.  Basic but enough to get the day started. The bad- The first night, we noticed the room was warm, but we could deal.  The second night however was so uncomfortable that I had to sleep with a wet cloth on me.  I woke up at 1.30am absolutely sweltering.  There are 2 high windows in the room, but to sleep without glaring lights you need to close the heavy curtains, which blocks the air.  Rang down to reception and asked if any…", "date": "February 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r197000458", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "I suggest this hotel", "review": "So we stayed here almost for a week ! and travelled to Siena and Milan , and came back. Clean business hotel, decent complimentary breakfast , and yes free internet worked , did an important meeting using the same The hotel is located in residential neighbourhood so sleep was great.Counter staff spoke good English (Yes it was good) , and was co-operative. The hotel is slightly old but room and toilets were clean. There are old television sets in the room , which played only 1 English News channel .This is not more than 1-2 kilometres from the city centre.And it was fun walking that distance in February weather. There is a super store Esselunga at walking distance, and a good Italian restaurant Jacopino nearby. Will stay again.", "date": "February 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r193940446", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Not bad for a night or two, but wouldn't stay longer", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "January 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r193891690", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 4, "Rooms": 2, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Not worth the stars...", "review": "Maybe it was just our luck, but our room was underground in the \"executive\" part of the hotel. We had one window near the ceiling that I wanted open because it was too hot in the room, but couldn't keep open because it was raining and with a window at ground level and no screen, i was concerned i'd get stray critters looking for shelter from the rain. I was also quite peeved that maybe because we were so far underground or because we were just far away in general, but we didn't have wi-fi in our room. We had to go to the lobby, so I'd assume the rooms that are in the same building as the lobby would also have wifi.   The breakfast was actually pretty good, and apart from the shortcomings of the location of the room, the location of the hotel is good. There is a bus stop a couple…", "date": "December 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r188612654", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Stayed at the Hotel Select for two nights", "review": "Internet sucks in italy in general ...but honestly I think 3rd world countries can do better than that... fire the IT support immediately... breakfast... the worst I've had so far in italy..nothing is fresh except for the yoghurt maybe...overall...cheap but still not worth it", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r182708485", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 1, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "For sure I won’t go there again", "review": "Dear Mister,  Thank you for completing the survey regarding your recent stay at our property.   On behalf of our entire team, I would like to apologize for not exceeding your expectations. Your satisfaction is important to us and we will be using the feedback you gave us to implement improvements to ensure we offer a better experience for guests in the future.   I hope that you will consider staying with us again so that we can have another chance to provide you with a superior experience.   If I can provide any assistance, please don't hesitate to contact us  Sincerely,", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r178345971", "sub_review": {"Value": 1, "Location": 2, "Sleep Quality": 2, "Rooms": 1, "Cleanliness": 2, "Service": 3}, "travel_purpose": "Traveled on business", "rating": 1}, {"title": "Not worth the Price", "review": "We just returned from a lovely vacation in Italy.  We stayed at several Marriott properties because my husband is a rewards member.  The last two nights, while we had rooms reserved at a Marriott, we used all our points so we planned to pay for the last two evenings.   We had reservations at the AC Marriott in Florence our last two evening but we felt it was a little too over-priced for the area so my husband booked the Hotel Select.    I wasn't too sure about staying here because many of the reviews were a bit negative.  While the Hotel Select is not a high-end hotel my any means, it is very clean and comfortable which is what's important.  We were visiting our daughter who is studying abroad so we were running non-stop during the day and evening.  All we needed was a CLEAN…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r176176762", "sub_review": {"Value": 2, "Location": 2, "Sleep Quality": 3, "Rooms": 1, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Budget Hotel with good stuff and good location...", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r175622320", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "nice hotel: Good breakfast & OK room!", "review": "This hotel was nicely decorated. Very good breakfast. Room was well sized. Friendly staff. Overall I liked it a lot.The parking was easy to find around, if not, you can ask for the hotel parking at a reasonable cost. Also walk a bit to get great food from a nearby supermarket. Take bus to go to Duomo, don't walk, you may get lost.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r175361586", "sub_review": {"Value": 3, "Location": 1, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "This is a really very nice hotel!", "review": "Stayed in the hotel for few nights. I like the hotel even though it was a little bit dated but still looked quite charming with a great sense of classic and history.   LOCATION: very poor location and very far away from the city where most of the landmarks were. The neighbourhood around the hotel was very quite and full of residental building and house. Stores around were usually closed early; so if you are looking at places to hang out late or visit at night, it is not a good area for that.   ROOM: Compared to my friend's room with one double bed, my room with two twin beds were extermely tiny and uncomfortable. We did not even much spaces for putting out packback and stuffs around.   BREAKFAST: Love their breakfast. A good variety of food items to choose. I enjoyed it a lot.  …", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r172257655", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "I definitely expected more", "review": "I stayed here recently with my family in the hottest part of August. The hotel is in a quiet residential area about a 5/10 minute bus ride from the central station. The staff are courteous and friendly. The rooms were typical European rooms, a nice size, clean bathroom and good beds. The breakfast was typical continental with cereals, pastries, cheese etc – very good!  We arrived early from the Paris overnight train and they let us leave our bags with them while we went back into town. The rooms are comfortable and have air conditioning; the local restaurant they recommended was excellent for food and value and was used by locals not just tourists.  We are happy to recommend this hotel and use it again – and probably will!", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r168287755", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 3, "Rooms": 2, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Never stay there again", "review": "Relatively inexpensive and in a quiet area conveniently close to the centre (Porta al Prato, vicino di borgo ognissanti) this actually is an hotel in my neighborhood. This is just to say how uncomfortable I feel to criticize it. I had my best friend staying there for my wedding, and was pleased that the staff was so nice and helpful. I did select an executive double room and therefore had some expectations: a modern, large room with all amenities. What my friend ended up staying in was a hole in the ground floor, musty and smelly, and less than convenient. For a bit more than a 100 euros in the peak season, it is not much, but I am sure the management can pay a little more attention onto these annoying details that make a huge difference: putting a room number above the door (to…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r167561934", "sub_review": {"Value": 1, "Location": 1, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "", "rating": 1}, {"title": "Never stay here! Be aware of mosquitos!", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r167354007", "sub_review": {"Value": 1, "Location": 1, "Sleep Quality": 1, "Rooms": 2, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "You Can and Should Do Better", "review": "This location is not centrally located and costs 12-15 Euros one way by taxi to go to the city center (walking is a a good 20 min hike).  The worse part of the hotel is that it is mosquito infested.  We all got bitten so badly that we missed one full sightseeing day as we could not sleep.  Definitely will not stay at this property.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r164077075", "sub_review": {"Value": 1, "Location": 2, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "First and last time here!!", "review": "Dear SantaAnaFellow, thank you very much for completing the guest survey: On behalf of the management and the front desk staff, I am extremely sorry to hear you had a bad experience by us. The Hotel is not located in the city center, it is 1km away from the train station, a bus ride would cost €1.20 and the bus stop is just five minuts walking from the hotel. I am very sorry about the mosquito problem, unfortunately it is a problem which is not possible to control, but for a deposit of €5.00 at the front desk we provide stuff anti mosquito. I hope to have you again here in our Hotel  Best Regards", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r161803848", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Nice Hotel- not centrally located, average room & breakfast, helpful staff", "review": "This was the only hotel in Italy we rented through a travel agent. He told us it was 3 star and near the center of town. It is not that close to the center of town and while it may technically be 3 star, it was the worst 3 star I have ever seen. We made the mistake of prepaying for two days. They gave us the worst room on the ground floor: it was small, smelly and noisy. When we complained the next day we received a better room, But why the games? Why not a decent room from the start. Staff varied from formal to snotty. The moral of the story: do your research.  The breakfast room was downstairs and quoted dreary. Again, the worst and least appetizing of the four hotels we stayed at in Italy.  Avoid", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r158618758", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Wonderful stay at the Hotel Select!", "review": "Dear RetiredGuy101 on behalf of the management and of the front desk staff we are sorry you didn't enjoy your stay by us. Our Hotel is 1km away from the main train station, 15 minutes walking, or 10 minutes with bus #22 maybe your travel agent was wrong? We do hope you could give us another chance to proove you how confortable could be your stay by the Best Western Hotel Select. Best Regards", "date": "March 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r156925030", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "I friendly recommend the Best Western Hotel \"Select\"", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "March 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r156134142", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very happy had a pleasant stay", "review": "The hotel is a typical older hotel near the heart of Florence - safe, old, residential neighbourhood. We spent 3 nights at the hotel, in March 2013. Even if they say its location is not far from rail station, we couldn’t find it very easy. The hotel’s location is in a quiet district, quiet street far from the crowds of the city. Even if it is not located in the center, you can easily get there by bus 22 from railway area. Very clean and spacious room, big windows and curtains with blades to keep dark. Our room was facing the main street but being a quiet area we were not disturbed by the traffic. Old furniture but well maintained in the room with comfortable bed. A big and modern bathroom was a plus. The housekeepers really do a great job, cleaning the room and changing the…", "date": "March 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r155737807", "sub_review": {"Value": 5, "Location": 3, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Clean, compact and fair price...", "review": "Dear Mara2305,  thank you very much for all your praises for our Hotel. We are glad you enjoyed your stay, the city, the Hotel staff everything.  We are happy when you are satisfied, that's our job, therefore I hope to see you again soon here in Florence! Best Regards", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r154896254", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Far from the travel attractions.", "review": "Nothing bad about the hotel very very helpful staff.... Excellent rooms good morning breakfast just a bit far from the station but easily accessible but bus no 22 or 23....... Keep up the good work......", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r152931742", "sub_review": {"Value": 2, "Location": 1, "Sleep Quality": 2, "Rooms": 2, "Cleanliness": 2, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Meh.", "review": "I stayed at this hotel two times last year and last time for 4 nights with my wife. For sure hotel's location is not steps from major tourist attractions but in my opinion there are other factors that drove me to take the decision to stay there ... take a look below: - Hotel is Best Western chain and it helps for those who used to stay in hotel chains; - Hotel is Clean and Staff are great (very very helpful. I'll describe in details); - Room and bathroom are quite big, very good; - Breakfast is Italian average, very good; - If you're driving, there are good spots just around the corner; - To go downtown, 10 minutes walking and 5 minutes bus... very easy; - There are nice options in terms of restaurants near the hotel. These restaurants are not tourist traps; After my stay in…", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r152052999", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Older hotel in residential area", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r143736786", "sub_review": {"Value": 2, "Location": 3, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Location Weak, Hotel Fairly Good", "review": "We stayed here for two nights in July 2012 because we wanted to be within walking distance to the duomo.  In Italy you can generally park on the streets for free if you park in stalls painted white but not in this neighborhood because it was parking for only the residents.  Parking behind the hotel cost 16 euros per night.  The nightly cost of the hotel was already a lot without also having to add another 16 euro.  The decor is old (and NOT a nice antique type of old) and our room was small and smelled musty.  Our mattress was smaller than the box spring and there was very little room on the sides of the bed.  The air conditioner didn't work on the \"low\" setting and the \"medium\" setting was very loud.  The breakfast was modest but good.  If you like to walk, it is a good…", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r143606037", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Good for the active person", "review": "dear 2oils  Thank you for completing the survey regarding your recent stay at our property.   I hope that you will consider staying with us again so that we can have another chance to provide you with a superior experience.    If I can provide any assistance, please don't hesitate to contact me directly.", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r143312424", "sub_review": {"Value": 4, "Location": 3, "Rooms": 3, "Cleanliness": 3, "Service": 4}, "travel_purpose": "", "rating": 3}, {"title": "Great rooms, tuscany style.", "review": "The hotel is in a residential area west of the railroad station, about a mile from the heart of the city. A cab was needed for people with limited hiking ability to get to or from the hotel. Rooms were of decent size; our two friends could join us in our room for an evening drink of wine, showing unusual room size. The elevator was, as is common, small. There was no bell man helping, although a desk person was always helpful. WiFi was free, but was working very poorly, off for two days; the hotel's phone had been off on the day we arrived, and went bad again at another time, probably being the source of the problem for access to the Internet. Breakfast was decent with good coffees and juices plus enough fresh food to snack each morning. An open window over the street allowed a…", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r142627816", "sub_review": {"Value": 5, "Location": 3, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "A nice hotel in Florence", "review": "Dear Dunsmurian,  I am glad you enjoyed your stay in Florence somehow. Our Hotel staff is always helpful and try its best to help you out.  Hotel is located 1km away from city center, but it is well connected with city bus and the cost of a ticket is only €1.20 one way, and they runs everyday til midnight. After that, of course you need a good walk or a taxi to come back to the hotel.  I am happy you enjoyed your rooms, and if you want to give us another chance we will be more than happy to show you our improvements.  Best Regards", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r142553104", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Not what I expected from reviews", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r141977552", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Smelly room", "review": "Due to the reviews here we almost changed our reservations. The hotel is a typical older hotel near the heart of Florence - safe, old, residential neighbourhood. We had the upgraded room which was not huge but reasonable, the bed was comfortable, the bathroom was modern and spotless. Windows that OPEN on to the street - you knew you were in Italy here and not just at a Best Western anywhere. The staff was helpful and informative. We use Best Western gift cards when travelling (and this can be a HUGE problem on checkout) but no issues here at all. We enjoyed our stay. Good restaurants are more accessible if you walk near the river. Parking can be a problem though, if driving.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r141082316", "sub_review": {"Value": 1, "Location": 2, "Sleep Quality": 2, "Rooms": 2, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Disappointing and bad service", "review": "Dear Beverly  Never judge a book by its cover, you say right? Sometimes reviews can be deceiving but what you experienced here at the Best Western Hotel Select is really what you got.  Our front desk staff really works hard to satisfy client's needs and sometimes, in your case, we succeed.  We sincerly hope to see you again in the future Best Regards", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r139633544", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 2, "Rooms": 2, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Small clean rooms, horrible service", "review": "On the other side of the main hotel, they have some small apartments. After giving us the key to an apartment of someone else (imagine how surprised you would be when a stranger walks in at 23h00) they gave us an apartment in a basement which smelled like a moulded, wet basement or a dark cave. After spraying a good deal of aftershave it was bearable.  The breakfast was rather sad, staff is not friendly and not professional. My advice: look for another hotel. Skip this one!", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r138521808", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 5, "Rooms": 2, "Cleanliness": 4, "Service": 1}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Overpriced, unprofessional receptionists", "review": "We booked a room at this hotel, as we were informed it included a full cooked breakfast, whereas the Best Western Executive (across the road) only supplied a buffet breakfast, and was cheaper. However, as it turned out, breakfasts for both hotels were the same (Executive guests crossed the road each morning to have breakfast, which was a half-hearted buffet (no fresh juice - cheap squash instead, bad coffee, very limited spread, and the staff started to pack up 30 mins before it was due to close). Our tea/coffee wasn't replenished each day, there was no milk/whitener, only one sachet of coffee, and the bathroom toiletries were also not replenished. Our mugs were also left unwashed, and in one case unemptied from the previous night. The TV didn't pick up several channels it…", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r138255971", "sub_review": {"Value": 2, "Location": 2, "Sleep Quality": 2, "Rooms": 2, "Cleanliness": 3, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Bad neighborhood and awful bed!!", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r138039253", "sub_review": {"Value": 2, "Location": 1, "Sleep Quality": 1, "Rooms": 2, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "A Solid 3 Stars", "review": "I seldom write a bad review but we had such a bad experience I dont want anyone else to miss a nights sleep.  Our travel agent booked this and I should have checked it out better myself but I didnt.  The neighborhood is full of graffiti and appeared quite unsafe (the taxi driver said is was safe though)  The worst part was our bed, it was like sleeping on concrete, we kept waking up in pain all night.  We did not like the breakfast at all either, but we really didnt expect much anyways.  The staff was very friendly though so I do feel bad about writing a bad review.  The room and bathroom were immamulately clean!", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r137899906", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Really enjoyable experience", "review": "We stayed here for 2 nights - everything was as expected - the long walk, uncomfortable beds, limited parking, etc...BUT....this is a budget hotel, so it's all ok - of you want a resort, go somewhere else. The staff were friendly and helpful.", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r134368823", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Not the best", "review": "Was really impressed with Hotel Select. I booked with them two days prior to arrival as my other accommodation lost my booking, and Hotel Select was very accommodating. The two men I dealt with at reception over the two days I stayed there were exceptionally polite and willing to let me practice my Italian, but were understanding when I did not understand their reply and then spoke English back to me. Hotel was very clean and had all the necessary resources. Including a hair dryer!! Location seems somewhat far from town centre but in reality is a 20 minute walk tops, if you stop and look at the shops! I was super impressed and would stay here again.", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r134316946", "sub_review": {"Value": 3, "Location": 2, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 2, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Does not meet Best Western Standards, Overpriced, unfriendly staff", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r132531993", "sub_review": {"Value": 1, "Location": 1, "Sleep Quality": 3, "Rooms": 2, "Cleanliness": 4, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Friendly Staff but far from the city center", "review": "1. Did not provide booked services. Front desk refused to acknowledge that I had booked a superior, remodeled room with free minibar soft drinks.  2. Far from city center and not in a pleasant neighborhood. 3. Nothing around the hotel for dinning - very dreary and grim atmosphere around the hotel. 4. Staff unfriendly and not very responsive.  5. Breakfast not on time, breakfast dude simply said \"no English\" and this is a US chain of hotel - why would he not speak English - at least conversational? 6. Wi-Fi kept cutting off every 10 minutes and poor speeds. 7. Have to climb few steps (~6 steps) to get to front desk with luggage - front desk does not help or no concierge - they just look at you. Did not offer help to send luggage to room. 8. Does not meet US Best Western…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r131254573", "sub_review": {"Value": 4, "Location": 2, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice three stars hotel, could be four", "review": "The hotel staff were friendly; our room was adequately big and the cleaning lady cleaned up our room every day - almost like a four star hotel. If you are smoker, be warned that smoking in rooms is not allowed.  Only disadvantage of the hotel is its location. We traveled four cities during our Italy trip and only got lost in Florence on our first day; the hotel is quite far from the city center. Do not forget to have print-outs from google maps (maps show the way from airport to hotel or from railway station to hotel). I advice you to take taxi (from railway station) for the first time arrival to hotel, then search for the bus stations when you're not carrying your luggages with you.", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r129804815", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Nice enough", "review": "Hospitable hotel,clean rooms and delicious breakfast. Very nice receptionists and hotel crew in general at modest prices.", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r128670248", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Not what we expected!", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "March 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r126354304", "sub_review": {"Value": 3, "Location": 1, "Sleep Quality": 2, "Rooms": 2, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Very good value, super close to the attractions", "review": "If you are traveling to Florene, I recommend that you stay somewhere other than BW Hotel Select.  The hotel is very out-dated, the breakfast was terrible and the location is even worse.  Granted it is only a mile to the Duomo, however,  you have to cross several very busy streets to get there and we were traveling with two children.  Even our tour guide in Florence considers this area \" The Ghetto\" of Florence.  It was mentioned in one of the other reports and it is true, there is a large dog next door that likes to bark very early in the morning. We loved the BW's in Rome and Venice, but we really wished we could have stayed somewhere else in Florence.", "date": "December 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r122497402", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Misleading...", "review": "We picked the hotel purely for its value and were very pleased. By bus it was 10 mins away from the heart of the city. We could purchase bus tickets from the front desk. We don't care if a hotel is updated or not as long as the room is clean, which it was.The English-speaking staff was very helpful in providing us with maps and directions. Plentiful breakfast with cold cuts, cheese, boiled eggs over and above the usual croissant and cereal which we found in other hotels in Italy. We liked that the location was in a residential area away from the tourist crowd. Since it got dark early we would get back from the attractions by 6:30 and walk to the restaurants close to the hotel. The food was so much better than the touristy fare offered in the main city. Caution to those renting a…", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r121787834", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Just sleep hotel - do not expect more", "review": "Don't be fooled-- there are multiple (7, perhaps?) best westerns in Florence. I was hoping to have booked the premier best western that is only steps from the duomo, but ended up staying here, instead. (with that being said, the lady i traveled with booked through a travel agent, so it could have gotten lost in translation...)  However, this hotel was fine for my needs. First, it was quite confusing to get to from the train station (get a cab!!). The entrance/lobby is in dire need of updating-- we did have to wait to get to our room because they were putting down new carpet--hopefully they will be redoing the rest of the hotel. The employees at the front desk were not overly helpful, but curteous enough. The breakfast staff was nice/accomodating.   Our room was a nice size, but…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r118093005", "sub_review": {"Value": 2, "Location": 4, "Rooms": 2, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Too far from the centre and noisy room next to reception on ground floor!", "review": "Good place near attraction, can walk to many atractions. We stayed one night here on the way to Rome from Pisa.We booked 3 rooms. We were able to walk to many beautiful places. Very convenient place. But corridor carpets are dirty, must be replaced. Rooms carpets are below Ok conditions.Washrooms are renovated. So we were little satisfied. Reception area is not a good place sit or relax. Dirty sofa in reception area. Car parking is not available but they arrange for valet parking. Breakfast is included, OK Anyhow, standard is low for the price you pay.", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r117459031", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 2}, {"title": "Great location and value for us, but make sure this is right for you", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r116728833", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Needs Refurbished", "review": "This hotel was perfect for us, since we just wanted to visit museums and common tourist destinations.  It was 2 blocks from a bus stop, which connected directly to the train station as well as common tourist destinations.  Getting our luggage to and from the hotel via bus was easy.  The hotel was in a quiet residential neighborhood, which was away from all the tourist and city noise and traffic.  There were plenty of places to eat, with a grocery and laundry also within walking distance. Free unlimited wi-fi, but you just had to ask.  The hotel was clean and the staff was very helpful.  There was always a staff member available who spoke English well.  It was a great value for the money, since it was half the price of the hotels in the downtown tourist area.  The only problem we…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r116635449", "sub_review": {"Value": 2, "Sleep Quality": 1, "Cleanliness": 2, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Great location and friendly staff", "review": "Disappointing! The hotel needs upgraded. Carpets are badly stained and tile floors are cracked. The air conditioning in our room didn't  work. Computer network connection continually lost. The beds were like concrete. It was sufficiently clean in the room and staff was friendly but would not recommend unless remodeling is done.", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r116117099", "sub_review": {"Value": 5, "Sleep Quality": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Perfect Location!", "review": "The hotel is located on quite street on 15 minutes walk from Santa Maria Novella, very well conected by public transport to the city center and train stations SMN and Rifredi. Nice staff and great breakfast. Of course the hotel need some refreshments, but I highly recomended it.", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r109887113", "sub_review": {"Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nothing positive to say about this hotel", "review": "Great location to catch the bus or walk around town.. Great Restaurants close by...Nice staff  Claudio was the best!", "date": "October 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r102203361", "sub_review": {"Value": 1, "Location": 1, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Good, quiet location- handy to everything", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r101490196", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Poor location. Dirty rooms", "review": "Friendly staff, about a 20 minute walk to the centre but gave us more reason to eat a bit more with all the walking!!  Bus was 5 mins down the road if you didnt want to walk. Post office across the road, laundromat, supermarket, small restaurants all near by- all good, we used them. We had breakfast at the hotel- was great. Good price, clean and quiet. It wasnt the Four Seasons BUT we knew that in the price we paid. Had free wifi so we were happy. Happily stay there again.", "date": "March 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r96781378", "sub_review": {"Value": 1, "Location": 1, "Sleep Quality": 2, "Rooms": 1, "Cleanliness": 3, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Wonderful accomodations for the price", "review": "the bedroom we were staying in was a hive of mosquitoes.. I was bitten in my sleep every night . the noise outside the hotel was very disturbing, and there was a resident dog next door, who woke us up constantly with his very loud bark. Breakfast was mediocre, but the lady running the breakfast area was so rude and cross, that I was nervous about asking her for extra coffee. Staff on reception were very friendly and helpful.. his hotel is about a 30 minute walk from the historical centre of Florence. Overall this hotel is very overprised for what you get..", "date": "December 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r86270088", "sub_review": {"Value": 5, "Location": 3, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Will never stay here again", "review": "Have stayed at this hotel six times since 2005.  ALL of the staff have been warm and friendly to us. When we checked in the first time, the front desk person gave us a list of restaurants to walk to including Osteria de Gelosi three blocks out the door to the left and a pizza place accross the street and two blocks in the other direction.  There is a spaghetteria near the bus stop.  The rooms are clean but not large.  The beds were comfortable for me, but then I was happy just to be in Florence.  My friend thought they were too firm. There is a little market just out the front door to the right on the corner and a super market about 3-4 blocks down to the right on the right.  If you needed laundry done, there is a laundry 2 blocks down on the right.  There is a post office…", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r81979049", "sub_review": {"Value": 1, "Location": 1, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Decent hotel if you are ok with a bit of walking", "review": "I was very disappointed with this hotel. It was dirty and smelled. The breakfast was nothing worth eating. The day time staff were rude. The gentleman in the evening shift were nice. The bed was very uncomfortable. The TV had no english speaking station not even CNN. They turned off the A/C every day from 9-4.. It was very hot in our room even at night. There was a bus \"around the corner\" which we took into the main city center.", "date": "May 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r75323398", "sub_review": {"Value": 3, "Location": 2, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Too far from heart of Florence", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "April 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r74789714", "sub_review": {"Value": 3, "Location": 1, "Sleep Quality": 2, "Rooms": 3, "Cleanliness": 4, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Disappointment", "review": "We stayed at the executive part of the hotel. The room was small, but we expected that. The area is quiet, but that doesn't mean your neighbors in the hotel will be. The bed was large, but not very comfortable. The room had poor ventilation, so the air was quite stale in our room, even with the windows open (it was muggy). It was exactly what we expected from a Best Western - a room to stay in.   While we weren't looking for a spectacular room, the long walk to the heart of the city really made it not worth the price. It took about 20-25 minutes to get to the Duomo, almost half an hour to the Ponte Vecchio, and 15-20 to the train station.", "date": "June 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r71796159", "sub_review": {"Value": 2, "Location": 3, "Sleep Quality": 3, "Rooms": 1, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Not quite what we expected but fair", "review": "We were driving thru Italy and France, so were looking for hotels with parking, which this hotel promised.  Upon arrival, we were told their parking lot (5 spaces) is full, and I can't leave the car on the street parking in front of the hotel, because street will be cleaned tonite.  It was suggested that I drive around the corner, and look for parking on the next street, which of course was full.  I was then given a name of a garage a few blocks away, only to find out that it was a private garage to an apartment building, and I couldn't get in.  I finally ended up finding a garage to park overnight, for 20 euros.  The rooms were old, and smelly.  The only plus of this hotel is that it was within walking distance to historic Florence. Overall, this put a damp on our traveling. …", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r69665428", "sub_review": {"Value": 2, "Location": 3, "Sleep Quality": 2, "Rooms": 2, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Excellent Staff, Good Location and Value for Money", "review": "The room was very dark and despite reserving a non-smoking room we were in fact given a smoking room - not to ideal!  The A/C was a bit of a puzzle to us - it's behind the floor length curtains so how to stay cool at night??  As we had a reservation it would have been nice for it to already be on for our arrival - it took the overall inadequate unit forever to cool the room down.  However, the staff could not have been nicer and the local pizzeria (Santa Lucia) was a real find (from a previous recommendation - thankyou) delicious, friendly and reasonable prices.", "date": "March 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r68311703", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Book executive across the street", "review": "Its a Villa turned into a Hotel. Some of the things I found Facilating and Some Not So Facinataing are: - Facinations 1. Very good Location 2. Not So expensive 3. Good Healthy Breakfast 4. Very Very Helpful, friendly and courteous staff, you will miss them once you go back home. 5. Very Neat and Clean and a well managed facility. 6. Walking Distance from the Supermarket and Other Places of Interest such as Meuseums etc. 7. San Jacopino Square bus Stop is at Walking Distance. 8 SMN Station is 15 mins by walk.   -Not So Fascinating 1. It doesnt really give a feel of a 3 Star as the Website Claims. Its a kind of 2 Star Deluxe. But is not Dissapointing its not Fashionable, but is classy Italian. Select Executive which is just across the road is slightly more Fashionable.", "date": "October 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r48243383", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Disappointed traveller", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r43254249", "sub_review": {"Value": 3, "Location": 1, "Rooms": 1, "Cleanliness": 3, "Service": 1}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "good price BUT poor quality", "review": "Well this place was a disappointing.  Its located too far out of Florence you need to cab it or walk for 25 minutes.  The rooms were small, smelly and very old.  The bathroom was small and god help a large person using the shower.  Im skinny and I stuggled to raise my hands to wash my hair.  The complimentary breakfast was the highlight and the friendly reception staff.  Can recommend the only Pizzeria in the area to eat though that was a surprise.   This hotel should be two star standards.", "date": "July 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r38527804", "sub_review": {"Value": 4, "Location": 2, "Rooms": 2, "Cleanliness": 2, "Service": 3}, "travel_purpose": "Traveled on business", "rating": 2}, {"title": "Best Western Hotel Select in Florence is a great place to stay.", "review": "The hotel was quite cheap, but overall very disappointing. The room was small the furniture old, tiles in the bathroom broken, the shower kind of working, and worst of all the coffee at breakfast was absolutely awful and I mean judged by Scottish standrads (where I currently live). Not what you'd exspect from Italy. The location is also not totally pleasant, although it was quite handy for my my way to the conference location. Service staff at the front desk were quite nice and helpful, but none of the other staff e.g. breakfast service did speak one word of English. So definitely not worth a recommendation even for the small budget.", "date": "March 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r32963542", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Grim", "review": "I've stayed here on two different occasions, each time I've visited Florence.  Once with my 22 year old (at the time) daughter and this time with my wife, cousin and two friends. It's a great boutique-type hotel just far enough away from the bustle of tourists, but close enough to walk from the train station and to all of the sightseeing Florence has to offer. And there's a delightful neighborhood square just around the corner with small local restaurants, shops, and characters.  We were upgraded to new rooms across the street from the main hotel building and they were fabulous. The staff was very friendly and helpful.  Their English was better than my Italian. The complimentary breakfast was a great way to start the morning. And the rooms are priced very reasonably for what you…", "date": "October 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r27498028", "sub_review": {"Value": 2, "Location": 1, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Nice new rooms", "review": "Too far from any sights of note, although they'll try to tell you that you can make it to the Cathedral in ten mins on foot.  It's twenty mins and I wouldn't advise walking it at night.  There are no cafes or restaurants nearby, just residential streets and urban decay.  We were given a ground floor room the 1st night, which was so noisy it was untrue.  To be fair they did move us to a 1st floor room when we complained but it faced the garden and a barking hound frequently interrupted our rest.  When the dog wasn't baying, we were very busy disposing of mosquitoes in our room.  I counted ten on the ceiling one night, amid numerous squash stains where previous residents had occasion to battle the insects.  The furniture is dated and cumbersome, cue banging your foot or knee off…", "date": "April 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r15080208", "sub_review": {"Value": 5, "Location": 3, "Check in / front desk": 4, "Rooms": 5, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "nice but far away from everything", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "September 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r6022770", "sub_review": {"Value": 3, "Location": 1, "Check in / front desk": 4, "Rooms": 3, "Cleanliness": 4, "Service": 3, "Business service (e.g., internet access)": 2}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Nice hotel about 10 minutes from the Airport", "review": "We stayed at the Best Western Select in Florence from Sept. 28 thru Oct. 2nd. It was a nice hotel, but you had to take a bus to see any attractions in Florence. The back of the hotel was next to a school so it was very loud in the day, but very quiet at night. The room was clean and the bathroom had lots of room. The lady who ran the breakfast room was a little rude. The front desk all spoke english and was helpful with the bus system. Great hotel if your alright with catching very crowded buses everyday. ", "date": "August 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r5773532", "sub_review": {"Location": 2, "Check in / front desk": 5, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Good Hotel, Long Walk", "review": "My family of 4 needed a hotel near the airport but still in Florence, as our flight left 7:15 a.m, but we still wanted to have a great last meal in Italy.  The day before, the hotel let us drop off our main luggage and we went to Venice for 24 hours.  Upon arriving back in Florence, we walked about 20 minutes from the train station, getting to the Hotel at about 10 p.m.  The concierge kindly called and got us a late night reservation at a local and fantastic restaurant a few blocks away.  He also arranged for an early (5:45 a.m.) taxi to the airport.  The quad room was sort of small, but it was perfect for us our last night.  We'd recommend the place for sure.  We can't tell you about breakfast because we left too early! The staff was great. ", "date": "June 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r5429874", "sub_review": {"Value": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "A little disappointed", "review": "Large, clean rooms with rather large bathroom.  A/C worked well and there was a little fridge, which was very useful. The bed felt bigger than typical European beds. The major problems were the noise on the street and the long walk from the main tourist sites. This is a great value if you don't mind the walk. ", "date": "June 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r5328179", "sub_review": {"Value": 3, "Rooms": 3, "Cleanliness": 3, "Service": 2}, "travel_purpose": "", "rating": 2}, {"title": "Nice rooms!", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "June 2005", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r3654740", "sub_review": {"Value": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Nice room", "review": "My husband and I stayed at the Hotel Select for two nights in July 2005.  The hotel was a 20 minute walk from the train station and about 30 minutes walk to the city center.  The staff was helpful and professional.  Our room (#215) was large and clean and one of the few rooms with a balcony. Because the hotel is further out from the city center, the room and balcony were quiet and it was relaxing.  The breakfast is served in a nice room in the basement and includes rolls, cheese, ham, cappuccino and yogurt.  There is internet access on one computer in the lobby area for 4 Euro for 30 minutes.  The negative to the hotel would be that it is a longer walk to get to the main sights.  There are busses running near the hotel, however, we chose to walk while we were in Florence.…", "date": "May 2005", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r3500562", "sub_review": {"Value": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "Great for the budget if you don't mind the walk", "review": "Hotel has good room, staff is friendly. There is a supermarket and several restaurants close by. We ate at a Cuban restaurnat 3 blocks away and the food was good. Bus line 22 is 3 short blocks away. ", "date": "April 2005", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r3347789", "sub_review": {"Value": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Good Value, Good Exercise!", "review": "As stated by others this is a great value for your money if you don't mind the walk.  To get into the city takes about 15-20 minutes walking, but the train station is only about a 10-15 minute walk (with my large pack on my back).  They also have a space for cars, however trying to actually arrive there by car was a bit difficult because of all the one way roads.    The rooms were clean and the staff extremely helpful and kind.  They have a good map to get you into the city and around, but I would suggest stopping at one of the tourist info desk and picking up the map that includes all the public restrooms (WC).   They have a breakfast which was decent but could have included fresh fruit.  In addition when they ran out of something for the breakfast (even if there was still an…", "date": "February 2005", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r3287813", "sub_review": {"Value": 4, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "", "rating": 3}, {"title": "good value for the money", "review": "We stayed here for two nights in February, 2005.  While it is convenient to the train station, there is not much going on in the neighborhood.  However, we certainly got great exercise walking the 10-15 min. walk into town.  The bed was kind of hard, but the shower was decent (for Italy standards), and the breakfast was good.  I felt we got a decent deal for our money.  The best part about this hotel is the service--the front desk was very patient answering all of our questions, and even sold us bus tickets and stamps. ", "date": "November 2004", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r2863406", "sub_review": {"Value": 5, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "A wonderful hotel", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "May 2004", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d203002-r2524695", "sub_review": {"Value": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 4}]