[{"title": "Visit to Italy ", "review": " We've never been to Italy before so this was a 1st for all of ower group, and I have to say it was amazing,we stayed at the Hotel Europa at Rva Del Garda right on the lake front. The hotel was superb we had an amazing time the food was very good although they could have had a change from scrambled or boiled eggs at breakfast but other than that we found no faults with quality, the rooms where comfortable although the single rooms I believe where a bit cramped not enough space for everything.     The resort itself was great plenty of bars and restaurants ,if you didn't have half board, not  cheap but then again we were told that Italy was expensive. We did a boat trip round the lake and stopped off at different towns, travelled to Venice well worth a trip it's a beautiful city and we did a gondola ride which is a must. Visited  Verona for the day,again it has a lot of history,saw juliet's statue and the balcony,and travelled up to the Dolomite what an amazing day that was.  All in all our holiday was amazing I don't think anyone could say anything negative about it. The best thing about the trip was the company we booked with all the trips where included in the price except the gondola which was extra but still worth doing it cost €20 per person which was booked by our guide who travelled with us daily on all the trips …", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r717655229", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Wine, food and lovely surrounds.", "review": "We stayed here over the festive season including seeing the new year in & the old one out. I cant praise this hotel enough, the food was out of this world, and as for the friendly  staff they all went far and beyond what was expected, sterling job & absolutely first class.  Only had one issue, room 222 was a bit on the small size. Considering, its mainly only for sleeping we found this was exceptable. My humble gratitude to all the staff and wish them a happy new year.", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r643502516", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent staff", "review": "Dear FMBFeering, we would like to thank you for taking the time to share your experience. We're elated to read your kind words about the staff and the food, you made our day! We are looking forward to welcome you again soon (in a larger room, of course).  Best regards,    The Management", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r716546639", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Hotel Europa", "review": "This hotel is perfectly placed for exploring the north of the lake. Food was excellent and the staff went out of their way to cater for our needs (vegetarian). All other staff were were friendly and helpful.", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r716113125", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "Great location", "review": "Great location on the harbour front of Riva Del Garda, next to coffee shops, bars and restaurants, although central the hotel itself was not noisy.  We visited as part of a Riviera Travel Group and found the rooms to be clean and spacious.  Evening meals are chosen each day at breakfast time, as a vegetarian I was well catered for as the head waiter offered me an alternative to the meat dishes served each evening.Would recommend this hotel.", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r715978691", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Best Hotel in Riva Del Garda", "review": "Hotel is located right in the center - beautiful rooms, elegant breakfast room with excellent assortment (scrambled eggs, tomatoes, good coffee, fresh squeezed juice) - with a beautiful view of the lakefront.     The location is a short stroll to many great cafe's and restaurants. We were fortunate to hear a live band play all evening - Pink Floyd echoing into the surrounding mountains.  This hotel and piazza cannot be beat.  Lots of little side streets with great shopping.  Hotel service is excellent, this is the best hotel in Riva Del Garda.    Walking is easy here, many side streets.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r709998503", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Hotel Europa... Skypool? ", "review": "This hotel is in a great location, Riva del Garda is a beautiful town to stay in with many restaurants to choose from and beautiful views. We paid for a room with a lake view, and the view really was spectacular and worth paying for. The staff were friendly and helpful. The breakfast room has wonderful views and there was a good spread of different foods.  However, when my fiancé and I looked for hotels, we specifically looked for ones with a swimming pool. The management photos of the pool are taken from clever angles which suggests the pool is a lot larger than it actually is and also suggests there is a cocktail bar up there. The pool is really tiny and very cold, and drinks are not served or allowed up there. This was a huge disappointment. We still really liked the rest of…", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r704217339", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Fantastic stay", "review": "We simply Love This hotel  Everything Was Perfect  We had a familyroom with 2 bathrooms  Located on 4 th floor Very Clean, very polite staff All The time  We stayed for 10 days Loved The posibility to take the bikes To The Beach  Breakfast Was Outstanding 🤩", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r700770252", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Excellent", "review": "We were pleasantly surprised by the quality of service, food and rooms, as we were on a budget holiday we could have perhaps expected less. The hotel is well situated overlooking the lake with the spectacular  mountains . We arrived very late at night due to an accident on the road but the staff couldn't have been more helpful and pleasant, even offering food had we required it", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r697409523", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "A perfectly located traditional hotel on the quayside at Riva.", "review": "This is the only hotel that I haved stayed at on three occasions, the latest just three weeks ago. Its is superbly positioned and surrounded by restaurants and bars. Thr staff are very welcoming and the food is just superb. A room overlooking Lake Garda is a must. Highly recommended.", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r696359346", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Disappointed this time around.", "review": "Have been to this hotel 3x before but was told under new management.  The location is great and the breakfast is still excellent but this time had a problem with a/c and service was poor.  After arriving went down to the front desk twice to complain and was told that on their computer the temp was ok and then it would now be okay. After sweating through the night I went down to request a room change.  Guici told me computer showed temp ok and then sent a young man behind desk ato go up to room with me.  Upon arriving he said You can't stay in this room to which Guicy, apparently in charge said she would send technicians to room.  After returning 5::00 and told the problem should be fixed, it was not and the techs had not been sent because when they finally came they immediately…", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r690721460", "sub_review": {"Value": 3, "Location": 5, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Viva Riva", "review": "Travelled with Riviera Travel in June. We had booked a lake view room , so worth it for the amazing  views. The bathroom was very large and modern. The bedroom was small but adequate, no need for anything bigger. The aircon was superb, especially coming in from the gruelling heat outside. We had no fault to find with this hotel whatsoever.  The staff were extremely pleasant and so, so friendly. Well done for your efficiency and making meal times a truly enjoyable experience. Some dishes were not to our liking, but that was purely down to our own wrong choice and not the quality. So no negativity there. Location of hotel is excellent,  and sitting out in the  little bars outside people watching, and listening to the entertainment was so relaxing. The trips organised by Riviera,…", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r690273880", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Refreshing experience", "review": "Great location, central and very convenient.  Refreshing to find a holiday hotel with friendly  and helpful staff, a restaurant that is adequate to cater for numerous clients with a very good selection of food, and waitering staff who appeared pleased and happy to serve you.   Room was small, but adequate.  Not surprising, as it was a converted old original building.", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r689179759", "sub_review": {"Rooms": 3, "Cleanliness": 3, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Boy, did we get lucky", "review": "We had to drive from South France to the Munich airport to fly back home.  We decided to stop 1/2 way in Riva Del Garda.  Fairly randomly chosen city (about half way), fairly randomly chosen place to stay (Hotel Europa). Boy, did we get lucky. I loved this place, my wife adored this place.  I'm sure the serendipity helped the mood, but this hotel was very nice. The location is ideal.  Right on the end of the lake right next to the Ferry dock.  We were driving, which can be painful in Europe.  However, there is a single parking area, not spot, but area to unload luggage right in front of the entrance.  Once inside, they direct you to their reserved parking spots in the garage 2 blocks away.  Plenty of room to park which was pleasing. Our room had a balcony looking perfectly out…", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r688288516", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Really Rather Good", "review": "I’m not going to say “rather good considering the price” as that implies “you only get what you pay for”. It wouldn’t do justice to the quality of this hotel. It really is pretty good. It’s very close to the ferry stop and very close to a huge selection of shops and restaurants in the old town. It has all the facilities you need and the rooms have safes, and are air-conditioned etc. The staff are very helpful, giving guidance on a wide range of topics. The buffet breakfast is extensive and of good quality. The only downside is that, on a limited number of evenings, a band plays in the square outside some of the rooms; this may or may not bother you, and it is certainly not an issue that the hotel can do anything about. So all-in-all, it was really good. ", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r684766933", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Paying for the location", "review": "There's nothing particularly *wrong* with this hotel, but you're essentially paying for a top-knotch location, nothing more. It's not a four-star hotel -- more like a good three-star hotel -- and despite some of the management's comments below, I've stayed in so many hotels around the world that I have a fine-tuned sense of what a four-star hotel is like.   On the positive side, the staff is mostly friendly, and there is a real treat at breakfast: freshly-squeezed juice of practically any kind you can imagine. On the downside:  - Parking is a nightmare. Theoretically the hotel offers paid parking at a nearby garage about three city blocks away. In practice, the garage entrance (not the garage itself) is hard to find and lacks signage, and although the hotel gives you an access…", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r683784841", "sub_review": {"Location": 5, "Sleep Quality": 3, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Lovely week in Riva", "review": "Enjoyed a lovely week in Riva at the Europa!  Lovely to be right in the centre of things! Noisy but we enjoyed the buzz!  Staff friendly and helpful, & food good - enjoyed our stay!  Pity there’s a supplement for a basic single room overlooking the building work but the double with a balcony overlooking the lake was lovely & the double glazing effective! - as was the air conditioning! ", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r681024157", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Wonderful 4* hotel by the lake", "review": "Booked this hotel after seeing so many good reviews. A truly well deserved 4* hotel. Spacious rooms, excellent buffet breakfast with the lovely Paolo keeping everything running smoothly. A spacious lounge with lots of info of places to visit. All the staff at reception were very friendly and helpful, thank you to Andrea for his tips on where to eat and booking us the day trip to Milan via europlan (brochures by reception). The hotel is directly opposite the ferry for the to the towns around Garda. Limone is a must.  If you fly into Verona as we did the best way to keep the cost down is as follows. Aerobus from Verona airport to Verona Porta Nuova €6pp. Train from Verona Porta Nuova (opposite) to Rovereto €5.90pp this takes approx 1hr. Tip if you buy tickets directly at the…", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r675664478", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Hmmmm", "review": "Dear Expedition809669, your enthusiastic review made our day, thank you! We're glad to read that you liked so much the hotel and how helpful our staff is, we always try our best to make our guests happy. All the hotel staff wishes you a fantastic summer and we really hope to see you again here at Hotel Europa. Kind regards,", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r675276750", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great location", "review": "Just back from a weeks stay at the Europa. The hotel promotes itself as four star but in my humble opinion it is three star at best. The staff were great,the hotel itself was ok but the food served at diner was appalling.So bad in fact that we ate out after sampling the first two nights offerings.Shame really as the location is spot on. Many around us felt the same but I don’t know if they will share on TA. The buffet breakfast was good with plenty of choice and variety,the bar prices were very reasonable but,oh dear,the food at diner was truly awful. If you are considering a stay in Riva then the Hotel Europa is a good spot BUT have diner in the town where one can eat really well.", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r672294429", "sub_review": {"Sleep Quality": 3, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "4* Hotel", "review": "Situated on Lake Garda. Evening meals were amazing, such choice & no meal was offered more than once. A 9 course dinner on New Year’s Eve, with fireworks on the lake with the  Dining room overlooking the lake. Evening meals were served, to the table, whilst breakfast was buffet style. Afternoon tea & cake offered every afternoon. Room 212 was very large, like a junior suite, although this had restricted view of the lake. Enjoyed watching the locals have their New Years dip in the lake.", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r643375832", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Amazing Christmas stay", "review": "We visited here for a 5 day Christmas break, travelling with Newmarket holidays. We had an amazing time staying here half Board. The food and menu choices were top notch, the staff were also very good ensuring we had everything we needed. We had a room facing the beautiful lake. We didn’t notice any noise, and it was lovely to throw open the Curtains and see beautiful Lake Garda. We will definite return one day. ", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r642213266", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Riviera package at the Europa", "review": "Stayed here as part of a Riviera package holiday. Beautiful hotel right on the shore of Lake Garda, right next to the main town square, close to the restaurants. We stayed here in July and were fortunate to see a music dancing festival parading in the square and sometimes along the hotel front. The room itself was ok, no view, but we didn’t pay extra for one. Room service was daily to a high standard.  The food was always first class with plenty of choice. Some people said there was too much pasta, really!  in Italy what do you expect! Breakfast was buffet, and the evening was buffet starters, salad & deserts, with the mains being ordered at breakfast from a choice of five. To be honest I could have lived on just the buffet, always something different every day and plenty of it.…", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r626031302", "sub_review": {"Location": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Wonderful stay", "review": " Dear George,  thank you so much for taking the time to write such an in-depth review, this kind of feedback is vital for us. We're glad to hear that you had a good time during your stay and enjoyed the food, your kind words made our chef blush! On the other hand, it's unfortunate that you never had the chance to dine on the terrace, we owe you an apology.  Usually, you are allocated a new table at each meal by the headwaiter, it seems that something went wrong. We hope to see you again soon, this time we'll make sure to reserve you a table on the terrace!  The Management", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r624734032", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "The best hotel in Riva", "review": "We booked the Europa with Riviera Travel. The hotel is located on the shores of Lake Garda. The setting is beautiful. There are plenty of bars and restaurants and plenty to see and do.  the hotel is easy to find. The check in was great and the room was well laid out and always clean and presentable. All of the food that we had was top class served by helpful, friendly and polite staff.  Its quite something to have your breakfast looking out over the lake.  Upstairs there is a sun terrace, small pool and Turkish bath.  My only gripe was that the WiFi though free, was unreliable.  All in all a great stay.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r621334142", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Riviera travel holiday", "review": "We had a fantastic week with Riviera travel, staying in a lake view room. The hotel could not be in a better position overlooking the lake and  paddle steamer that is docked right in front of the hotel. The food was very good indeed along with the efficient and friendly service from the restaurant team.  I loved that you could drink wines from the wine list that were produced within just a few miles from Riva.  A special thanks to Kate, our guide who was just the best!", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r620147822", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Overpriced and poor value", "review": "Dear Badgerman,   thank you for giving us such a positive review! We're delighted to read that your vacation went so well, we hope to see you again soon!  The Management", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r619886405", "sub_review": {"Value": 1, "Rooms": 2, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "A very comfortable hotel with friendly staff", "review": "The location is terrific and our view over the waterfront was lovely, however this didn't really compensate for the price paid. The staff are efficient but not very friendly. Our room was quite small and the air conditioning was very noisy. After travelling for 5 weeks in Switzerland and Italy I realized this hotel was very poor value for money.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r618704743", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A great and central placed hotel", "review": "We stayed at this hotel for a week and were very pleased we chose it. Our room was comfortable and clean as well as being quiet which we heard was not the case for everyone. The hotel is situated on the edge of Lake Garda and we had a lovely view from the dining room. The staff were very helpful and friendly and the food was of a very high standard with a wide range of choices and plenty to eat. We would certainly recommend this hotel to anyone staying in Riva.", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r616385526", "sub_review": {"Value": 4, "Sleep Quality": 5, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "So pleased we chose this hotel!", "review": "I Stayed in a double room with my cousin i july. We choose lake view. The room had a view over the town square and the lake. If you don`t like noice i would not choose this. We heard street muscians play during the evening on to our room, but we did not mind it, but you might do? He did not play all night long so it was no problem for us. The room was clean and had what we needed. The breakfast location was really great and the view really good. They had a lot of selctions of breakfast items. We did no use the roof terrace or the pool, but the pool is a little smaller than it looks in the pictures. But great for a cool down i guess. Only complaint i have is that we arrived really late, and the receptionist lady was going to explain where the parking garage was, she was a little…", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r615649616", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "EXCELLENT LOCATION, FANTASTIC HOTEL", "review": "Just returned from a week at this Hotel. This is probably the first Hotels ever that I have stayed in that I can't think of any complaints at all ! Extremely good location right in the centre of the town. Wonderful Lake views. Bedroom was fine, reasonable size and nice bathroom with a bath as well as shower. The service was good throughout the Hotel. However the best thing of all was the WONDERFUL FOOD ! Breakfast was plentiful. Evening meal was outstanding, 4 courses-salad bar, 1st course usually pasta or soup or juice-main course of meat, fish or veggie and amazing desert buffet ! Great to sit on the terrace having dinner overlooking the Lake. i am a perfectionist and find one of two complaints wherever I stay but at the Europa NONE AT ALL !", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r615318506", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Great Hotel", "review": "Loved the Hotel Europa in Riva, it was absolutely spotless super clean. Friendly helpful staff who worked 24/7. The rooms are a great size nice and modern. Hotel is in a fantastic position overlooking the lake and square where there are lovely bars,  and  restaurants surrounding the area. The ferry is directly opposite to take you to different destinations around the lake. The hotel has a small rooftop pool which is an added bonus and a lovely sun bathing deck. The food is Amazing with a fantastic choice even the pickiest eater would be able to find something they like. The only thing I would ask of the management if I returned would be to sit at a table of 2 for breakfast and dinner as they put our table next to another which is quite annoying as having to make random…", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r614438639", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Really good stay", "review": "Dear Surfgirl67,   thank you for sharing your experience, it looks like you really enjoyed your stay. If you return to our hotel, feel free to ask in advance for a table that isn't too close to the other guests; our maître Paolo will be more than happy to accommodate your every need. We hope to welcome you back very soon! Kind regards.  The Management", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r613127927", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Beautiful hotel.", "review": "Just returned from 1 week at this hotel. Very, very enjoyable - stayed on a bed and breakfast basis. Good choice of breakfast from buffet. Lovely room overlooking harbour. Very clean and well presented. Great staff - even before we checked in they had helped book taxi transport to and from airport and had booked us on an excursion to the Dolomites. Next time we go to Lake Garda, we will look to book this hotel again and we are certain that we will have another great week.", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r611940867", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Just brilliant", "review": "Typical Italian family run hotel. The food was first class. Could not which for a better hotel on the lake. Only 50 yards and you are boarding a boat that will take you round the lake. Plenty of free entertainment in the square ever night.", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r611713266", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Nice location", "review": "Se spent three nights here in a deluxe lake view -room. The view was nice. If you want to spend a quiet evening in your room, this might not be the best choise for your room. There were artists playing and singing at the piazza and infront of the hotel. This didn’t bother us. Our room was smaller than we thought it would be. It was ok, but nothing special. Breakfast was good.   There was a very small pool on the roof. It was too small to really go swimming.   I would say that the location and view were beautiful, the hotel itself was average. ", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r599956570", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Great location", "review": "Stayed there for one night. Excellent location directly on the lake. Superb breakfast buffet with a beautiful view. Room was a bit dark facing the road. Central air condition. The receptionist was very friendly. We were allowed to park our motorcycles on the enclosed car park at no extra charge.", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r593921329", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Location location and location!", "review": "Wonderful Hotel in the best location... just on the lake and the ferry terminal  So much happening around it... lovely cafes and restaurants!! The room was very clean with a lovely view from the balcony! Breakfast was excellent!! And the staff very helpful and friendly.. Loved it... Will surely be back!!", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r593707407", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "a trip to lake garda", "review": "A nice hotel which is very handy for the lake and its ferries. Bar outside with 10% discount for guests. Staff are very friendly and helpful. The only downside which results in 4 stars not 5 is the shower over the bath. The bath is narrow and curved base which means a it can be quite slippy  whilst showering and dangerous climbing in and out.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r588911495", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A Delightful and Peaceful Setting", "review": "We spent a week here on a Riviera holiday in late May, early June 2018 and were very pleased with many aspects of the hotel.  We had paid extra for a lake view room and requested a balcony.  This proved really good and the location overall, as seen from the photographs of the hotel, was idyllic.  The square outside the hotel was not busy or noisy yet the closeness of large pedestrian areas alongside the lake made you feel part of the activities with visiting musicians and entertainers contributing well to the atmosphere.  External noise was not intrusive and the air-con, although a little noisy, was effective.The room was small but adequate but the bathroom was disappointing with a small and cramped shower area over the bath.  The bed was fine and there was sufficient storage…", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r587560116", "sub_review": {"Sleep Quality": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Amazing hotel in a beautiful position on the lakeside.", "review": "Stayed here for one week in May.  Food is excellent with plenty of choice.  The restaurant has a beautiful lakeside position.  We also chose a lakeside room which had an outstanding view.  We certainly would stay at The Europa again and it is highly recommended.", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r587445506", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely place and location", "review": "Came here for morning coffee on the pavement, beautiful hotel and location, priceless view looking out over the water. Staff were very good and friendly and the prices were reasonable. This is definitely a hotel we would consider for our next trip to Garda", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r586940198", "sub_review": {"Location": 4, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "A lovely hotel in a great location", "review": "This comfortable hotel is located overlooking the harbour in the beautiful old town area of Riva. It is well maintained, very clean and the food is good. The staff are efficient, friendly and helpful. We had a room at the back of the hotel and there was quite a bit of traffic noise starting early in the morning, but we didn't notice it at night.", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r583195053", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "A Wonderful Riviera Holiday at this Fantastic Lakeside Hotel", "review": "We had a week at this hotel in a standard room which had comfortable contemporary Decor with a limited view of the Lake, but wished we had upgraded to a Lake View Room.  The Hotel is centrally located in the old town next to the harbour and main square in fact you could not find a better location in Riva Del Garda.  The Restaurant on the first floor has stunning lake views and the food is outstanding the Chef must be one of the best in the region and turns out moorish food which definitely ruins one's diet and often puts on local delicacies. The hors D'ouvers and breakfast buffet are outstanding While Paulo the head waiter and his team are gems that the hotel owners should treasure as the are an invaluable asset. We had a early departure on our final day , and Paulo ensured we…", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r582029702", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "An amazing holiday!", "review": "Dear travellingman2150, thank you for the beautiful review! Wa are very pleased that you enjoyd the holiday here, even thanks to our staff, that with the receptionists, the waiters leaded by Paolo and the kitchen staff makes all the best day by day for the happiness of the guests. We wish you all the best hoping we can say \"Welcome\" to you all one more time next year. The management.", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r580967933", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Returned Again", "review": "12 times we have spent 2 weeks in Hotel Europa for a summer holiday. It is in the best location in the true heart of the town. Located on the harbour side, handy for the boat trips down the lake and surrounded by a variety of bars and restaurants and the best Gelateria is right below. All the photos are taken from our balcony.   The hotel staff are without exception, brilliant. Everything is conducted in a professional and friendly manner and they strive to achieve everything asked of them. The breakfast buffet provides a wide array of foods that only the most pernickety could fault. My wife is an awkward eater but she always enjoys breakfast. We don't take the evening meal as we prefer to eat at different restaurants each night. However, reports of the dinners are very…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r559910932", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fabulous location", "review": "Great hotel in the centre of town. Friendly staff. Choice on menu not always my taste but was well presented.  We had a room at the back which was quiet but just a street view but our kids had a view right over the lake which was beautiful.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r551263158", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "October week with Riviera travel at Europa hotel.", "review": "Lovely week at the Europa with Riviera Travel touring each day.  Hotel was lovely,  sea view rooms nice but not much of a balcony only couple with table and chairs available and big enough to sit out on so be specific on your request. Lovely and clean, bath robes and slippers, take little kettle etc with you otherwise you need to wait til restaurant opens. Food lovely though if you don't like what's on the menu you can ask for something else. Trips out were very good though not a lot of time in Venice, you are offered the gondola trip which was very good value but it was done in middle of your day so limits your time to see other things, but their directions etc on where to meet and times etc with maps clearly marked were very good as we were all a little worried we'd get lost !…", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r534415345", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good stay here with Riviera travel", "review": "Beautiful setting in Riva Old Town.  We had asked for a lakeside room and were pleased to find we had a balcony..............the downside of this was when the next door guest's cigarette smoke would waft into our room.  Bathroom well fitted with over bath shower and bidet.......... although I think anyone a bit weighty might find the bath small. A welcome touch was complimentary white slippers and the use of bath robes.  We were seated in the conservatory dining area which overlooked the harbour which was wonderful.  Breakfast is OK although fresh fruit salad not always fresh i.e. I don't think melon should taste fizzy (fermenting)  My husband liked to boil his own morning egg to his own preferred softness. There's a wide range gluten free food. Dinner offers a buffet to start…", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r531730925", "sub_review": {"Sleep Quality": 5, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great restaurant in s beautiful hotel", "review": "Great location on the lake with a restaurant unique for a hotel! I have been here for work and with family many times and I have been always surprised by the high quality of the restaurant and the kindness of the staff. InSeptember they offered the regional food of Trentino like strangolapreti, canederli, trout, carne salada, ecc... a great dinner which you would not expect in a hotel! Thank you to the staff and to the chef Valerio.", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r528933729", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Riva Del Garda..a traffic free zone", "review": "We spent an 8 day holiday with Riviera Travel,using our base as  the excellent Hotel Europa. This was a 4 star hotel with clean comfortable bedrooms.The Dining  facilities  Were in a beautiful restaurant overlooking the Lake and the Square.. Great to watch the  Boats coming and going while we were having our meals !The starters and Main Course Were silver service with several choices. The dessert was buffet style..so much to choose from! Breakfast choice ranged from Cereal, eggs and bacon to fruit ,yogurt etc The Waiter service was excellent and nothing was too much trouble. Price of the holiday Included Day trips to Venice (an excellent day out!)Verona,The Dolomites and a tour round the lake. The guide was excellent and  all in all the holiday was very good value  for money", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r528426790", "sub_review": {"Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Beautiful hotel in great location", "review": "The hotel is larger than it appears from the lake - it's not just the blue building with the \"hotel europa\" sign on the top but it includes the buildings on either side of it as well. It clearly caters successfully to large groups. We traveled as a couple but there were groups from the UK as well as some corporate group in a conference room listening to who-knows-what.  The common areas are quite attractive and the breakfast room includes a terrace that overlooks the lake. It is extremely sunny there in the morning, so go with your sunglasses. Breakfast is good, with many choices including gluten-free pastries. I found the croissants somewhat dry, but everything else was good.  The room we had was a \"deluxe lake view\" and it had a very nice balcony. WiFi worked everywhere except…", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r527891166", "sub_review": {"Sleep Quality": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "This hotel is a \"keeper\"!", "review": "Great location, and the staff were very polite and helpful. Food was fantastic - we were on a Riviera \"accompanied\" tour and had buffet breakfast and dinner included, and it was excellent. We also found it a real treat to eat in the beautiful dining terrace. We'd paid extra for a room with a lake view, and if we stood on tip-toe on broken floor tiles yes we did have a lake view. But that really is a minor niggle, if and when we return to Lake Garda and indeed the town of Riva, we'll definitely stay at the Europa hotel.The roof terrace is also beautiful and the pool on the roof is really not much more than a plunge pool but all in all, this hotel provides a great all round package and made for a very pleasant stay.", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r527501576", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great location great care", "review": "We went to this hotel on a Riviera Travel hotel and were very pleased with the room,food, and the general care given by the hotel. From the outside it is a old traditional building, which hides what appears to be a new building Inside. Within this comfortable environment, we enjoyed a good menu and service by the restaurant staff, a room which was serviced daily including very regular changes of  bedding and towels. We had a large clean modern bathroom, a large TV which was a little light on English programmes. There were facilities that we didn't use due to our being on a tour and being out for five of our seven, also being right by the harbour and lake we spent time exploring the old town and lake. The staff were friendly and helpful.", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r526117453", "sub_review": {"Value": 4, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Returned Again", "review": "12 times we have spent 2 weeks in Hotel Europa for a summer holiday. It is in the best location in the true heart of the town. Located on the harbour side, handy for the boat trips down the lake and surrounded by a variety of bars and restaurants and the best Gelateria is right below. All the photos are taken from our balcony.   The hotel staff are without exception, brilliant. Everything is conducted in a professional and friendly manner and they strive to achieve everything asked of them. The breakfast buffet provides a wide array of foods that only the most pernickety could fault. My wife is an awkward eater but she always enjoys breakfast. We don't take the evening meal as we prefer to eat at different restaurants each night. However, reports of the dinners are very…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r523873600", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great for a girlie trip", "review": "The hotel was in a perfect location by the lake within walking distance of restaurants and all amenities. The ferries were 2 minute walk from the hotel. The room we had was great, we had a lake view and could also see the square, small rooms but adequate. Safe, fridge and TV. No kettle though but we managed without one.  The sky pool was a welcome relief after some trips in the heat, small but fine. The breakfast was next to none. The evening meal had a good choice. Something for everyone. I don't understand the table allocation thought, didn't that happen in the 1970s??  Paulo was kind enough to accommodate us though (I think the tour operators get first dibs on the tables) Clean, tidy hotel also free WIF, I would definitely recommend.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r521853647", "sub_review": {"Location": 5, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Depends what you are used to", "review": "There are some very good things about this Hotel. It is in a superb position. The rooms are reasonable but missing some of the niceties of what I expect from a 4 star. No tea or coffee facilities. Free water only available on first night. No tissues. Basic toiletries. No glasses in the rooms, only thin plastic cups.  The staff were generally very good. The food was hit and miss. Some nights it was excellent, some not so good. In my opinion the veal stew was inedible. Last night buffet was excellent. They do not know how to cook vegetables. Wine prices were very reasonable. The sky pool is about 1 metre deep. Noisy air conditioning.", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r521846659", "sub_review": {"Value": 3, "Sleep Quality": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Staff is THE BEST! Located in the middle of the action + on the lake", "review": "Everyone on the staff was super helpful and friendly. We have a lot of sporty equipment and there's a big, safe bike storage room. Parking was easy and inexpensive. The room itself is comfortable, maybe a bit cramped (fridge is toooo tiny), but to be expected when it overlooks the main plaza and is on the lake. There are lots of food choices and it's thoughtfully prepared. There's a juicer at breakfast with veggies and ginger. Wait staff remembered us and our preferences from the first day (we stayed 4 nights). Only problem was that my bike frame got some nasty scratches from the bike storage locks because the padding didn't stay in place (bike locker #49).   Can't say enough about the staff—they're so nice and chill and accommodating—really makes all the difference.", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r520449726", "sub_review": {"Location": 5, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Amazing", "review": "Dear Sporty Girl, thank you for your top score review! We are very glad to read that you enjoyed everything here during your stay. About the bike locker #49, we fixed it: thanks a lot for your suggestion! We hope to see you soon again at Hotel Europa. Kind regards from Riva, the Management", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r518145459", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Perfect position ", "review": "This is not our first trip to Riva Del Garda, but was our first time at Hotel Europa.  If I could have given more than 5/5 I would.   We stayed here as part of a European driving tour having driven from Austria.  On arrival, parking outside the hotel was full so we had to go into Riva park up and walk.  This is my one an only criticism as once we had checked in and parking permit issued, we were able to get the car firstly outside the hotel entrance to unload and then up to the hotel car park.  The parking was fine and had a great view of the lake (level 6 of the multi story car park).  We stayed in room 206 which was on the 2nd floor with a lake view.  The room was very clean and comfortable with a small fridge, air conditioning and a good size safe.  The view from the room…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r517791753", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A perfect location by the lake", "review": "This hotel is situated in a perfect location. The ferry is 2 minutes walk and there are countless bars, restaurants and shops close by. The car park is 100m away and you need to reserve a space. Our room had stunning lake views and we looked forward to relaxing on the balcony with a cup of tea. Unfortunately there was no tea/coffee making facilities which surprised me as I have never been to a hotel before that doesn't provide this in the room. Also, it is not possible to borrow an iron so take a travel one if this matters to you. Or you can use the hotel laundry/ironing service. We sent a couple of things for washing and they came back 24 hours later nicely washed and pressed. Pool is tiny - more a dip in to cool off facility than anything else. Beds were 2 singles pushed…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r517174444", "sub_review": {"Location": 5, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely hotel, lovely holiday", "review": "A big thank you to everyone at the Hotel Europa for a wonderful holiday experience. Our room with a lake view (203) was perfect with free safe and excellent Wifi, fridge, gorgeous bed and spacious bathroom. The position of the hotel on the lake and the view from the room were magnificent, the food was of such high quality with plenty of choice. The staff were so friendly and helpful. Pauline, our travel guide with Riviera Travel, was exceptional. Altogether a wonderful holiday.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r514276211", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great location, average rooms, no atmosphere.", "review": "The hotel is in a fantastic location, it's situated on the lake, close to ferry, lots of restaurants nearby and a great bar underneath. Our room was extremely clean and the house keepers visited daily.   We had a superior lake view room. Unfortunately though there had been no photos of the room when booking.. The room was one of four rooms located in the hotels roof. The room was spacious and the bathroom was was fine. The room itself was very plain and dark. The darkness came from the fact the balcony was built into the eaves of the roof. The balcony was surrounded in dark wood and had a dark wooden roof. There was a table with two chairs which was nice, but when seated it was impossible to see the lake or the mountains. The view when standing though was beautiful!   The…", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r511716036", "sub_review": {"Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good hotel", "review": "The location is excellent. We had a room which overlooks the lake. The ferries and bars  are less than one minute away, although it can get noisy at night. The rooms were clean , with air con .  The staff were all very friendly and helpful.  Breakfast was good - fruit , eggs , breads etc . Our party had mixed views on the food - it was good but not brilliant ", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r507833542", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Perfect location in a gem of a place called Riva del  Garda", "review": "The hotel was in a perfect location by the lake within walking distance of restaurants& shops. Also the ferries were just coupe hundred yards from hotel. The room we had was cosy but adequate. Safe, fridge& TV. No kettle though but we managed without one. Plenty of tea& coffee. We had a view of the mountains& The Bastian. The sky pool was a welcome relief after some trips in the heat. The breakfast was next to none. The evening meal had a good choice. Something for everyone. Clean, tidy hotel with friendly staff. Also free WIFI", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r507369879", "sub_review": {"Value": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "All you need, in just the right spot!", "review": "We stayed there on the recommendation of Riviera Travel and paying a small supplement, and it was well worth it!  We were on a higher floor with a sort of semi-balcony tucked into the roof which gave great views of the lake and of the town waking-up in the morning. The conservatory style dining room was a lovely and bright spot for breakfast, and there was plenty of choice, including Prosecco to start the day right! Dinners were varied with a gala evening for something a bit more special.  Restaurant and Reception staff were universally friendly and helpful. Don't be put-off by the proximity of the hydroelectric station - it is inaudible, and the pool and sunbeds are of limited utility due to their modest size and the shadows cast by the mountain.  Traffic noise is reduced by…", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r506061514", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A hotel with a view", "review": "This hotel is in an amazing position at the head of Lake Garda just near the harbour where the boats are .  We have now stayed here twice and love it.  You do need to pay extra for a lake view but it is not expensive and is definitely worth it.  The breakfast is fantastic.  There is the opportunity to boil your own eggs (timer provided!) and squeeze` your own fresh juice or vegetable smoothie.  There is plenty of choice of all kinds of breakfast food too.  The evening dinners are excellent with plenty of choice and an amazing sweet buffet.  The hotel is ideally situated in the town near to everything.  We would never stay anywhere else and we intend to return. We went with Riviera Travel both times.....will use them again too", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r502477547", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great hotel, interesting meals and beautiful central location", "review": "The location in my opinion can't be bettered - 30m from the ferry/overlooking the main square and close to many attractions/bars/reastaurants in riva.  This may look like an old hotel but I believe it to be a modern building behind an older frontage.  The rooms were clean and modern and the ensuite sufficient if not the most luxurious we've had.  Room safe, fridge and tv are included.  we had room 122 at the rear of the hotel so nominal road noise only.  Our grown up kids had room 309 on the top floor with balcony overlooking the square ( I think I got the rooms the wrong way round!!).  The sun terrace has a view over the lake but the pool is tiny.  Food was  interesting and mostly of good quality and varied with 2 courses served plus buffet starters and desserts.  This should…", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r499615674", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great restaurant welcoming staff", "review": "Dear Lawrence, thank you for your top score review! As you said, despite the classic frontage of the hotel, the rooms and the common areas are completely renovated. We are happy that you enjoyed your stay in Riva and we hope to host you again at Hotel Europa! Kind regards, the Management", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r499084029", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Fantastico!", "review": "You do not expect such a good restaurant into a hotel: great buffet , special menu, Trentino dinner, professional and welcoming staff. I love the gnocchetti trentini, risotto at erba ursina personally picked by the great chef Valerio on the Dolomites Alps! The front desk staff is great and helpful  Thank you! I will come back in the fall!", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r499082099", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Perfect place for a break", "review": "The Hotel Europa is perfectly positioned on Lake Garda, close to the lake, moorings, and the lovely town. The room was a little small, though very comfortable with excellent bathroom, but we didn't mind as we spent most of our time out exploring, eating really good breakfasts and evening meals, or sitting in the comfortable lounge. The staff were without exception polite, willing and helpful and added massively to our enjoyment of a wonderful week in a really nice region of Italy", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r498856257", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "All about the Location", "review": "Stayed at the Hotel Europa, in June, fantastic position on the Square and over looking the lake. The food was excellent with many choices. Breakfast the same. Ask the Head maître d ( Paolo) if you are Vegetarian, and he will concocted something for you. The rooms were spacious and maid service everyday. A.C. was free and welcomed. Maybe take a travel kettle with you as no facilities in the bedrooms. Riva Del Garda has many good restaurants and bars and from here is good for boat trips around the Lake", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r496829536", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fabulous Hotel with amazing lakeside view", "review": "Dear Neil B, thank you for your comment! We are glad you enjoyed your holiday on Lake Garda thanks to the beautiful location and to the people working at the hotel: we are proud of our staff. We hope to host you again in the future. Kind regards from Riva del Garda, the Management", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r490981037", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Location, location....", "review": "Fantastic hotel with friendly helpful and very efficient staff. Food was excellent. Breakfast buffet and Dinner were both excellent with plenty of choice including wines at a reasonable price.  MD Paulo and his team were superb, full of charm, humour and very helpful. Our room was very comfortable and spotless - it had a balcony with a view of the lake. It was not near any main corridor so was quiet but be aware that with the windows open there is noise from the bars below and around the hotel environs, not that we were worried by this as it added to the atmosphere in the evenings. There was good WiFi in the hotel if you want to keep in touch with the outside world.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r487901586", "sub_review": {"Value": 4, "Sleep Quality": 3, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Lovely location", "review": "Dear christchurch, thank you for your comment! We are glad you habe a wonderful stay. As you said, the atmosphere here on lake Garda is simply special and we will be glad to share your pleasure with the maitre Paolo and all the staff! Kind regards from Riva, the management ", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r487460895", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Amazing Hotel facing the lake", "review": "We went on a trip with Riviera Travel. I recommend this hotel the food was excellent the staff were friendly and the rooms were clean. We paid extra for a lake view which was well worth the money. A lovely week in a lovely place. Would definitely stay here again. Thank you Bev and Caroline from Riviera travel a great week.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r487235845", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely hotel perfect situation", "review": "Dear Angie H, thank you for your comment! We will share it with our chef Valerio and all the staff: we are really proud of our team and we are glad you appreciated their courtesy. We hope to host you in the future! Kind regards, the management", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r487097353", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Always an enjoyable stay Riva Del Garda.", "review": "Great hotel with amazing breakfast buffet.  The housekeeping is first class and reception staff very friendly and efficient.  The free bicycles were in perfect condition.  We had a lakeside room which was nice as it had dual aspect windows keeping it cool.  Friends faced the other way complained their rooms although nice were hot and didn't seem to have air conditioning.  Car park was secure - other than wishing it had had tea and coffee making facilities we could not fault it and would return again if in Riva.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r487047053", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Bellisimo", "review": "Dear Coogie, thank you for your review. We are glad you liked your stay and appreciated our staff: we are really proud of them and their hard work! Speaking about the air-conditioning system, the hotel has it, but due to city laws it cannot be turn on before the 1st of June. All the best from Riva del Garda, the management", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r486886870", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Apart from no kettle, excels in every way", "review": "Visited this hotel for a week on a package tour with Riviera Travel. Having stayed in Riva Del Garda before I requested and paid extra for a lakeside view. The room was clean with bath shower and bidet. There was a good sized (free) safe in the room, there was a fridge included, along with bathrobes and slippers. Take a travel kettle with you as it is great to watch the world go by from the room. WiFi was fantastic, we took the amazon firestick and it worked fine though we only watched a couple of things on it. Breakfast was extensive with lots of choice. Dinner was ordered in the morning and had a choice of 3 starters and mains and was of a high standard. Wine list had good choice and was reasonably priced. Staff are really friendly and approachable. The room was cleaned to a…", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r486429055", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Heaven", "review": "There's not one thing I can fault about this hotel, ALL the staff are brilliant. It's just a step away from everything, I can't fault anything! The staff are all fantastic, behind reception, in the dining room, everywhere", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r482462374", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "holiday", "review": "Dear sydeney17, thank you for sharing your experience! Hope to host you again in the future. Kind regards from all the staff, the management ", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r481504259", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Delightful in all respects", "review": "Hotel Europa  At First was disappointed in the room I booked a lake view from the pictures in the  brochure which showed the main hotel the blue building in the middle we were in the dark red building to the left  no balcony  room drab and view excellent but you had to stand to see it with your glass of wine before you went out on the night time excellent staff   very good position  excellent walks around Riva and very good ferry location out side door good small  pool on roof ", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r475878540", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Lovely place", "review": "Dear keith I, thank you for your comment! You are right, the location of the hotel in downtown Riva is the perfect spot to walk around, go shopping or take a boat trip. The ideal room to enjoy lake view while sitting on a balcony is our deluxe room, instead of the superior room that you booked. Kind regards from all the staff, the management", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r451622096", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "WEEK BY LAKE GARDA", "review": "My sister, my daughter and I checked in the day the hotel opened for the season, Our apprehension was dissipated the moment we enter the hotel: it was in top shape, fully staffed, and ready to go. Even the rooms were already well ventilated and welcoming (often times at the opening of a season hotel rooms are damp and stuffy). We had a room with a view which was gorgeous. Stuff impeccable, professional, helpful, friendly. We had a \"mezza pensione\" , i.e., with breakfast and dinner. It was a great idea especially since the dining room overlooks the square and the lake front. Food remarkably good with a pleasant selection from the menu. Giusi, Massimo, Michele, all wonderful. Maitre d'hôtel (Paolo?), a treasure for the hotel.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r429040330", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Lovely 5 night stay.  Great Location and Staff!", "review": "We stayed for 5 nights in late September.  The location is great!  Very convenient to everything.  My wife's mother had stayed at the hotel more than a decade ago when traveling with an Elderhostel (now Road Scholar)  group.  We are so glad that she mentioned the hotel to us.The Hotel is right across from the Lake Garda Ferries.  The Tower, Museum, ancient sector of town, everything was nice and close.  We arrived by bus from the train station in Rovereto.  The central bus station/terminal was a walkable distance.  Easy walk for me and doable in less than 20 minutes for my wife, who has some knee problems.  Our room was fantastic.  We took the Junior Suite since this was a special vacation.  We loved the two room (and two bathroom!) setup.  Loved that the floors were hard…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r425969433", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely location. Shame about some aspects", "review": "I have given this hotel review \" very good\" because it is in a beautiful location right beside the lake. Also it has a pleasant ambience with clean lines. It has been refurbished so the bedrooms are smart, clean and tidy with TV and a nice bathroom with bath and shower. Beds are large and room service is good with linen changed regularly.  What I think let's this hotel down is the food at the evening meal. Poor choice and not cooked very well. A lot of frozen food is used as are pretty prepared dishes. On saying that, the selection of breakfast items is excellent. Self service and as much as you like. Also I am very surprised that there is no bar in this hotel as they have a Bistro outside where you get a discount so no nice cocktail taken in the hotels nice surroundings before…", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r425880591", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely Hotel overlooking the lake", "review": "Visited this hotel for a week on a package tour with Riviera Travel.  Lakeside view room was clean, large and well appointed with bath and shower, bidet etc.  We were on a half board basis.  Breakfast was extensive with lots of choice. Dinner was ordered in the morning and had a choice of 3 starters and mains.  Wine list had good choice and was reasonably priced.  There was a hotel bar situated on the terrace outside and as residents we had a 10% discount on drinks.  All in all a very enjoyable stay in a beautiful location.  There is a rooftop poool though we did not use it.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r425789776", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "more than we expected", "review": "Recently stayed at Hotel Europa with a party of eight friends. I had booked with Riviera travel the first time with that company. After this holiday it stands up there with the best.I was impressed with the fact that every detail was taken care of. Our representative at the hotel Pauline Ryley was outstanding. When i and my husband had trouble getting a return booking pass due to the foibles of Ryanair, she sorted it for us. Every place visited she informed on where to eat, where the toilets were, even what was good on the menu. Throughout our excursions we were given lots of history about the place we were visiting. she even rotated seats on the excursions so that everyone had a fair share of front and back seating. It did not bother our party but it was a nice gesture all the…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r424926653", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Top location, very comfortable", "review": "Great location, so it's probably worth paying the extra, as we did, for a lake view, it really is a treat.  The roof terrace is not quite as it appears in the photos, and the pool is actually quite small.  However, the room was as you'd expect from a hotel like this, fairly de luxe.  Slightly annoying was the air con that can't be totally switched off.  It's probably essential in mid summer, but at the end of September, it was nice and warm, just right to have the window open.  Parking is very handy and a must have if you're going by car, otherwise I don't know where you would leave it.  The breakfast buffet is a truly wonderful spread, a bit of everything, including Prosecco if you must.  You won't need lunch after this.   Riva del Garda is a lovely place to visit, the Europa…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r424131582", "sub_review": {"Value": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent lake views and cuisine to match!", "review": "Staying as part of a Tour group, charming staff, and dinner a delight every night, and I'm a vegetarian that doesn't often have such a lovely menu to choose from. Lake view rooms nice if not large but views make up for that. Ace location with old harbour just outside. Bars, restaurant parks all a few minutes away.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r423289134", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "A lovely hotel with great view of the lake", "review": "Arrived at the hotel late in the afternoon. Beautiful location directly in front of the lake. The rooms were a little basic but nice. The breakfast was great. Most importantly the staff were really friendly and very helpful. Will definitely visit again if I go back to lake Garda", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r423234932", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Fantastic Hotel", "review": "We couldn't fault this Hotel food was excellent plenty of variety staff so helpful and courteous the rooms are cleaned  everyday not a speck of dust anywhere.  I would have preferred a room with a view but we went on lots of trips so didn't spend much time in the room. I will definitely go back to the Europa again. Riviera Tours were excellent everything was organised so well and Nichola our Tour Manager was so organised and knowledgeable she made our tours run so smooth I think we chose the Best!", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r422626147", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Almost perfect!", "review": "This hotel is in a great location beside the lake, the dining room having floor to ceiling Windows giving magical views across the water and there being convenient access to the pretty town and harbour. The staff are friendly and helpful and the food is delicious - particularly the hors d'oeuvres and desserts! Only disappointment was my (single) room (227). Bathroom was great but the room was narrow, no room for a bedside table, no bedside light, no picture on the wall to relieve the expanse of white wall, view of the internal courtyard. Luckily not spending much time there! Bed very comfortable, however, and double-glazing effective. Comfortable sitting areas downstairs. Very enjoyable stay.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r421439450", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Haven of peace", "review": "This is a wonderful hotel. Peaceful and tranquil. It is also has very welcoming staff, on reception, in the dining room, and keeping the bedroom spotless. The food was excellent. The location could not be bettered. All in all, the hotel would take some beating.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r421383064", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Everything here is perfect", "review": "This place has everything - location,cleanliness,excellent food, friendly staff and beautiful rooms.  You really couldn't ask for more.  Waking up (room 305) to a view of the mountains and lake.  Excellent choice of food, and lovely views while you ate in the conservatory dining room..  The roof-top pool area was spotless as well as having superb views.  Well done Europa ...a big thumbs up from us.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r420588152", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "great location but that's all", "review": "Location of the hotel was very nice, hotel near the lake, with bar and restaurant in front of it. Unfortunately, we were disappointed with our room and staff of the main restaurant. If you want to stay on a balcony, you have to have half board, otherwise you have to stay inside because all the tables are reserved. Nobody told us that, but the waitress in the morning just told us that we are not allowed to sit there and when I asked why, she was just saying  something in Italian and we can say she was very rude to us. We had a feeling that are less worthy customers than the others as she behaved like this. The room was clean, bed was comfortable but in front of bathroom there was black smudge on the wall Afterall, we won't visit this hotel anymore. It was not as cheap as we were…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r420384061", "sub_review": {"Value": 3, "Rooms": 3, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "A wonderful holiday", "review": "We stayed at the Europa in 1997 and always promised ourselves that we would return one day. Well, last week we did return and we were not disappointed. The room was perfect, overlooking the harbour. The staff were all incredibly attentive and pleasant. The rooms were maintained to the highest standard on a daily basis. The food is from an absolutely traditional Italian menu - antipasto, pasta, secondi and dolce. The first and last courses are buffet style with an enormous choice and the others each are from a choice of four and are different every day. The restaurant staff were all excellent. The restaurant overlooks the harbour and, on warm mornings and balmy evenings, the windows are open giving a real alfresco feel to your meal.  The hotel now has a bistro with tables outside…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r420013278", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent location", "review": "As previous reviews the hotel is in an excellent location.  We also had a table on the balcony for our stay and the choice at breakfast extremely good with plenty of fresh fruit and the ability to do your own orange juice and juicer.  We had a room in the eaves on the 3rd floor with a balcony but unfortunately when sat down could not see over the side.  The pool area is on the 3rd floor so nice and close for the sunloungers. Close to all amenities in the town, friendly staff and perfect for the ferries, all in all an ideal holiday base.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r418206970", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Nice hotel in a great location", "review": "Stayed in this hotel for a week with friends from 3rd September 2016. This hotel is located on the main square and within 2 minutes walk to the ferry terminals for easy travel to Limone, Malcesne and Torbole. The location is excellent in that shops, restaurants and gelateria are only a short and easy walk away. The hotel is spotlessly clean and all of the staff we came across were very friendly and helpful. We stayed half board and the breakfast and evening meals were very good indeed. We had rooms with a lake view and balcony and they were each of good size with good bathrooms (rooms 103 and 104 for reference). The hotel offers free WIFI which could be stronger but was better than a lot of hotels we have stayed at in the past. The hotel offers free bike loans for those who want…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r417963515", "sub_review": {"Value": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Back Again!", "review": "This is our 11th consecutive summer holiday in Hotel Europa and 15th in Riva. We drive over from UK and make all arrangements independently.   Obviously we are a little biased in their favour because we keep coming back. There are better (more expensive) hotels, and many much worse. We just really enjoy this hotel. The service and staff are brilliant at all times. If anything is wrong it is quickly sorted.  Our room on the second floor had a balcony and a view over the Piazzas and Torre Aponalle, the harbour and the lake disappearing into the haze.  You have to pay a bit more for the premium Lake View rooms so decide what you want. These same views are available when you step outside of go up to the sun terrace on the roof.  Rooms are a good size, serviced daily and kept clean…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r413018158", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "super lakeside hotel", "review": "Perfectly situated for lake steamers, main square and lakeside beaches. very friendly staff and excellent food.Rooms are fairly basic in furnishings but comfortable and very clean.Having visited other resorts on Lake Garda, this would be my preferred location as a base.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r406991367", "sub_review": {"Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "10 DAYS AT THE EUROPA", "review": "Dear amitchell, thank you for your review! We are really glad you appreciated our staff and restaurant. We hope to host you again in the future. Kind regards from Riva, the management ", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r404261500", "sub_review": {"Location": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Very good hotel and good stay", "review": "This was my second trip to Italy, Rome being the first. The coach trip from Verona Airport to the north of Lake Garda was about one and a half hours and the approach down to the resort gave us our first glimpse of the beautiful lake.  Reception staff at the Europa were efficient and courteous and I found my single room quite quickly. The room was spacious enough and provided all my necessities except tea & coffee making facilities. Luckily, I had brought my own, although it was rumoured that reception may have provided same.  We were lucky enough to be given a table on the balcony overlooking the town plaza which we kept for all our stay. The Hotel is in a very strategic position, right beside the Lake and its ferry services. Its proximity to the centre of the town is another…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r404214139", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Stunning Location", "review": "On arriving at the hotel, our first impression wasn't as favourable as it was when we left.  It comes across initially as a little outdated and quaint but that soon becomes part of its charm.  The room we were allocated had a lake view which was super albeit the room itself was a little spartan and the bathroom was ready for a face lift.  Having said that it was spotlessly clean and remained so throughout the stay, the room service was thorough and to a high standard every day.  Although our room was directly over a number of bars it was very well soundproofed with the window closed and noise was not an issue at all.  The reception service was very good and friendly and the hotel easy to navigate, the staff were knowledgeable and able to switch between languages very easily. …", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r403723212", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very good value...", "review": "This hotel is great value, the rooms are well kept, clean tidy and modern. Our room did not have a view of the lake, but was very light and airy, with good air conditioning. The Breakfast buffet was very good, with a very good choice of cereals, fruits, ham and cheeses, juices and hot scrambled eggs, bacon and mushrooms, boiled eggs you can do yourself. With a separate machine for all sorts of coffees and tea making facilities. The evening meals are fantastic, so much to choose from on the antipasta buffet, then you are served a second course, then a main course, if you can survive all that, there is a sweet buffet to die for !!  The staff are all very good, friendly and polite.... All in all a lovely hotel on the side of the lake.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r392920503", "sub_review": {"Sleep Quality": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good hotel, great location.  ", "review": "Dear MIKE F, thank you for your comment! We know how important it is to start the day in good and energetic way: that is why we offer to our guests a rich and healthy breakfast buffet! All the best from the hotel staff, the management ", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r391622575", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Location, location, location", "review": "Hotel Europe is a comfortable clean hotel in a fantastic location on the lake front. Breakfast is served on a veranda overlooking the lake. Fridge in room, but no tea/ coffee making facilities. Bikes can be rented from hotel.  Roof top pool is small, but good for kids, and ample sun loungers. ", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r391008267", "sub_review": {"Value": 4, "Location": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "holiday in italy", "review": "The Hotel Europa is at the heart of Riva and overlooks Lake Garda, only a few rooms have a view of the lake but there is a rooftop that has views and a tiny pool,  the breakfast room  looks out onto the square and part of the harbour.  The rooms are clean, air conditioned, nice bed linen there's a TV, mainly euro channels tho'.  .No tea/coffee making so take a travel kettle if you want to make drinks.  The lifts take you down to the square and there is a good bar right outside the door. The hotel food was very good indeed and the staff were lovely.  We stayed for a week on a tour with Riviera travel and would happily go back again.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r389821900", "sub_review": {"Value": 4, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Hotel in Ideal location", "review": "Dear Corleyweld, thank you for the nice words! The location of the hotel is one of our pride: you can easily reach the lake, the beach and many shops. Kind regards from all the staff, the management ", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r387930549", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Convenient location", "review": "We were on a journey around the south of europe with a rented car. So when looking for a convenient hotel with a parking garage, this hotel came up (there is a garage nearby). And what a nice hotel it is! Right by the harbour where all the restaurants and boats are. We got a room with a view right down to the harbour, the room was nice and modern (deluxe room) with every thing working well. The hotel has a small pool on the rooftop with sunbeds, however there were no bar or other service there. Good breakfast with the usual spread. I recommend the hotel, everything went nicely.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r385762623", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Hotel with a great location for all amenities, especially the ferries.", "review": "The room was small, but had everything we required, nice bathroom, all scrupulously clean. Since we only use the rooms in hotels as a place to sleep etc., it was perfectly adequate. The staff, without exception, were excellent. The food and the service were way above what you would get in some countrys for this type of establishment. I would have no hesitation about staying here again. The public rooms were comfortable and well equipped.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r379942971", "sub_review": {"Value": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Old but elegant hotel", "review": "Nice room with balcony overlooking lake. Good food with waiter service. Pleasant,friendly staff. Extremely good position by lakeside and two minute walk into town. Very near to ferry terminal so lovely trips across the lake to different places.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r379276743", "sub_review": {"Sleep Quality": 4, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Wonderful location", "review": "We thought the Hotel, though old was comfortable and the food was excellent especially the buffet antipasti. The staff were friendly and efficient. Our only problem was, that the area outside the hotel is full of noisy bars which went on quite late. The double glazing was very good but the air conditioning doesn't go on till mid June so it was a choice between getting hot at night, or having the windows open. The views over the lake right outside were amazing and the ferries go from there all over the lake. also easy to walk round the old town. Internet was good in the room.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r378528131", "sub_review": {"Value": 4, "Location": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Noisy But Does What  It Says On The Tin", "review": "Very functional hotel though lake view room on second floor very noisy. No air conditioning meant room was very hot and stuffy. Breakfast was good, room service for tea at any hour also very good. Location for all the local shops and bars was ideal as it was for the boats.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r377802262", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Could it be better - NO!", "review": "Just returned from a week at the Europa with a Riveria Holidays group. The Europa was fantastic, good rooms, great food and the staff could do no more. Position was good for exploring, right next to the lake boats. Not noisy at all. No hesitation in returning some day.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r377264027", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Wonderful Riva del Garda", "review": "We travelled with Riviera travel to Riva del Garda via Verona airport.  Well worth using this airport as it is so much nearer than Milan etc. and it is small and easy to negotiate. Europa hotel is placed right on the lake and has wonderful views, comfortable rooms and good food.  The staff are so friendly too. Our week with Riviera was well planned: we saw amazing sights and places. You need strong legs and feet - it is not a restful week but if you like towns and mountains this is the trip for you. My disabled husband coped with the help of a wheelchair when tough going but has so many happy memories. Our guide Christine was amusing and well-informed.  Our driver was very helpful and capable. We would highly recommend this company/hotel/holiday.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r372662941", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely Hotel", "review": "Dear Janet, thank you for your comment. We appreciate Your positive feedback on our our food and rooms. It is always a pleasure to know that we are on the right track.  We look forward to your next stay! Kind regards from all the staff. The management ", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r371833451", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Lake Garda tour", "review": "Stayed at this hotel on a Riviera Travel holiday.  What a great location right on the edge of the lake in a little harbour within easy walking distance to the old town and lake front walks. The rooms are lovely, clean and modern. Ours looked out onto an inner courtyard but was still very pleasant even though we didn't have a lake view. We stayed for a week and towels were changed daily and bedding also changed during the week. The staff were extremely friendly and helpful, especially the dining room staff.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r370727073", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Stunning Place", "review": "We could not find a fault with this Hotel we were in room 206 overlooking the lake wonderful views across the old Harbour the food was good plenty to choose from. the breakfast was plentyful with lot to choose from", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r367224190", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Beautiful view and great location", "review": "Stayed one night in April in room which looked out front and had great view to the lake and main square. Room was clean and quite big, nothing fancy, but view really made it great. I believe you need to book one of the expensive category rooms to have lake view.  Breakfast was good and there is also nice lake view from breakfast room. Hotel has really central location, but they have also their own parking altough we were using one of garages maybe 10 minutes walk from hotel.", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r366517802", "sub_review": {"Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great location", "review": "The back of the hotel opens to a nice plaza with many restaurants and shops it is also right on the lake with tour boats right there the room was clean and price moderate just a great location there is limited parking in their private lot make a reservation for a parking spit", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r326960311", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Lakeside Delight", "review": "The hotel is right beside the lake. Some rooms look out to the front. Although we stayed in one of the rear rooms it was quiet, very clean and comfortable. All the staff were polite and helpful, speaking very good English. The restaurant is a conservatory type room on the first floor overlooking the lake. The delicious buffet breakfast set us up well for the day ahead. Evening meals were also good, but beware of ordering too much! Our only criticism would be that, as with  many European foods,they were a little too salty for our taste. A great place to stay as a centre for exploring the area.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r321611641", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great location", "review": "Hotel central and handy for all amenities.  Boats/ferries to other locations on the lake - right outside the door.  Shops, restaurants etc all around.  About 1 mile walk to bus station.  Just a great location. Room fresh, clean and large comfortable bed.  Quiet at the back of the hotel - our room had a view of the mountains (no. 102), maybe not all rooms have this. Staff very friendly and helpful (particularly when handle on suitcase broke). Breakfast generally good - however toaster machine turned off and items not replenished on a couple of occasions after 9am (breakfast supposedly served till 10am).   Nevertheless would definitely stay here again.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r319531827", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Brilliant hotel, with lovely views of the lake!", "review": "This hotel is really lovely.  The staff are very helpful and friendly.  The dining room has a brilliant view over the lake and local square.  The food is excellent, there is so much choice.  It is in a good spot for exploring Riva Del Garda.  Excellent hotel all round.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r318577657", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely hotel,location,etc,etc,etc.", "review": "This was our first visit to this part of Italy,and I'm sure it won't be the last. The Europa is is great place. The rooms were adequate, and serviced daily. We did not have a lake view but this was not a problem to us when you think how little time is spent in them. The only criticism is that there were no tea/ coffee making facilities in them. All the staff were really efficient, reception,waiting and bar staff could not be faulted. Food quality was lovely, and the panoramic restaurant was lovely. We enjoyed the \" Happy Hour\" between 5 and 7 pm was used regularly. Overall a great holiday, and we hope to return.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r314640800", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Overlooking Lake", "review": "Such a great place to have a holiday, the hotel staff are just great and they really look after you no problems with my gluten,wheat and lactose free diet they even got me in some lovely ice cream I could have. Would go back as it's so enjoyable.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r314467746", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "first visit to Lake Garda", "review": "Wonderful experience through Riveria Holidays...great choice of hotel right by the harbour....food fresh, delicious & (a little too) plentiful as my waistband testifies too:))  Excellent staff, comfortable, clean bedroom with toiletries replenished daily....would be happy to return!!", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r310505773", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely staff and hotel, food perhaps not quite so good", "review": "Well situated by the port but surprisingly quiet, must have good double glazing. Staff very friendly and the hotel very well kept. Perhaps worth taking an extension lead if you plan to charge loads of kit as the plugs are fairly inaccessible. We had half board and the food is good but a bit too much for us, also the buffet not always replanished. Breakfast rather average.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r308856879", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good location", "review": "We stayed here as part of a Riviera group in August this year. The hotel is undeniably in an excellent location, but otherwise for what is termed a four star hotel it was a bit disappointing. Yes, the food in the restaurant was good with a changing menu every day. The breakfast buffet was really very good and the staff were all really nice and helpful. The public rooms of the hotel apart from the restaurant were however a touch utilitarian. We were not in them much so this didn't matter but they did not give me a good impression. The rooms themselves are very bare and almost bleak. The towels in the bathroom should have been thrown away long ago they were so thin. The air conditioning was dreadfully loud and had no individual controls.  The other thing which I thought mean was…", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r307183184", "sub_review": {"Value": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Beautiful view lovely service", "review": "I would Stay here again most definitely Beautiful breakfast buffet with hot breakfast, yogurts, breads, croissants, fruit, coffee, Cappuccino and fresh juices. Great service. The room more than comfortable  nice bathroom  great hotel front desk service, happy hour, etc. all you need is Here. Rooftop pool is small but comfortable lounging seats to sun yourself. Would return", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r306271962", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Location - perfect", "review": "This is our 10th consecutive summer holiday in Hotel Europa and 14th in Riva. We drive over from UK and make all arrangements independently.   Obviously we are a little biased in their favour because we keep coming back.  There are better hotels, and many much worse.  We just really enjoy this hotel.  The service and staff are brilliant at all times.  If anything goes wrong it is quickly sorted.  Our room on the third floor has a balcony and a view over the Piazza and Torre Aponalle, the harbour and the lake disappearing into the haze.  You have to pay a bit more for the premium rooms so decide what you want.  These same views are available when you step outside of go up to the sun terrace on the roof.   Rooms are a good size, serviced daily and kept clean and tidy.  Everything…", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r304511586", "sub_review": {"Sleep Quality": 4, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Wonderful location, friendly staff", "review": "We stayed five nights at this hotel.  We came as part of a package holiday from Canada and were thrilled to be given a lakefront view room on the third floor.  The room was comfortable, especially the beds, and it had a nice washroom.  Plenty of cupboard space.  We were at the front of the hotel so we could hear the music from the square but it never bothered us.   The reception staff were so friendly and helpful.  Thank you Michaela. Always a smile.   We chose half board and were extremely pleased with the dinners.  So much choice and variety and food was very tasty.  You choose your appetizers and dessert from the buffet and the 2nd and 3rd courses are served.  You choose your meal for the next evening and fill in a card.  Any wines, water, etc. is charged to your room. …", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r302884671", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Fantastic Holiday", "review": "The Hotel Europa, similar to many Italian hotels, has spacious, elegant public rooms but basic bedrooms. We booked a superior room on a half-board basis, with lake view, which was clean, comfortable and well serviced by the staff throughout our stay. In fact the staff, from the minute you walk into the reception to register, were brilliant. Nothing was a problem and they were the friendliest bunch you are ever likely to meet. The location is fantastic for access to ferry boats, cycle and walking routes, visitor attractions, bars and restaurants. We thought we might eat out some evenings to experience different settings and food styles however, we dined in every night. The food and service were brilliant, not one bad dish or complaint.  We travelled around the lake to other towns…", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r295270955", "sub_review": {"Sleep Quality": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A gourmet experience!", "review": "This hotel is amazing. The location at the edge of Lake Garda is perfect. The ferries to every corner of the lake are a few steps from the hotel. the staff throughout the hotel were friendly and helpful, the quality of food (half board) is exceptional and was quite unexpected! Riva Del Garda is a friendly, safe and buzzing resort... suitable for every age group. There is a huge range of outdoor activities nearby...serious cycling, water sports, climbing, walking etc etc. the hotel even welcomes dogs! There are quiet comfortable lounges and outside areas. A large sun terrace on the roof, with sunbeds and recliner chairs also has a small pool. All areas are exceptionally clean and well maintained. We booked with Inghams and thought the stay was excellent value.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r294730337", "sub_review": {"Location": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Holiday", "review": "Went with Rivera coaches and the lovely holiday rep was Jackie she was very knowable.nice room wants a bit of TLC spending on it bathroom ok even though the shower screen not big enough. Food nice just wished they did more variety at breakfast and fresh veg with the Eve meal. Drinks not to expensieve bargain if you happen to get down for happy hour.please note they do supply you with a kettle teabags and milk if you ask at reception we didn't know about this till the day before we where leaving to come home.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r293649763", "sub_review": {"Sleep Quality": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice stay, perfect location", "review": "We stayed here for two nights during our stay in Riva Del Garda.  We had a nice room with a beautiful lake view, put the extra money in it! 😊  Very good breakfast in the morning, lovely to be sat on the terrace watching people in a slow pace on the outside whilst enjoying a glass of fresh pressed juice 😊  Very nice and helpful staff, hotel parking on the outside, excellent location in the heart of Riva.  We used the roof pool on our last day, not big but served its purpose to cool us down in the heat 😊  All in all a very pleasant stay 😊 ", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r291665352", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "great place, great food and a great location", "review": "With had half board and glad we did. Starting with diner, the food was amazing. Breakfast had everything plus more, a bowl with fresh veggies and fruits to make your own juice. I don't think I have seen a breakfast like that, it was amazing. The room had AC, bed was comfy, and we had a nice view of the harbour. Front desk was nice and friendly, got free bikes, a steam room and a small pool. There is a desert place downstairs that is a must for everyone .", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r290446805", "sub_review": {"Value": 4, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Clean, good for storing bikes, but seems one of furthest hotels from swimming beaches in Riva", "review": "The hotel was clean and safe. The staff was friendly and helpful. There is a bike room attached to the hotel where they rent and store bicycles.   The hotel is next to the water but not really near the swimmable water. I had a bicycle and it seems like over a kilometer by the time you take the twists and turns to get to the beach.  The hotel is also within walking distance of the central plaza and many restaurants.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r290159739", "sub_review": {"Location": 4, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Super friendly staff and great location", "review": "Couldnt fault the hotel, staff, location and service !! We had a Lakeside view with a balcony, and certainly worth paying that bit extra to wake up to such beauty ! Really helpful and lovely staff ~ the food was really good ~ (if you don't opt for the hot breakfast on offer) ~ not really brilliant, but compensated by the choice of everything else. Fresh and healthy as well as beautiful cakes and pastries. Not at all noisy in our room ~ ( we were 2 floor ) and can't praise the staff enough", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r286869487", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Be careful of the room you choose", "review": "We booked a Superior Lake View room and on arrival were given one of four in the roof.  It was horrendous - very dark  The balcony had two chairs but were you to sit down you would be looking at the balcony wall.  The view could only be seen by standing.  There was no view at all from within the room.  No pictures of this room appear on the hotel's website.  We know why!   We had no intention of staying in that room.  To be fair to the lady on the front desk we were moved to a Superior Lake View room on the first floor which had a window only, but was better - not quite what the picture shows on their website. The rooms are fairly basic but clean with comfortable beds and a very nice bathroom. The breakfast room is in a marvellous setting as is shown on their website.  The food …", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r286848288", "sub_review": {"Sleep Quality": 4, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Nice break on Lake Garda", "review": "We stayed for a week on a half board basis and had an excellent time.  Staff were very helpful.  We had a room overlooking the harbour and could quite easily have sat and watched the comings and goings all week.  It wasn't quiet but I enjoyed the hustle and bustle.  There were a lot of older people in the dining room, some groups who looked like they never seen food before, but thankfully we took it easy and there was plenty of food to go round.  Some nice pasta dishes as well.  If we were leaving early we could get an early breakfast and we enjoyed a few aperol spritz in the happy hour too!", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r285257515", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fantastic lake-front position", "review": "Also travelled with Riviera Holidays.  A lovely hotel in an ideal lake-front position, opposite the ferry and with cafes and restaurants on the doorstep.  We had a \"standard\" room which faced an inner courtyard, it was clean and comfortable without any frills, but was exactly as described on the hotel's website and in Riviera's literature.  We had decided not to pay extra for a lake view room because of previous comments on TA about noise from the cafes below, but guests we spoke to said this was not a problem as the soundproofing was very effective.  There were two very airy lounges with great lake views anyway.  The air conditioning in the room was a little eccentric, it automatically shut off at night unless you asked reception to leave it on, but once we discovered this it…", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r283090330", "sub_review": {"Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great hotel", "review": "Stayed in this hotel for 1 night may 2015 room on our tour round lake Garda which was lovely cannot remember the room number but it was the room with the balcony over looking the harbour .  Had no problems with the room only that I found it hard to locate the plugs eventually found one behind the tv , I have seen comments about the noise coming from the bar which is below this room we did not have any problems but this could be that the weather was a bit wet and cool so maybe no music etc. breakfast  was very good really enjoyed you pay extra for the parking but it seemed to be a secure car park ", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r276959139", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "EUROPA SHOULD BE EUREKA!", "review": "Traveled with Riviera Holidays, to this great Holiday Hotel and resort on Lake Garda. Situated at the head of the Lake with views over the lake and ferry Terminals. Good  accommodation, excellent staff, wonderful buffet breakfast and a great choice of evening meals in a relaxed and friendly and very clean Hotel. Wish we could have stayed longer!", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r273525026", "sub_review": {"Value": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "SUMMER BLISS", "review": "We travelled with Riviera Travel to this glorious Resort. Perfect location for travelling around the Lake and the many Tourist attractions. The Hotel situated opposite the Ferry terminal always a fascinating experience people watching and sitting in one of the many lakeside Restaurants. Dining in the Hotel for breakfast or evening meal overlooking the Harbour, with a wonderful choice of menu and brilliant staff for whom nothing was to much trouble. Overall a great place to stay. ", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r273267212", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "great service", "review": "We recently had a group stay at Hotel Europa.  The staff was very accommodating.  Michele at the front desk was helpful every day.  His English is perfect and he helped with everything from directions to amazing restaurant reservations and was always pleasant.", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r264339963", "sub_review": {"Sleep Quality": 2, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Very good hotel in a Beautiful Location", "review": "The hotel was just perfect for a couple's first holiday abroad together. Not all the staff spoke the best English, but that didn't hinder anything. They are really helpful and approachable. The rooftop pool is only small, but a great place to relax and cool off. Views over the lake and square are fantastic so throw open your windows and let the atmosphere fill the room! Wonderful when there are musicians outside the restaurant next door! The dinners available are beautifully cooked, and there are some familiar dishes. Breakfast is filling and plentiful. We couldn't have asked for a better hotel to start off our travels together!", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r247371415", "sub_review": {"Location": 5, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Outstanding staff", "review": "Despite not speaking any Italian whatsoever, we got by fine because staff were absolutely charming and tried very hard when speaking English with us. Swimming pool on the roof lovely, welcome lovely, coffee on the house when we arrived outside on the little terrace. Room a little tired although it had a fabulous view of the lake and square... having said that, the bathroom more than made up for the room being slightly tired. Breakfast was great. All-round lovely experience. Free parking for our motorcycle too, behind a safe gate. Receptionist - an older Italian lady - could not do enough for us. Grazie!", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r243331630", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Europa hotel Riva Del Garda", "review": "First time at Lake Garda we stayed at the Hotel Europa ,fantastic location paid extra for a lake view well worth the money we stayed in room 105 magnificent view of the Lake from balcony .Staff very good nothing was ever a problem ,food was first class with many choices would recommend this hotel to anyone who is visiting Lake Garda.", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r237330986", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Riva very nice", "review": "We returned from Europa a few days ago. We had booked a room with a view of the lake and were put in 109, after the first night we asked to be moved as the noise from the pub below went on until 1.30am. We were moved to a room at the side which was a little better although the noise from the recycling collection van at 7.30 makes sure you don't get to sleep in.   The food in the hotel is average and you have to choose what you want for your evening meal the night before.   On a plus side it was nice to be able to go for a walk around the town in the evening and we always felt very safe.  The staff are friendly and we met some lovely people from our tour and enjoyed their company very much.  Overall I would say DONT pay extra for a room with a view it's not worth it.", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r236410941", "sub_review": {"Location": 4, "Sleep Quality": 1, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Riva is my favorite place!", "review": "We stayed at the Best Western Europa in Riva Del Garda for two nights.  The hotel was very nice.  We had a family room locate at the back of the hotel is on the main street, the room had two bathrooms. We eat two dinners it is much recommended.  The breakfast and the diner serve on the balcony view of the lake is beautiful, and the food very good to start the day and the evening. The girls  at the front desk are very helpful and friendly. The pool with a large deck and lots of lounge chairs on the roof top is great. The location is just perfect on a lovely piazza. We had car so we park it with the hotel garage arrangement it cost 7 Euro for night, It is my second time at this area and Riva is my favorite place! I recommend to taka bike to travel along the lake Riva have lot of…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r233668205", "sub_review": {"Sleep Quality": 3, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Room with a view!!!", "review": "We returned 3 days ago having spent 10 nights at the Europa. I agree wholeheartedly with the review from \"TriploverIreland\" with a few exceptions. We were fortunate to have an excellent corner room on the 1st floor above the dining room. We also had a large balcony and looked over to the Ferry Terminal, the lake, harbour and to our left front the piazza. Apart from the tower clock chiming the 1/4 hours etc.which stopped at 11pm till 7am. we only had one night that was a bit noisy till 01.30 and all the other nights quiet by 11pm,ish. Our room facilities were very good with a quite large powerful shower over the bath with plenty of hot water. Plenty of storage and a spotless room. The food was of very good quality and well presented. Dinner served by well trained and friendly…", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r231381943", "sub_review": {"Value": 5, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great location", "review": "My husband and I have just returned from a seven night stay in Hotel Europa. We had a side room which was small and functional. However it was very comfortable, quiet and spotless. Rooms at the front are less quiet. There are electric power points in the room (other reviews talk of only power point in bathroom). They are covered by dark blue covers! We pointed this out to other guests who also thought they had to use the shaving point in the bathroom. The breakfast buffet had an abundance of fresh bread, croissants and cakes. Also cheese, a variety of cold meats, croissants, fruit, jam, honey, marmalade as well as cooked breakfast. I started each day with a glass of bucks fizz!  The reading room at the front of the hotel had French Windows opening onto the piazzo and overlooking…", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r230897417", "sub_review": {"Rooms": 3, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Something that lets the hotel down", "review": "Myself , my husband and daughter stayed at this hotel for the week 15/9-22/9/14 ( 2 rooms ) Now I had seen the reviews on trip advisor after paying £ 59.00 per person for a lake view room so I asked for a highfloor room to avoid the noise. When we checked in we were allocated the 1st floor ( 107 ) , us at the front and my daughter at the back ( I did not pay for a lake view but was stuing £ 159.00 single suppliment ). On the first evening that it when it went downhill. We were over the pub at the front ( called no name pub ) and the music was still going it at 12.15 so I went down stairs to ask when the music was supposed to be turned off . The man on the night reception said 12 midnight and he went down stairs and asked them to turn it down which they did. His comment was no…", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r230842690", "sub_review": {"Value": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Just ok", "review": "Honestly this was my least favourite hotel I stayed in while traveling Europe.  I felt like I was in a dorm room from the 70's. Service was fine although they did try to charge me twice for my hotel room.  For the price it wasn't worth it.", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r230692197", "sub_review": {"Sleep Quality": 3, "Rooms": 2, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Riva Del Garda Hotel", "review": "We stayed at the Best Western Europa in Riva Del Garda for four nights.  The hotel was very nice. We had three  family rooms.  There were four in each room.  One of the rooms had a small patio.  It was nice for enjoying the evening before dinner with a glass of wine.  The other two rooms had two bathrooms.  This was a special addition with teenage girls.  The breakfast room over looking the lake is beautiful, and the food very good to start the day.  The people at the desk were very pleasant and helpful.  There was a small pool with a large deck and lots of lounge chairs on the roof top.  We only ate breakfast at the hotel.  The location was perfect on a lovely piazza.  We had private transportation from Milan and they were able to drop us off in the back of the hotel.  The back…", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r230600029", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Hotel Europa is the place to be in Riva Del Garda.", "review": "My wife and I stayed at the Europa Hotel in 2013 and enjoyed the experience so much that we told our friends about it and returned with them this summer to do the same holiday all over again. The location is first class, the food and accomodation is second to none and the prices are fantastic. I would recommend this hotel to anyone looking for a fantasic holiday that doesn't cost the earth.", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r230153366", "sub_review": {"Value": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lake Garda in my view", "review": "We have just returned from an 8 day stay at the spacious Europa Hotel and enjoyed the great location, close to the lake and set in an historic piazza.  The staff are very helpful & polite e.g. printed out our airline boarding passes. The meals were 4 courses and there was an impressive buffet, for breakfast; at dinner, the Appetiser buffet was varied; pasta or soup followed, then a Main meal, with meat or fish and vegetarian option. Finally, the desserts were delicious, with plenty of fresh fruit, ice cream, and other Italian delicacies.  The bedroom was functional and very clean but lacked a beverage facility in the room - we had to ask for a kettle & plug it beside the basin, no other electric point. Next to the hotel are plenty of bars with wonderful cocktails & yummy…", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r229578416", "sub_review": {"Location": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Terribly overpriced for what is a basic 3 star.", "review": "We stayed at Europa for 3 nights, we thought the rate charge was far in excess of its worth having stayed in much nicer cheaper hotels in Florence and Rome. The rooms are very basic, drab and disappointing. On our first night there was a band outside the room until nearly midnight which kept us awake. Our bath plug didn't fit and although rectified meant we were unable to use our bath one night. The pool is an oversized paddling pool although the terrace itself is quite pleasant. ", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r228816061", "sub_review": {"Value": 1, "Location": 5, "Rooms": 1, "Cleanliness": 4, "Service": 2}, "travel_purpose": "", "rating": 2}, {"title": "Location, location, location!", "review": "We have visited Riva Del Garda many times, but have not found a better location to be than Hotel Europa.  This years 2 weeks in August was our 9th consecutive stay here and we have also booked a return next year.  Perfectly placed on the lake/ harbour side and at the heart of the busy Piazzas.   We always make our own arrangements direct with the hotel and everything was perfect on arrival, even the exact room we had requested when we booked last year.  The hotel car park was full but the overflow is in a nearby multi storey.  A very short walk once you have unloaded.  This is actually a better option than the hotel car park as the €7/day is less.  The private hotel section has allocated parking space and is perfectly safe, secure, illuminated and clean.  It also much cooler…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r227571948", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great location, not a 4 stars though", "review": "The location can only be matched by other hotels on the piazza, so very well located. Room was clean but small. Breakfast ok but without anything special (same jam, ham, cheese as in any other cheaper places, no fresh bread). Staff was courteous. Parking is conveniently located 50m away but you can park and drop off your luggages in front of the hotel. Overall ok but NOT a 4 stars by any mean, rather a 3 max. Location and price make it a 4, that's it.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r225518797", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Perfect Location", "review": "Beautifully situated hotel , converted from an old mansion and well modernised .Room was clean and comfortable if not very large ,bathroom was fine . Air conditioning worked well . The food was very good , an excellent selection at breakfast from the buffet , and four courses at dinner , all very enjoyable and the service was extremely efficient .The hotel is a few steps from the lakeside , very convenient for a stroll after dinner with many bars , shops and cafés nearby . We enjoyed our time there .", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r224684401", "sub_review": {"Location": 5, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great location at head of the lake", "review": "Super position with limited car park but arrangement with overflow only 100metres away 4 floor room for 3 with lake view B & B around £1350 for 9 nights in August Reception staff bit variable in helpfulness and not much enthusiasm for us to eat in hotel in restaurant overlooking the water as several tours had already booked half board HOWEVER slap bang in centre of busy squares with probably 30 restaurants within 5 minute walk so no great loss. Room (405) well decorated and always cleaned to god standard. Small pool & sun deck with only sporadic waiter service. Breakfasts reasonably good but again staff inconsistent in friendliness - tip is not to be afraid to ask same question to another staff member !!", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r224155151", "sub_review": {"Value": 4, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Excellent Central Location", "review": "Just returned after spending 7 nights at the hotel.  The reception staff both on arrival and throughout my stay we're both friendly and helpful. The hotel room, was very clean and adequately furnished and included a safe and air con at no extra charge.  It overlooked the end of the lake and one of the main squares giving easy access to the town and the many narrow streets where you could shop, eat or just have a coffee or of course the Aperol Spritz, and watch various street artists.  Breakfast was buffet style offering a good choice of fruit, cereals, cheese, ham, various bread tools, croissants and buns. The hot breakfast was limited in that it was bacon, scrambled or boiled eggs.  Dinner was also very good with a buffet entree with a very excellent choice of salad, fish,…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r223213329", "sub_review": {"Value": 5, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Disappointing", "review": "I have stayed in best western hotels before and have not been disappointed until now! The hotel is in a prime location on the lake with stunning views.  However, the hotel itself was extremely disappointing. The rooms were very basic and definitely not value for money. The buffet breakfast was poor and service none existent, with the staff being very sullen.  I wouldn't book this hotel again although will definitely return to lake garda which was stunning.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r221570442", "sub_review": {"Value": 2, "Location": 5, "Rooms": 1, "Cleanliness": 4, "Service": 2}, "travel_purpose": "", "rating": 2}, {"title": "Stunning location!", "review": "Excellent service in all departments of hotel ......rooms are spacious and have air conditioning....would recommend a room with a lake view...you can enjoy people watching from your balcony.....restaurant has stunning views of lake......boats to explore the lake are a few feet away...", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r220743305", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent location and value", "review": "We arrived at Riva Del Garda late afternoon in May, 2014 without a booking and 'happened' on the Best Western Europa. Due to the wonderful location right on the lake with restaurants and shopping right outside, we thought it would be fully booked. However to our delight, staff were very busy but found they had two rooms available both with lake views and the rate was more than reasonable. Rooms were comfortable and very clean, wifi was available, and the food in the restaurant excellent value.  Our only regret is that we could not stay longer due to our schedule. Would have no hesitation in staying again and recommending to fellow travellers.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r216715975", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Superb accomodation", "review": "Just back from a weeks stay at Europa with Riviera travel. Location of hotel is spot on, we had a room with a lake view which was excellent. Having read reviews before we traveled we were a little concerned, one review said that the waiting staff were surly. This proved to be far from true, all the staff were extremely helpful and very friendly. The food was excellent and there was plenty of it, there was one exception, the \"Gala Dinner\", roast suckling pig was served  but considering that I do not like pork that was my hard luck. Would certainly recommend this hotel and would not hesitate in staying there again.", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r214257370", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "The restaurant is the star attraction", "review": "We chose the BW Europa on the basis of its location  - which is superb, but the star attraction was undoubtedly the restaurant. We travelled with Riviera who appear to have negotiated sole occupancy of the restaurant terrace / conservatory for their clients, the views from which were absolutely stunning and will live in our memory for many years. We have come to expect mediocre food from resort hotels, so we were very pleasantly surprised to find such high standards for both breakfast and evening meals, particularly the antipasti buffet which was always attractively displayed and very tasty. We had a room without lake views, and the room itself was adequate and comfortable, but not very attractive, which was initially disappointing, but the benefits of the rest of the hotel soon…", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r213297153", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "i should not tell you ,but `````````", "review": "just returned from a fabulous trip with Riviera travel staying at this superb hotel. excellent staff and wonderful food in the restaurant overlooking the lake. our room was large clean and comfortable and always plenty hot water in the shower. The atmosphere in the hotel was always most welcoming and relaxing and happy hour in the bar meeting with our fellow travellers was most enjoyable. Definitely the best hotel to pick of the 5 offered for this trip to Lake Garda. First class organisation and trips arranged by Riviera and a special thank you to our guide Antonia for her informative and humourous talks. ( her knowledge is amazing ! ) Found plenty of good local bars in eve with music and good places for eve walks stopping to enjoy a late ice cream or Aperol Spritz !", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r212882058", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "excellent value for money", "review": "Came here with Riviera Travel in May. Why anybody would give this less than a five I don't understand. For the money its excellent value.   Food always very good and plenty of it, rooms very clean and fresh towels every day. Reception staff very helpful e.g with local buses and connecting me to wifi. Waiting staff very good too and the wines were sensibly priced.   The location is stunning and anything you need including a small supermarket is less than five minutes walk away. No need to pay for a lake view as you spend so little time in your room. Riviera clients also seem to get the best seats in the dining room too!   I think one or two of the grumblers are expecting rather too much for the price we paid - would happily stay there again.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r207855083", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great location", "review": "Stayed here on a Riviera holiday and it fitted the bill for our needs.  We hadn't upgraded our room and were glad not to have spent the extra cash when the trip was so full on - lots of trips and time on the coach.....  First time taking an organised holiday  - let us visit lots of different places in a short time frame but much prefer visiting as and when we want and not being herded!", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r192091273", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Stay in garda", "review": "Stayed here late october with riviera travel, the hotel itself is in beautifull position right on the shores of the lake. I was rather dissapointed with the food especially the evening meal (as though the hotel was trying to save money on the food bill) The room we had was at the back of the hotel overlooking the courtyard, i found the bed very  hard. The staff in the hotel were most helpfull.", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r191941892", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 2, "Rooms": 2, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great location and food - family of 5 in Riva del Garda", "review": "We stayed in Hotel Europa in early September 2013. The staff were friendly and helpful, the food as we had heard online was very good - we had big breakfasts out on a terrace overlooking the lake. It was spectacular. The dinner was also great and kids enjoyed all their meals. The rooms were comfortable and clean. The parking was about 50m up the road but convenient and safe. Hotel is very well located.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r187246222", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Definitely would go back", "review": "We were also here with Riviera Travel.  Fantastic location - food was terrific - especially the buffet breakfast.  Could not fault the hotel in any way and the service was excellent.  Had a room with a lake view - was absolutely stunning.", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r185274192", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A disappointing stay", "review": "We came here with riviera travel. The location was excellent, right on the lake but apparently it was their last week before closing for the winter and things had run out. We asked for a baileys, no joy, a Tia Maria, no joy, a jack Daniels, no joy. Many of the wines were also out of stock. Your evening meal had to be chosen the night before, feeling like you were in hospital. The evening meal was 7 -9 pm. We quickly learnt that you had to be there at 7pm if you wanted your first course, which was a buffet, as when it ran out, which it did, it was not replenished. One of our main meals was given back due to very poor quality. We had a room with a lake view which was good except that there was no socket in the bedroom so the kettle had to be plugged into the only socket which was…", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r183463916", "sub_review": {"Value": 1, "Location": 5, "Sleep Quality": 3, "Rooms": 2, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "First stay at Best Western Hotel", "review": "We have recently returned from a week at the Europa Hotel Riva del Garda.  Best Western should be very proud of all their staff at the hotel from the very warm welcome at Reception with requests dealt with very efficiently and cheerfully.  The restaurant and bar staff and the chambermaid who were all very welcoming and helpful.  The whole team were very professional. The location is second to none located on the lake with bars, shops and restaurants all in easy walking distance. The views over the lake are memorable and we would certainly return to this hotel.  Lovely quiet room with no noise.", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r182729455", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lots to like", "review": "This hotel has a wonderful location on the lake with easy access to town highlights. We had a room overlooking the lake which, under normal circumstances would have been lovely. However, after September 15 the ventilation system is off and this makes the room stuffy. When you open the window all the noise from the cafes below comes in and this makes it hard to fall asleep or just have some quiet time. In our room the bed was in dire need of a new mattress but otherwise it was adequate. The staff were friendly and helpful. The big plus at this hotel is the much-better-than-expected dining experience. We thoroughly enjoyed the selections from the menu and the selection of antipasti was incredible. The breakfast buffet was also comprehensive. Just remember that if your back needs…", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r180673355", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 2, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "A lovely, friendly hotel", "review": "Having booked our holiday through Riviera Travel we were very pleased that we selected this hotel. Its situation is almost storybook perfect. We booked a lakeside room which gave lovely views over the square and the lake. The life in the square, with its cafes and clock tower, added to the atmosphere but this could easily be shut out by the effectiveness of the double glazing. The staff were always friendly, helpful and efficient. The room was comfortable and clean. The food was excellent throughout the week. We would happily return to the Europa.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r180064136", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Superb food and excellent staff", "review": "I stayed for a week on half board on a tour with Riviera Travel. Great value and a perfect position overlooking lake Garda.  The food quality and choice was superb for a 4* hotel and the staff particularly in the restaurant were excellent.  Rooms were good and alway clean and well kept.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r179806111", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Very Good Hotel in an Excellent Location", "review": "We stayed at the Europa Hotel with friends in July. We had a most enjoyable week, booked through Riviera Travel. When booking, all the lake view rooms were already booked, we were disappointed but overall it didn't really matter. Our rooms were a nice size with very comfortable beds, air conditioning and a good bathroom with plenty of towels. I do wish tea/coffee facilities were in the room, even if there had been a small charge for this. The breakfasts were very nice and a table in the balcony room looking at the beautiful view of the lake was fantastic. When I think of this image, it really does make me smile, I wish I could have bottled it and brought it home with me. We had a very nice table in the restaurant for evening meals. Most of the dining staff were polite and…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r178493415", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Great Location, Friendly Sevice - Great little 3 Star by the lake", "review": "We stayed here for a week in late August, early September. The location is perfect, right on the central square by the pier in Riva, a charming (albeit far from the most beautiful ) lake Garda town. The room was spacious, clean and perfect for a cheap and cheerful getaway. The only irritation was the fact that the double beds have two single mattresses, a trans continental annoyance! The breakfast was good and the service was exceptional. We also found that prices at the bar were exceptionally competitive (Prosecco at happy hour was 2€ a glass). There are no frills at Hotel Europa but nor do you feel you are in a truly budget hotel. The hotel also has its own sun deck and small pool which can be nice if the beach is busy. A great place to stay, thoroughly pleasant and relaxing,…", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r176408839", "sub_review": {"Value": 5, "Location": 5, "Rooms": 3, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Excellent meals", "review": "We stayed a week on a package deal, and were delighted with the hotel. A fine continental selection at breakfast, with delicious meats, crusty breads, and a wide selection of cereals, fruits, yoghurts etc. A couple of hot things such as scrambled or boiled egg, but don't expect a full English (You really don't need it here). Pleasant staff. Each evening was effectively a 4-course, with a serve-yourself pre-starter from at least a dozen options, followed by the starter and main course served to you, and rounded off with your selection from the desert table. Meal times 19:00-20:30 are perhaps a bit early, especially if you've had a long day out. The town is delightful, but if you want to get to sleep early avoid the front rooms as the noise outside goes on until 11:30 or so most…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r175447528", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Wonderful views!", "review": "This was our third stop of our European tour, we had been to Venice last year but wanted to try another Italian location near the water.  The hotel confirmed by email a few days before that they had reserved a balcony room for us.  The room was fantastic and especially enjoyed our balcony view in the morning and last thing at night.  The hotel location was fantastic, right in the centre but found it a big noisy on Saturday night because the outside entertainment was still continuing after midnight. Other than that we had no issues at all, the breakfast choice was fantastic and plenty of different locations to sit and eat breakfast.  We were amazed at the amount of different seating areas around the hotel, the happy hour was also very enjoyable.  All the hotel staff were very…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r175146830", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely place to stay.", "review": "We have just spent 4 nights at this hotel and leave very early in the morning. Unfortunately we didn't have a room with a view over the lake, however we looked up at the Bastile and I think it may have been quieter on our side of the hotel at night time. The staff were lovely and very helpful, nothing was too much trouble. We needed to leave at 4.30 in the mining and so a wake up call was organised along with some breakfast and a taxi to take us to the bus station for the 5.50 am bus to catch a train at 7.30am at Rovereto. Breakfasts were fine and filling and  it was very enjoyable sitting on the terrace overlooking the lake. Our room and bathroom were quite large and we had a comfortable chair to relax in.", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r174856652", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent Hotel", "review": "Great position, lovely town with many restaurants, shops & tasteful entertainment. Hotel was clean & friendly and food was excellent. Shame the pool was only a plunge pool - a slightly bigger one would have made it perfect.", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r174337290", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Lovely Hotel", "review": "The first time that we stayed at the Europa was in 1989! Like a recent reviewer we also have spent many happy weeks, always in a lake view room - probably out of the 25 years we have visited Riva about 15 or 16 times, and as Hoola13 said \"always at the same Hotel\"  Our paths must have crossed!  We have seen the previous family grow up and now move from the Hotel business.  The new managers are very friendly and nothing is too much trouble for them.  The food is excellent.  There is a help yourself salad/buffet before the starter which is beautifully set out.  The Gala Dinner once a week starts with a sparkly drink and vol au vents in the lounge.  The cook and kitchen staff must work very hard to produce such a wonderful range of food which is on offer each evening.  We booked in…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r172684906", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fantastic Hotel", "review": "I have just returned from my 16th visit to Riva, 13 times at this Hotel!! (twice this year!) I cannot recommend it highly enough, The staff are wonderful, very helpful at all times and nothing is too much trouble for them. The food is excellent with a huge choice for dinner each evening and they hold a weekly \"Gala Dinner\" with live entertainment. The Hotel is spotlessly clean, spacious and bright with a lovely large lounge having open balcony doors overlooking the Piazzas and lakefront below. They have a \"Happy Hour\" between 5-7pm each evening with reduced price drinks, they also have bicycles available for guests to use free of charge. The Europa is in the perfect location and is ideal for less mobile guests too as everything is on the doorstep, also, the buses to the western…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r171947421", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Good location, but overpriced and not 4*", "review": "Spent one night in Best Western Europa in Riva during a weekend. Had limited options since most of the hotels were overbooked and Riva is an expensive place (at least for accommodation) during summer.  The good points: The location is good, and if you are lucky you can probably get a room with some nice lake view. The stuff is quite helpful and friendly and a very positive thing is that their english is quite good. Rooms are also spacious (compared to other options in Riva). The bad points: The hotel is quite old and needs renovation. While this is not necessarily bad, the problem is with the rooms that have no soundproof (we could clearly hear conversations from next room). There are no blinds in the rooms, meaning that you get up very early in the morning by the sun. We had…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r171290358", "sub_review": {"Value": 2, "Location": 5, "Sleep Quality": 2, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Fantastic hotel, great position", "review": "Recently spent a week at this hotel, first week in July 2013 with Riviera Travel. A truly outstanding hotel with great food and I cannot speak highly enough of the staff who were so polite and helpful. Riva is a lovely place to stay and the position of this hotel on the lakeside makes it that much better.", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r168273739", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Would go again", "review": "A brilliant stay. A relatively small hotel  with friendly staff made our week very enjoyable. A lovely old town to explore. The rear door of the hotel opens into the old area virtually next to the lake where the ferries dock. A North Lakes ticket cost 20.5 euro each with a slight reduction with proof of over 65yrs. With this ticket we visited Malcesine, Limone and return. There was a similar reduction at the nearby museum. There is a pleasant walk to nearby Torbole . Free Wifi in the hotel. Plenty of nearby bars and supermarkets.  Our decision to stay here was  influenced by the favourable reviews on tripadvisor, we were not disappointed and would definitely stay here again.  We were travelling with Riviera travel and the four excursions  were most interesting, especially the…", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r167076720", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Location, location, location", "review": "Our first Riviera Travel holiday was a great success. The Europa is easily the best located of the many hotels in beautiful Riva. It is set right on the harbour and adjacent to the market square where there is always something happening. The hotel is surrounded by very good bars, restaurants and shops. We didn't have a lake view room and there was no noise inconvenience but I don't think that would have been a problem in any of the rooms. The bars etc. are very civilised and don't pound out loud music at any time.. The hotel was spotlessly clean and the staff in all areas were first class, particularly in the dining area. They could not have been more helpful and catered for all dietary requirements in a pleasant and efficient manner. Being vegetarian is sometimes a problem…", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r166054006", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely hotel in a prime position", "review": "Recently spent a week at this hotel, and would thoroughly recommend it to anyone. Perfect location right on the lake edge and close to all restaurants, bars etc.Very friendly staff both on reception and in the dining room. Included breakfast and dinner were first class, with the evening meal very varied. Right next to the ferry stops so ideal if you want a trip to other towns around the lake (which we did). Asked for tea and coffee making facility and was provided with 2 cups and a kettle which had to be plugged in a socket in the bathroom. No tea or coffee provided, but quickly solved this at the local shop. Good aircon which could be regulated inside the room (other reviewers said otherwise). All in all a great little hotel. Paid extra for a lake view which we thought well…", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r165676234", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely hotel in a great position", "review": "Just returned from a week at this smashing hotel. Although it's a Best Western hotel it's more like a small family run hotel. The rooms are a little small but that's no problem. The aircon works a treat but you need to ask reception to turn it off at night if it's a bit too cold for you. The hotel itself is very clean and well looked after. And the location on the harbourside is exceptional.   The staff are very helpful and nothings too much trouble for them. My wife had some problems with the hair drier in our room but that was rectified within 5 minutes of reporting it.  We stayed on a half board basis and the breakfast buffet is good. However, the evening meals are even better. They are 4 courses with an antipasta buffet first course which is lovely. Its so good that if you…", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r165224788", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Ford R     'Lovely friendly hotel'", "review": "Recently spent a week here with friends.Everything was excellent food, rooms, service and location. Very much hope to go back soon. Thoroughly enjoyed the 'gala night when there was music. The bar staff were friendly and helpful.", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r164693317", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Ideal location", "review": "Recently returned from an eight day stay at the Europa. We stayed in room 309 which had a covered balcony in the roof section overlooking the harbour at Riva del Garda. We had views of the harbour, the clock tower and the mountains and lake. Room was of a reasonable standard with what I believe were memory foam mattresses and individual duvets on a double bed, which prevented any night time wrestling matches with the wife. Room was equipped with free safe (key obtained from reception on check-in with no deposit required), TV (with only one English channel-BBC World which wasn't a problem for us) and although we took our own travel kettle we were aware of other guests being provided with a kettle on request. Staff were very friendly and helpful. My request for extra coat hangers…", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r163578828", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fab hotel in a super location", "review": "Hubby and I have just returned from a weeks stay at this hotel. We booked this via Inghams holidays.  Its a lovely hotel and very clean. The room we had overlooked the lake and Riva town square which was well worth the extra cost. The staff throughout the hotel were friendly, knowledgable and very helpful. The food at both breakfast and evening meal was superb, well presented and plenty of choice and quantity. Would definately return to this hotel if we were to return to Riva. Can highly recommend. Hotel situated near the boats that transfer you across the lake. We hired a car for four days and the hotel has a very small (free) parking area at rear of hotel. The times we were unable to park here the hotel offered parking at 7 euro's a night in a secure carpark located very close…", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r162185101", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Highly Recommended", "review": "We stayed at Hotel Europa in the 2nd week of May with Riviera Travel, From our experience the hotel can be highly recommended. We found all the staff to be very friendly and helpful. The hotel and room was kept very clean and we found the food to be very good. The hotel is in great location, lovely views from all around and the town of Riva del Garda itself is very pleasant with most places within easy walking distance. The ferry is also close by for great trips on the lake.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r161965983", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fab Little Hotel", "review": "We have just returned from a week in Riva del Garda with Riviera Holidays. We particularly choice this hotel because of it's location and previous good reviews. We were not disappointed on either count. The hotel is beautifully situated in the town square and having taken the advice of previous reviewers we paid extra for a lake view. It is stunning to look over the lake especially as the sun rises up over the mountains in the morning. We found the staff to be extremely friendly and helpful and as this is a small hotel you felt as though they treated you as individuals. The food was plentiful and as well as an extensive buffet breakfast unexpectedly they also had boiled and scrambled eggs and bacon available every morning. For your evening meal you had a choice of three starters…", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r161409339", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good Hotel, Great Location", "review": "This lovely hotel is situated right in the quiet harbour of Riva, surrounded by small and hospitable street bars, and small soveniour shops on the quayside. We stayed at this hotel for 7 nights, and were very pleased with all aspects of the service and accomodation provided. In particular the food (we were on half board) was wonderful, and varied. The staff at this hotel were very friendly and helpful, and go out of their way to make your stay enjoyable. We were located in a room at the top of the building (4th floor) at the side of the hotel facing north, with views towards the mountains. These top rooms seem to have only recently been created under the room, and as such were in brand new condition. Overall, a very good hotel and I have no hesitation in recommending it.", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r159939796", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Beautiful, friendly hotel", "review": "My partner and I stayed here for 7 nights in April 2013 as part of a package from Riviera travel in the UK. The hotel rooms are quite small but that is a small price to pay for the location on the quay side of Lake Garda. The food was plentiful and always beautifully cooked with a different menu choice every night. The breakfast buffet was taken in the conservatory room overlooking the lake and quayside and always had a good selection of foods to suit all appetites. Tea and coffee making facilities are available, but you have to ask for them at reception. All the staff there were extremely friendly and helpful and all spoke English well. I would definitely recommend this hotel to a friend and will go back in the future.", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r159928219", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great location, nice hotel, lovely people", "review": "We thoroughly enjoyed our five-night stay at Hotel Europa.  Everything was sparkling clean and bright, and the staff was warm and welcoming.    The hotel restaurant was very good, with a wide selection of tasty foods at the breakfast buffet.  We especially enjoyed having breakfast on the sunny terrace, overlooking the piazza and the lake.    Although our room was small, our \"double\" bed was two singles pushed together, and there was only one wall outlet for recharging our electronic devices, none of those things mattered to us at all.  The bathroom was spacious, and we were thoroughly comfortable in our accommodations.  In fact, we slept like babies. Our window opened onto the piazza, with a breathtaking view of the lake and the distant mountains.  We'd definitely recommend…", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r159848433", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Super hotel", "review": "We came with Riviera Tours on the first week of their season. We chose this hotel because of its position, being close (overlooking) the lake and near to shops,cafes, bars etc. we have been de lighted by everything here. The Staff have been helpful when needed, and the hotel rooms are well supplied with all you would expect of a good 3 star standard. Our holiday has been on a bed, breakfast and evening meal basis and the food has been perfectly acceptable with sufficient choice for us. We would stay here again and recommend it to others.", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r158375081", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Wonderful location, food and staff", "review": "Stayed here in September with Riviera travel. The location is brilliant, we had booked a room with a lake view but it didn't have a balcony, I think that there are only 2 with balcony. The ferries are right outside across the square, the buses for the west side of the lake stop quite near the hotel, but the buses for the east side of the lake are from the bus station, a good 15 minute walk away, but you're on hols, so what?  Food far exceeded our expectations, with a huge spread for the antipasta and a daily choice from a changing menu for mains. The food could not be faulted and I would recommend anybody to go for the half board option. Breakfasts were very good  The staff were all very helpful and helped to make our stay in Riva very enjoyable", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r151673447", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Holiday in Riva Lake Garda", "review": "Lovely small hotel in Riva Del Garda, Italy.  Rooms are quite small but comfortable.  When we arrived the room we were given was a bit dark and gloomy but as soon as we mentioned the fact to the manager he instantly found us another room without any hesitation.  We stayed half  board and the food was exellent with waiter service.  I was unwell for a couple of days and the staff were most concerned and did every thing possible to help my condition.  The hotel was spotless.  It has a lakeside view and close to shops and bars.  We would certainly stay there again.", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r150387388", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A nice hotel with a wonderful location", "review": "We particulary enjoyed eating in the dining-hall with a splendid view of the harbour and the lake. The evening meals were excellent, and the staff were always friendly and helpful (particularly the ladies in charge of reception). A highly recommendable place!", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r143965735", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A wonderful hotel", "review": "Just returned from Hotel Europa in Riva del Garda where we stayed for seven nights. The hotel certainly deserves its four star rating.  The interior of the hotel is superb and the food extremely good.  The bedroom was spacious as was the bathroom with all needs provided and if you had forgotten to pack any toiletries they were available at reception. The staff were very professional and friendly. I would not hesitate to recommend the Europa to anyone.", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r142480138", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Comfort andTranquility", "review": "The Best Western Hotel Europa is a place to which we return when we have an overwhelming need to \"chill out\". We found the Europa by good fortune over fifteen years ago and have just enjoyed our fourth visit and you don't go back to a place that isn't good. There have, of course, been changes but the overall atmosphere and ambience remains the same. The rooms are OK, clean and comfortable; some are better than others so read the reviews for hints on that. The public rooms are comfortable and casual. We have always found the staff to be helpful and friendly. The food is exceptional for this grade of hotel, we've never had a poor meal here and you're never rushed. Finally the location has to be one of the finest in town with the mountain behind and the lake in front; convenient…", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r141770065", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "", "rating": 5}, {"title": "Have booked again for next year !", "review": "Stayed for six nights late August. Must have one of the best locations and view over the lake across to the Monte Baldo mountains especially from the restaurant with its full-length sliding windows. The staff were very professional ,helpful and friendly. The food was good with plenty of choice for dinner and especially for breakfast. The new owners have plans for further refurbishment and the Manager Marion ensures the smooth running of this Best Western Hotel. We travelled independently and my wife and I have already booked for next year ! Leslie Marsden", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r141404748", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Delightful Hotel", "review": "Stayed in the Europa 9-16th July 2012 as part of a holiday with Riviera Travel. An hour drive from Verona and at the head of Lake Garda.  After reading previous reviews concerning potential noise from the outside bars and eateries, we decided to request a courtyard room. Room 112 was a good size and very clean, with a side view over the lake. We also had a terrace with table and chairs. Apparently the front (lake facing) rooms were not too noisy either and those that stayed in these just shut the double glazed windows.   The hotel is a few metres from the waterfront and only a couple of minutes walk from the town square and shops.   The highlight of the hotel itself was the food. The chef received a standing ovation at the end of the week. You are allocated a table for the week…", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r135042667", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Superb Location", "review": "Superb Location with easy access to transport , bars and night entertainment combined with a clean room and good food.  Staff were friendly and helpful but , given that this was part of Austria until 1927 , in a more Germanic style than one might find further south.  Not so sure about maintenance levels as our patio tiles contained no grouting , we were missing a bath plug and some bathroom electrics needed attention. The lifts were not always functioning as expected and it's never good to see Graffitti in a lift !  Overall a pleasant stay and although the paragraph above might sound awful these are simple things that an efficient Hotelier  can deal with.", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r134500717", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 5, "Rooms": 3, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Very good place", "review": "I stayed 4 days in this hotel and I was very impressed about the placement and cleanness of the entire hotel and room. Is well placed in the old city of Riva del Garda having an amazing view of the lake. I recommend this hotel. The only minus that I have found is that the room are small and can be an inconvenient.", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r134214073", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Good hotel - GREAT food", "review": "Stayed a week in June 2012. Average room size, clean & tidy overlooking lake and bars. Some reviews say noisey but we just shut the double glazed windows and turned on the air con - couldnt even hear the town clock that chimed every quarter until late evening. Small swim pool & sun bathing area on roof a bonus. Rooms with lake view AND balcony are superior to those with just lake view. If you get the option do take half board accommodation because the food is fabulous. Great location, great hotel for a great holiday.", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r133388978", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Everything on your doorstep, plus a good hotel", "review": "Breakfast is upgrade continental.  Evening meal was pretty good, service good and very accommodating if nothing on menu appealed.  Good beds, wonderful bathrooms. Staff are efficient and helpful.  Now, about the lifts, these take a bit of mastering (such fun)but adds to the ambience.Hotel is adjacent to ferry (this stops around 7pm), all the good bars are also adjacent in the square, you can watch world go by. By the way, there are no balconies at this hotel.  Excellent place for the over 50's.  A good bar which also does excellent snacks and some meals, is Cambusa, right in square, next to Hotel Centrale (but no connection to).  You wont get a better service than here if you want to just take your time with a  drink of whatever,  have a snack or something a bit more…", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r133288180", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good Hotel in Great Location", "review": "Stayed in the Hotel for a week in May 2012 as part of a Riviera Touring Holiday. The room was good sized and very clean. It had the benefit of air conditioning and the even greater benefit of being able to open the windows wide open for fresh air. The room window overlooked a courtyard but there was some road noise with windows open so choice to made there at night. Situated in the older part of town right next to the lake with mountain views with several layback cafe/bars on your doorstep, it is hard to think of much better location.  Food at the hotel for breakfast and dinner was fine. The only negative was a rather sullen maitre d who I assumed didn't like coach trips but his staff were brilliant which made up for him. The remainder of hotel staff were fine too. If you are…", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r131662856", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Holiday of a lifetime", "review": "On a recent trip to Lake Garda, Italy My wife and I stopped at the Best Western Europa hotel in Riva. The hotel is immediately adjacent to the lake ( 50 meters away ). The views from a lakeside room are fabulous looking down on the town square, the lake and the mountains in the background. The standard of food ( we stayed half board ) was excellent. A superb selection of both hot and cold dishes for breakfast together with a selectable four course evening meal served byan efficient and humorous staff increased our waistline significantly over the week ! The rooms were of a suitable size with an excellent power shower and a full length bath. The staff on reception were exceptionally helpful. Although the rooftop pool was only just opening due to being early in the season, the…", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r130175352", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent position and food", "review": "Have just returned from 7 days in this lakeside hotel. We did not have a balcony but did have a lake view room - lovely view - but this side of the hotel can be noisy at night from the bars below. We just closed the window when it became too loud. The room was small and there was an absence of hotel information but the terrace restaurant enjoys a magnificent view of the harbour. The evening meals were excellent.", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r129577360", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Clean, friendly hotel in a great location.", "review": "Just spent 8 enjoyable nights at this newly renovated hotel. I found a welcoming staff, an extremely clean room with a new bathroom and a comfy bed. The only annoyance was the lack of reliable internet access.", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r127592288", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "Wish we could go again", "review": "Right in the centre by the lake. Luckily we had a room at the back so didn't have the noise from the front. Lots of bars and cafes at the front, great to be at, but when it is bedtime, nice to be quiet. We had a nice little courtyard we overlooked. Beautiful roof terrace with small pool and lots of chairs to lounge on overlooking the lake and mountains. Food good as well and staff were all friendly and helpful", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r121013671", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A touch of US Best Western in Europe", "review": "This hotel provide a touch of an US based hotel in Italy.  It is a large facility.  Well kept, with relatively large rooms.  The location is good.  The parking garage is in a different building across the main road.  It is a 3 - 5 minutes walk to the garage.  It is located just in the center of the old city.  Near many restaurants and shops.  A great location for day trips in the vicinity.  The breakfast is served in a very nice balcony overlooking the lake.  It is a good best western breakfast.", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r120535218", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great view and location", "review": "Our friends made the reservation and we were surprised to find our hotel on the main square. At first I was disappointed not to have a room overlooking that view, but we were quite tired, and our quiet room on a courtyard was just the thing. As it turned out, there was a DJ at the restaurant next door on the square who was playing awful 70's disco music that evening and we were glad we didn't have to listen to it.   The room was quite satisfactory, although the towels were small and thin. Otherwise, the bed comfortable and very clean. Breakfast was plentiful and varied and the staff were all friendly and attentive. We ate in the restaurant in the evening, overlooking the beautifully lighted piazza. Food was very good, and the atmosphere was great.", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r118898693", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "October in Riva ...", "review": "The hotel is perfectly situated , I managed to park in the internal parking and the staff was extremely polite and helpful....  My room was very small with a nice bathroom . Unfortunately I had no view over the magnificent scenery . Wonderful breakfast in an amazing terrace overlooking the lake. Would love to go back ....", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r118875673", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Wonderful.", "review": "I am amazed at the amount of bad reviews this lovely hotel has had on this site. People saying you are watched at breakfast and you shouldn't stay there if you're English! None of this is true at all. No one watched my boyfriend and I when we had breakfast, and all the staff were friendly and polite.  We stayed for a week recently, and found it to be a very nice place indeed. Our room overlooked the road, but that didn't bother us as we had a balcony, and could also see the mountains and lake. The room was spacious, clean and tidy and welcoming, and the bathroom was great too, with a wonderfuly powerful shower in it.  The staff were all friendly and helpful, and the breakfasts were delicious. I would recommend the hotel as well for its location, as it backs onto a lovely area…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r118418398", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Superb location for a hotel chain...", "review": "After planning various stops throughout Slovenia and Italy, we were concerned that Best Western may be the weak link as we prefer the smaller, more intimate guest houses. However, we were pleasantly surprised with our room which was fairly large. It was obvious the hotel had been 'modernised' so it had a similar feel to a travelodge. The bathroom was slightly retro but perfectly clean.  The best bit.... what a spectacular view! We were very lucky to have one of the front facing rooms - no balcony, but you could open the doors wide to experience the vibrant atmosphere outside. Live entertainment took place but it didn't go on too late and we actually had a fantastic night's sleep as unlike most other places we had stayed in, there was constant air conditioning.", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r116669143", "sub_review": {"Value": 4, "Sleep Quality": 5, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Perfect location and good value", "review": "My mother and I stayed at this hotel for 3 nights in July. We had a room overlooking the harbor/lake with a small balcony, which was very pleasant.  The room was simple but clean and comfortable.  The staff was very helpful and breakfast quite abundant.  We also had a very nice dinner in their lovely restaurant with views of the lake. Perfect location to explore the old part of town and watch people walking. Easy parking in private lot behind the hotel. Bikes for rent, and free wi-fi.", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r116548598", "sub_review": {"Value": 5, "Sleep Quality": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Fabulous location, thin walls!", "review": "The hotel is in a perfect location, right in the main square at Riva overlooking the harbour, rooms are an excellent size, immaculately clean and well furnished.  The hotel 'pool' is more of an adult paddling pool but is located on a nice roof terrace which overlooks Riva. Walls are extremely thin, you can hear the conversations from adjoining rooms, Buffet style breakfast is served until 1030 but the staff do not replenish the food so if you arrive after 9.30 your choice is extremely limited. That being said nothing can detract away from the fantastic location,room size, cleanliness and friendly staff, we would definitely stay here again for those points alone.", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r115957881", "sub_review": {"Value": 5, "Sleep Quality": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice hotel which I would highly recommend.", "review": "I stayed here in June 2011 with my girlfriend and I think this hotel was almost perfect. The location is ideal as it is situated right beside the lake and less than a one minute walk from the streets where all the shops and restaurants are contained.  The rooms are small but they are very clean and comfortable. The staff were very friendly and helpful. The restaurant looks out onto the lake and is really nice although we only ate there for breakfast. Breakfast is a continental style buffet with all the usuals such as croissants, breads, cereals, cakes, tea/coffee, juices.  The swimming pool is located on the roof and is actually tiny. It's more like a big bath. There are about 15-20 deck chairs for sunbathing.   My only real gripe was that there is no gym in the hotel. To be…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r115096861", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "location and balcony", "review": "Our room and bathroom were big enough for a short stay,  clean. Staff was friendly and helpful. There's free parking but the small parking ground right at the hotel is probably most of the time occupied. There's a car park very close by but it's 12 Euros/day :-(  Breakfast is good with many choices. You can have breakfast on the paned patio overviewing the harbour - lovely! There's a small swimming pool on the roof terrace which we didn't use though.  Best thing about our stay at the hotel was the cute little balcony overviewing the harbour! We could sit there in the evenings and watch the (moderate) 'hustle and bustle' around the harbour. There are Cafes, Restaurants directly at the hotel so if you're looking for absolute peace and quiet it's probably not the right choice. But,…", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r114861533", "sub_review": {"Value": 4, "Sleep Quality": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Perfect place for holiday", "review": "In late May 2011 we stayed at the Hotel Europa on Lake Garda as part of a Riviera Travel booking. On arrival we found the staff most courteous and helpful which continued throughout our week’s stay. Our room was located overlooking the lake, harbour and piazza and we found the extra cost (for the view) well worth it. Our room was comfortable and a good standard, plenty of wardrobe space and a safe inside, which cost 1 euro per day if you wanted to make use of it (there’s a 10 euro deposit per week). The bathroom had a bathtub as well as shower (over the bath) and was kept spotless each day by the cleaning staff. Everything worked well and there were the usual complimentary toiletries provided.  Breakfast was informal where guests could choose where to sit and weren’t restricted…", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r112891842", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "The Perfect Place to Stay", "review": "We stayed here for our 30th Wedding Anniversary we booked through Riviera Travel.The Hotel was Lovely and clean throughout, room was adequate, with a good shower, and well lit bathroom, good wardrobe for hanging all your clothes in. We were overlooking the rooftop swimming pool, and the mountains. You can overlook the Lake but for an extra charge.The only downside was the Tv stations we would have liked to have watched a bit of tv after we had been out for our evening meal. There was only a news station, sport station, and we would have liked to have watched a general station. films etc. The staff were very helpfull, and the Lady owner of the hotel was very kind. breakfast although not a cooked, was more than adequate. The dining room was also onto a conservatory overlooking the…", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r109427121", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent value in excellent location on an very beautiful lake", "review": "Nothing inspiring or even that noticeable as an entrance between shops opening up to hotel above but great location on front right by the ferries with restuarants just outside. Has free car park just behind off main road.", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r78535502", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "Excellent service and perfect location", "review": "We, three persons and a dog, arrived July 14 and the temperature was 38 degrees celsius. The day before our arrival we had sent a mail to the reception asking them for a room with a balcony since the dog had a tuff time in the heat. The receptionists (all of them) were the kindest and most serviceminded you could wish for - they had arranged for us a room with a balcony facing the lake/harbour!!! I think the room number was 110. What a relief and joy when we went into the room. That ment our dog could sleep outside, at the balcony. And it also ment we had a wonderful time in the evenings, sipping on a cold white wine and looking at the view. The room itself was clean and was big enough for the 3 of us. I also must mention the breakfast!!! It was a luxury to have your breakfast…", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r73935045", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Perfect Location", "review": "Located on the harbour front the Europa is an ideal place to base a stay on Lake Garda. Malcesine was the preferred location but lack of available rooms meant Riva was the next best option. It turn out to be the right decision - Malcesine is beautiful but with a vehicle Riva was the right place to stay. Rooms are functional but not where you would want to (nor should) spend your time in such a beautiful location. Pool area on the roof is a good areas to view the comings and goings in the harbour but you really shouldn't go to Riva to sunbathe. Get out on the Lake, sit in a bar and watch the world go by, walk through the narrow streets of Malcesine and sit in a restaurant and watch the world go by some more.  The Europa is a perfectly acceptable hotel to stay in - it benefits…", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r73132787", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Pleasant well located hotel", "review": "We spent a very pleasant week in the Europa on B&B basis. The rooms were tidy,comfortable and clean if a little cramped , especially the bath room. The rooms are quite basic with no tea/coffee maker or fridge. Some of us paid over £100 extra for a lake view . The view was of the harbour (not the lake) and was through a small window (no balcony). This option is not worth the high price. The breakfast was quite good with a reasonable chioce. The main disappointment was the lack of healthy bread and fresh (rather than tinned) fruit. One evening we suffered from very loud music from the basement bar. Be warned. There are plenty of plus points too. The Europa is in the middle of town close to the ferries and plenty of excellent resturants such as the Nationale and Leon D'oro. Also…", "date": "October 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r48180879", "sub_review": {"Value": 4, "Location": 5, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Highly recommended for location", "review": "This hotel was well located in front of the ferry jetty at the north end of Lake Garda. We found our std twin bed room just adequate in size, comfortable beds, well equipped bath/shower room and good air cond. The buffet breakfast was good and held in the terrace, overlooking the harbour. Our main complaint was that the air cond was switched off without our permission altho we could open the room window.  Upon our request, the air cond was switched on again. There is one free internet pc/connection in the lounge area. There are many local restaurants nearby. The best were D'oro and at Hotel Sole but fairly expensive. The only Chinese restaurant in Riva was cheap; good portions but about average in taste.  Beware of the Cafe de Paris - cheap, taste ok but....", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r44177284", "sub_review": {"Value": 3, "Location": 5, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "GREAT PLACE TO STAY", "review": "This is our return visit from 8 years ago.  The location is this hotel is practically right across from the docks to catch the ferry to other towns on Lake Garda.  The breakfast is superb.  We had a great time and will return again.  ", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r66172666", "sub_review": {"Value": 4, "Location": 5, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "PLEASE GO BACK TO HALF BOARD", "review": "I have visited Riva for 25 years, usually stay and a certain hotel but thought I'd like a change so booked Europa for myself and friend (she'd never been to Italy before)  We were so impressed by the meals, the courtesey, the room and we decided we'd book again for 2008.  Such was our luck, Europa stopped half board and only do B & B.  It's in a prime position too.  However, in 2008,   having had a not so good stay the hotel I've  used for  years, I intend to go back for B & B at Europa, and eat out at night.    A point my friend and I found the lift system  rather amusing (but then we're English)", "date": "June 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r39074846", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "A very good 3 star hotel", "review": "This 3 star B & B hotel is in an excellent position overlooking the harbour.  Our room was spotless, not the most spacious but perfectly adequate. Twin beds, desk, table and loads of drawers and wardrobe space. No view. Overlooked a small courtyard but suited us as the room was very quiet. The breakfast room overlooks the Lake. Good variety for continental breakfast, ham cheese, fruit, gorgeous bread and rolls etc. All the Staff were helpful and pleasant. Liked best : Approx 50 yards to get a boat across the Lake. Eating places practically next door. Liked least: No mirror above desk. No tea/coffee facility in room.", "date": "June 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r33176982", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great location and very helpful staff.", "review": "Top location by the ferry terminal and very close to the town centre although rather noisy in the evening until about midnight due to proximity of bars and restaurants (but beautifully silent in the morning!).  Staff could not have been more helpful or pleasant.  We got everything we asked for.  We requested and were given rooms with lake view (Euro 20 supplement).  Breakfast terrace has wonderful view and the breakfast buffet is good and very generous.  Rooms are rather small and characterless but clean and modern.  Only 12 car park spaces, although this is better than most of the hotels in the town centre that have none at all.  Arrive late in the evening and they will direct you to an underground public car park (spotless, well lit and secure) on the edge of the town and a 10…", "date": "June 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r32701362", "sub_review": {"Value": 3, "Location": 5, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great location", "review": "Just returned from a lovely holiday in Riva del Garda having stayed at the Europa Hotel for a week (wished it could have been longer).  The hotel breakfast room was a big surprise on our first morning as the view across the lake was spectacular and the selection of food was extremely generous.  Our room was rather small and did not overlook the lake but it was adequate and had plenty of storage space, a good size bathroom and very clean.  The roof terrace and pool was an added bonus, very quiet and a good place to read when not taking in the lake view.  We could not have planned a better location.  It was convenient for the lake steamers, the restaurants, the old town and shops.  It was just great to step out into what seemed like a postcard picture every morning.", "date": "August 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r19503400", "sub_review": {"Value": 4, "Location": 5, "Check in / front desk": 5, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "OK hotel, shame about the door", "review": "Riva is lovely and we booked for early May to ensure it wouldn't be too hot, and the weather was perfect.  We had paid extra for a room overlooking the lake - however, the night we arrived we noticed that out room door didn't lock.  This was reported to Paulo the night manager immediately.  He was very laid back about the whole thing, assuring us that our possessions would be safe,  and promised to have it dealt with, but the day we left it STILL hadn't been seen to.  So if you are allocated Room 207, check to see if it's been sorted yet! Another reason we had booked the Europa was for the swimming pool on the roof but when we enquired about it, it wasn't going to be opened \"until next week\".  I wonder how many guests over the weeks had been told \"next week\". Apart from that,…", "date": "May 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r17071911", "sub_review": {"Value": 3, "Location": 5, "Check in / front desk": 5, "Rooms": 3, "Cleanliness": 4, "Service": 4, "Business service (e.g., internet access)": 4}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Trying to change the rate at check out", "review": "What a shame. Perfectly OK stay for three days and then, at check out, the front desk guy tries to increase the room rates despite the hotel's reservation confirmation clearly stating the rate quoted by them when the reservation was made a couple of months before...There had been a \"mistake\". What a terrible tactic for a hotel management to try. He persists, stating that it is in case we come back to stay again. He doesn't realise that trying to hike the price when the bill is being settled is a sure guarantee against ever wanting to stay there again. Terrible attitude to customer service.", "date": "October 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r10068288", "sub_review": {"Value": 2, "Location": 2, "Check in / front desk": 1, "Rooms": 2, "Cleanliness": 2, "Service": 1, "Business service (e.g., internet access)": 2}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "great location", "review": "We visited the best western europa in september of this year.First impressions were that it was ideally located on the side of the river, with an excellant view across the town square. We had paid extra for a room with a lakeside view and although the rooms were very simply decorated (not at all as shown on the website) the view was gorgeous. The downside to our front facing room was the noise late at night from the bars and early in the morning from the shops and restaurants setting up. Food in the hotel comprised of a continental breakfast, well stocked with cereal, freshfruit, cheeses and meats and a four course evening meal with an excellant and interesting selection of meats, pastas and desserts. Being vegetarian i initially found nothing i could eat on the menu, one word…", "date": "September 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r10058200", "sub_review": {"Value": 4, "Location": 5, "Check in / front desk": 4, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nothing special...", "review": "Past reviewers of this hotel have given a strangely flattering but inaccurate picture of this mediocre establishment. My wife and I have just spent an enjoyable week here but would not consider it up to the standards of many other hotels in the area in this tariff range. Yes, it has a lakeside position…but not a ‘great’one. Its lakeside entrance door is situated next to a rather tacky little bar, which can get quite noisy in the evenings. Unless you are using the ferries daily I see no pleasure in being situated adjacent to the main ferry terminal with all the activity around the booking booths and coach drop-offs.  To compare it to a ‘four-star’ is stretching the imagination a little too far. It is just one of those typical bland, terraced establishments which have been tarted…", "date": "September 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r10020112", "sub_review": {"Value": 3, "Location": 3, "Check in / front desk": 2, "Rooms": 2, "Cleanliness": 3, "Service": 3, "Business service (e.g., internet access)": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Wonderful hotel", "review": "Super holiday. Food excellent and lovely ambience in hotel restaurant overlooking the lake. We had a spacious and immaculate room with a mountain view. Great, central location, just step out of the hotel and you are in the hub of things. We would return. ", "date": "August 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r8514572", "sub_review": {"Value": 4, "Location": 5, "Check in / front desk": 5, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A nice friendly hotel in a beautiful location.", "review": "Lake Garda in August is beautiful and very busy. It was a  struggle to find a reasonably priced hotel close to the centre of Riva del Garda but the Best Western Europa fit the bill.  We arrived very late on a Sunday night and our first experience was of the friendly night porter moving his own car to give us a parking space right in front of the door. This set the tone of the hotel very well.  The staff were helpful and friendly. The room was a little small but clean and well designed with enough space for everything. It would have been nice to get a view overlooking the lake but it didn't really matter.  I would have no hesitation recommending it to anyone. ", "date": "August 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r8494201", "sub_review": {"Value": 4, "Location": 5, "Check in / front desk": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "The Best for everything", "review": "Over the years I've stayed at many hotels in Riva area, all of them good but the Europa is the very best.  Very clean, rooms excellent, staff very helpful and the food very, very good (need a 2 mile walk after dinner!) The lift arrangement gives the brain cells an airing but that's all part of the fun.  This hotel is a 3 star and should be rated a 4 star plus. ", "date": "June 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r8315697", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely Hotel", "review": "Had a wonderful time at this lovely hotel. The room was very clean and comfortable with excellent facilities.  The food very enjoyable and plentiful.  The staff were very friendly and extremely helpful. We managed to get a lake facing room and were not charged extra for it.  I would definitely have gone back again but understand that next year they will only be doing bed and breakfast .  This is a great pity as the whole dining experience was very enjoyable.  We were allocated a table for the whole of the stay and managed to get to know several guests.  I feel that I would miss this if I had to find a different place to eat each night.  If this is true I will reluctantly have to find another hotel.  Excellent location and views.  All in all we had a superb holiday and feel very…", "date": "June 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r8052024", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Great hotel, great position in town", "review": "This wasn't our first choice but they were already full however, as things turned out I was delighted we ended up here - it was a great hotel - right beside the lake in the main old town square.  The room was modern, simple and very clean with a good bathroom and excellent aircon.  Our room overlooked the lake and I was worried we may suffer from a lot of noise from the bars/restaurants below but the triple/quadruple? glazing on the windows meant we didn't hear a thing.  Breakfast was buffet and standard European and all the staff were very pleasant.    There is a small car park if you you take a cheap Ryanair flight and drive (the return Ryanair flight from Bergamo was another story and I would never ever ever travel through Liverpool airport again - but thats another story). ", "date": "June 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r8030509", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Magnificent", "review": "This was our 5th visit to Riva del Garda and our 2nd stay at the Europa. It is the best hotel we have stayed at in Riva with excellent and clean accommodation, excellent regional food on the menu and really friendly and professional staff. We have recommended this hotel to our friends and would ask others to give it a try ", "date": "June 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r8000268", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "good location", "review": "The location of the hotel is very convenient, with free parking.  The rooms are on the small side. It would have been nice to look out on the waterfront. It was clean and quiet.  Very good breakfast. ", "date": "May 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r7848049", "sub_review": {"Value": 3, "Location": 4, "Check in / front desk": 3, "Rooms": 3, "Cleanliness": 4, "Service": 3, "Business service (e.g., internet access)": 3}, "travel_purpose": "", "rating": 3}, {"title": "Brilliant Location", "review": "Perfect location, alongside ferry quay and square with cafes. Quiet, with other resorts easily reached by bus or ferry.First class restaurant with a wonderful panoramic view, excellent service, good food especially 5 course gala night on Sunday eve. Our 2nd floor room was very spacious, spotlessly clean, air-conditioned and accessed by 2 pristine lifts, plus another lift down to front of hotel. Ideal for wheelchair users. Roof-top sunbathing area and pool clean, small but adequate, with shower and toilet. Highly recommended all round. ", "date": "May 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r7729589", "sub_review": {"Value": 4, "Location": 5, "Check in / front desk": 4, "Rooms": 5, "Cleanliness": 5, "Service": 4, "Business service (e.g., internet access)": 3}, "travel_purpose": "", "rating": 5}, {"title": "not great, just ok", "review": "Ok, very well positioned with a nice view,if you get a room with a view. In fact, I was in a single room with just the basic and no lake view, but my parentswere in a nice and larger room with a beautiful lake view. The breakfast is at this huge balcony with a great view of the lake, protected from the wind and the rain. Breakfast is just ok, nothing else. Coffee did seem to have been heated several times, tasted like old. This hotel has a serious parking problem. It´s free,  but there is no place for all the guests and it´s hard to park on the street. In general, this hotel is not great but it´s ok. ", "date": "November 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r7636407", "sub_review": {"Value": 3, "Location": 5, "Check in / front desk": 3, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Wonderful place!", "review": "This hotel is extremely well located with a secure car park and very comfortable accommodation.  The staff are friendly and helpful and the food is very good, with an excellent table d'hote fixed price dinner menu and good buffet breakfast.  The restaurant is partly in a covered (and enclosed for cooler days) balcony area overlooking the main, pretty piazza of Riva del Garda.  From reception there are internal steps (or lift) to a door leading directly onto the piazza which surrounds the pretty harbour from where the lake ferries go to Malcesine, Limone etc.  There are plenty of restaurants within a short walk (2 - 10 minutes) to choose from and, for a special meal, can particularly recommend l'Osteria de l'Anzolim tucked into a corner of the square behind the harbourside…", "date": "October 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r5972862", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 4, "Rooms": 4, "Cleanliness": 3, "Service": 3, "Business service (e.g., internet access)": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Stunning Views, charmless staff", "review": "The Hotel Europa scores on three counts — location, location and location. Set opposite the town harbour it enjoys spectacular views across the café lined piazza and clock tower, out towards the sparkling lake and mountains beyond. If, like us, you are lucky enough to get one of the few front rooms with a balcony, this is wonderful. You can throw open the French windows and drink in the atmosphere. However I suspect life isn’t so rosy if you are assigned one of the back rooms. A fellow guest told us that she had a view of a brick wall.   The hotel itself is pleasant enough in a bland 80s sort of way, though nowhere near as elegant and luxurious as its brochure would suggest. There’s a spacious lounge, a rooftop sundeck with a small plunge pool and steam room (the latter carrying…", "date": "August 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r5771033", "sub_review": {"Value": 4, "Location": 5, "Check in / front desk": 3, "Rooms": 3, "Cleanliness": 3, "Service": 2, "Business service (e.g., internet access)": 3}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Excellent location", "review": "Location was brilliant- views from rooms were great.It was really interesting to people watch etc. Staff were mostly really friendly and helpful- particularly in the restaurant but one of the receptionist wasn't helpful (the other was great). The food was great- breakfast and evening meal- and the conservatory dining room was really attractive, Hotel was clean and well organised. Room service was a little haphazard. Even when it said room service when you asked for it they said they couldn't do it as not enough people on duty!! Swimming pool was very small. ", "date": "July 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r5619997", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Not a 4 star", "review": "Spent a week at Riva Del Garda srayed at Best western Europa was not impressed with the Hotel or the staff very basic,would go to Lake Garda again but not the Europa Hotel ", "date": "July 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r5613517", "sub_review": {}, "travel_purpose": "", "rating": 2}, {"title": "No more than average", "review": "Spend a long weekend end of march. Rooms very italian, basic style and not too welcoming. Breakfast just average with neither great chocie nor quality. Staff reasonably friendly. Not many parking spaces available. On the plus side: great location, lovely terrace with lake view for breakfast and nice harbourside front. Not a real dael at € 95. ", "date": "April 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r5026838", "sub_review": {"Value": 2, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "", "rating": 3}, {"title": "Simply Magic", "review": "Have just returned from a superb week at the Europa Hotel - a 3 star plus right on the harbour. The hotel is superb bar none and has a view to die for! You are right in the centre of Riva, and the terrace restaurant has views across Riva over a 5 star meal!! The restaurant is superb - we had 7 gourmet Italian meals, the staff were so professional, and the whole feel was more 5 star than 3! The double glazing in the hotel made sure that even with a lake view room once we closed the window we heard nothing ----- amazing. It really is a beautiful hotel, and even people at the 4 star Sole had been looking at it. It is part if the Best Western chain, the owner lives in the hotel .... we could go on and on and on ..... we have been to Riva many times and can not recommend anything…", "date": "August 2005", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d203229-r3892389", "sub_review": {"Value": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}]