[{"title": "Wonderful setting, hard if you're on your own", "review": "As per the other reviews, Shanti Som has an amazing location in the hills of Andalusia, the facility is beautiful and very well put together, the yoga and personal trainer classes are amazing, and the pool was glorious for November. The staff are very friendly and helpful. I came as a solo traveller and after reading the advertising about the shared table for solo travellers in the dining area and the info about most of the visitors being solo travellers. Upon arrival, I found I was the only solo traveller, alongside one couple and a group retreat of about 12-14 people who had come as solo travellers to join one of the centre's week long programmes. In the dining area, I was seated a table by myself during my three night stay whilst the people on the structured retreat shared a table and fun conversation each mealtime on a long table next to me. It was a lonely experience and one evening they invited me to join them, but the following evening they were busy in a party so I sat and ate by myself whilst the people on the next table played games and had a great time. On checking out, I was told by several of the staff that there were 'normally' other solo travellers but not the week I was there.  It would perhaps have been tactful of the staff to ask me if I was happy to eat alone whilst watching a group of other visitors socialise together, after all, we were all individuals who came for the same reasons. The food although tasty give me a bad stomach one evening, and the couple had a bad experience with some raw chicken which left them sleepless and unhappy for most of their stay. I had one joint yoga class with the female and gave her a hug as she cried into my arms at how unwell she felt. That said, the staff are lovely and go out of their way to speak with you personally. So a mixed bag. I think this would be a wonderful place to come with a friend or family member but not alone.…", "date": "November 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r724654057", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "4th visit and still wonderful", "review": "Dear Katya, thank you so much for publishing your impressions about Shanti Som on TriAdvisor. We are sad to read that we did not manager to live up to your expectations during your stay. It is true that we only have 3 to 4 groups per year here and during the rest of the year, aprox 11 months, our clients are to 85% single travellers. We have taken good not of your suggestion to ask the clients that are not part of the group if they were happy to eat alone. As a matter of fact we are thinking of not taking any more travellers that are not part of the group during a groups stay. I fully understand your point there.   Please do accept our apologies and we hope that you did not leave Shanti Som with only bad feelings as we normally are proud that our clients usually truly enjoy it here and would like to come back.   Warm regards", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r718158456", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Little paradise ", "review": "Just back from a yoga retreat at Shantisom. I love this place - so serene and the staff are so helpful and warm. Food is outstanding even if you are on the slimming retreat. Healthy and tasty. Had a Thai massage with Paloma she is a legend. Will be back soon.", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r707535902", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Retreat and renew", "review": "Thank you for this very nice review Kai!!! You know we love having you here and I am so happy that you and the girls enjoyed it!!! Come back very soooooon. Hugs from all of us at Shanti Som!", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r706367028", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Wellbeing retreat if you like getting up at 7am everyday", "review": "If you need to take some time for yourself, treat yourself and load some energy you are at the right place! The rooms are nicely done, very clean and comfortable. The staff is really welcoming and caring, you feel like at home. The yoga teachers are Amazing and the spa treatments absolutely great!  I felt like reborn after my stay.", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r703804448", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Confused!", "review": "Having felt the need for a short break and some pampering we looked up on line and found this lovely retreat.  As we live, for part of the year in Marbella, we thought we would just pop along and have a look - 20 mins by car.  We were not disappointed it was a real retreat and very zen.  Before visiting we checked the prices through Booking.com and found that for the day/night we wanted including an evening meal the price was E330.  We enquired about availability and was told at reception that it was available whereby we were just on the verge of booking thinking that it maybe cheaper to book directly with the provider!  We couldn’t have been more surprised when we were told it was normally E339 but there was a supplement for the summer months whereby the receptionist brought…", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r686026778", "sub_review": {}, "travel_purpose": "", "rating": 2}, {"title": "Wow!", "review": "Thank you for placing your opinion on Tripadvisor! Of course we are very worried about your problem and I have addressed this to the team. I cannot see your name on Tripadvisor and therefore could not check your bill. Perhaps you could send us an e-mail to reception@shantisom.com and I will have a further look into the matter.  I do apologise for not for not having reached our goal \" To make every client have an amazing stay\" in your case.  Warm regards", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r683162378", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Pure Heaven", "review": "I travelled to Spain for a few days on my own for some R & R.  I didn't stay at the retreat but went for a treatment and some lunch.  This place is out of this world and such a clean and beautiful environment, the healing garden is especially beautiful and the smell from the flowers is amazing, I could have just sat all day.  I had the harmonium treatment which I hadn't had (or heard of) before but it was so uplifting and at times emotional as it ties in a reiki style treatment with meditation.  I felt so much better after it.  The staff are lovely and the food in the restaurant is gorgeous.  Would highly recommend and I will try and stay here soon.", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r677117260", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Zen", "review": "Thank you so much for your nice opinion placed about us. We hope it will not be too ling until we can also welcome you here again to stay for a few days. Warm regards", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r666247631", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Very relaxing trip", "review": "A truly unique & beautiful experience with amazing attention to detail. The well kept gardens and views are stunning as is the hotel itself. The food was delicious. My husband & I really looked forward to our yummy breakfasts each morning. All the staff are wonderful and I can't praise them enough!!!! I would highly recommend this piece of paradise to anyone & everyone! Thank you so much for a perfect stay. We look forward to returning. Well done the Shanti Som team you are all FABULOUS!!!!", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r657288456", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Perfect", "review": "Spent 5 days here but wish it had been more. Travelled alone for first time in years and it's the perfect destination to go to. Staff professional & kind. Facilities great, food delicious. I booked 5 day yoga retreat, but when I go again I would opt to choose my own bespoke programme. I like to be active so I booked extra hiking & circuit training. Even swam in outdoor pool.Had a few massages too there's a long list of treatments to have, but I would recommend booking before you go. Yanna in restaurant is wonderful, so are Rosalee and the uni interns in the gym. Javier's massages have to be experienced to be believed! There were mainly solo travellers but also couples/friends and families travelling together. I would not hesitate to return by myself or with my husband. Food is…", "date": "February 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r656266072", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "A wonderful, peaceful haven", "review": "We would like to thank you so much for this very nice review indeed. It makes everybody happy to read that we reached our goal which is to completely satisfy the clients and even go beyond. Hopefully it will not be too long until we can welcome you here again!!! A big hug from all of us here at Shanti Som", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r635989145", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Tranquil Haven", "review": "I visited Shantisom a couple of weeks ago with one of my sisters.  This is the second time we have visited and I’m quite sure we will return!  This is a very well managed place with superb staff, wonderful food, fantastic yoga and a lovely atmosphere.  I was interested to see that many of the staff were still there after my last trip which I think indicates that this is a well run place with happy staff.    I enjoy the fact that it is small and cosy and I enjoyed meeting the other people who were staying at the same time.   The weather was very disappointing during this visit, so sadly there was no swimming or sitting in the sunshine to be done.  However, a lovely fire was lit in the reception area and we had a very restful time reading and chatting.    Well done to all the…", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r626680735", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Great place", "review": "Dear Victoria;  As always it was wonderful having you and your sister with us and we hope that we can welcome you back very soon and hopefully this time with better weather. Thank you so much for your kind words it is very appreciated.   Warmest Regards, Shanti Som Team", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r626599919", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Rest and relaxation.", "review": "I have recently returned from my fourth visit to this heavenly spot!  Nothing, happily,  has changed over the years - the staff remain the same and I was greeted like an old friend by all. The rooms are very comfortable and the food is delicious but for me its the personal input that makes all the difference. Everyone seems to remember you and your requests; the reception staff are all delightful, both yoga teachers are superb -( excellent whether you are a complete beginner or seriously flexible)  the masseurs are exceptional and Pilates with both Xavier and Rosali are both challenging and fun. I have stayed both with a friend and the last few visits, solo and it is one of the very few places where anyone would feel totally at ease being on their own. It is a very safe,…", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r624691135", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Simply Wonderful ", "review": "My wife makes me join her at a health retreat, for one week once a year. The aim is to relax, eat well, detox and exercise. For the past five years we have been to Juicy Oasis in Portugal, which is amazing - but pure juice for 7 days and a little intense with a purist focus. This year I asked for something different - equally as nice in quality but where I could also eat and have a glass of wine in the evening. They also focus on Pilates which I wanted to try to correct a poor posture caused by flying every week on business.  It’s been amazing. The location is peaceful, surrounded my mountains. The resort is like a little piece of Bali in Spain and is incredibly relaxing. The team here are wonderful and nothing is to much trouble. The food is fantastic and plenty of it -…", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r622082284", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "And breathe ", "review": " My dear C & H, Thank you very much for taking your time to give us this amazing feed-back. It was a pleasure having you with us and we hope you come back soon. Your words give us powerful to work harder and give our guests the best services. It´s worth the effort if we can read your beautiful words. Have a nice day. Big big hugs!! Shanti-Som Team", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r620969981", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Great escape!", "review": "Just back from a yoga retreat at Shanti Som and can’t recommend it highly enough. Beautiful accommodation and location.   The team are the most friendly, helpful and efficient I’ve come across but most of all they care deeply about the guest experience.   Natalie the yoga teacher was outstanding- very knowledgeable and willing to share her experience and just a very good soul I think! There is also a comprehensive range of spa treatments including some unusual holistic treatments worth trying. Lesley’s foot healing was a revelation.   Excellent food and service from the restaurant team. Very healthy options that all taste completely delicious- and a bar for those who want to indulge.   One of the most compelling aspects is that you can go for just a day or as long as you want…", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r618954845", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Peaceful and restorative", "review": "Midst of glorious countryside, & exquisite gardens, a haven of well-being. We were warmly welcomed, followed by orientation and explanation of how our week would progress. We had a fabulous room  \"Peace\" which is well worth asking for when you book; sunny terraces and private space.  We opted for a detox programme, it's rather brutal if you see the other guests food but having listened to the lovely Director's advice, \"arrive on time and miss any temptation!\" The first and last nights hot salads are delicious. Midway, the daily juicing sounds a nightmare yet isn't. I could and wanted to go to the gym every afternoon for a light work out so I didn't go into slow-down too much although you are encouraged not to do too much on this program.  Felt more fantastic by the day. Flat…", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r616412567", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Amazing place!", "review": "My dear Adrienne and Michael!!! Thank you so much for giving us this great feed-back. It was a really pleasure having you in our Shanti-Som. We were laughing with you and Michael. For all our team, it´s a treasure to receive guests like you, so polite, funny and friendly. Working like that is easy!!! Maybe next time you could enjoy another retreat and then try our amazing food.  We hope see you very soon. Have a lovely day...and life!!! :) Big big hugs, Shanti-Som Team  ", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r615730561", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Lovely relaxing stay", "review": "Really lovely hotel . Rooms are really stylish ,with a really confortable bed . Food is fantastic , I was on the weight loss programme , but the food was different , tasty and I lost 3kg in a week , how great is that ! The treatments are good , it's a small spa though , great fitness trainers especially Havon  Pilats teacher who  Is very good , and very funny but works you hard , the yoga teachers are kind and supportive , rosa lee the other Pilates teacher is calmer and does a great stretch class . The hotel is small ( which I loved ) so quiet and calm , so if you want lots of activities all the time this isn't the place for you . But if you looking for a nice calm peaceful resort that is great for the solo traveller ( met some great people ) then look no Futher , it's really…", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r612084248", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Fabulous retreat in southern Spain", "review": "Thank you so much Davina! We loved having you with us and the whole team hopes that it will not be long until we can welcome you again here. You were a great guest!!!! Warm regards from all of us here at \"Your\" Shanti Som", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r611516451", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Sisters together ", "review": "Only 20 minutes from Marbella and you could be anywhere in the world. Very beautiful resort but super expensive. Treatments were very good and I was looked after incredibly well. Recommended highly for a solo traveller.", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r604558437", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Lovely place to relax and enjoy yoga classes", "review": "Thank you so much for this nice review! We are happy that you enjoyed it and that you received the care you were looking for. Warm regards - The Team of Shanti Som", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r596055672", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Perfect Choice", "review": "This was our second visit to this beautiful, tranquil retreat. From the minute we arrived it felt like home. Christina and her team do an exceptional job of making your stay individual and relaxing. We will definitely be back. ", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r589700108", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Haven of tranquility.", "review": "You feel like a friend within minutes. The staff are so helpful and friendly. The gardens are wonderful and the perfume of flowers pervades the air. All around are hills and it is difficult to believe you are 30 minutes or so from Malaga airport and short distance to Marbella. You are encouraged to put away your WiFi devices and eat wholesome food. Alcohol is available if you must! We did and pricey! Yoga studio and outdoor shala and gym. Great spa. Candle lit by night creates ambience. Bedrooms have large terrace and huge sofa beds. Just perfect. Plan to return.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r589397535", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Your well-being is taken personally", "review": "Thank you for your kind words Elaine. Please come back soon to \"Your\" Shanti Som. Hugs from all of us here", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r576129919", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Reenergizing experience", "review": "I felt really welcome and taken care of from the first day with every member of the staff addressing me by name and knowing the details of my booking, sport programme, food preferences...  Rosalie, the pilates trainer perfectly adapted the training to my needs and capability, always finding the right level of challenge and encouragement. The yoga and meditation classes by Nathalie were inspiring and she managed very well the participants’ different experience and fitness levels.  I felt really re-energized after just a few days enjoying the quiet, relaxing atmosphere, professional treatments and great food - I look forward to coming back! The only small drawback was that the rooms are not too soundproof, so that the talk, nightlife and bathroom noise of the neighbours would…", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r571600580", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Spectacular retreat in very natural surroundings", "review": "Dear sabine, thank you very much for this very nice review. We are so pleased that you had a nice stay with us and that you were able to leave re-energized. I have given your comments to Rosalie and Nathalie too. They were very happy because comments like that are the best motivation. I am sorry about the noise in the rooms and wish I could do something about it.   Hopefully you will be able to come back soon to \"Your\" Sahnti Som family. warm regards Christine", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r556662928", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "A truly wonderful and magical slice of heaven!", "review": "Shanti Som is a great place to disconnect from city life and get a great reenergizing experience. I was at Shanti Som for 1 week and felt really fresh after it. Several special good things to mention: 1. Team is outstanding - administrators, restaurant personnel, nutritionist, yoga and fitness trainers. Thank you Shanti Som team - you make the experience truly rewarding! 2. Totally quiet place - I don't remember where I felt being in such absolute silence last time in my life. 3. Cousine - even at weight loss retreat the food is very tasty and you don't feel hungry at all (w/o compromizing on results - i lost >3 kg in 1 week) 4. Sauna and steam room are very good too  Recommend to do as much hikes as you have stamina for - mountains around are very picturesque, it's very…", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r556322308", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Get away from it all", "review": "A great way to really get away from it all! Set in a nature reserve completely hidden from sight, a wonderful place to truly relax. Super comfy lounge with open fire and WiFi. Ensuite rooms good. Beautifully prepared and presented meals focusing on fresh, healthy ingredients. Limited choice on set menu. Huge portions! Fitness classes expensive and only. 2 yoga classes listed per day. One studio which doesn’t fit many clients so at busy times it might be on a first come, first served basis. Gym room unlocked at 11am but unsupervised, so unless you book a personal training session, again over priced, or you absolutely know what you’re doing, you can’t really use the gym.Massage treatments very expensive too but the ones I received were very good. Having been assured by the…", "date": "December 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r550047055", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Heavenly place to relax and be very well taken care of", "review": "Shanti Som is one of my favorite places to stay in the whole world. The staff is so friendly that you feel like family, yet everybody is extremely professional and kind. The food is amazing, the spa treatments are excellent and the place is just a feast for the eyes and the soul. Don’t miss out on the yoga classes with Nathalie. It is a wonderful place to relax, unwind, destress, and be very well taken care of, especially if you travel on your own. No need for makeup and fancy dresses, it’s a place where you can come as you are and feel comfortable. Just bring a good book to read by the fireplace. You’ll feel loved and welcome at Shanti Som!", "date": "November 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r550028835", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Unique Retreat in Marbella", "review": "Lovely hotel in the country side with a great therapist team. Spending few days in this beautiful and quite paradaise will give us back the calm and energy we all need. Specially would recommend this Retreat to bussy people looking for some peaceful days. ", "date": "December 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r547152773", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Weight loss in paradise", "review": "I went with my elderly parents. My mother and I did the turbo weight loss weekend and my father was normal full board. The place is beautifully designed with 14 bedrooms. The staff all extremely friendly and helpful. The yoga instructors were very professional and friendly and the personal trainers extremely motivating but also very aware of not over pushing!! I managed to loose 4 lbs on a long weekend so will definitely be going back. Many other guests were there for the wellness retreat and repeat customers which says a lot about the place. Thank you to everyone, hope to see you soon.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r533126310", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Ommm shanti", "review": "Thank you so much for your beautiful opinion placed on TripAdvisor!! It was a real pleasure meeting you and your parents here at the Shanti Som and well done for the 4lbs loss! We are very much looking forward to having you soon with us again!!!!", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r532174978", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "“I have the simplest tastes. I am always satisfied with the best.\" Oscar Wilde", "review": "Most important: Detox program, I lost 7 kilos in 2 weeks, not hungry, great tasteful juices except the Aloe Vera one ;but it was the healthiest ! maybe as advice shake it or combine it with watermelon juice.  Second advice, the lemon every morning, present it  already in a pressed juice form, less hanky panky to press it yourself in the room or organise a pyjama breakfast :-) Great, friendly, also :-) handsome staff, beautiful hikings in the neighborhood, Lodging like in an Abbey, sereen and quiet , great & healthy menu iff you want to cheat  :-) AND fantastic shopping ( with your smaller sizes at the end of your cure ) in Puerto Banus Marina - 20 min taxidrive from hotel. Thanks to the whole staff. Big hug", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r525998354", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Peaceful, amazing staff and great food", "review": "Thank you for taking the time to put a indeed very nice opinion on Tripadvisor!!! Come back soon. A warm hug from all of us here at Shanti Som!!!", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r525977758", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "A peaceful hideaway", "review": "I rarely leave a hotel after 6 days without even one complaint. The staff is friendly, kind and attentive, the environment is wonderful. The hotel is clean and caters to all wishes. The spa is amazing, they give great massages with a wide range of choices. The only improvement (really the only one) is the Wifi system, it's not working very well.", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r524786253", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Absolute Bliss, peace and quietness ....", "review": "We are so glad you enjoyed your stay with us as this is our goal!!! Every customer should leave with such a good impression. We hope to see you again in the not too distant future!! Warm regards", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r524436368", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Amazing", "review": "Shanti Som is a peaceful gem hidden in the mountains 40 minutes from Malaga airport. A small retreat where the staff know your name from day 1. For the most part it is quiet and relaxing with several spots to hide away and relax.  The rooms are boutique luxury with a fantastic bathroom and rituals bath products. The rooms are set around the edges of the property, one side has a mountain view and a balcony, the other has a patio with equally impressive views, but all rooms are wonderful.  According to all guests, the restaurant food is excellent (although I did the detox so had limited experience of it) and the spa treatments are as good as I've had anywhere in the world (if very expensive).  For the price of the stay, there were a few consistent niggles from guests. The wifi was…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r519330755", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Relaxing yoga retreat! ", "review": "This was my first trip away on my own - it was perfect for that purpose! Very relaxing resort, loved the yoga teachers and all the staff. The yoga pavilion is amazing and it definitely enhanced the whole experience.   When you book onto a retreat the meals are included and you get to choose from two options - it was great the first day or two and then I wasn't as keen by the end of it. Overall the buildings and surroundings were aesthetically very pleasing but I wasn't so sure of the purple bedding/cushions and curtains in my room - slightly old fashioned and I think they need to look at the sound proofing in both the spa area and between rooms. Saying this, I would still highly recommend and would love to go back some day! ", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r508843801", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Prefect to relax and unwind", "review": "Thank you for your beautiful words. We do hope that you will be making it our way again in the not too distant future. Warm regards from all of us!", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r498285231", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "What a little gem! ", "review": "Just back from a 4 night stay and cannot recommend highly enough. Every single member of staff went out of their way to make it a special trip. With only 14 rooms it never felt busy or crowded and nothing ever felt an effort to the great team there. I stayed in a twin room with my mother and whilst the room wasn't huge it had everything we needed and the garden with 2 chairs and 2 loungers was a welcome 'extension'.  My mum has dietary restrictions (vegetarian coeliac diabetic) but there was choice every day and if she didn't fancy what was on the menu they were happy to offer her something different. The food was delicious and the service great.  The spa is lovely with therapists happy to advise on treatments and no hard sell on the products used which you can sometimes get. I…", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r498145702", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Very enjoyable stay.", "review": "Thank you ever so much for the great review! We appreciate it a lot and it really does motivate the team to continue their good work. We look forward to having you back really soon!!! Warm regards from all of us here at Shanti Som", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r497250728", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Amazing! Faultless", "review": "I spent an amazing 10 days here. I combined the high intensity fitness retreat and a boot camp run by BodyByrne, Dublin. The place is magical. Although it is close to Marbella I did not go there once. Too busy being pampered and looked after by the amazing staff who all know your name the minute you arrive. The food was fresh and tasty and the chef is very accommodating when you ask for slight adjustments to the menu. Nothing is too much trouble! I did most of my training with Javier and he is so funny but also pushed me. No slacking allowed! I enjoyed several treatments and each was fantastic. Cannot speak highly enough of this place and will definitely return. ", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r492127553", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Wonderful Haven", "review": "I have just returned from five nights at this heavenly hotel. It is peacefully located up in the hills and with only 14 rooms, it feels very personal. The staff are, with no exceptions, delightful and extremely professional, the food is excellent and the classes and therapy sessions are superb. I travelled alone (as did the majority of guests) and felt totally at ease and returned feeling very rejuvenated. I would highly recommend this retreat to anyone searching for some real rest and relaxation. It is not glitzy but one certainly feels extremely well looked after -  I shall definitely be returning!", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r491895275", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Yoga retreat ", "review": "Dear Trini, we would like to thank you for your nice opinion published on TripAdvisor! It is so motivating for the whole team! Hopefully it won't be too long until you can visit us again. Warm regards Christine", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r489985061", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "You won t be disappointed", "review": "I was lucky enough to travel here with 18 beautiful souls. I can't say enough about the service and delicious food. Rooms were comfortable. It was a perfect trip Thanks Shanti Som.  Great location  We will never forget you  ", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r486046812", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "We'll be back in the fall!", "review": "Dear Jeannette;  Thank you so much for your lovely and kind comment.  We were very happy having you as our guest and we all hope we can welcome you again in a next future. You will always be in our minds.  ", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r479480515", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great place", "review": "We went for 6 nights and loved it. I did the yoga retreat and really improved, my husband did weight loss and enjoyed it and lost weight. Personal training, lovely walks, Pilates, yoga, stretch class, he tried everything. Staff were encouraging and supportive with him and everyone seemed to care. Stayed in suite with private garden which for us was worth the extra. Food was great, healthy and wholesome with good portions. We picked up lots of ideas to bring home with us including our morning fresh lemon and ginger teas in a cafetière.  Kev is still sticking to weight loss programme he was sent home with and is doing well so thanks to all staff who helped him. All staff were wonderful. My only area that could be improved was pool was not heated. I love swimming but in April it…", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r471159263", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Beautiful experience", "review": "My wife and I visited the retreat for a body exfoliant and massage. It was excellent and the staff so welcoming and helpful. We then had lunch which was again quite exquisite. I would not hesitate to recommend a visit.", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r460693522", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Wellness Retreat in a Beautiful Setting!", "review": "Muchas gracias por su amable opinión! Esperamos verles pronto otra vez aquí en el Shanti-Som ", "date": "January 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r457813649", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "A luxurious cocoon", "review": "I did quite a lot of research to locate a wellness retreat in a beautiful surrounding, with warm-ish weather within a three hour flight from London and I found it. Everything was great without being pretentious, and the price was great value for a six day retreat (includes room & board, a training session each day, yoga and nutritionist, but not treatments).   The staff were very supportive and friendly and since there were only 14 rooms, people got to know you quickly. I did the weight loss program - not the detox - and the food was delicious and very healthy so I did not feel deprived. The location in the mountains was gorgeous and it was 15 minutes north of Marbella. Also, I loved the region - I went to Ronda and Grenada. And the weather was sunny and 65 degrees - sheer…", "date": "January 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r457049029", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "2nd visit - even better than the 1sts", "review": "Thank you Susan for your very nice words. We all here at Shanti Som miss you already and can't wait to welcome you here soon again!! Stay safe until then. Big hugs from all of us here Christine ", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r444332912", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "A Southeast Asian Haven in Spain!", "review": "My daughter & I came for a well deserved mini escape and found shanti som a perfect retreat. the place is beautiful and tranquil and the staff and everything you could wish for - helpful friendly but never intrusive - if feels like you are staying at an indulgent relatives super duper residence and they have thrown in yoga and treatments should you wish to partake ( which we did!!) food is also very good -if you need to escape if you need to relax & rest amoungst beautiful surroundings this is the place to go", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r439608253", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Detox - It worked.....", "review": "I went for a 6 day juice retreat, the juices were lovely, and copious and I wasn't hungry. The evening broth definitely helped fill any evening 'not eating blues'. The morning yoga classes were great, at 9am which is pleasant as some places do them at 7 (!). Possibly a few too many people on some days given that it was a bit chilly so we had to do them in the slightly smaller indoor yoga studio. But generally it was fine, great instructors, I would just suggest that when there are 8 or more people, they would benefit from a 2nd instructor in the room correcting people. As a beginner, and surrounded by a lot of people on the yoga retreat who were way more advanced, it was sometimes a little overwhelming for me trying to keep up.  The place is a nice size, again, on a personal…", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r437389626", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Relaxing detox in beautiful surroundings", "review": "Thank you for having taken the time to write about us on tripadvisor. We are glad that you ingeneral enjoyed you stay and we have taken note of your suggestions. At the momento we are looking into the possibility of heating up the pool! Hopefully you will visit us again one day", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r422406802", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "SERENITY", "review": "My friend and I stayed at Shanti Som for 4 nights in September 2016.  We were on the turbo detox: 3 full days of juice (4 per day), supplements and broth (1 per day). Food was reintroduced on the fourth day.  The place itself is nestled in the countryside so everywhere you look is absolutely beautiful. The hotel itself is wonderfully decorated with an Asian theme. The photos on their website don't do it justice!  The staff were so accommodating and very personal - I was very surprised that most knew my name already!   The detox itself was hard! I've never done one before so I've got nothing to compare it to but I was very low on energy. (That being said if you're worried about this, don't be - the staff made it very clear to us that if we needed food at any point, just to let…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r418850755", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A bubble of tranquility", "review": "Dear Katie, thank you for this nice opinión on Tripadvisor. We all here at Shanti Som hope it won't be long until we see you again. Warm regards", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r410548748", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Dinner", "review": "A great place to unwind and de stress in a SE Asian style, yet just a short flight from London. I was sceptical when my wife suggested this but I/we really enjoyed the experience on the 6day weight loss programme. A fair amount of exercise in there but mission was accomplished and weight was lost! An added bonus is the food was (unexpectedly) excellent.  Rooms were good although next time I would maybe go for a suite. Staff were all excellent and extremely welcoming. We will definitely go back.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r406755848", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Detox 6 days on juice 1 day on food ", "review": "So beautiful and very peacefull 5 Stars small retreat with a great spa. Wonderfull staff who knows your name 5 min after check in. Enjoyed the whole experience and lost 4,2 kg in 6 days. Hope to come back again for the exceptionel good food and yoga 😊", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r402091627", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "A place of tranquil", "review": "Thank you Charlotte. We are happy to see that you enjoyed it and congratulñations for your weight loss in 6 days!! Hope to see you very son again here at Shanti Som", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r398858170", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Holiday to unwind ", "review": "Very stylish, high-end boutique hotel and yoga retreat in the middle of the Andalucian forests and mountains and still only 15 minutes away from Marbella buzz. An excellent food, too. A little bit on the expensive side, though.", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r396621420", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "A perfect Place to Relax", "review": "What an amazing place this is..as soon as you walk in the door you start to unwind! It is a place where you can get away from the daily pressures of life and totally relax. The food is fantastic with a good choice of healthy options. The spa is wonderful and the staff really look after you and adjust the treatments to your individual needs! A really beautiful place and we did not want to leave! ", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r386897123", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Peaceful & idyllic", "review": "I really can recommend Shanti Som for spending some relaxing Days & taking Yoga Classes (the Pavillon for outsides Classes is wonderful))!  Very nice & clean Rooms, super friendly Staff, excellent Food, nice Spa-Area and totally surrounded by Nature!  If you feel like going to the Beach, just grab a Cab and within 10 - 15min. you're there (in Marbella).", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r374806019", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Lunch with friends", "review": "Excellent lunch in this beautiful setting tucked away inland away from the hustle and bustle of the coast. The staff were very attentive and we were not rushed at all. The whole location had a very tranquil feel about it. Would definitely recommend a visit.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r365780720", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Wonderful retreat", "review": "I stayed here on the 6 night detox retreat and I can't rate it highly enough.  I was made to feel welcome throughout the stay and Shanti Som is really geared up for single travellers. The staff without exception were superb and nothing was ever too much trouble. Nathalie our yoga teacher was also outstanding.   The rooms were beautiful - I stayed on the mountain side which had the sun from the morning until late afternoon (the other side gets the sun from the afternoon onwards). I was worried about some reviews saying the rooms were noisy - it didn't bother me at all and I'm a very light sleeper but maybe I was lucky with considerate neighbours.  The resort itself is immaculate with plenty of sunbeds and places to curl up with a book when the weather wasn't great.   Spa…", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r364330224", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Exotic Home from Home", "review": "I have just returned from a wonderful week at Shanti Som.  Apart from a beautiful and charming environment, what makes this place so special is the wonderful staff.    All the staff call you by your first name and it's so relaxed and informal it's like staying at friends home.  Nothing is a problem and each member of staff is keen to help you with your programme whether it be relaxation or detoxing.     There is a wonderful circular sofa in front of beautiful roaring fire that acts as great focal point for guest to touch base, relax and chat.  I did a 5 day detox and thoroughly enjoyed morning yoga, afternoon by the pool with the occasional foray to gym and walking in the surrounding countryside.   There were some fun people detoxing too so that helped take my mind of all the…", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r363856631", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "3 days in Nirvana!", "review": "A perfect retreat from hectic life.  After 3 days full board, 2 yoga sessions a day, steam room, sauna, pool, healthy yet tasty food and a tranquil location in a lovely little unspoiled valley, the mind was relaxed and the batteries fully re-charged.  Absolutlely what the Doctor ordered!! The hotel is small, clean, spacious and well-designed.  The staff were very friendly and welcoming.  I am definitely going back!", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r360814895", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Beauty treatment given as a gift", "review": "The massage was amazing and we had a fabulous lunch!  We didn't stay overnight as we have a home nearby but the setting is wonderful. Lovely service and the treatment areas were really nice. Great place for lunch too.  Fabulous for a girls day spa experience. ", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r360747361", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Disappointing", "review": "I booked in for a half day retreat . To be honest I thought it was very over priced for what I got . The lunch consisted of a choice of two main courses and they did not have the ingredients for one of the dishes so in fact there was no choice . The tofu dish was very small with three pieces of tofu . I was given a sugary welcome drink on arrival as part of the package ( I'm trying to stay off sugar as part of my own detox) . The massage was relaxing but not the best massage I have ever had ( and for a lot less € ! )  The price advertised on the website is different to the price invoiced. There is no doubt that the surroundings are impressive and the staff are friendly but even so the package is overpriced by far . I voiced my feedback on departure but was offered no reduction…", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r360521425", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 1}, {"title": "Takes you back to Thailand", "review": "Calling here with the family and it takes you back to Thailand in a 5 star place. Relaxing, elegant in stunning surroundings. Highly recommend this to chill out the pool and gym are excellent along with the spa. The settings of hills and greenery is also amazing. ", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r360087275", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "..... Shanti Som", "review": "A place where 'East meets West’.  It sounds like a cliché but stopped being a cliché for me when the staff of Shanti-Som welcomed me in the hotel.  As many people these days, I was looking for a beautiful place to rest, to think, to relax, to heal, to enjoy … and that’s a lot ;).  A pure place but also corresponding and connecting to our 'Western’ way of living. A place not too far away, a safe place in this world where too many people are fighting and a place not too expensive.  I got the address from a friend, who's living in Spain. She didn't know so much about this place so I took a look on its website. Everything they say on the website is not a lie; - It's a wonderful and beautiful place... Check! - It is build in the middle of Andalusian’s nature but also near Marbella.…", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r347638625", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Nice, but major renovations need to be advised upon booking", "review": "Lovely hotel in the mountains 15 min drive from Marbella. Rustic setting and Asian style hotel complex. Restaurant was good and staff very accommodative. Very much focused on Yoga, with a small gym and \"wet\" spa facilities. As we were looking forward to a night off the kids, we were going for the spa - however there are major renovations going on when we arrived, and were told the steam room was out of action and the sauna only after workmen left after 6 pm.   I have a major problem with hotels that offer luxury services and do not advise if these facilities are out of action on the nights we book. We should be advised in advance and offered the choice of cancelling.   Disappointed in a hotel which should have done better.", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r346819795", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Pleasant stay", "review": "This smallish pretty retreat in the mountains behind Marbella has very good food. The place has a buddhist vibe and offers several packages - health breaks, weight loss, yoga etc. I was on a few days' health break and enjoyed it. A few things bothered me though: the constant music in common areas is always a downer for me - also here. There is no room service at all. Both the dining area and the rooms suffer from bad lighting - it was almost impossible to read a book or a newspaper. And finally - the worst - my room was quite heavily scented. I spent hours trying to air the place out. I suspect those spritzes increasingly used during the cleaning process in hotels the world over. Not nice! Especially for people with allergies.", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r336889446", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Perfect for single travellers", "review": "I've often found it a challenge as a single traveller to find somewhere to stay where I feel completely comfortable and able to enjoy all aspects of my visit.  Shanti Som is the perfect place for that.  The shared dining table is a lovely idea and through it I met some great people of differing nationalities however, even if you chose to eat alone, you would not feel at all awkward or out of place.  As there are only 14 rooms, you quickly get to know the other guests over a yoga mat or at mealtimes but if you wished to take some solo time, this is also easy to do and there is never any pressure to mix with others.  I loved my room with balcony which overlooked the mountains and was so peaceful and restful.  The underfloor heating in the bathroom was a nice surprise too.  There…", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r334215980", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Great Location for rexlaxtion", "review": "The location is great very relaxing environment, scenic views of high mountains . The food was very good. The service was excellent. The staff very professional and accommodating. It exceeded my expectations.  I would gladly recommend this place to family/friends and colleagues. It is a gem of a place. Thank you, for taking good care of me. I can honestly say it has been one of the best holiday breaks I have had in a long  time : )", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r328010457", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Surrounded by nature", "review": "Lovely place, I traveled solo for a short detox. The nutritionist was great, nice treatments, tranquil environment. The hotel is about 20 mins taxi ride from Marbela, so you have to catch a taxi or rent car; I wish I rented a car. ", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r316650216", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "A beautiful, relaxing resort - highly recommended!", "review": "Thank you for taking the time to write about us. We are pleased to learn that you enjoyed your stay with us and we hope to be able to welcome you again soon to the Shanti Som. Warm regards Christine", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r305281211", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Retreat in the mountains", "review": "I went on my first solo holiday last week and the Shanti Som was an excellent choice! It was everything that I imagined but better!  I wanted somewhere that was good for a single traveler and that also had a health conscious/fitness element too, as well as being relaxing. The Shanti Som ticked all of these boxes. Arriving there was wonderful, the resort is tucked away in the mountains in Monda and the location is absolutely beautiful. The hotel is really pretty and charming with lovely stone sculptures and water features all around.   When I arrived I was made to feel very welcome by Karina and immediately felt relaxed as she gave me a tour of the hotel. All the staff know your name too which is also a really nice touch, making the service really personal and friendly.   The…", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r299436909", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Tranquil, elegant, amazingly friendly, incredible food and yoga", "review": "Perfect in every way if you're looking for a peaceful, comfortable and health conscious (but not too health conscious!) break. Especially if travelling alone. For a full review perhaps I could point you to my blog? https://faithiepop.wordpress.com/2015/05/11/10-things-i-learnt-at-shanti-som/", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r290841052", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Wedding at Shanti", "review": "I was thinking wether to write a review or not; we had such a great time that I wanted to keep this place just to myself...but it's not fair; I had to make justice and write about what I believe is one of the best hotels / well being retreats of Europe.  We booked the entire hotel for ourselves for the weekend; Price? listen people, forget about the Price, after the experience we had, I can say it was worth every euro (and we are no Rockefeller, we are \"normal\" people, so we are Price sensitive).  The staff were all absolutely amazing, the atmosphere of the hotel is one of a kind (you will not see anything ike it around andalucia), the location is magical. I mean, when you are told \"the hotel is in Marbella, Malaga\", the image that comes to your mind is completely different.…", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r268225084", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "A beautiful lunch at a beautiful location", "review": "This place is amazing! The whole ambience is really calm and so beautifully landscaped, and the staff really couldn't do enough to help us, but without being an annoyance. There were gorgeous flowers and water features everywhere, and the food was just delicious and so beautifully presented.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r261120187", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "a beautiful well being retreat", "review": "Many times I went to Monda to stay in this wonderful well being retreat. For the first time friends invited us to have lunch there. Since then we come there as much as we can. This retreat is well hidden from the main road so all you can hear is mother nature at her best. The waterfall ornaments, buddhas, colors so bright, lovely colored umbrellas, it all adds up to the nice sphere. The views are to die for.", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r252878718", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "As good as it gets....", "review": "I hit the jackpot with the Shanti Som Wellbeing and Yoga Retreat in Monda, Spain. This is a little gem of a retreat tucked away in the foothills of the Sierra Nieves mountains north of Marbella 10 minutes by car yet a world away. It's an exceptionally well run place by any standards but even more so for a retreat and spa with only 14 rooms.   The resort has a Balinese feel. It's calming, understated yet substantial at the same time. The management has luxury hotel experience which is evident in the level of hospitality and attention to detail. They are truly there to make sure your stay is as good as can be. I was looking for a well run, knowledgeable and clean place...clean and comfortable. On all fronts I was more than pleased.   For my part I undertook a six day juice detox…", "date": "December 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r246438123", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Total relaxation", "review": "Located in the mountains of Marbella in the middle of a forest, this is the best place for a relaxing, disconnected, detoxification, Yoga getaway. It has only 12 rooms, and it gives you the feeling that you are at home. Lights out are at 9 pm. My plan was to stay 4 days, I checked out, but was back for more in a week. If you are looking for night life or shopping, you are only half an hour drive from the center of Marbella (Puerto Banus).", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r244897260", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "The perfect getaway", "review": "I have tried all three retreats over the years, weight loss, yoga and detox and can recommend all of them, depending on your goal.   Shanti Som is the perfect haven for a relaxing, re-charging, get away from it all holiday and I'm surprised by some of the other reviews.  The whole team are wonderful and attentive, nothing is too much trouble and you'll feel at home in no time at all.  The yoga teachers are of a high standard and practising in the wonderful outdoor yoga pavilion is bliss. There are some wonderful spa treatments on offer and the food is first class.   I always feel incredible after a stay there and am always sad to have to leave and return to normality.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r236374918", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Detox program ", "review": "The detox programme has changed from 2012. The standards have dropped I am sad to report at Shanti Som from 2 years ago.  The coffee enema used is an instant brand,  nowhere near as effective as the original coffee enema.  No steam room for the whole week. Stupideous excuses. The sauna is switched on,  on demand. The gym is poorly equipped. Yoga mats require replacements as they are over used and slippery. The Yoga teacher is not constant throughout the detox program and therefore unable to build continuity of strength as each yoga teacher has their own style. The room was nice.  The juices were nice. ", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r235081267", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 2}, {"title": "Weight Loss Heaven", "review": "I have just returned from nine nights here and I have to congratulate the team at Shanti Som. I lost over 6 kilos in 9 days!.... The Food was amazing for a diet plan, the Yoga I loved and have already booked more sessions on my return home. Mercedes my Personal Trainer, well the only thing I can say is that she is \"The Spanish Devil\" But she got me back to exercising after a 20 years on nothingness.... So thank you!  The resort itself offers excellent spa treatments too, and a chilled and relaxed vibe, and with WINE!.... Yes Wine even on a diet!.. Small friendly and beautifully formed. I will be going back, and so should you! Book NOW!", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r232273095", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Would do anything to feel that breeze from the pavilion", "review": "One of the most relaxing experiences I've ever had. Was impressed with the standards of rooms and bathrooms. Surprised to have this standard in Marbella besides the 2 well renowned hotels at the beach side.  The food is excellent given even for the pickiest people. The yoga retreat is highly recommended. Lovely team, therapists & amazing yoga instructors, they all make you feel at home.   One thing that can be improved is maybe having portable AC units in the bedrooms for those summer nights.   I will definitely come back to this tucked serene haven.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r231444003", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Wonderful for a true 'retreat' holiday.", "review": "We have stayed at Shanti Som several times and have always enjoyed a fantastic and peaceful time. The staff are truly welcoming and always try to make everybody's stay the best it can be. The setting and hotel itself are stunning. It's the perfect place to escape the outside world. Three days there feel like a week's holiday. ", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r231440214", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Lovely place to relax and unwind...", "review": "My mum and I had a great 5 day stay here at the beginning of September. I had read quite a lot of negative reviews but I can say I was pleasantly surprised. In terms the problems people have had a lot of this could have been solved by asking the staff. I was on the high intensity and weight loss program, but was able to alter this to suit me. The yoga teaching is very good with lots of guidance and the outdoor studio very relaxing, we had a cow and puppies visit during our practices. Mercedes is an excellent and very persuasive trainer, who got the best out of me in a relatively short time. We also did two hikes with her, these were not particularly interesting however they were designed to burn fat and that they did! If you are looking for something more leisurely and scenic I…", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r229579418", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Nice property, lacks finesse", "review": "Located in the mountains above Marbella (you need to watch out for the final turn off the road!), tranquil environment and a priori nicely done. Lovely gardens, nice and welcoming reception area however a challenge to get your luggage from the parking to reception because of numerous steps and nobody there to assist. The rooms are OK, but small and basic - they are all located around the central patio which is also used for lunch and dinner, therefore noisy. But you can also hear the TV from the room next door, even the toilet - so not great for a wellness retreat. No WIFI in the rooms and even in the reception area not great. Overall, for what they charge for the rooms not up to standard.  The biggest problem is the service staff in the restaurant - not service orientated nor…", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r225289263", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "A haven of tranquility", "review": "I have just returned from 5 wonderfully relaxing days at Shanti Som. A haven of tranquility and calm, the perfect antidote to the daily stresses and strains of life and I wouldn't hesitate to return at any given opportunity.  Delicious food, beautiful surroundings, and fantastically helpful staff and a really great team of therapists from Mercedes, the personal Trainer, to Marisol the Nutritionist. Shanti som has created an environment which allows you to completely unwind from the minute you step through the door. Nestled in beautiful nature, it's rare to find somewhere so close to home that is a total escape, without long haul travel involved.  I stayed for 5 days, but a long weekend would be equally fabulous here.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r224537963", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Inner peace ", "review": "The Shanti Som gave me the time and the tools to feel better, mind body and soul.   The food was excellent, even though I was on a healthy eating menu I never felt hungry and was introduced to fantastic new flavours.   Following the retreat I have been able to take some of the valuable lessons and applied them to my everyday life.   Mercedes the personal trainer is absolutely wonderful, not only did she help me with my weight loss goals but she helped me with rehab on my ankle. She worked with me daily to strengthen my ankle and work towards my recovery. She worked tirelessly to give me the support I needed and she's still a good friend today!   I decided to treat myself to an array of spa treatments whilst I was there and of the treatments I would say the lomi lomi massage was…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r222542891", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Nice retreat in mountains, lacks finesse and considered touches", "review": "A retreat in the mountains above Marbella near Monda and Coin, beautifully isolated and calming but just lacks the finishing touches of a world class resort.  Well manicured gardens and relaxing reception area with incense and calming music greet you after the winding roads up from Marbella however negotiating the numerous steps from the car park with heavy luggage is not easy, there was no offer of help! The rooms are well appointed but with no air conditioning in summer prove to be overly hot. The service can only be described as slow and impersonal, waiting for 20 mins for a warm smoothie is not great and then when charged an additional €1.50 per drink for delivery to the pool is unacceptable. There are no offers of cold towels, fruit or cold drinks during the day as offered…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r222116833", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great retreat", "review": "I absolutely loved my retreat at Shanti Som. (I did the weight loss retreat.) Great hotel in a beautiful location. All the members of staff were incredibly nice, from the people in reception to the nutritionist. Trainer Mercedes is awesome. And DO get a deep tissue massage at the spa, it's one of the best I've EVER had.", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r218167362", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "DETOX", "review": "First time detoxing so didn't know what to expect. Hotel has a nice holistic vibe - all buddhas and incense etc. Rooms are small and very noisy. You can hear everything from the room next door to you, even the toilets! Rooms are very basic, no air-con but has a ceiling fan. Stingy on the towels and toiletries and no Wi-Fi in rooms. Can't comment on the food but what I did see looked very good. The gym has one bike, a plate machine and a very small multi-weight system but is extremely sparse and really should not be classed as such. Again, no air-con the gym. Pool very small. However, with these negatives I can say that I did enjoy my stay and achieved the results that I went for. But, do not expect the 'detox' programme they promise on their website. No 'pre-arrival…", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r209141657", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Highly recommend this haven of tranquility", "review": "The most tranquil stay in beautiful tastefully decoarated rooms, calm and tranquil, attention to the minutest detail, excellent service and the most delicious food. You could not ask for more. Highly recommended.", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r200345581", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Beautiful tranquil ambience and surroundings.", "review": "Had lunch in the restaurant and enjoyed a most tranquil, scenic and warm and sunny afternoon in the garden.  The food was beautifully cooked and presented and the quality was excellent, however the portions were a little small for the price.  Lovely relaxing afternoon with friends and a very different experience.", "date": "January 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r192722519", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Amazing staff pamper their guests", "review": "We just got back from a short visit to Shanti Som. What a great place! The rooms are a bit small but sufficient and with a great bathroom (with rainshower and floorheating). The bedsheets are really,  really soft. The surroundings are great! The view from the room is really nice. The fireplace in the reception location is really cozy. The food is amazing and healthy.  The early breakfast they arranged for the day we left was excellent! The sauna and steamroom are great. The massages are amazing. But what really makes the place special is the staff. They made us feel very welcome. One of the ladies told us literally “we are here to pamper you” and that’s what they do, all of them.  I’m quite sure that if you would travel alone you would feel very much at home as well.   A few…", "date": "December 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r189024928", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Sunlight and silence", "review": "Shanti Shom is a beautiful boutique hotel in the middle of nowhere with only 14 rooms and bathing in sunlight and silence. The spa and yoga facilities are excellent. The food is very good, tasty and healthy. There is a big fireplace with a huge sofa to relax in the evening and big sofas outside to lounge. It is difficult to connect with the outside world as telecommunications are not well arranged. There is almost no connection with Vodafone Spain and Wifi is only to be found in the hotel lobby. No calls can be made from the hotelrooms; luckily, relatives can call the guests and are connected to the rooms. The yoga facilities outside are really awesome. Swimmingpool is not heated, and as this hotel is up in the mountains, the water gets really cold. I think its a great hotel for…", "date": "November 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r185928746", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Heavenly bliss that I don't really want to share!!", "review": "Shanti Som was a perfect retreat for me.  I was looking for somewhere I could relax and enjoy warm weather without being out in the sun all the time as I was 6 months pregnant.  There are lots of places to just chill and read a book, big sofas and lounging areas, lots of running water and rock pools, a beautiful lounge furnished in a very welcoming style and a lovely open fire for when it got a little cold. Beautifully furnished and decorated.   The location is in the middle of nowhere but for me that wasn't an issue as I wasn't planning on leaving or traveling around.  If I wasn't pregnant then this isn't the sort of place I would come to for a week but maybe a long weekend.  Great one for chilling out and recharging.  But marbella is only about 20 mins drive away so very…", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r185663109", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Perfect place for 'a quick fix'", "review": "Shanti Som is a really nice resort and especially the staff is awesome and doing anything to make you happy. Accessibility is easy via Malaga so it is a good place if you want to focus on rest and health for just a couple of days. The only minors are that rooms are quite noisy (although I was lucky enough to not having any neighbours during half of my stay) and that you can't easily go out for a walk which is why i give it 4 stars and not 5. Next time I will probably take a rental car. I did the 5 day detox and it is really easy. The juices are awesome but I thought the enema system was too basic as you lay a bit squeezed. Anyways, you get used to it :-). I regret I had not much more opportunity to taste their food because I think it is delicious. Views are awesome, but ask for…", "date": "November 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r185047905", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Beautiful oasis", "review": "nestled in the green hills.  Tastefully and elegantly decorated in the south and south east Asian styles.  The Buddhas, water features and limited number of people make it a peaceful spacious meditative sanctuary.  I enjoyed a luxurious one night stay, did my own morning yoga practice which was heavenly followed by a delicious breakfast and a lazy afternoon in the terrace and by the pool.  Definitely recommend Shanti Som as a long week-end spirit recharger!  Would be great to have more wifi access as that's become a life necessity, even in a sanctuary!", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r175074792", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "an absolute gem", "review": "i dont really want to write this review because I want it to be my little secret - my guilty pleasure.  From the moment I walked in i felt all my stresses disappear.  My head cleared and I knew instantly I had found my peaceful haven.  the setting is beautiful, an oasis of calm only 10 minutes from Marbella.  I had never considered doing a retreat before, but I felt so ill from the stresses and unhealthy lifestyle I had fallen in to, it was Make or break time.  I feel so much better.  The food is excellent and so healthy and fresh.  The outside courtyard was a tranquil setting to eat all meals.  When I looked into booking I wondered whether the cost could be justified, trust me its worth every penny.  I am fitter both mentally and physically and I have a renewed passion for…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r174884313", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Wow, end of", "review": "Thank you so much for writing this beautiful review! We are very pleased to see that we have reached our goal of making our clients feel relaxed, restored and in peace. Don't worry this will always be your little gem and we are already looking forward to welcoming you again to \"Your\" Shanti Som.", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r174304682", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Great for quiet Lunch", "review": "A little piece of heaven in the hills.  Attended a wedding here, surroundings were excellent.  Very high quality throughout, lovely courtyard and outdoor experience was pretty unique.  Will go down with very fond memories especially the evening dancing including fire dancers.", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r172477022", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Quiet beautiful place to relax", "review": "We visited this hotel for lunch with friends and if you have a car it is a fantastic ride up into the mountains leaving the madness behind you. So peaceful and tranquil with beautiful surroundings. We looked at the rooms and will definitely return for a stay. We had the set lunch which was excellent throughout. The staff complemented the atmosphere of the hotel and were excellent.", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r167487353", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very peaceful", "review": "My husband and I stayed here for a week. If you want to relax, this is the place. The hotel and surroundings are wonderful, quiet and peaceful. The rooms are small and without airco, but we didn't have a problem with that. The food is healthy, a bit pricy, but very tastful.   It's nice to start the day with a yogalesson in the outdoor. There are a lot of nice seats around the hotel where you can sit down and read a book or do whatever you like to do. Wifi is available in the beautiful lobby. One week was enough for us. Don't go there with your kids, but go alone of with your partner, mother or friend.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r162948448", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Beautiful hideaway in the mountains near Marbella", "review": "Wonderful stylish Hotel, beautiful (small) rooms, very friendly staff, great atmosphere, excellent food (try the chocolate cake...), helpful and professional manageress from Germany. I will definately return!", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r161382982", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Ok ...so I have been 4 times in 14 months!", "review": "I am addicted to Shanti som's vibe and energy. I really enjoy Natalie's yoga classes,the mountain walks,the good healthy eating and the wonderful treatments. A small very friendly boutique hotel.  See my previous review last year. Looking forward to returning again in November.", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r161011165", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Bliss", "review": "Thank you so much for the review!! We here at the Shanti Som love having you with us and are really looking forward to welcoming you again in November!!! Lots of love", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r159389435", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Enjoyable few days", "review": "It started on arrival,lovely reception with personalised check in,refreshing just prepared juice,warm smile and 'can do'from the word go. I did the turbo detox package and stayed in a premium room. The room is compact but very nice with a private outside area. All staff are really friendly and the whole experience pure bliss from start to finish. The yoga instructor catered for all abilities and the spa treatments were very good. Everyone I met seemed committed to the ethos of Shanti Som and showed extensive knowledge about nutrion and the various stages of detox. It is a perfect place for a solo traveller as you feel at home very quickly, and a great way to sign out from the daily stress for a while. I came back feeling healthier and positive with lots of energy. I can't wait…", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r159213745", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "THE = True Human Excellence", "review": "Friendly staff and attractive, compact rooms.   Food is excellent with a well priced organic wine list.  Outdoor pool is unheated which is a pity.  Attractive gardens and comfortable loungers for relaxing.  Good yoga facilities but very small, limited gym.", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r158787763", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "5 Star retreat... we'll be back", "review": "First time in 19 years my wife and I took a full week-off as a couple (you guessed right, our oldest daughter is 19). Shanti Som turned out to be the perfect retreat, with a fantastic yoga program (Thank You, Mourad), great surroundings, welcoming and helpful staff, and wonderful food (way above average). The place is set about 15 minutes in the mountains above Marbella, allowing for a quick get-away. Our walk from El Refugio de Juanar (turn-off from the road to Marbella about 5 minutes by car from Shanti Som) to the mountains dominating Marbella was unforgettable, with views on Gibraltar and the Rif Mountains of Morrocco (so near, yet so far...).  Shanti Som is more of a retreat than a hotel, with yoga, detox, loss-weight programs, and has a very limited number of rooms, which…", "date": "March 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r156578880", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Blissful!", "review": "Thank you very much for the nice review. It was a pleasure having you with us and we hope to see you again soon! warm regards Christine", "date": "March 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r155984278", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "-Paradise Found-", "review": "Having just returned from a blissful week at Shanti Som, I can sincerely say I have never felt so refreshed, rested and relaxed.   The setting is truly beautiful and inspiring, the mountains, running water and fresh air give it a very tranquil feel.   Although I believe it was fully booked when I was there, it never felt busy and there was always plenty of space to find quiet time.    All of the staff were extremely attentive, always had a smile on their faces, and couldn't do enough to help the guests.  I knew them all by name by the time I left, and I was sorry to say goodbye. My favourite area was the custom made semi-circle sofa around the gorgoeus log fire, something which was nice to sit around in the evenings once the sun had gone down, and I also loved spending time in…", "date": "February 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r151786736", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Only went for a massage-!! so so...wasnt wowed!", "review": "Hi Debbie, Thank you ever so nuch for this great comment! We miss you here and hope you will soon find your way back to us! Warm regards from everyone here at Shanti Som Christine", "date": "November 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r147209616", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A Relaxing Break But There's Room For Improvement", "review": "Just returned from a rejuvenating week long stay at Shanti Som. I went for some simple rest and rehabilitation, but received so much more... The beautiful hotel (which looks like a sleek indonesian house), wonderful staff and sublime landscape provide the perfect setting for unwinding and bringing one's self back to life! The restaurant has both an indoor and outdoor area, with a varied menu, and balanced offering of meat and vegetarian dishes.. It has both an indoor and outdoor area, and due to the climate, you can easily have lunch outside in the sunshine during the winter months! - coming from the grey skies of London, the luxury of this is NOT to be underestimated. It is simply glorious. Shanti Som offer various treatments and programmes, from beauty and massage to more…", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r141419342", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Great relax", "review": "I had a very good time in Shanti Som in August. I stayed there for a yoga retreat and it was perfect. We had Nathalie and Mourad for the lessons and they were perfect. I felt really well after the whole stay. The hotel is very comfortable, you can spend hours reading anywhere in the lounge or gardens. The restaurant was great, all meals are selected to comply with the aim of your stay - rest and enjoy. The atmosphere is very good, you share with others your yoga sessions or breakfast, drink etc. I would recommend everyone to go. There is a beach in Marbella, just 15 minutes by car.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r140783528", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "3 days of total bliss", "review": "Many thanks for your nice comments. We hope to have you back next year. Kind regards.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r140338859", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "When can we return?!", "review": "I have just returned from a 3 day yoga retreat at Shanti Som with my girlfriends. We had a truly relaxing stay in this little bit of paradise tucked away in the mountains just above Marbella.  The interior design was gorgeous - very Thai & tranquil yet modern & chic. The accommodation was of a very high standard with fabulous showers in the bathrooms & lovely large terraces overlooking the mountains.  The food was delicious and varied with Asian, Mediterranean & Middle Eastern menu choices. All of the staff - from the reception staff, the waitresses, the spa therapists, the yoga instructors & even the housekeeping staff - were extremely professional, warm and friendly and couldn't do enough for us. They really are a credit to Christina the Manager.  The swimming pool is small…", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r139403980", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "highest praise", "review": "Dear Lynne, Many thanks for your nice comments and suggestions. It was a pleasure to have you here with us. The Shanti-Som team is looking forward to see you again. Warmest regards.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r139153604", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Not enough loungers", "review": "We have nothing but praise for the Shanti Som. Everyone involved in the running of this retreat is quietly friendly and warmly welcoming - from the greeting at reception to the serving of the food, the room cleaning and the observant eye of the proprietor. In particular, the kind encouragement extended by the yoga teachers is to be commended.   With only fourteen rooms, there is always a place to sit quietly - whether by the pool, in the healing or organic gardens or on many of the magnificent day beds placed considerately around. The space was a haven - we felt as though we'd been convalescing with the gentle consideration afforded us at every step of our stay.   The lack of air-con was a joy to us. It was hot but leaving the ceiling fan on to provide a gentle breeze combined…", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r139040382", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Tranquil", "review": "This is a quiet peaceful beautifully appointed hotel. The quality of the accommodation is excellent. The staff are efficient and professional. The food at the restaurant was very good and we enjoyed our 2 days here. But, it was 41 degrees and the room had no ventilation and no airconditioning making it impossible to sleep. We would return but only when temperatures were below 30 degrees or airconditioning had been installed.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r137610335", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Wonderful relaxing stay", "review": "Dear guest, Many thanks for your comments. Management department will take in consideration your suggestions.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r137447415", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Special place for peace and quiet", "review": "My sister and me loved every day of our five days stay at Shanti-Som, we loved the silence and relaxing atmosphere, wonderful food, excellent service and treatments for body and soul. We will be back!", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r136203755", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A little piece of heaven", "review": "I have never been in a hotel where there is such a respect for peace and tranquility. Very well attended to and we were made to feel at home very quickly. Perfect place to disconnect and get away. It can get very hot in the mountain though and there is no air conditioning in the rooms which can make it slightly uncomfortable at times. Additionally there is very limited WiFi coverage. Otherwise a great stay!", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r132424553", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "An enchanting and beautiful place to relax and re-energise", "review": "We celebrated our 42nd wedding anniversary with a special lunch,at this Asian paradise.                 Perfection in every way.      Bill.", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r129533679", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "A perfect warm welcome in Asian atmospere", "review": "I stayed at Shanti Som for a week full of yoga. My room was one of the corner Suites (\"Peace\"). Shanti Som is an Asian paradise in Europe in the middle of the mountains 10 KM away from the coast of Marbella. All staff is extremely warm and service minded. They did everything they could to give me the best experience. The private yoga classes were super. In the morning done by Petra; a very experienced warm lady and in the evening by Nathalie a very soft and sweet teacher. The combination was perfect.  I also had some treatments in the Spa among which foot reflexology by Halila. What a lovely and good experience that was.  The menu they set up for me was light and very tastfull. A perfect combination of different fusion kind dishes.  Anyone who wants to take some time of to…", "date": "March 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r127120149", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "A great find,for an Spring or Autumn diet or dettox", "review": "Shanti Som is a beautiful hillside retreat.  On entering the Hotel you immediately feel at home.There are only 14 rooms all set around a courtyard.The 2 suites are the only rooms with baths all other rooms have showers.If you do not like hearing the noise of the fountains ask for a room that is quiet.There is no air conditioning this could be a negative in the summer.Bedrooms are comfortable with nice terraces with loungers all overlooking the surrounding woodland. All rooms have a TV(with 7 english channels) but no DVD. Swimming pool area is stunning,the pool is not heated. There is a small gym , 1 powerplate,1 treadmill,1 bike, 1 bench and 1 weight machine. The highlight of the Hotel is the magnificent outdoor yoga studio.The indoor studio is also very nice. I was on the diet…", "date": "March 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r126514980", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Thailand in Marbella", "review": "Cosi and luxury hotel-spa, amazing service and magical atmosphere. Unforgetable stay, willing to come back soon. Thanks Rodrigue Joly and team for your kindness. Diana and Rocio", "date": "December 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r121874238", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Absolute Luxury and Relaxation", "review": "Stayed here together with the girlfriend last week. This is an absolute gem, peaceful, luxurious and high class service. The staff was very friendly and well trained. If you are looking for some peace and tranquility 15 minutes away from the busy costa this is the place!!", "date": "December 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r121793078", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A pleasure..!", "review": "I spent a week here in May to Detox. Can truly recommend this place. Great rooms, lovely SPA, and fantastic staff...! Kezia (who runs the place) is a fantastic lady with a spirituel and lovely soul..! I will definately go back for a retreat any time soon...:-))", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r119640507", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Shangri La!!", "review": "I cannot believe that hidden away in the mountains and pine forests behind Marbella there lies this little gem of a place called Shanti-Som.  You could be in Bali if you did not know you were in Spain.  The relaxing full body massage, facial and wonderful lunch was fantastic and this is all on my doorstep.  Only 20 minutes down to the coast but you are in paradise.  I cannot wait to get back and to believe that this place is only a stone's throw from where I live.......", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r119563976", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Perfection upon Earth !!", "review": "This wonderful establishment is by far the nearest that we have ever been to a 6 star location,   not a single item has been missed to ensure one's comfort and above all total relaxation.     If your life encompasses Yoga, or wellness treatments this will be your own personal ' Nirvana'    Cannot rate it highly enough, from all aspects.", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080297-d2284110-r119346518", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}]