[{"title": "Clean hotel and about 10 minutes by tram to main marina/harbour.", "review": "Very clean hotel Location near San Juan beach Rooms lovely House cleaning service excellent Staff at restaurant could be more welcoming. Choices of food limited and was cold, however, there was good selection of fruits Staff offered me wine glass to drink larger on 2 different days. That was unusual. I would have given 4 stars if not for the experience at the restaurant.", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r725469819", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Short break", "review": "Dear Mr. 435iglo,  We really want to thank you for taking the time to share your comments with us.  We are pleased to hear from you that you enjoyed your stay, however, we regret that we didn’t live up to your expectation regading restaurant service. This is definitely not the image we want our guests and customers to take with us.  We will take your comments on board to improve all those points that should be taken into account and we hope you give us another opportunity the next time you are in the city.  Kind regards, ", "date": "November 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r725220161", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "San Juan experiince", "review": "The new owners have definitely been improving some of the rooms and reception areas. The pool area is much better and cleaner and the hotel is the busiest I’ve ever seen it but still great value. Mostly the same staff so I guess they are doing something right.  Great location 5 mins walk from Avenido d’Naciones tram station. ", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r717929323", "sub_review": {}, "travel_purpose": "", "rating": 2}, {"title": "Theresa", "review": "Dear Mr. Adrianlind,  Many thanks for your comment and punctuation, and for recommend our hotel with your kind words.  We are pleased to hear form you that you enjoyed you recent stay stay. For us, was a pleasure served to you and we really would like to receive you again very soon.  Best regards.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r711686065", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Not quite good enough for the price", "review": "stayed here for a week in September with my wife on a bed and breakfast basis just arrived after all the bad weather hotel was ok breakfast was only ok i have had better . the staff were ok some had very poor english .A lovely beach a very rude waiter in one of the restaurants on the beach .this area is built for spanish tourists and i got the feeling they didnnt realy want us there if you cannot speek fluent spanish stay away .i wont be back . i almost forgot the pool area of the hotel was alive with ants", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r710022743", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "We absolutely love this hotel!", "review": "We have stayed at this hotel many times & wholeheartedly recommend it! The beach is just down the road so I’m not sure why anybody would need the pool too much. The staff are friendly and seem to have been around for a while (surely a good sign). We have stayed in 5 star hotels before but I think this is our favourite hotel. The cleanliness of the hotel & professionalism of the staff are “second to none” Book this hotel - you will not be disappointed!", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r706433833", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Super Hotel 🏨", "review": "Dear Alberto F,  First of all, many thanks for your excellent comment and punctuation, and for staying with us one more time.   We are delighted to have attended you during your recent stay and we are glad to know that you have enjoyed a pleasant stay.  A positive customer experience is something that our staff takes pride in and we hope to receive you again very soon.   Thanks again & best regards. ", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r700564008", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "A great stay at a friendly hotel.", "review": "Second stay in this hotel, our previous stay was when it was the Holiday Inn. The rooms are in the process of being updated and we stayed in one of the new rooms. The room was lovely, spotlessly clean, lovely bathroom, super air conditioning. The food was lovely, lovely staff, great pool area, will definitely return 😊.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r685715439", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nice hotel and friendly staff", "review": "Dear guest,  Thank you very much for your excellent comment and score. We are very happy to hear that you have enjoyed your stay with us and we thank you for highlighting the aspects that you liked most about your stay with us.  We hope to see you again very soon.  Best regards.", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r680451591", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Not 4 Star Quality", "review": "This is probably the most I have ever written about a hotel! This hotel is very nice indeed, the staff are so friendly and helpful, nothing is too much trouble. They work extremely hard to make your stay special, continually cleaning up and and maintaining the hotel. All areas are spotless. Our room was spotless. The buffet food is easily the best I have ever tasted, obvious care and skilled cooking makes all the dishes first class and very tasty. The chef and assistants continually bring new dishes not just more of the same. Every day had new and different things to eat. No shop in the hotel but a supermarket very short walk away so no problems there. Just an observation, the hotel location was fairly high up a hill, so walking to the beach and restaurants was not too bad but…", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r679920440", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "We enjoyed our vacation", "review": "It´s a quiet place where you are able to relax, not far to the city center and easy to get around by car. The staff are great, kind, helpfull and they do their very best with the language too :-)  The rooms could be upgrated and the pool water was cold - in general, it was a good  Desfrutamos nuestros vacationes y muchas gracias a todos  ", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r676554470", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Good for one night", "review": "Dear Robert,  First of all, many thanks for your review.   We are pleased to hear from you that you enjoyed your stay with us.   We hope to see you again soon!  Best resgards.", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r669073106", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "I had anticipated more, but received much,  much less than the minimal of lowest standards!!", "review": "First room on second floor 113 it was ants everywhere. Change to 1 floor number 13. It was better but ants in bathroom.  No good.. I got full board for 2 days. Breakfast wasnt good. Lunchtime ok, but dinner had leftovers from lunch. And desame all time.  The pool was very good. The gym👍And free parking. Have a mercadon next door. ", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r668374541", "sub_review": {}, "travel_purpose": "", "rating": 1}, {"title": "Good hotel", "review": "Dear Bodaasa,  Many thanks for your comment. We are pleased to hear from you that you enjoyed the pool area and gym facilities. As you have commented, we are next to the supermarket.  I am so sorry for the inconveniences caused during your stay regarding ants and food service. We are looking into this matters in order to resolve them.   We hope to have the oportunity of receive you again to give you a best experience.  Regards.", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r668127497", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Avoid the food", "review": "I am just after spending a week here with my future wife, so let me first of all let me say the few good points of our stay at this hotel. The hotel itself is just a short walk away from the beach and there is also a few local pubs that are very good, the main one being, 'Sparks Bar Elpaso', which we found the staff and customers to be second to none!!. To come to the hotel itself, the rooms themselves where of a neat and clean appearance and where fully cleaned every day. There was a well presented buffet breakfast with a wide range of fresh fruit etc.   Now to the negatives regarding this establishment, of which there is many...... On arrival, the receptionist could not speak English, and for a hotel which was flying a Union flag,was a bit disappointing. The kids ran around…", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r665538420", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Ok. But nothing much in the area.", "review": "We stayed for 4 nights at the end of march. The hotel is in an area on the outskirts of Alicante. Personally I found it to be a bit remote. The beach is about 10 mins walk away and is nice. There is a supermarket close by and some restaurants . Also a Macdonald's. Most of these are approximately 10-15 mins walk away. The tram runs into Alicante city centre.  Taxi from the airport cost us €38. To return to the airport we got the 21 bus just outside the hotel in to the marina area near the meila hotel, and then caught the c6 bus to the airport.   The hotel itself is fine. Nothing special. The lift is a bit away from the reception area.  The room was good, bed was comfortable and it had a fridge. Cleaning staff were very good.  Breakfast was average but adequate. Lots of fruit, and…", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r664453951", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Fine for a couple of days", "review": "Dear Norfab,  Thank you very much for your candid review and for staying with us. We are happy to know that you liked our hotel and we certainly appreciate your nice feedback on our rooms and cleaning staff. However, we regret that the area has not been to your liking.  Many thanks again for your time.   Regards.", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r642078127", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "First time we have visited since change of ownership,  Well impressed", "review": "Room was large and clean although it was quite sparse in terms of decor. We were room only so decided to eat out so cannot comment in the food. It is a good location for access to the beach - the beach area was lovely. The area around the hotel is mainly residential (large tower blocks so not aesthetically pleasing but as a base, the hotel does a good job). Check in was quick and the sauna/fitness room looked very well kept and had some good pieces of gym equipment. Overall a fairly good place to stay.", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r636994865", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Great Hotel, Bad timing", "review": "The society we belong to have an annual meeting in December every year & for the last 4 years has used this venue.   It has had a change of ownership &  they are doing a lot of work to upgrade the hotel.  Rooms are being refurbished and the room we had was excellent.  The restaurant has changed its menu  ( 3 courses for 10 Euros) & the food we ate on the Friday night was fresh & tasty.  It is an ideal location for the beach & travelling into Alicante City", "date": "December 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r634360158", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "The hotel is ok, but don't visit this part of Alicante", "review": "Good Morning Gi m,  We appreciate your excellent evaluation and comment. It´s gratifying to read that our efforts to improve our facilities and service to our customers are rewarded.  We hope to welcome you again next year and offer you a more satisfying experience.  Thank you very much  Kind Regards", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r618824663", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Very basic", "review": "..and in some areas the carpets were worn and the hallways smelt faintly musty.  The bar staff were not as friendly as we had hoped, in fact one in particular was quite indifferent and could not even be bothered to raise a smile!  Sadly she was also employed in the restaurant.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r618823271", "sub_review": {}, "travel_purpose": "", "rating": 2}, {"title": "Not great.", "review": "Good afternoon SanMadg,   We inform you that at this time, we are renovating and improving ours facilities to offer a better service to our guests. Wo would like you to come again and you will apreciate our changes.  Thank you very much ", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r618074235", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Sterile and tired", "review": "I found the staff that I encountered in this hotel to not be very helpful. The food was not nice and the food in surrounding restaurants wasn’t great either, although there wasn’t a big selection. The location is okay if you are happy to lie on the beach all day as their isn’t many activities. My partner and I went jet skiing about half an hour away which was probably the highlight of our trip and also took the tram to Benidorm for the day which was a better location. I would consider booking a different hotel if you’re playing on going to Alicante. ", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r617527960", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 2}, {"title": "Positives and Negatives", "review": "Good afternoon Bethanymags,  We regret that our hotel has not met your expectations.  We inform you that we are currently immersed in a series of reforms to improve and renew our facilities.  We hope you can give us a second chance to offer you a pleasant experience.  Thank you very much for your comment  Kind regards", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r616881367", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Worse food ever!!", "review": "Had to stay here on a business trip and it really isn't suitable for that. Room was very sterile looking and just not nice, WiFi didn't work properly as I couldn't get devices to connect, not a problem for me in most hotels. The worst of it was that breakfast doesn't start till seven thirty which is no good when you need an early start. I won't be using this hotel again.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r615753303", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "We’ve already booked again for next year!!", "review": "We have stopped in the hotel both when it was a Holiday Inn & now it’s a Port Hotel. Over the last 10 years we must have stopped in excess of 150 nights so I think we’re in a position to offer an authoritative review.  Staff All the staff are friendly and we have never experienced any “rudeness” EVER. It’s true many of them don’t speak English that well. Try speaking a little Spanish - They are very patient & really appreciate your efforts. We keep recognising the same staff over the years - They are always friendly and always make us feel welcome.  Refurbishment The hotel appears to currently “under refurbishment”. The older rooms are absolutely fine. They certainly all have a new TV and they have reinstated the fridges. The WiFi seems to be better now also. I’m sure it’s only…", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r614215385", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Rude staff", "review": "Good afternoon Alberto F,   Your comment has impacted us in a very positive way. We are happy to hear that your experience in our hotel after 10 years, is still satisfactory in all aspects.  As you well know, nowadays the name of our hotel is Port Alicante. The hotel is currently under renovation, with the idea of improving and modernizing our facilities so that our clients have more satisfactory experiences.  We are happy to know your nice opinion about our staff.  We try every day to improve and offer a great service to our customers.  We hope to see you again next year.  Thank you very much ", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r614145231", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Canceled", "review": "Myself and my partner stayed in this hotel end of August start of September. Firstly I want to start with the positives, the pool area is really lovely and the lifeguard is very friendly also, the rooms, despite being outdated (see more below) are absolutely spotless. Could not commend the cleaners enough they do excellent work. The breakfast was sufficient had a nice variety to choose from which meant you could fill up for the day ahead.   Now for the negatives. The first being the staff, it seemed the majority of people who stay at this hotel are Spanish families because very few staff, bar one or two on reception spoke any English. We tried our best with this but it’s not a language one can master over a few days! We felt like we were for the most part an absolute…", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r592661318", "sub_review": {}, "travel_purpose": "", "rating": 1}, {"title": "Great Hotel ", "review": "Good afternoon David F,  We are pleased with your news about our pool area, lifeguard, rooms and breakfast.  We are sorry if the friendliness of our staff has not been to your liking and the rest of aspects of the hotel has not met your expectations. We try to be friendly with all our customers.  We receive many foreign clients and that is why our reception staff speaks English and they usually help in the restaurant if there is a communication problem.  Our daily menu has a closed price of 10 eur including starters, main course and dessert, even if you only want to take the starters.  It is my duty to inform you that it is not possible to book a double bed room before arrival at the hotel, it depends on availability upon arrival. If the day of arrival there wasn´t availability, that is why you were changed the day after if availability allowed, but the type of bed is never guaranteed before arrival.  I inform you that right now the hotel is in the process of renovation, which we hope will be of your pleasure if you give us another opportunity to try to improve your experience with us.  Sorry for the inconveniences and once again, thanks for your comment.  Kins Regards ", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r591430677", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Unsatisfied. Low quality for price payd", "review": "We didnt stay in this hotel , just checked in look at the most outdated room I have every saw and left with a full refund.  As it turns out the only new rooms are family rooms,,, so be warned. The area is quiet and the beach is at least 10 mins walk( a lovely beach).  There are no bars or other hotels that we saw. We got the tram into Alicante and stayed in a lovely hotel.  Its a shame as the staff were lovely and totally understood. The pool from what I saw was small and overrun with children.    ", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r590489073", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Lovely stat May 2018", "review": "We had a lovely stay for 1 week in May. Really nice newly refurbished room, lovely pool area, spotlessly clean and helpful staff. Good location 10 minutes from beautiful San Juan beach, 5 minutes to supermarket and tram stop. It is only 1.45 to alicante by tram. We akso travelled to nearly town El Campello and to benidrom to visit Mundomar marine park by tram, which we lovely. San Juan itself is a safe quite area with mainlu spanish visitors with a small but nice selection of restaurants and bars along with the lovely white sand beach. We thought the hotel was very reasonably priced.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r585811156", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Seasoned traveller with accurate review", "review": "Hello Leona,  Many thanks for your candid review.  We are pleased to hear that you liked room, pool area and staff. Also, we are located in a nice area. So, we are happy that you are very satisfied with your stay.  We hope to see you soon. Regards.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r585596729", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Easyjet cancellation", "review": "Currently staying at this hotel let me start with negatives in my opinion that i have and that is no kettle in room so you can leave tea bags at home and no balcony to sit out on. On plus  side staff very efficient  Room 207 beautifully furnished and lovely toiletries in bathroom even a comb. Food in dining room is fine for 10 euro starter main and dessert not Michelin standards but really what do you expect. I cannot  understand the poor reviews i definitely would return. Within a ten minute walk you are on the most spectacular prom spotlessly clean with numerous restaurant. Several places offer  beer/soft drink plus tapas for 2 euro. Very satisfied first time visitors.", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r583438665", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Ok hotel ", "review": "Dear Dolores M.  Thank you for your comment and punctuation regarding your stay.  We would like to apologise for the inconvenience caused about no balcony and kettle at your room. If you need boiled water or tea, you could ask for it at the bar.  On the other hand, we are pleased to hear that you liked room, staff and food. Also, we are located in a nice area, with lots of shops, bars and a beautiful beach. So, we are happy that you are very satisfied with your stay.  We hope to see you soon. Regards.  ", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r570577888", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "No no ", "review": "We were taken here by Easyjet after a flight cancellation. Where do I start with this? Well,  I'm a severely disabled traveller and their accessible room was the best I've ever seen so I was quietly optimistic  about the hotel. This all went downhill once I realised we where in the middle of nowhere. This is in a residential area with literally nowhere to go. Then we move onto the food. This is absolutely appalling food. I don't know who the chef thinks he is but he is bringing some unbelievable concoctions together. Then we move on to the staff and this does not include the cleaners.  Extremely horrible arrogant nasty people who made me and my family feel like second rate citizens because we were English and not Spanish. Laura and Domingo in the restaurant made  it quite…", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r559524702", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Good", "review": "Booked this hotel last minute. The hotel is a 10 minute walk from the beach which is Lovely. The staff at the hotel were helpful and friendly. The rooms were spacious and clean. We had breakfast once and it was fine, continental style breakfast. Cannot fault the hotel & staff. It was out if season so we found it difficult to find restaurants to eat but there seemed to be many there that were closed so I'm sure this wouldn't be an issue in the summer. Alicante city is only a short taxi drive away with many restaurants. Would definitely stay here again for a short break. ", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r558527039", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "This is completely horrendous ", "review": "The hotel is supposed to be a five star hotel. It is definitely not! Worn down and shabby, the breakfast is boring and the staff is completely clueless. Asked them to restart the router and they had NO clue!", "date": "December 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r550487069", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Annual Meeting", "review": "Hi Lena R!   Thanks for choosing to stay with us and sharing your experience1 I'm very sorry about the issues on our update, breakfast, and hotel staff's service. This is certainly not what our hotel strives for, nor is this our usual or our best. I reached out to you privately to discuss this further, and I look forward to your reply.  Once again, thanks for your feedback, and I hope we have the opportunity to show you an experience that aligns with the many 5-star reviews we receive every week.  Safe travels,   Gian M Case Manager IHGService", "date": "December 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r544809025", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Nice location ", "review": "We appreciate that this hotel is moving to a different chain of hotels in early 2018 but felt that the attitude of the staff and the overall appearance of the hotel was lacking.  We have visited this hotel once a year for the last 4 years.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r538174932", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "3 day break", "review": "Hello Gi m,  Thank you for staying with us and for leaving a review. I am happy that you are a regular here in the last 4 years. Please accept our sincerest apologies if we failed to make your stay more comfortable due to the condition of the hotel and the level of service. Your comments are highly valuable to us and will assist us in our continuous efforts to maintain and improve the service level we aim for. We are confident that necessary steps will be made, in order to achieve complete guest satisfaction.    Again, thank you for staying and we hope you give us another chance to show you how great our hotel is.    Best Regards,   John O  Case Manager  IHGService ", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r537915999", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Beach week with caz and Nic ", "review": "Me and naldo, caz and Nic booked a last minute beach break to San Juan playa and stayed at the Holiday inn. I would like to say a big thank you to Maria jòse in the hotel bar, great service, also a big thank you to the cleaning staff , our rooms were cleaned to perfection, however, I would not return , the hotel was tired, lacked charm, expensive but average breakfast buffet. If you do stay in this hotel don't book or take a room between 118 & around 129/30 these rooms overlook the service area, deliveries, refuse collection ect, on the other hand the terrace closes at 22.00 due to the fact that the rooms overlooking the pool bar area don't want any noisy guests disturbing them, understandably so, but in Spain most people are still eating dinner at this time, so slight conflict…", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r535491931", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Don't believe the bad reviews ", "review": "Dear nicholasandronald,  Thank you for your recent stay with us and reviewing our property. I am very pleased to know you liked the convenient location of our hotel in the area and the service you received from our staff. On the other hand, I am sorry you were not well satisfied with the condition of our facility and the discomfort you had due to the noise. We take our guest comments very seriously and always strive to provide comfortable and friendly accommodations. Your review will be used to consider improvements needed and we hope that you can give us a chance to show what we have done.  Thank you for staying and we hope you give us another chance to show you how great our hotel is.  Sincerely,  Anthony M Case Manager IHGService", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r534625697", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "This hotel is so Perfect", "review": "We stayed here for 9 night and never had a problem with anything.. We arrived at 12 at night and the receptionist was happy enough when booking us in.. Room as clean enough, we did ask for a double but we were expecting 2 singles pushed together.. Seems to b a standard thing now a days.. Towels changed daily.. Bed re made, bin emptyed everyday.. Cleaners always spoke on the passing.. Drinks fairly priced in bar, considering how much they pour you.. I was happy enough. We ate dinner 1 nite in hotel, fairly enjoyed it.. Also had lunch 1 day too.that was also great. Pool area is fine.. Not to busy and always a sun bed to be found.. Rooms are a bit dated, could do with a lick of paint and also carpets on corridor had a few stains. But so what, your not there to admire the walls or…", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r532920654", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Tired but close to beach", "review": "I am stayin as we speak now for 2 days(room 138) with a view over the swimmingpool and I cant say anyting bad about this Hotel( the outdoor place is perfect, The Staff is so kind and welcoming, spcecially the Staff at the bar/ restraurant, they just welcome you as a family, the room is big and clean, the only thing it might be an little frigde( if you are gonna stay for a week or so, but that did not affect my staying for theese 2 days, the locations is 100 procent brilliant, 10 min walk to the beach and Shops everywhere, I dont understand the complains here on the Tripadvisor because this is so good Hotel, I am giving them Full house and coming back for longer time🤗🤗🤗", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r532889696", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Fantastic stay", "review": "Never stayed at a Holiday Inn that needs upgrades more than this.  Great location not far from the beach but when we asked at the desk, was told it's 25 minutes away by bus ( 0 minute walk). They put us in a room over the entrance so all night long we heard the door open and close   Pool area was loud with no waiters working the area ", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r531264553", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Lovely area will stay there again", "review": "We needed a hotel that offered free parking and was reasonably priced and this hotel fitted the bill. It's classed as a 4 star hotel as there are business facilities, a restaurant and a decent pool but there was no fridge or tea/coffee making facilities so bring your own kettle! Lovely neighbourhood and nice and quiet with an easy stroll to the beach where there are bars and restaurants and a McDonalds.  The rooms are very large and spacious and the large bath was most welcome. Sachets of shower gel and shampoo are provided plus extra attached to the wall.  The staff are friendly and helpful and speak good english. If you have forgotten anything such as a toothbrush they will provide one for free.  The pool is nice and the enormous bed was very very comfortable Felt very safe…", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r531032694", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Need upgraded", "review": "The hotel looks nice from the outside but it definitely wasn't when we walked in. Definitely not a 4*. The reception is basic. The carpets old, the walls grabby, the rooms although clean, were very old and basic. Wallpaper peeling off the walls, ceiling fracked and stained, no mini fridge, no safe and old furniture. The bathroom had broken tiles and grout, the chrome taps were old and not longer shiny , the shower head was spraying water in all direction, the soap dispenser on wall was odd. We were there for a night only while driving somewhere else along the coast, the night staff were non interested either.  The room was in a basement and I had to listen during the whole night the air condition engines outside the back of the hotel every 5 minutes for about 10 seconds, the…", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r530978889", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Holiday Inn San Juan", "review": "Hi FAITHGLASGOW,  Thanks for sharing your thoughts and for choosing us for your lodging needs. Although it's nice that our exterior is to your liking, I'm sorry to hear that our accommodations did not meet your expectations. The overall upkeep, noise, and the staff's service level as detailed in your review is not the impression we'd like to leave any of our guests. Your feedback is appreciated and be assured that this has been shared with the team to ensure that we are on par.  Thanks again for bringing these to attention. Despite what transpired, I hope we get to welcome you back soon for a chance to make your next overnight better than the last.  Safe travels,  Jillian I Case Manager IHGService", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r530640148", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Disappointing first night, but slowly redeemed itself", "review": "Lovely pool area lots of sun beds, although towels were put out and then left for hours. No outdoor pool bar while we were there. Internet was hit and miss. Breakfast was very good and lots of choice, hot and cold. Hotel was very clean and comfy beds. Supermarket close by and loads of eateries, so we did not eat here at night. 10 min walk to a fab beach very clean. Tram stop close to hotel too. We all enjoyed our 3 night stay and would come back again.", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r530593120", "sub_review": {}, "travel_purpose": "", "rating": 2}, {"title": "The Holiday Inn with so much potential but lacks investment.", "review": "Upon arriving at the hotel we were told that there were no working lifts and weren’t offered any help from staff. The corridor leading to our room was unlit and we were made to feel like we’d been shoved in an empty part of the hotel. The room itself was spacious and nicely decorated, with plenty of storage. Much to our surprise the water ran yellow when we turned on the taps. We told reception, they were previously aware of the situation but failed to tell us about before our arrival. They didn’t offer us another room to shower after a long day of traveling. But simply showed us to a sink downstairs where we could brush our teeth. The situation the following day was much better, despite this I feel like we shouldn’t have had to pay for a room that wasn’t up to the expected…", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r530129900", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Not 4*", "review": "Booked in with my daughter on the 20th . Arrived late at night and the 2 reception ladies miserable.   The room was better than other reviews however massive dent on the bath and very rusty.  If you caught yourself on this you would need antibiotics and a tetanus jab .  The breakfast for the hot food chopped up hot dog sausages and cold bacon  . For a 4 star I find this shocking .  Would be nice if your maids would knock on before they actualy walked in .  The last morning my taxi was collecting us at 8am . The breakfast was running ten mins late then she tried charging us for breakfast when I had already paid in advance . Had less than 15 mins to eat breakfast.   The only positive about this hotel is the location.   Would I stay again? Absolutely not !! ", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r527025031", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Dated and past its best", "review": "Hello michelle s,  Thank you for taking time to share your experience with us. I am happy that our location worked for your travel needs. However, I am sorry to hear that you did not fully enjoy your time in our hotel. We take comments such as these seriously and would like to follow up with you. I have sent you a private message in an effort to obtain more information.      I look forward to hearing back from you very soon.    Best Regards,    John O  Case Manager  IHGService ", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r525634516", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Outdated", "review": "Although this hotel is in a great location it is now showing it's age.  Breakfast was fine and staff were friendly enough but this is NOT a 4 star hotel any more.  We stayed last year and came back again this year in the hope that some improvements had been made but no, it was worse. Only one socket in the room and no tea/coffee making facilities.  Sorry guys but we will be looking elsewhere from now on.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r525490876", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Late summer holiday in Alicante, Spain", "review": "Hello John H,   Thank you for your feedback regarding your stay at Holiday Inn Alicante - Playa de San Juan, Spain. We take our guest comments very seriously and always strive to provide comfortable and friendly accommodations. We appreciate that you find our location to be convenient and your nice comment about breakfast.  However, on behalf of the hotel, I'm sorry we fell below your expectation regarding the room condition and the property being dated. We will look into these concerns. We take all reviews positive and negative very seriously, and your feedback will help us improve for our next guest or your next visit.    Sincerely,    Orlando   Case Manager  IHGService ", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r524829020", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Tired old hotel, surly service", "review": "As this hotel is for sale , maintenance is not a priority anymore. Carpets don’t look new  bathrooms could use updates , however rooms were kept very clean. Breakfast in the room was at a different price  than advertised, but got adjusted when we complained about it. If you didn’t want the full  buffet breakfast  an option was promoted to get a coffee and a bun at a the bar for a small fee, however, this option,turned out, was not for the summer months, and we only found out afterwards", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r523317338", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Great location and restful stay", "review": "Very nice, reasonably priced hotel.  Nice big room in the tower.  Beds were pretty new and mattresses very firm.... could do with a mattress topper.  Pool area relaxed and great pool bar.  Staff very friendly.  ", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r523072161", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "August vacation at Playa San Juan", "review": "Dear Loll. Thank you very much for your candid review and for staying with us. We appreciate your positive feedback. I am pleased to hear from you that your stay was nice, specially that you enjoyed with our staff and pool areas. Thanks again and I look forward to see you soon. Regards.", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r520990359", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Should not be a 4star hotel", "review": "This hotel is fine but I can maybe understand why people complain. Much will depend on which room you get. I think the worst ones are on the ground floor between reception and the lift. These are the ones with the old style TV’s and there will be people walking past all the time so they certainly won’t be calm. At peak times, like breakfast it must be a real pain.   Try and get a room on the higher floors.   Talking about breakfast, this is probably the worst aspect of this hotel. Not the food, it’s great, but the long wait each morning trying to get into the restaurant. There’s not enough space for everyone and this results in a wait for tables to become available. Once you’re eventually seated, there will be another long queue to toast your bread and the chances are there will…", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r520326867", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 1}, {"title": "Very welcoming.", "review": "Dear davewG6580TQ. Thank you for your candid review and for staying with us. We appreciate all feedback, both positive and constructive. I'm sorry to see that your stay had been less than ideal due to the hotel conditions and breakfast queue, which were below your expectations. I apologize for your disappointment and for any inconvenience this may have caused you. I would like to inform you that we will began with a remodelation soon so, we would love nothing more than to welcome you back and deliver an experience you'll be sure to remember. Regards.", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r520300961", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Mixed feelings", "review": "Pretty dated hotel, mould on walls, I haven't seen a TV like this for almost 15years and only 6 channels work. And they call this a 4 star hotel has more in common with a Spanish pension. 10 min walk to the beach, staff pleasant and let down by the building. I would say not worth the money the 3stars near hear beat it hands down. ", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r520221343", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Hotel near to beach", "review": "Hotel is in good condition. Cleaning room service were working fine. Breakfast menu was excellent. Service at hotel restaurant was excellent and friendly. Reception service is good. Could be little more informative about links for public transports as local people can't speak much English but helpful and friendly. Bus goes to Alicante city from next to hotel and you can take another bus from Alicante city to Airport or vice a versa. Walking distance to beach in San Juan. Clean and log beach. Nice and not expensive, some cheap small restaurants next to beach. Even nice for evening walking or jogging.", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r513096563", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Short holiday with my family", "review": "Dear Mahesh P. Thank you for your booking at Holiday Inn Alicante – Playa de San Juan and thank you for taking the time to write a review about your stay with us. We are happy to know that you liked our location, staff, food and services. We find fulfillment in meeting our guests' needs. Thanks again and I look forward to hear from you! Regards. ", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r511562362", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Would everybody please chill about this place - can't understand so many negative reviews!", "review": "If you have a family with more than four members then make sure to arrange a minibus to pick you up as taxis only take a minimum of four passengers per vehicle! Unlucky for me our transfer bus was cancelled at the last minute so had to get two taxis.Hotel reception welcomed us nicely regarding the time, brilliant night staff on duty went out of their ways to help over our stay! Breakfast buffet also brilliant variety to choose from. We all loved the hotel pool aswel, nice atmosphere. Local kebab house (Fontana kebab and pizza) saved our life as it was the only HALAL eatery in the area! Visited twice a day even tho there was plenty of supermarkets LOL.Beach was approximately 10 minute walk from the hotel and I was impressed how nice it was!Hotel rooms were a bit outdated but hey…", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r510664748", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Drive home", "review": "Dear Jia U. Thank you very much for your candid review and for staying with us. We appreciate all feedback, both positive and constructive. I am pleased to hear from you that your stay was nice, specially that you enjoyed with our staff, food, and pool area. We hope begin with a reform soon to improve our facilities, so we hope to see you again soon. Regards. ", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r510558115", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great stay", "review": "Stayed here three nights at the end of July with partner and our two children.The holiday Inn Playa San Juan is a 70's beach hotel that could do with a facelift, carpets in common areas are really worn and the pastel tones are a bit Falcon Crest. Front desk staff could smile a bit more and they should put fridges in rooms. Having no one to help you with whole family luggage and be told to get the trolley and suit yourself when there are 4 people behind the desk is simply not acceptable in a four star property.Dismal music selection on repeat at the pool.That's it. This is were negatives stop. I just can't understand some people's comments; have you not seen the pictures before booking? Have you looked at your bill? Seriously, were you expecting the St. Regis?  Now with the…", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r508724254", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Shocked......", "review": "Currently staying in our 4th Hotel in the last 5 days of 6 night property search fact find and have stayed in 1x2star, 1x3star and this is our 2nd 4 star, however this should not be as the room is poor with a TV from the 80's a light connected to the mains and exposed, zero toiletries in the room but a lovely little note telling me to ask for some if I want them. A shower/bath mixer that throws the water out of both and neither can be turned off. We are on the 1st floor and when we finally left the room for evening meal my wife nearly wiped herself out when she tripped on an uneven floor with loose carpet tiles. Evening meal for two took approx 20 minutes to complete as after we had our starter the main came as clearing the first and the desert came while the boss had her main…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r508183278", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Mrs Jane Bryenton ", "review": "Dear Mark M. Thank you for your booking at Holiday Inn Alicante – Playa de San Juan and please accept our sincerest apologies for the inconveniences you have experienced during your stay due to the hotel conditions and service offered.  It is our goal to consistently provide superior service and accommodations at our hotel and your comments are very important to us. I would like to inform you that we will began with a remodelation soon so, we do hope to have the opportunity to welcome you back in the future, so that we can provide a better experience.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r507316615", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Good value and relaxing", "review": "This is my fourth visit to the holiday Inn. I love the area . I have found all the staff excellent & very friendly on all my visits . The restaurant is excellent for breakfast & dinner . Lovely pool (although a little busy in school hols)with a lifeguard present ! I do feel however that you need more sunbeds & also where are the cushions (the sunbeds were not very comfortable)I decided to go & sit on the beach which was  cooler plus charged 12euros for 2 beds & an umbrella. The rooms are lovely I stayed in 144 overlooking the pool but would benefit from coffee making facilities plus a fridge (but this would put the price up ) The televisions are dated but who watches tele on hols . This is a lovely hotel with great staff . Needs a bit updating but it would then be more expensive…", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r504424713", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "We liked it ", "review": "Dear Mrs. Jane Bryeton. Thank you very much for your candid review and for staying with us. We appreciate all feedback, both positive and constructive. I am pleased to hear from you that your stay was excellent, specially that you enjoyed with our staff, food, pool and rooms. We hope begin with a reform soon to improve our facilities. See you on March dear friend! Regards.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r503600244", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Nice and Clean Hotel", "review": "Hotel is situated in a residential area about a 10 minute walk from the sea front. Younger couples may want a location that has more night life and bars. Rooms are a bit dated, however they are clean and have all you require. They will also provide items of toiletries if you have forgotten to pack them. TV's are old and there are no fridges in the rooms. There is air conditioning and Wifi, although it will not connect in the rooms, you have to go to the reception areas. Breakfast buffet is good, plenty of choice and continually topped up till end of service. Staff are effiecent if somewhat lacking in charisma. Pool area is good and not too busy, wish they would get some more music tapes as they played the same ones continually all day EVERY day.Alliin all good value and…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r501502364", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Rather tired but fairly comfortable hotel", "review": "The hotel has lots of resources like business meeting rooms and indoor fitness and health facilities and the staff are very accommodating but the hotel needs some updating: e.g. New carpets in common places and bathroom and bed renewals.  The menu is very limited and breakfasts are standard.   There is not a great choice of eateries around and about but buses to Alicante are frequent and bus stops are a short walk from the hotel.  A golf course is not far away.  The beach, a 10-15 minute walk away is lovely but many of the bars and cafe's restaurants along the sea front are not that inviting, Fast food is common and the quality of food available locally is nothing to shout about", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r500945706", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Quick break", "review": "Hi Margaret J,  Thank you for your candid review, highlighting not only the bad but also the good points of your stay. We are always grateful when a guest takes the time and effort to acknowledge our staff. I am delighted to hear you found our location convenient and our hotel comfortable. On the other hand, I apologize we fell short of your expectations, particularly with the breakfast menu and the general upkeep of our hotel. I want to thank you for bringing your observations to our attention. We utilize all comments for improvement of our product and services and will continue to work towards the highest standards for our guests.   Again, many thanks for the feedback and for staying with us. I hope that you will consider us again if your travels bring you back to our area. Have a wonderful day!   Sincerely,  Connie D Case Manager IHGService", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r497685538", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Overall a good hotel, but with a serious need of some tech updating", "review": "Staff rude and unhelpful especially on reception,Bar staff nowhere to be seen,Housekeeping very good as was the pool bar lady and the lifeguard,Beach lovely but restaurants pricey for portion size,Drinks prices reasonable.Would not go back to this hotel or area again.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r496508122", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Little Gem of a Place", "review": "Hi lellie251,  Thank you for your candid review and for staying with us. We appreciate all feedback, both positive and constructive. I'm sorry to see that your stay had been less than ideal due to the service you received from some of our staff, which were below your expectations. I apologize for your disappointment and for any inconvenience this may have caused you. It is our goal to consistently provide superior service and accommodations at our hotel and your comments are very important to us. Please be assured that your feedback will be forwarded to the management team to ensure our valued guests' needs and expectations are met in the future.  Again, many thanks for the feedback and for staying with us. Should your travels bring you back to the area, we would love nothing more than to welcome you back and deliver an experience you'll be sure to remember.   Sincerely,  Connie D Case Manager IHGService", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r495824041", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good location but in need of some renovation.", "review": "Enjoyed my stay.. it was nice, quiet, and comfortable. Staff was helpful, and they do keep it quite clean. I was pleased that the air conditioning worked well -- something not common in many European hotels, where many don't seem to appreciate that we Americans love our air conditioning in the summer.  Also pleased that while they didn't have any readily available ice machines, (another thing we Americans are used to in hotels), the front desk staff was VERY willing to fetch and fill a bucket of ice cubes from the kitchen.. nice touch.  Parking very convenient and at no charge.  My only two complaints: NO Wifi in the rooms... common areas only.  This is pretty pathetic for a 4 star (or really any star) hotel.....especially one that carries such a well-known brand name like…", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r495687089", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "GREAT LOCATION, GREAT NIGHTS SLEEP, GREAT STAFF, GREAT RELAXING TIME", "review": "Ok so the decor was a bit tired, but i expected that for the price paid But ......... The Location was great beds lovely and comfy air con worked fine black out curtains kept early morning sunshine out staff helpful and friendly maid service fine and friendly plenty of choice for breakfast. That's all we needed for a relaxing time.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r494665589", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Relaxing family break", "review": "Just finished a very enjoyable 7 night stay at this hotel. Much better than the reviews on here suggest.   We stayed on the 4th floor and our room was excellent. Big room that suited two adults and one child. Had a large double and a large sofa bed which was made up for us.  Large bathroom. Air con. Room safe. Room cleaned well each day.   Hotel facilities were excellent. We spent a lot of time at the outdoor pool. Good sun spot and never too busy.   Wifi was good in our room and the common areas. Including at the pool.   All staff in hotel friendly and polite except one. More on that later.   Only had breakfast in hotel which was good so cannot comment on lunch and dinner.   Hotel in a great location 10 minutes walk from beach and all the bars and restaurants. Supermarket 5…", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r491751926", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Good and very bad", "review": "Just spent a weekend break at this hotel. Good points first. Location 10 mins taxi ride from the airport. 400 metres to the most beautiful beach. Hotel staff very help full. Food and breakfast good. San Juan very Spanish feel. Great for relaxing. Alicante Marina ten minutes taxi ride 15 euros. ** bad points, the hotel is not a 4 star. Needs updating, carpets etc. ** The room was stinking disgustingly of cigarette smoke which made you feel sick. We had to spray the whole room with  every we had, after shave deodorant perfume fresh air spray and leave the windows open. The other strange bad point was that the pool does not open until 10 am daily?? Would i use this hotel, no! I would go back to the resort though, but book a bigger 4 or 5 star hotel.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r488604731", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "great base to explore", "review": "Hi seanflanagan423,  Thank you for taking the time to share your recent experience at our hotel. While we are pleased with your kind regards toward the level of service rendered by our hotel staff members including our location serving its purpose for your travel needs, it is regrettable that the overall cleanliness of our property may have fallen below your expectations and for the pool's hour of operation, which you found unfitting. Please allow me to apologize for any inconvenience this may have caused you. Rest assured, we take our guest's comments very seriously and always strive to provide a wonderful stay. I have faith in our hotel that they will continue to do their best to improve our amenities and services.  Once again, thank you for sharing your feedback. I truly hope that we will have a chance to make it up to you and provide you with a better stay in the future.  Sincerely,  Alvin M. Case Manager IHGService ", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r485901738", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Not a four star", "review": "After reading the hotel reviews i was a little concerned as to what we would find on our stay . We were two couples who loved our stay here and would def stay here again ..The first plus was the staff they were so friendly and helpful and could not do enough for you , nothing was too much trouble and they were working none stop . We had the continental breakfast which was a lovely fresh toasted roll with jam and butter with fresh coffee and freshly squeezed orange juice and all for 5 euros each  , the full continental looked good as well . One could have a three course evening meal which we do on two nights up to 11pm and it was brilliant for 15 euros each not inc drinks and the standard of food was lovely . All area,s including the pool was spotless  and it was a lovely pool to…", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r485651690", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great value, quiet rooms and a fabulous pool area", "review": "This is a classic, old-style Holiday Inn. The rooms are a little dated but very comfortable and quiet - we slept extremely well. It's only 10 minutes walk to lovely San Juan Beach and loads of restaurants, bars and shops. It also has an excellent pool area with a bar alongside, perfect for sunny afternoons when you're footsore from exploring. It's basic but great at the same time - I would go back definitely.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r485200235", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Enjoyable Stay", "review": "My wife and I stayed here for 7 nights and were a little apprehensive after reading some of the reports. However, we needn't have been so worried. Although there is no doubt that some aspects of the hotel would undoubtedly be improved by some new decoration, the overall standard of the hotel is fine.  The room was large, clean and more than adequate. Bathroom fittings are a bit dated and we did have a problem with the toilet, where the cistern would not fill and continually ran water.  After reporting it to reception, we were immediately offered another room nearby which was fine. Our room was on the 2nd floor and we were very happy with this, however we were glad we didn't have one of the rooms on the ground floor between reception and the lift as nearly every guest in the rest…", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r483476486", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good location", "review": "I visited this week for  2 nights . The hotel is a very old style holiday inn . If you like the new plastic look then this hotel is not for you . The hotel was clean and the rooms were cleaned to a high standard both days I visited . Wifi is free if your are a ihg member . The internet in some upstairs area isn't great . The bar , restaurant and foyer area and by reception is reliable and quick The pool area is a lovely sun trap and is close to the bar 👍 Staff are welcoming and polite . The language barrier can be a problem at times but they go out of the wat to assist. Food and drink prices are hotel prices . More expensive than near by restaurants and bars. If you are travelling into Alicante airport, the bus is a great option for 11 Euro return  The bus stop is less than 4…", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r481812953", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "If what you are looking for is to sleep, this isnt your place!", "review": "I got to this hotel and they placed me on the ground floor. Normal room, a bit date but it was ok.   After couple of hours in the room i had a problem with the noise coming from one of the room next to mine. I complained to the guys at reception and they changed me to another bedroom. This one right above the swimming pool area which has all the noise of that area till 10.   I was shattered, but I waited till 10 to go to sleep as it was impossible before and at 10:15 i ranged reception to asked them when they were going to shut the swimming pool. They closed it after my call. To my surprised, noise was still happening now from outside my room.   Right outside my room two guys with a bottle of alcohol drinking on the sofas and having the time of their lives. I rang reception…", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r481809667", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 1}, {"title": "Last minute holiday", "review": "Hello Maragon27,  Thank you for posting a review about your recent stay with the Holiday Inn Alicante - Playa de San Juan, Spain. It sounds like we fell below your expectations, particularly with noise control. I'm sorry that you weren't able to rest during your visit. We take all reviews very seriously, and I would like the chance to look into this for you. I have sent you a private message to gather more information about your stay.  I have recorded your feedback on corporate level to help evaluate the property and our hotel management will also be alerted to improve soundproofing. It's good to know that you found the food selection at the restaurant pleasing. We find fulfillment in meeting our guests' needs.    Thanks again and I look forward to hear from you!  Best,   Anna B Case Manager IHGService", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r481659730", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Excellent base", "review": "Just returned from an amazing week at this hotel in Playa San Juan. We didn't read the reviews before we booked - thank goodness !! I have to wonder if these people stayed at the same hotel ! Staff were very helpful, the hotel was clean (and I'm quite fussy), great bar area. We didn't eat in the restaurant as we preferred to eat along the sea front. The hotel is within easy walking distance of bars, shops, restaurants, the tram and of course the beach - what more could you want ? We had lovely days out on the tram to Benidorm, Alicante and LA Vila for next to nothing. Stayed in room 511 - top floor. Big room and very quiet (email ahead) The weather was fantastic which helped but we can't wait to return.", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r477150514", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Don't let bad reviews put you off...", "review": "Just returned from a 3 night stay (15-18 April) at Holiday Inn Alicante with my husband. Firstly, please don't let bad reviews put you off- if you're looking for a luxury 4* hotel, this is not the hotel for you. However, if you're looking for a fairly inexpensive hotel close to the beach to use as a base to explore the beautiful region of Alicante, then this might be the place for you.   Positives: friendly English speaking staff, nice pool area, fairly cheap food and drink prices, free parking, 10 minute walk from a stunning beach, good transport links (number 21 bus to Alicante town right outside hotel and tram is a 5 min walk), early check in (we were allowed to check in at 1pm although official check in is 4pm), late check out at 12pm (and also option to extend check out til…", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r476914882", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Very bad internet, run down, not very clean", "review": "Dear Nicky B,  Thank you for taking the time to write a review about your stay with us. We are happy to know that you liked our location and we certainly appreciate your nice feedback on our staff. On the other hand, we would like to apologize for the inconvenience caused by other guests during your visit, and for not living up to your expectations regarding our room amenities and internet connection. Reviews like yours are very valuable as they enable us to target areas we need to improve on. Rest assured your feedback will be forwarded to all concerned departments for future reference.  We value you as our guest and hope to accommodate you again for a chance to provide you with a much better experience.  Sincerely,  Joel A Case Manager IHGService", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r475473338", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Desperately needs upgrading", "review": "Holiday Inn should meet certain standards. This hotel does not. While it is well situated and staff is - for European standards - friendly and the meals reasonably good, the hotel is totally run down and needs urgently some refurbishing. Rost in the bathroom, curtains and carpets with holes, no fonctioning wi fi (internet), old furniture, not very well equipped etc.etc. When your only interest is to have a hotel close to the beach: OK. If you want a hotel which is worth this name: stay away...", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r471461035", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Dirty old hotel but good staff", "review": "Dear Harald W,   Thank you so much for your candor about your stay. We work hard to deliver exceptional guest experience, and it is apparent that we fell short with regards to the cleanliness of your room, intermittent Internet connection, and our hotel aesthetics. Although it was not the happy and comforting experience we were hoping to provide you, I certainly appreciate your kind words for our hotel staff and prime location. I would like to assure you that we pay careful attention to feedback such as you have provided, taking immediate steps to correct any deficiencies. I'm grateful to you for choosing to stay with us. I hope you will consider giving us another chance in the future to demonstrate our commitment to satisfaction in all areas of the guest experience.  Warmest Regards,   Gian M Case Manager IHGService", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r460824246", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "IMPROVEMENT DESPERATELY NEEDED!! ", "review": "On arrival we were greeted by the reception lady who couldn't have been more displeased to see us. After demanding our passports she pointed the way to our room. After what seemed like a very long trip we couldn't wait to just lay down for 30mins. On opening the door we walked in to 1970. Everything is outdated from the furniture/decor and even the TV. Mould on the walls is covered up by the wallpaper that is peeling off and the plug holes in the bathroom are extremely dirty. Now I know it's a Holiday Inn so I wasn't expecting the world... however it's apparently a 4 star. The communal areas are clean and look more modern. I wouldn't stay here again even if it were free!  ", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r459169879", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "NO Free Tea or Coffee", "review": "Dear David B,  Thank you for your stay and for posting a review on TripAdvisor. Your feedback is extremely important as this will help us to achieve our mission to provide the perfect guest experience.  It is nice to hear that you were satisfied with the cleanliness of our stylish communal area. However, I sincerely apologize for the issues you experienced particularly with the service provided by one of our staff during your check-in and if you found the amenities in your room to be over the hill. Also, my apologies for the upkeep of the bathroom. I have taken note of your valuable comments and will use these to monitor and improve the quality of services and amenities we offer to our guests.    Once again, thank you for your valued feedback. We look forward to having the opportunity of welcoming you back and provide you a better stay here at the Holiday Inn Alicante - Playa de San Juan, Spain.  Kind Regards,   Dhang R. Case Manager IHG Service", "date": "January 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r456114637", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "A lot to improve ", "review": "Pool is outside and not heated.  So if you are travelling in Winter you cannot use the  pool.  Gym is very outdated.  They don't provide free tea or coffee, stayed few times in budget hotels and they provide free Tea and Coffee.  Resturant staff is not very helpful or polite.  Menu is in spanish. Best to eat out.", "date": "January 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r454574619", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Ok", "review": "Hi Wilson G,  Thank you for posting a candid feedback from your recent stay with us. I was concerned to see that you were not impressed with our property particularly with the pool, fitness center, and restaurant among the others. I would like to apologize for any inconvenience these issues may have caused you during your stay. Rest assured, your comments will be shared with our management team to properly address your concerns.    Again, thank you for the review and I hope that you would still consider staying with us again in the future.    Regards,    Mike F. Case Manager  IHGService", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r454433567", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Value for money", "review": "Well, don't know how to rate without being rude. This hotel has their good things: location, rate (winter), parking (important here), internet not bad. Anyway when considering stay here must be aware the hotel is old, needing a lot of work: wallpaper to be replaced (or fixed), not much electrical connections, etc. Breakfast is poor. Staff isn't courteous (unfortunately a problem as many other in Spain).", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r448886992", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Standard.", "review": "This hotel was nice and clean, a typical holiday inn. Although the staff are not very helpful, and the restaurant inside doesn't have much choice or even nice food. The food around the hotel is horrible. I tried about 10 different restaurants and the food was awful in them all. As far as entertainment and things to do there isn't really anything. The beach is nice. We ended up taking the tram to Benidorm which took over an hour but was a lot better than Alicante. ", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r446743802", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Old, but cheap, with horrible food", "review": "Hi Bethanymags,   Thanks for choosing Holiday Inn Alicante - Playa de San Juan, Spain and for leaving feedback.   I appreciate your comments about the hotel's upkeep and I am pleased that your overall stay was satisfactory.   It is unsettling to read that your expectations with the restaurant was not met because of the food options and that you found limited activities in the vicinity. I will be forwarding your review to our hotel's management so that these areas can be given attention.   I am hoping that you will visit Holiday Inn again despite this experience.   Kind Regards,   Anna B.  Case Manager IHGService", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r444101133", "sub_review": {}, "travel_purpose": "", "rating": 2}, {"title": "Annual meeting", "review": "The upside to the hotel is the price. For a hotel with swimming-pool & sauna, 400 meters from the beach only, for €49 per night... the price is low, hence I gave it 2 stars instead of the 1 star it actually deserved if the price was higher. The hotel looks & smells like nothing changed since the 80's, stains on the carpet in the hallways, noisy, and worn interior. I feel the springs in the (bouncy) bed, the tv is tiny, interior worn... and then came the worst: the food in the restaurant was the worst I ever had ! Besides the fact that I can't believe there's restaurants that still serve foie gras (which they shouldn't !), I left most of the plates un-touched, both the starter & the main. The mushrooms in the starter were so salty, chewy & overdone that I actually spat it back in…", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r437759915", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "How not to run a Hotel", "review": "Dear Onderdijk,  Thanks for providing time to leave feedback about your recent visit. Making your stay a complete success is our goal and with that in mind, I regret to learn that we fell short of your expectations as you were let down by the overall upkeep of your assigned room and bedding condition and that the food options at the restaurant were not to your liking. Though I would prefer that you have had a more pleasant experience, I appreciate your candor in writing your review. Comments like yours are taken seriously and will be relayed to the management to address areas that need further improvements.  I value you as an IHG Rewards Club Spire Elite member and I am hopeful that you give us another chance to host you again should you return to the area so we may show you that we can be better.  Safe travels,  Jillian I Case Manager IHGService", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r437382206", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 1}, {"title": "average hotel", "review": "This hotel is chosen because it has meeting rooms and a separate area for dining.  It is used mainly on the Saturday for the meeting but many couples go to the hotel for the weekend.  The men have their meeting and the ladies go shopping in Alicante", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r436770876", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Pleasant ", "review": "A nice quite hotel ,the family room was good size but the decor and fittings were a bit tired .The staffs understanding of English was poor .The hotel seemed to be quite short staffed .the food we had was good and reasonably price but the drinks were expensive and the bar was not maned at all times .Parking was available and secure.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r433671059", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Very relaxed", "review": "We have stopped here over the years on many occasions and found this hotel ticked the box. On a positive observation for the owners we noticed that the corridor carpet was looking rather tired and in need of a upgrade. We was stopping in the lower ground floor, and found this very dark. The bedroom was in need of a upgrade as the room was very dark and In need of a paint job. As for the fact that there was no wi fi not good.  After a few days we request that we be moved and was put on the 4th floor with wi fi.  Overall we love the this hotel  and the staff here and we'll be back again.😊", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r433427081", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Staff cant keep covering for this hotel", "review": "Dear Dalton P,  It is always encouraging to hear feedback from frequent guests like yourself. We apologize that you found our hotel amenities below your expectations particularly the Wifi and lighting condition in the initial room assigned.   On a lighter note, it is good to know that you are pleased with how our hotel staff handled your concerns and we are excited to welcome you back soon!  Sincerely,  Danelle A Case Manager IHGService ", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r430899423", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very Very Disappointed ", "review": "2nd visit to this hotel, chose as great value for money. I don’t know how much longer the staff can cover for the awful state of the décor inside this hotel. The carpets tiles are all faded, stained and patchy. The room décor needs a complete refit – the wardrobe doors did not work, there were no net curtains at anybody’s windows (the rail was there!) The wheels on the bed make sitting up in bed impossible as there is no headboard, so you just push away from the wall and end up with a big gap. The room was fantastically clean and the towels and bed linen were good quality. There was only one power point and this was under the desk, which was very difficult to access – impossible probably for someone with a disability. No fridge ( but there had been at some point!) Whilst here…", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r430811736", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 1}, {"title": "Disappointed/Dirty", "review": "Where to begin ! I was quite taken back when I visited this hotel on the outside I looked like it ticked all the boxes I was pretty impressed after all I'd been travelling for a few days visiting friends so was in need of a holiday inn 5 star treatment. How wrong could I have been first impressions rude receptionist ! Quite clearly on my booking I ticked the box double bed non smoking etc. What I actually got was totally  the opposite 2 singles ( smoking) absolutely stink to high heaven. So back I went to ask for what I originally booked I was told quite abruptly \" we cannot guarantee a double bed or non smoking room\"  eventually I was given a room my of my choice why they didn't do that in first place I don't know. Maybe I was important enough ! So eventually got to the room…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r428185681", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Great Location .. and hotel", "review": "Stayed here on my points earned as ihg staff member. Hotel is spotless. Staff very friendly.. lovely pool. Great menu. Location perfect. San juan beach and restaurants all amazing. Great if you speak Spanish as is not very touristy.. Al oleo great tapas and Los packs great menu and food. Bowie pop moments and texaco lovely staff and always open late.. defiantly will return here. We had a ball !! Muchas Gracias a todos Los empleados todos muy amables .. Seguro que volvemos pronto ☺", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r427157628", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "No internet in the rooms, bathroom dirty downstairs", "review": "No, it`s not a bad place. Especially since we reserved cheap! Friendly staff, decent pool, but for some reason the outdoor bar was not open. But here`s the shocker: Wi-Fi does not reach the rooms. This was a not a technical glitch so I was told, no; this is the way it`s meant to be!? Welcome to the 90`s? Around the pool and in the reception area there`s Wi-Fi and otherwise in some of the alleyways you can catch it too. Very strange. The general bathroom downstairs was very dirty too. But it`s a decent room and ample parking! The TV channel selection was limited, but it included some international channels.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r426166838", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Needs some TLC ", "review": "Dear JuRut,  Thank you for the sharing your experience with us and for choosing our property for your travel needs. I appreciate the kind remarks towards our friendly staff, parking area, room accommodation and hotel pool. I do however regret that we were unable to meet your expectations with our WIFI service, cleanliness of the bathroom. Your comments have been taken very seriously and have been shared with the Management Team, in order to help us improve further the service and products that we have to offer.   Again, thank you for your valuable feedback. We hope that you will give us another opportunity to serve you should your travels bring you back our way.  Sincerely,    Zelyn N. Case Manager  IHGService", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r424794625", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "I've stayed in many Holiday Inns and this one was disappointing. Misleading room/service\\hotel description.", "review": "Location was good as it was 5-10 minute walk down to the beach. Bus to town was across the road from the hotel, and the same for on the way back, always took the 21 to and from Alicante town, only €1.45 for a single ticket! Staff was friendly and enjoyed our attempts at speaking Spanish! Dinner was lovely - priced at €15 for 3 course meal, the breakfast wasn't tempting so always went to the restaurants by the beach. Restaurant staff, Llando (lovely blonde girl with long hair) and Domingo, really attentive and lovely! Took the tram to Benidorm (from Luceros in the town centre to Benidorm) for the day to see what it was like, took an hour and tickets were about €12 euros for two returns.   However, the decor was dated and needed some work. The carpets were visibly stained,…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r422793607", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Inexistent customer service. Rude and unprofessional reception staff", "review": "Dear pradalovestotravelx,  Thank you for your recent stay and for taking the time to write us a review. We take our guest comments very seriously and always strive to provide comfortable and friendly accommodations. I am pleased you regarded our location to be good and staff friendly. On the other hand, we are very sorry you did not experience an exemplary hotel stay with regard to the stains in the carpet and issues with the room amenities to be a let down. We highly appreciate your feedback and I will be forwarding this to management since this is our best resource for improvements and achieving superior guest satisfaction.   We look forward to serving you again in the future and see the improvements made.   Sincerely,    Dianne L.  Case Manager  IHGService", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r422105755", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 1}, {"title": "Good value and location", "review": "A good location for San Juan beach (10 minute walk) and a quiet area out of season. Lots of eating places along the beach and in the shopping area (about 10 minutes away).  The breakfast buffet is a bit limited so go out if it's not included.  There's only 1 public internet terminal wth no printer so reception have to print things for you like airline boarding passes. Don't know what the wifi is like.  I've stayed several times and the rooms need some maintenance especially the bathrooms (discoloured tiles, etc). The beds are on wheels and can slide about sometimes.  The hotel is near a supermarket and tram stop (Hollanda). The tram system is excellent and goes north to Benidorm (about an hour) and Denia further up the coast.", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r421667254", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "We'd actually give it 4.5 stars!!!", "review": "Dear jenny0198,  Thank you so much for staying with us and for taking the time to leave us your feedback. I am pleased to know that you liked our location and our property of good value. Your review is vital for improving the service and quality we offer to our valued guest. It is always hugely motivating when one takes the time and trouble to acknowledge and give points for improvement on our hotel rooms and breakfast options. This feedback will be shared with the appropriate people that can help us make a difference to ensure our valued guests' needs and expectations are met in the future.   Thank you once again for your valuable comment, and if you might have any suggestions that will contribute to enhancing your stay, please do not hesitate to contact us.  Sincerely,  Krysllin G. Case Manager IHGService", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r420997499", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Ideal location only 10 minutes from the beach and restaurants.", "review": "We have stayed here multiple times and really like the hotel & location.  Good Location is fantastic near fantastic beach. Public transport is easy & inexpensive. Hotel is super-clean. My wife is a \"clean-freak\" - She approves - praise indeed!! All the staff are friendly and speak some English - although at least attempting some Spanish is usually appreciated. Rates are usually quite affordable and offer excellent value. Breakfast is good. Early check-in is often available. AirCon although a little old looking - seems to do the job OK.  OK for us but some may not agree Some pool loungers are a bit flimsy although not sure why anybody wouldn't go to the beautiful beach which is not too far away. Decor is a little dated in rooms - Some of the carpets in the hallways are a tiny bit…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r420046617", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Hardly a Holiday Inn  -don't expect any service -just  a shrug when things go wrong!", "review": "Not a 4 star hotel in my opinion but met our needs OK. Would have liked tea/coffee making facility in the room.  Excellent choices for breakfast. Cannot comment on the evening meals as we ate out every night. Pool was clean and safe and the staff were helpful.    We used the Tram/train to get about, dead easy to use and very cheap.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r418639444", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 1}, {"title": "Very clean and ideal hotel, only 10 minutes walking to beach and restaurants", "review": "Dear Mr. John  Thank you for contacting the Holiday Inn Alicante Playa de San Juan regarding your experience during your recent stay. The feedback we receive from our valued guests, like you, enables us to target problem areas, We welcome any opportunity to improve.  Thanks a lot for your words, we appreciate you taking the time to share your comments with us. It has been a real pleasure to have you in our hotel.  I will communicate these words to all our hotel´s employees.  Once again, we appreciate you taking the time to share your comments with us.  Best regards. ", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r416732376", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "No where near a four star!", "review": "Lovely environment especially for Children or Family - within city reach,close to the famous San Juan beach,within lovely residential area,nice breakfast,fast check in and check out,staff are friendly and helpful.   Flooring is completely out of touch need replacement,Internet is crap,the tennis court is chargeable to your room,the holiday should be 2 star rated until fully renovated and refurbished.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r416634376", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Clean and budgeted. Overall an average experience.", "review": "Dear ademolao180,  Thank you for taking the time to write a review about your stay. I'm glad that you found our hotel location convenient, and I'm happy to hear you had a pleasant check-in. I do apologize if you were not able to fully enjoy your visit, and for the shortcomings you have experienced with the overall condition at the hotel. We have taken note of your feedback and will be used to focus on improving guest satisfaction. We look forward to serving you again so we can show you how we are continuously improving.  Sincerely,  Tracy V. Case Manager IHGService", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r414868077", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Short sunny brake in Costa Blanca", "review": "The room was good. Definitely, the interior need renovation. Overall you get value for money. We had stayed there for 7 nights and hadn't included breakfast in our package. Though we tried the breakfast and it was really expensive. Euro 25 for two person. At the nearby beach you have plenty of restaurants and you can get breakfast for 4-5 Euros per person. Most of the staff is friendly and courteous except the restaurant staff. Lady on the bar is super rude and would make you feel as if you are not a customer but a beggar asking for free meal may be!! Complete turn off. One of the reasons you would never like to go to the restaurant.Also, the menu options are limited in comparison to what is offered by restaurants nearby. Pool is nice but pool side beds are super uncomfortable…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r414104929", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "An Ignored Hotel Guest", "review": "Dear latikaraja87,  We appreciate you taking the time to share your feedback regarding your stay with us. We give the utmost importance to our guest comments as they help us improve, and continually provide the best guest experience possible. Please accept our sincere apology for the shortcomings you experienced during your stay and regret our service and accommodations did not live up to your expectations. The feedback we receive from our valued guests, like you, enables us to target problem areas, We welcome any opportunity to improve. Only we inform you we also have a Continental Breakfast for 5euros per person that guest can take in our cafeteria, if not necesary take Buffet. And our Tamayo Restaurant have dishes from 7,00euros, also if not necesary take carte or menu, you have other options.   Again, thank you for your review.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r414104645", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 1}, {"title": "Disappointed This time", "review": "The hotel itself is in good location,only short distance from sandy beach.  Definitely not 4 stars,but 3 yes. Hotel staff is friendly and helpful. Literally,small and tidy hotel with free WiFi and parking.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r412582219", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Strike 1- Day 1 / 8 August 2016", "review": "Have stayed here many times and although moderately disappointing in some areas some new changes have really jumped the shark. 1. Pay up front for entire stay at check in. What hotel does that?  2. Pay 40€ up front for pool towel service. 3. Fridge removed from room.  4. Filthy carpets on 4th floor. 5. Broken toilet flush  Stay tuned for day 2-8!  As usual nothing will change and a shmo from IHG will respond thanking me for feedback and nothing will,change.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r408292424", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Average.", "review": "Dear Lucas T,   Thank you for taking time to share your experience with us. I am sorry to hear that you did not fully enjoy your time in our hotel. We take comments such as these very seriously and would like to follow up with you. I have sent you a private message in an effort to obtain more information.    I look forward to hearing back from you very soon.  Best Regards,  John O Case Manager IHGService", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r405040988", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "never again", "review": "We stayed in the hotel for a few nights and considering the price we expected a little bit more. We had a junior suite which was basically two beds (one of which was an uncomfortable sofa bed), a chair, bathroom and an extra TV aswell as a kettle! The balcony was pretty big but no decent view. The room was first floor and close to reception at the top of the stairs so noisy at night (we would have requested a room change had we stopped longer). The room and parts of hotel looked tired but appeared clean. The pool was lovely and the staff were friendly, polite and helpful - Anabel (I hope I spelt her name right) on reception was very pleasant to us on arrival and a credit to Holiday Inn. A few improvements and we would definitely return. The location was okay but if you are to…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r404852916", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Very tired hotel ", "review": "Dear toffeeblu,  Thank you for your recent stay and for taking the time to write us a review. I am truly touched and grateful for your very kind review regarding our friendly and helpful reception staff, found our pool to be lovely and location accessible. On the other hand, it is regrettable that you found the hotel only at average best. Kindly accept our sincere apologies for falling short of your expectations. Your feedback is highly appreciated as this will help us look for more ways on how to provide you with a better stay in the future. I hope that you would still consider staying with us in the future and may give us a chance to show you the improvements made.   Sincerely,  Dianne L Case Manager IHGService", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r402431843", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Very Tired. In need of refurbishment !", "review": "the wifi does not work, there was no electricity in the rooms!! the pool was dirty, the location bad, the reception was unfriendly and did not speak english very good. this is no 4 star hotel. i cant recommend this hotel. it is not worth 170€/ night.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r400750822", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Ruined holiday", "review": "Shame Shame Shame This so called 4 star hotel to be a part of the Holiday Inn group should be scrubbed of their member list. As an Accor member I will now think before booking another of their hotels. I and my wife have worked all our lives and saved to travel. I had a reservation for 3 nights but stayed only two . We booked a double room but was told they only had twin room and they never gave a bed option. I told the girl I had booked other Holiday Inns with bed preference and she said it was not true. It wasn't that we had twin beds it was the attitude I resented. The room was a good size and the A/C worked but there is no fridge and only one drinking glass for 2 people. Coming back from a walk I asked for ice and was told the cost is2 euros. I have never had to pay for ice.…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r400517007", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Mediocre in every way", "review": "Dear lonsic,   Thank you for taking time to share your experience with us. I am sorry to hear that you did not fully enjoy your time in our hotel. We take comments such as these very seriously and would like to follow up with you. I have sent you a private message in an effort to obtain more information.    I look forward to hearing back from you very soon.  Best Regards,  John O Case Manager IHGService", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r398275631", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Going downhill", "review": "Hotel itself and rooms need a upgrade to this century. Everything looks and feels very old. Besides that hotel has nice facilities: pools for adults and kids, tennis court, play park for kids and even the gym which at the moment is kind of empty room. We tried breakfast and dinner and we didnt like the food, although price was cheap. Hotel has free Wi-Fi but it doesnt work very well. A lot of free parking is a plus. Hotel is nearby the beach and restaurants but it takes a while to walk there. So the location is not perfect either. Like I said topic, it's very mediocre in every way. ", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r397957918", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Family Holiday", "review": "Dear Tero S,  Thank you for writing a review on our hotel. Our goal is to deliver exceptional service and superior accommodation to all of our guests and we appreciate your business with us. It is nice to know that the tennis court and the pool facility are well to your liking. However, it is regrettable if you found the rooms dated and if your dining experience did not exceed your expectations. Your feedback is of great importance to us as this allows us to monitor and improve the quality of our amenities and facilities we offer. Rest assured these concerns will be forwarded to the hotel management for evaluation and will be a basis for future improvements.  Again, thank you for staying with us and we hope we get the opportunity to show you some of our improvements on your next trip.  Sincerely,  Grace P. Case Manager IHGService", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r396092464", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Nothing to complain about", "review": "This was our ninth stay at this hotel and each time it gets more and more tired. The decor and fittings in the room were exactly as they were ten years ago. Gone is the mini bar in the rooms. Wi - fi is worse than dreadful and room cleaning is poor. The lounge bar also has not changed. Pool bar is also limited in the times it is open now. The bar after a request for Smirnoff vodka still did not have it after five days after they ran out. Sorry to say we won't be back for a tenth time. ", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r393186737", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very average", "review": "Where do I start..... The rooms are very outdated and in need of a modernisation. The pool is nice expect the staff that work there don't seem to like the British, as the group of us were playing in the pool and they were very strict in how loud, what we could do, drink etc. Yet for the Spanish people they were fine.  The front desk had a sign which states that 'all major cards are excepted' when exchanging money.. But it turns out that they only except cash but when I attempted to exchange money, they replied with sorry we have hit the limit.. I don't think they quite know the process..  Would I come back to this hotel... No ", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r391753763", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Outstanding hotel, great value, great food, great service", "review": "Dear James T   Thank you for your feedback regarding your stay at Holiday Inn Alicante Playa De San Juan. We take our guest comments very seriously and always strive to provide comfortable and friendly accommodations. We appreciate your nice comment about the pool.  However, we’re sorry we fell below your expectation regarding customer service. We will address this concern. We take all reviews positive and negative very seriously, and your feedback will help us improve for our next guest or your next visit.   Sincerely,    Orlando A.  Case Manager  IHGService", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r389855274", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great Location", "review": "We travelled to this hotel with expectations that it would be like a travelodge - we hadn't paid a kings ransom for our stay.  The hotel is scrupulously clean, and the rooms were very well designed with everything you need.  All towels, toiletries, hangers, safe, all the bedding you could need and very good air conditioning to name a few.  There were some scuffs etc but in a busy hotel these are to be expected.  The bathroom was surprisingly large, and well designed with copious amounts of hot water.  The pool area was large and well kept, the pool well maintained.  Plenty of sunbeds, with parasols and a little pool bar providing drinks, ice creams, food etc. The restaurant is brilliant value, with a 3 course meal (with generous portions and big choice) for 15E - also an a la…", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r388738722", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Mr", "review": "Dear Deborah B. Thank you so much for your review of our hotel. I am pleased to hear you enjoyed your stay with us. It's something our staff takes great pride in, so we value your feedback. We hope you will visit us again.   Sincerely, Sales Manager", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r385057927", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Nice hotel", "review": "The hotel is in need of an upgrade but it is clean and friendly with good facilities, pool etc. its in a lovely area, short walk to the beach which was clean and not too busy, bus and tram stops nearby to get into Alicante.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r380965071", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Decent enough hotel, nice stay...", "review": "I booked a long weekend break in Alicante for myself and my partner using IHG Rewards points for the hotel stay.  The hotel is situated in a residential area about 800 meters from the main promenade / beach area of Playa de San Juan where the majority of the local bars and restaurants are congregated. The walk back from the promenade is uphill, but not strenuous in any way, and the hotel is also close to numerous tram stops if you wanted to travel further afield on the excellent Alicante - Benidorm tram link.  The hotel is typical of a continental Holiday Inn, not massively luxurious, but perfectly clean and functional for a short stay or business trip.  The hotel, unusually for Holiday Inn hotels, has a pool and sunbathing area set around the pool and garden adjacent to the…", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r377034871", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Location", "review": "Dear leedsls27,  Thank you for taking the time to post a review of your recent stay and for being a loyal IHG Rewards Club Platinum member. Allow us to apologize for any inconvenience you may have experienced due to the ongoing renovations. Although it is regrettable that you did not fully enjoy your stay, we appreciate that you have shared your concerns with us. Let us assure you that we will continuously work on maintaining and improving our property in order to accommodate you better in the future. I do hope that you will give us the chance to make it up to you and provide you with the service you deserve.  Sincerely,  Faith R Case Manager IHGService", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r375667881", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Horror stories TRUE! Stay away...no quedarse en este hotel", "review": "It's a holiday inn so you know what you are going to get.  The staff are great. The food is fine , everywhere us clean.  The pool is in a large area and there are ample beds. The location is 5 mins to the be ach and 5 mins to the avenida naciones line 4 tram. The hotel is low rise which is nice.    Theresnot much to fault but it is getting a bit tired.  ", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r375506708", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Never ever again!", "review": "Las historias de horror son ciertas, no tirar su plata en un hotel que no es para nada 4 estrellas!!!  PLEASE READ AND HEED THE WARNING  We arrived around 5:30pm, to check swiftly into the hotel and then hopefully straight out onto the swimming pool as it was a lovely sunny day.  We had driven past the hotel a couple of days previously and actually stopped to ask reception about availability of rooms and looked around the swimming pool and it all looked reasonably good.  However, the reception area and the swimming pool at the time were the only reasonable presentable areas as we were to find out.  we were given our room keys but there was no warning that the swimming pool was closed or no apology for that matter from the male receptionist.  As we walked away from reception we…", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r375051278", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Short break", "review": "Dear Dear GeoSA,  Thank you for writing us a candid review regarding your stay. We certainly regret the overall dissatisfaction you had experienced during your stay. I have sent you a private message in order to obtain more information about your stay. We hope to hear from you soon and be of further assistance.  Sincerely,  Dianne L. Case Manager IHGService", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r374393743", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "PLEASE PLEASE TAKE NOTE OF TERRIBLE REVIEWS IT IS NOT A JOKE ", "review": "This will be a lengthy tale but one worth reading. So book a trip for 5 days to recoup. Read the reviews on here and got slightly worried so emailed the hotel. Explained I had booked to bring my sister out after dealing with some stresses and was worried about the reviews. They write back.....don't worry the hotel is lovely...there are no issues....all rooms are lovely. So we arrive and see a sign on the door saying the pool area is closed all week.........OMG.  So we speak to the guy behind the counter and explain if the pool is closed why do you not put it on the website or tell us in the email exchange.  The guy tells us the pool is open in the morning and not to worry. So we check in. Rooms shabby ....rotten door frames, tiles hanging off, mates springs lovely to lay on…", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r367337501", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Holiday inn", "review": "Dear Clairebear2905,  Thank you for taking the time to write a review of our hotel. It is regrettable that the overall level of service you have received did not live up to your expectations. I sincerely apologize for any inconvenience you may have experienced. Let me follow-up on your concerns. I have sent you a private message in an effort to obtain additional information. I look forward to your response and be of further assistance.  Sincerely,  Faith R Case Manager IHGService", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r367085915", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Smoke smoke", "review": "The rooms are basic but good for a short stay. We had an issue with our first room ( advice keep away from 1-8) but this was sorted to our satisfaction. Food is reasonably priced and was good. 10 min walk to beach and local bars and restaraunts. Pool was nice to have. ", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r365836804", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Nice hotel in very quiet area ", "review": "Sometimes you get surprised, what hotels promise on internet and what you get. This hotel put us in a room where the smoke was hanging thick. We turned in the door and asked for a non-smoking room, but the reception told us that there were no one available. So why offer rooms that you don’t have? The positive thing was that they had a nice swing pool and the staff was friendly.", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r365237762", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Room 137.. DO NOT STAY IN ROOM 137!!", "review": "Dear HansSueco,  Thank you for taking time to post a review of our property.  I am pleased to hear that you liked the nice swimming pool and friendly staff.  Guest comfort and satisfaction are of the utmost concern to us and our hotel is committed to making every possible effort to provide comfortable, clean and friendly accommodations.  I am sorry for the strong smelt of smoke in your room.  It is not our intent to cause undue distress to our guests.  Please  accept my sincerest apologies for any discomfort this issue may have caused you.  I hope to have an opportunity to serve you again and so we can make it up to you.   I value you as our guest and hope you will continue to choose IHG for your future travel needs.   Sincerely,   Lera P Case Manager  IHGService", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r364889675", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Noisy noisy noiay", "review": "Arrived late in the evening to a 24 hour reception desk, not particularly friendly greeting and I had emailed in advance stating we were late arrivals. Corridor smelt of awful body odour and room was adequate for our purpose.  Bed made a horrendous noise when you rolled over and all night people were coming and going and paper thin walls. Plenty of free parking onsite and pool looked clean and neat gardens. Would not recommend to stay as not near the airport if you need a close stay. Beach was absolutely beautiful with local delicacies available, very traditional and worth a visit Do not touch this hotel", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r364150781", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Enjoyed", "review": "Dear Nataliel1978,  Thank you for your stay and your comments. We're so sorry to hear that you had a noisy stay with us. Your comments have been escalated and we will look into the situation. In line with this, we have sent you a private message to obtain more information.   Again, thank you for being our guest and look forward to hearing from you soon.  Sincerely,  Christian C. Case Manager IHGService", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r362654978", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "One night", "review": "This is a lovely hotel & lovely staff. Disappointed wifi wasn't available in the rooms which would of made a business trip difficult. Rooms are dated but that reflects the price. Enjoyable stay & would consider staying again.", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r360978957", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "A lovely holiday inn", "review": "Hotel needs a definite upgrading ,very tired. Rooms are long past refurbishing. Breakfast and dining room staff are great. For a hotel in a resort area, it is just adequate. The Holiday inn franchise should take a good look at this hotels potential.", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r359428689", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Not a hotel for modern people", "review": "Dear Joe D,  Thank you for submitting your review of our hotel.  I am pleased to note that you liked the service you received from our staff in the dining area.  We work diligently to ensure our facilities are well maintained and we try our hardest to provide not just good value, but comfortable, clean and friendly accommodations.  Your feedback regarding the current state of the facility particularly with the rooms have been forwarded to the hotel management.  Kindly accept my sincere apologies for falling short of your expectations in these areas.  We are highly motivated by your words and ensure you that we shall continue to strive for excellence.  I value you as our guest and hope you will continue to choose IHG for your future travel needs.   Sincerely,   Lera P Case Manager  IHGService ", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r358012250", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 2}, {"title": "Adequate Hotel", "review": "My husband and I have just returned from staying at this hotel and we found it to be adequate for our needs definitely not 4 star.  Room a little tired and needs updating the cleanliness of the room was excellent and we had clean sheets and towels everyday however, there were no tea and coffee facilities which was very disappointing.  Mini bar in room was very inexpensive, pool area very nice and clean.  We ate in the restaurant one evening which was very good and again inexpensive for 3 courses 15 euros also bar prices for a hotel again very good.  Unfortunately for us the down staff was that we found the staff although very friendly, the service was very poor and slow.", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r355008274", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "No frills but adequate for short stay", "review": "Hello Betty, thank you for your comments. We inform you that we are doing renovations and remodeling our facilities and we feel that your stay was not entirely to his liking. We hope to count on your presence. Thanks and regards.", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r354517843", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great ", "review": "This was the second time we stayed here recently -each for 3 days. While facilities are very basic and in need of an upgrade, the hotel was adequate for our short stay but nowhere near a 4 star rating in my opinion. On arrival there is free secure parking and the check-in welcoming and efficient with no delays. We had booked online and the daily room  rate was just over Eu40 which was reasonable value. Although the rooms are adequate in size, the decor is very dated and the tv antiquated. Nevertheless we were able to get into our room at 1pm and the cleanliness icluding the bathroom was excellent for our stay. Free wifi is provided with strong signal. Other facilities include a small gym and a nice pool area although not heated. Dining and bar facilities are average. The hotel…", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r352645089", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "It was fine for what it was", "review": "Dear mervspain,  Thank you for leaving a review about your stay with us. We appreciate your nice feedback regarding our hotel of good value and convenient. On the other hand, it is regretful that you found our hotel needing some upgrade. I have forwarded your concerns to the hotel management and will be a basis for an upgrade.   We hope you will consider us again and see the improvements made.  Sincerely,  Dianne L. Case Manager IHGService", "date": "January 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r345417459", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "horrible. ", "review": "Stayed here with my husband read all the reviews and yes it needs an update but the staff were more than helpful.  We were upgraded to a suite with a balcony the size of a terrace.  It was clean and as you would expect a holiday inn. There was a short walk to the wonderful beach and the other direction the tram stop into town. Will definitely stay there again. Don't be put off by the poor feedback ", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r344891304", "sub_review": {}, "travel_purpose": "", "rating": 1}, {"title": "Great facilities", "review": "Have been staying in this hotel for 15 years now, we love the location and there facilities, but it is in desperate need of a make over, the swimming pool is great and they have a smaller pool for children, whilst the gym is not big it is sufficient for any one that needs to workout on holiday,there are two tennis courts and the restaurant offers a set course for those with a limited budget,breakfast is excellent and the staff very helpful, I would say it is very family friendly,golf course very near,but as I have said it needs a make over,", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r342698548", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Friendly staff, hotel undergoing renovation", "review": "Dear TERRY O,  Warm greetings from Holiday Inn Alicante-Playa De San Juan. We rely on guest feedback as this will allow us to improve wherever possible. Thank you for noting our good location and facilities. It is also good to know that you found our staff to be friendly and that you were pleased with the breakfast options. However, I am sorry for the disappointments you had with the overall look of our property. Your comments are noted and forwarded to our management team for proper evaluation and improvement.  Until your next visit, we remain at your service.  Sincerely,  Ingrid V. Case Manager IHGService", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r337385439", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Nice staff - tired hotel", "review": "We stayed for 4 nights here at the end of December. Our room was nicely cleaned and the wifi worked great. But as others have mentioned there are areas where the hotel needs attention. Not much in terms of amenities - at least not what I expect from Holiday Inn. We needed toothpaste and all they had were the small packets with a toothbrush. You can see there are signs of previous damp and worn carpet in the hotel. The staff are very friendly, and helpful. Affordable. The location is convenient to the beach, transportation, nearby restaurants and shops. Being so close to the beach, I can see why there're issues of damp. Plenty of hot water so I think your experience depends on the room. It was easy to get there from Alicante airport by bus (C6 to 21, total cost per person €5.30).…", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r335142250", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 2}, {"title": "Horrible experience", "review": "Staff are generally good, pleasant and nice. Hotel is tired, rooms are worn, old decor and bathrooms scruffy.  You get a small sponge and shoe shine in the bathroom, no errrr soap, tooth brush or shaving stuff Great parking, but location from Airport is around 25km, also around 12km from Alicante harbour so not much around in the winter months.  Breakfast is just about ok, nothing warm just basics, bread and non branded cereal & a coffee machine which sounds like a jet engine It's a 3 star at the moment at best   ", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r334257117", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "holiday inn", "review": "Good afternoon David, I feel that staying at our hotel was not entirely pleasant. I inform you that we are making reforms both in lounges and in rooms. True, these distances are both aeropuesto as Alicante, but also to the good weather we have, even at this time of year is very nice walk along the beach area, which is 400m. Hotel, where they have cafes and restaurants. I hope that we will have you here.", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r330845661", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Staff lovely,  hotel tired", "review": "This hotel is in need of a refurbishment.  It is ok, but lots of little things need improvement.   Top of the list.   Wifi is terrible.  Lack of electric sockets near the bed.   Tired and dated decor.   Poor value for money at breakfast.  No kettles in standard rooms.   No overt acknowledgement of Spire status until I asked for upgrade.  Upgraded room was better but still dated and tired.   There is nothing majorly wrong with this place that a little investment wouldn't put right.   The staff are an asset.   Friendly,  helpful and nice.   ", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r329591140", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Poor ", "review": "Good Morning, I thank the entries indicates, I regret that has not had a very pleasant stay. As for what we said, I inform you that we are doing renovations and improvements. The Wi Fi is open, but is subject to availability, in all common areas and most rooms have, and all rooms have air conditioning and heating, the difference is that the superior rooms are larger. Thank you very much for your clarification with our staff, I will get their comments. Best regards.", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r328664260", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Basic, great value.", "review": "Ants in room, lights not working, one glass in a room for two, telephone not working so have to go down to reception, and could not get a drink in the overpriced bar due to poor service. Obviously it is a budget hotel but it ain't that cheap considering the sub standard accommodation and service.  My advice would be don't bother and find somewhere else. I will be in future. ", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r317020340", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Comfortably Average", "review": "Buenos días, Lamento que su estancia en nuestro hotel no fuera del todo agradable, siento los incidentes ocasionados. Le informo que estamos haciendo mejoras y reformas, y espero que volvamos a contar con su presencia en un futuro.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r315598799", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great hotel ", "review": "Forced into last minute stay here for a few nights. Hotel is dated like many. Could find faults for fun re decor etc but at the price per room per night it gets 4 star. Has plenty facilities and decent poolside area, great location and very very cheap. Staff friendly. Have paid a lot more for very similar standard of hotel. ", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r312944653", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "great location", "review": "although this hotel is not in centre of alicante in my opinion is very well located.getting to lovely san juan playa takes only 10minutes or even less.shops,cafes and restaurants are also easy to reach by foot.and if you want to get to centre of Alicante you can take tram which is also 3min away from hotel.when it comes to rooms they are nice but in my opinion some things need maintance work.hotel is not new i suppose.pool not to big but very chilling and not very busy.breakfast good although seeing every day poached eggs got boring.but still its worth staying there.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r311555055", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Comfortable Stay Near The Beach.", "review": "My wife and I have just returned after spending 10 wonderful nights in the Holiday Inn. We had room 504 on the fifth floor which is the highest in the hotel. I had requested a high floor before arrival after reading some poor reviews of rooms on the lower floors. Check in staff on arrival were excellent and in no time we were in our room. Was a little bit concerned after reading some reviews but we were pleasantly surprised by the room.The room was spacious, comfortable and had excellent air conditioning. It had a wooden floor and a well stocked mini-bar. There was a small flat screen TV although unfortunately there was only one English 24 hour BBC world news channel. The bathroom was a good size and had plenty of amenities. Overall the room was very comfortable. We had…", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r309943780", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Relaxed but rather chaotic", "review": "Helpful staff, but things didn't really work. Wifi didn't reach bedrooms and wasn't great anywhere else. Getting in and out of the compound was a bit fiddly. Not very convenient for the beach or anything else. Paid around 60 euros, which was fair enough but would have resented paying the full rate. Nice reception staff who didn't seem at all bothered about us checking out late, and helpfully printed boarding passes for me.", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r306785111", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Pleasant stay", "review": "Dear Richard C,  Thank you very much for taking the time to share your thoughts and comments regarding your stay with us. We strive very hard to make each and every guest's stay perfect however, it appears we fell short of our goal during your visit. We would like to apologize for failing to meet your expectations regarding our internet connection. We also regret any inconvenience you may have experienced. In spite of these, we are pleased to know that you found our reception staff to be nice. Reviews like yours are very valuable as they enable us to target areas we need to improve on. In addition, your feedback has been forwarded to our management for evaluation.  We value you as our guest and hope to have another opportunity to provide you a much better experience.  Sincerely,  Joel A Case Manager IHGCare", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r297290066", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great Family Hotel - well run and good location", "review": "Polite and helpful staff, great breakfast and excellent pool although childrens playground could be better - consists of just one slide, a table and four chairs. Booked at very shrot notice but we thought it was very good value for money        ", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r294770154", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Quite okay for a vacation hotel", "review": "I took my 6-year old daughter on a short trip to Spain. The purpose was to enjoy as much sun as possible at a pool and the beach. It seems that I picked a very good hotel for those purposes. The hotel is located within 10 minutes of walking distance to the wonderful Alicante beach. Most of the time we hang out by the pool, enjoyed beverages and ice-cream from the poolbar. We had a very good time. I am not sure which room category was assigned to us, but the room was okay. Nothing really fancy and a bit run-down. But we didnt spent much time in our room anyway. The bed was really comfortable, though. And the aircondition was a blessing. The hotel charges 9 EUR for breakfast if you book at the time of ckeck-in. As a walk-in customer you would pay 12 EUR. We found the breakfast to…", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r294302768", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Hit and Miss", "review": "We arrived early so the hotel was nice enough to allow us to store our luggage for free until our room became available. I requested a room at a higher floor with wifi and a fridge because August is extremely hot, need a place for cold drinks. We were told there were no rooms available at higher floors but they would move us the next day. So we go to the room (ground level), a very old looking room I should add and realize the AC does not work. After a few mins of trying to figure it out I go to the reception and let them know the AC doesn't work so they immediately hand me a remote! WOW! Are you kidding me; you would think they would've handed me the remote when I checked in rather than have me go back and ask for an explanation? Maybe they assumed we'd be happy without a…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r291731083", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Good experience...Does what it says on the tin", "review": "Dear Stef H,  Thank you for taking the time to post a review about your stay with us. We are glad to know that you liked the second room you were given. However, we would like to apologize for the less than satisfactory level of service you received from our front desk staff. We also regret the issues you had with your first room. We give the utmost importance to our guest comments as they help us improve, and continually provide the best guest experience possible. In addition, your feedback has been forwarded to our management for evaluation.  Again, our apologies for the inconvenience and we hope to accommodate you once more for a chance to provide you a much better experience.  Sincerely,  Joel A Case Manager IHGCare", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r290533340", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Looking tired", "review": "Good value....rooms OK if a little tired... Corridors need a makeover but Breakfast excellent Pool good although some more sombrillas would be nice.... Staff excellent..helpful...No complaints EXCEPT... The door stop is a piece of metal right beside the bath/shower...5 cms of vertical metal that you could stand on when getting out of the bath....This needs to be removed and a better option considered... all in all a very good experience...", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r290280631", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great location", "review": "We returned to the Holiday Inn Playa de San Juan after a 7 year gap. We love the location for it's peace and quiet. Other times we have been slightly out of season, so it was much quieter. We had booked a suite here as we were staying 6 nights. On arrival the staff allowed us to lock our bags away as we arrived on a early flight. So we spent several hours by the pool until our room was ready. The room (131) was a little dissapointing as the balcony had a huge extractor chimney in front of it. So not only was it unsightly, you had a constant drone from the fan from the kitchen below. And the kitchen staff started and around 5am, and there would be banging of bins and slamming of doors all day and evening. The rooms look tired, especially the bathrooms. They could do with a…", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r282685883", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Wonderful location, friendly staff", "review": "I spent 9 nights here and enjoyed every minute of it.  The rooms are in need of updating, dirty wall paper older, chairs etc...but very clean. The staff was friendly and the pool area really pretty. The weekends they had a pool bar open with drinks and snacks and plenty of seating.  The location is close to beach and a great jumping off point for the costa blanca area.", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r282410351", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Hit and miss", "review": "Got a great price on this hotel so was satisfied with our stay. It was only one night. The room was spacious, clean, had good air con and comfortable beds. It was very quiet.  We arrived late and they served us some food and wine in the restaurant. The food was very good, the wine was very bad. The service in the restaurant was appalling. It was like they just didn't know what to do. Offered no menus, offered no drinks, no water, table was badly laid, no offer to taste the wine and had to go to the bar to get more drinks. It was a good job the food was good. People on reception were great. Was a flying visit and for the price we paid, it was worth it. Customer service needs attention though. ", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r281208839", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Not nearly as bad as the reviews say....", "review": "Dear brinenick,  Thank you for your feedback. We take our guest comments very seriously and always strive to provide comfortable and friendly accommodations. We appreciate your nice comment regarding room cleanliness, air conditioning and bed.  However, we’re sorry we fell below your expectation regarding the restaurant service and the wine. We will address these concern. I assure you that the feedback of our hotel will be reviewed and most certainly forwarded to the appropriate departments.  We take  the confidence our guests place in us very seriously and work diligently to rectify any unsatisfactory experiences. We hope you give us a chance in the future to show you how great our hotel is.  Sincerely,  Orlando A. Case Manager IHGCare", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r278847060", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Disappointing and poor customer service", "review": "Yes the hallway floors are in serious need of replacement, and apparently some of the rooms are not too great HOWEVER I had a pretty good experience here and I travel extensively.  When I arrived the staff were super nice and the reception area was immaculate.  I had a room on the 3rd floor and it was spotless and nicely furnished enough with nothing broken.  My son's room was also quite fine and we were VERY impressed with the daily maid service.  The rooms had a free safe.   What I did NOT like though was that the only 2 english channels were 24/7 news so I couldn't even watch a single movie or show ever.  This hotel has 24 hour room service which was limited but very nice.  The restaurant had GREAT food with reasonable prices and the bartenders and wait staff were superb. …", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r277140722", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Far below IHG standards", "review": "Myself and my cousin stayed at the Holiday Inn from 26/05/2015 until 28/05/2015. We wanted a short getaway and were very shocked to find out that the swimming pool was closed for 'cleaning' for two whole days - 26/05/2015 and 27/05/2015. This meant we were only actually able to use the pool for half a day as we flew out on 28/05/2015 - early evening.  We could not understand how a pool can take two whole days to clean - particularly in May when you would expect the pool to be cleaned and ready for holidaymakers.  In addition, we had paid for bed and breakfast. On the first day - we were approached in the restaurant and told that breakfast was not included. Firstly, we would not have even bothered with breakfast if we had not paid for it - so to be embarrassed in front of others…", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r276277986", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Needs updating", "review": "Just had 3 night 4 day stay here. We went with 3 other couples. We stayed here 2 years ago, so this was the reason we booked here again. Unfortunately the hotel could do with some refurbishment especially in the rooms. On arrival the staff were very helpful. We checked in then noticed the pool was closed for the 4 days we were there. I would just like to say, the area is very Spanish and the local resteraunts were very good. We go to the Alicante area every year with our group of friends, but we feel we will be giving the Holiday Inn a miss next year and try somewhere a bit more up to date.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r275288043", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Less than expected", "review": "Dear Mel A,  Thank you for writing a review about your recent stay with us. I am delighted to hear that you liked the hotel location and helpful staff.  We work diligently to ensure our facilities are well maintained and we try our hardest to provide not just good value, but comfortable, clean and friendly accommodations. It seems that we were not able to execute an exemplary hotel stay experience this time due to the room conditions and pool closure. Please accept our sincere apologies for any inconvenience these issues may have caused you. Your comments will be forwarded to the hotel management for consideration of future upgrades.    We know you have many choices when it comes to lodging and we hope you will continue to choose IHG for your travel needs.  Sincerely,   Lera P Case Manager  IHGCare", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r271565864", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Good value hotel", "review": "Reception, restaurant and pool area was nice and fresh. My room felt less new and fresh. Toilet did not flush properly and the room itself was in need of refurbishing. Otherwise clean towels were provided and cleaning every day. I encountered four members of staff, where only two spoke good enough english for a place that receives international guests. The two who greeted me were friendly and tried their best, but my initial questions about the area and local transport yielded little results unfortunately. Wi-fi had old technology and poor coverage, and the last night it did not work at all.", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r266220708", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Terrible.", "review": "Dear Blackfrozt,  Thank you for being our guest and for taking the time to write your review.  We appreciate your compliments with regards to our reception, restaurant and pool area. However, we’re sorry we fell below your expectation regarding the room condition and the WIFI connectivity was below average. We will address these concerns. I assure you that the feedback of our hotel will be reviewed and most certainly forwarded to the appropriate departments which will provide us an opportunity to correct ourselves and come up with better solution for you and other guests.  Again, thank you for your comments and we look forward to welcoming you again in the near future.   Sincerely,   Christian C Case Manager IHGCare", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r265914920", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Once and never again - like Ryanair", "review": "Very kind and helpful staff. And you get a lot for the price you pay. Easy access to shops and beaches around. Would come back again.   Cons: This is not a facy hotel. It is quiet old. Still it is very clean. ", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r265913359", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Nice location and friendly staff", "review": "We stayed here for a family holiday, 4 kids and 6 adults. Breakfast was a large buffet and the rooms were also well proportioned. The staff on reception and in the bars were very good and friendly.  Unfortunately the decor in the rooms was old and in some cases chipped/broken/cracked but still usable.  The fold out bed was OK for the kids for a night or two but you wouldn't want to sleep there for a week.  Around the hotel there are a number of good restaurants and bars and the beach is a 10min walk.", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r265218821", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Okay for short stay and would stay again", "review": "Nothing special, but very adequate. Wished we knew we could have taken the C6 bus from the airport and gotten off on the first stop! Nice breakfast was included in our booking and it was nice. About 15 minutes from airport.", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r264727893", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Very good hotel for a short stay", "review": "Dear Goodtimehadbyall50,  Thank you for your feedback and for staying with us. We realize you have many choices when it comes to lodging, and we sincerely appreciate your business. We always strive to provide great service to all of our guests, and it is nice to read that the location of our property is up to your par. Your patronage and support to the hotel is very important to us and we look forward to welcoming you back in the near future. If there is anything we can do to make your next stay more comfortable, please do not hesitate to ask the Manager on Duty.  Once again, thank you for staying with us and hope you will continue to choose IHG for your future travel needs.  Sincerely,  Divina P. Case Manager IHGCare", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r259995406", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Good base for overnight in Alicante", "review": "We went to Alicante airport to pick up friends so we decided to stay the night at the holiday inn and we was very glad we did it was very good value nice big rooms and friendly staff all so a nice bar where you can  relax with a glass of wine or what ever you like and we had a very good meal in the restaurant", "date": "February 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r257976994", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Good value", "review": "Arrived at the hotel at about 11pm to find friendly and cheerful receptionist. Rooms were a very good size with a range of pillows. Decor good and overall hotel looked well maintained. Breakfast is included with many booking sites so make sure you choose one of those! Breakfast was very good with a selection of traditional cold cuts, cheeses, fruit etc. regret toaster did not appear to be working. Relaxing breakfast overlooking the very sunny pool area.  Overall a very pleasant stay which was very peaceful and a hotel I would be happy to return to. Staff on check out equally cheerful and welcoming.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r253714151", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "ideal for business", "review": "Although a little far off from Alicante CBD, its location is ideal as the beach is near and there are plenty of services nearby. Rooms are the right size for a business trip, clean and good service. I am  from Alicante and when I visit family or business this hotel is ideal.", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r249650763", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Nice and comfortable", "review": "The hotel is good and not too far from the beach. Rooms are ok, clean and simple. I had the chance to eat dinner too, the service and quality of food is also good. Breakfast offers a lot of food. I would come back again if alone and in the area.", "date": "December 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r246222027", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Four stars and one tiny soap for three guests", "review": "Dear Gianluca B,  Thank you for taking the time to share your feedback with us. I am glad that our location suited your needs and you found our breakfast options to be commendable. It is always a huge motivation on our end to receive commendable feedback from our valued guests like you.  Please see us soon if your travels bring you back to the area!  Best Regards,  Pam G Case Manager IHGCare", "date": "December 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r244537846", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Run down hotel with serviceminded reception", "review": "The place proudly displays 4****, which, by looking at the room design, might have been the case ages ago. Nowadays, you get heavily scratched floors, old bathroom (with one tiny soap for three persons and two towel sets), antique TV-set, moving beds. The 3rd bed was an armchair bed, actually.   Size room ok, clean, friendly staff, and excellent breakfast buffet.", "date": "November 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r242240632", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Less than expected", "review": "Dear tourism_revw,  Thank you for your feedback, both positive and constructive. It is lovely to hear you enjoyed breakfast and found the rooms clean and our staff friendly. We give the utmost importance to our guest comments as they help us improve, and continually provide the best guest experience possible. We are sorry our hotel did not live up to your expectations and regret you were not satisfied with the conditions of the room you received. While we understand that your stay was not 100% satisfactory, we would hope that you would give us another chance to make your stay as best as it can be.  Sincerely,  Connie D Case Manager IHGCare", "date": "November 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r240031070", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Ok'ish", "review": "We've just got back from a really lovely holiday in Playa de San Juan staying at the holiday Inn.  Weather was absolutely perfect and we loved the location, a ten minute walk to a fabulous beach resplendent with palm trees, walks to die for and cafes and restaurants along the beach.  Additionally, bus stop outside the hotel with regular, and cheap buses to Alicante.  Would definately stay in this area again.  Would I stay at the Holiday Inn ?  Probably, if they addressed a few issues.  Firstly, for a british tea drinker, a cup of tea first thing is essential to bring you into the land of the living.  It felt like a hardship not to have a kettle and tea and coffee in the bedroom, and I don't think I've stayed anywhere in years that doesn't supply this.  Secondly, the hotel needs…", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r237535887", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Good location and great value", "review": "Dear Elaine S,  Thank you for taking a moment to share your experience and concerns. We work diligently to ensure our facilities are well maintained and we try our hardest to provide not just good value, but comfortable, clean and friendly accommodations. I am happy to hear you like our friendly staff and enjoyed the hotel pool. However, please accept my apologies for your less than satisfactory stay due to the condition of the room amenities encountered. We appreciate you bringing this to our attention and trust that we will address the issues and assure you that proper measures will be taken   We do hope when business or pleasure brings you back to the area, you will allow us the opportunity to exceed your expectations.  Sincerely,  Zelyn N Case Manager IHGCare", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r237098122", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Better than expected (after reading reviews)", "review": "I stayed here for 3 nights with my husband and little child in October.  For the price we paid I could not fault the hotel at all.  A short walk to the beach.  Lovely clean beach and lots of restaurants along the promenade.  The hotel pool was ice cold, but then it was October!  There was also a little play area for kids which was handy.", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r234263537", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Poor quality/price relationship", "review": "Some days after booking our holiday in San Juan Alicante we read the reviews re the Holiday Inn..Both my husband and I are in our late retirement years... to say the least we were repulsed and devastated at the  accounts we read..and to be very frank they destroyed  and spoiled our \"anticipatory\" feeling ..We arrived at the hotel late Sat night Oct 4th.. only to be greeted at reception desk by a most courteous gentleman.Happy with our introduction etc we waited till daylight to assess things in more detail... All i can say is that we were VERY PLEASED .. Though not up to the quality of a 4* hotel ,the rooms were immaculately clean... the staff were helpful and friendly and the breakfast food was wholesome and plentiful.. The walk to the beautiful beach was Much Longer than we…", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r233951572", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Shabby . HOLIDAY INN SHOULD BE ASHAMED OF THEMSELVES", "review": "Dear Catherine A,   Let me first thank you for choosing our hotel during your recent visit. It is a great pleasure to learn about your experience with us and to know that you were well looked after by our team and that you enjoyed our hotel facilities. I have taken note and wish to thank you for all your valuable comments. These are of great importance to us and allow us to monitor and improve our service continually.  Once again many thanks for your feedback and we would welcome the opportunity to serve you again.   Sincerely,   Karen C Case Manager IHGCare", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r229387560", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "In desperate need of renovation! Repeated requests ignored.", "review": "This hotel is in desperate need of a renovation. The rugs are filthy, stained, and smell of humidity and mould. Why they put carpeting in a beach hotel (in the heart of the ceramic tile industry) is beyond me. The hotel is independently owned and the owner is cheaping out on renovations. The reception summer staff is mostly young people who are not trained in hospitality, working as seasonal interns, for very little pay and there is no incentive for follow through.  I specifically asked for a FIRM mattress, in the booking details and BOTH mattresses on BOTH beds were flimsy and old. I put in a request with the reception to have something done, even a plywood board would have sufficed but our two requests were ignored. The sun chairs by the pool are the plastic hardware store…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r229319854", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Much better than I expected", "review": "Dear Lucas T,  First of all, thank you very much for your recent stay at our hotel. We give the utmost importance to our guest comments as they help us improve, and continually provide the best guest experience possible. It is unfortunate your stay was not as comfortable as it could have been due to the condition of the bed you received and maintenance levels on site being below par. We appreciate you bringing your concern to our attention. Please be assured that your comments will be used for the purpose of bringing improvements needed.   Again, thank you for the feedback and our apologies for the shortcomings.  Sincerely,  Connie D Case Manager IHGCare", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r227274013", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Well past it's best...", "review": "We chose this hotel, because we wanted a place relatively close to the beach. It cost us 3.85 euros per person to get a bus from the airport to Puerta Mar 1 (Plaza Puerta del Mar) and from the same bus stop we got into the bus 21 (it was somewhere around 3 euros per person I think) which went straight pass the Holiday Inn. Very easy and good air conditioning in the buses. When you want to go back, you just get into the bus from the other side of Holiday Inn (there is a small entrance which we used, when we would walk to the beach).  Based on the reviews I had read, I expected the place to be far shabbier than it was. Sure the carpets looked pretty stained (I would suggest them to change the fitted carpets into something that is easier to keep clean), but otherwise everything was…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r226477899", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "This hotel needs a complete renovation", "review": "Dear Joanna-Finland,  Thank you for taking the time to write us a review regarding your recent stay. Please accept our sincere apologies for falling short of your expectations, specifically with the issues you have had with the noise. Rest assured that these issues will be looked into. The feedback we receive from our valued guests, like you, enables us to target problem areas and take the necessary actions to ensure similar situations can be avoided in the future. We appreciate the candid feedback we receive and welcome any opportunity to improve.  Sincerely,  Karen G.  Case Manager IHGCare", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r223723004", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Spoilt by mismanagement", "review": "Hotel lobby is very welcoming and modern. Rooms and corridors are worn and old fashioned. Our room was very large with good air conditioning. Breakfast service was chaotic with dis-interested staff and many uncleared tables, no napkins or cutlery available. However there was a good selection of fresh fruit and pastries. Our reservation was made on a best available rate basis although the hotel still decided to apply a one night charge a week in advance of our arrival and also requested full payment for the week when we checked in. Pool area is clean and the poolside bar serves a good selection of drinks and snacks. Hotel's location is very convenient for buses to Alicante and within walking distance of the beach and a good selection of restaurants.  Wifi is advertised at the…", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r220389714", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Good Hotel...but renew those filthy carpets!!", "review": "As a Priority Platinum member I have raved about this hotel before as I have visited it every year for the last 8 yrs., and this trip in July was just as good.. socially.  HOWEVER for the last five years the corridor carpets need renewing as they are stained and STINK!  I am not the first to moan about the state of the carpets as many have stated before me. This year we noticed that some parts of the hotel are getting a bit tired from the lack of close up maintenance, and don't get me started on those stupid plastic sun loungers!  Note: Free Wi-Fi can be a little patchy at times.  To the owner of this franchise: lets see a bit of money spent on your investment and get it back to some of its finer days.", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r217918332", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "on the downhill", "review": "Dear Alicanteman,  Thank you for your feedback of our hotel. We strive to provide the best possible service and experience and it is always great to hear from our guests on how we are doing. I am deeply sorry that on this day we were not able to meet your expectations especially with the condition of the carpets and hotel amenities received. Your comments will be forwarded to the ownership of the hotel to take into consideration for future upgrades.   We value you as an IHG Rewards Club Platinum member and we hope to have an opportunity to show you how great our hotel is.  Sincerely,  Zelyn N Case Manager IHGCare", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r215480826", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Great value, good location", "review": "First of all, I have to say that I like this hotel. It's very convenient for a stay at San Juan playa and I personally prefer it to any of the hotels located right on the beach because it makes the hotel more calm and less party oriented. It also gives you the opportunity to have a little walk before getting to the beach (it's about 300m so really perfect in my opinion). The hotel also has a nice pool if you prefer the pool to going to the beach and the staff is usually very nice and helpful. It also has a little gym and paddel courts if you feel like keeping active. All this to say that I've stayed in this hotel about 6 or 7 times in the last 7 years and I'll probably be back. However... and it's a big however, there's no denying that since my 1st visit to this hotel (I…", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r214055120", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Ok if your Spanish, please read.", "review": "Dear mark1977Montreal,  Thank you for leaving a comprehensive review, highlighting not only the bad but also the good points of your stay. Your willingness to spare some of your time to relay your comments is genuinely appreciated. It is lovely to hear that our location suited your needs.   It is certainly not our intent to inconvenience our valued customers, but to instead provide good value, comfortable, clean and friendly accommodations. Your feedback is of great importance to us and allows us to monitor and improve our product and service continually.  Thank you again for your comments. We look forward to your next visit.  Sincerely,  Connie D Case Manager IHGCare", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r213914592", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Change not Good", "review": "Can only echo much that has been said before, a good value hotel based in a good location for exploring the area.  I would rate the beach at San Juan as the finest I have visited in Europe in terms of space and cleanliness, We traveled to Benidorm for the day and really appreciated the contrast when we returned.  Couple of practical points regarding traveling from the airport - take Bus C6 to Alicante Port (Puerto del Mar) then change to Bus 21 which stops outside the hotel, cost is around £5 in total one way and will take about an hour.  The return bus route to Alicante leaves from the road behind the hotel and runs every 20 minutes.  I can recommend the tram system also, the nearest station to Alicante is just up the hill Hollande or Av. Naciones, you can pay cash on board and…", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r213797340", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Excellent hotel and value", "review": "Booked up for a last minute week abroad, found this hotel on trip advisor. Great hotel, 5 minutes walk to the beach at San Juan about 6km's from Alicante. Room spotless, food in hotel great. Staff brilliant. Pool spotless, certainly caters for families as well. It is one hotel I would certainly go back to out of this world", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r209890284", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Dangerous Sunbeds!", "review": "This is the second time my wife and I have stayed here. Rooms are clean spacious but tired. Having said that for the price it is great value. Well serviced by Trams and Buses, a short walk to the beach and Playa de San Juan central. Don't expect international cuisine its all very Spanish. The sunbeds around the pool have a habit of collapsing. this can be quite hilarious when watching newcomers! However the are old and dangerous, the girl at reception assured me that they were being replaced shortly (trouble is they said that last year too).  Overall for the money cant beat it.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r208355984", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent Stay", "review": "Stayed 11 nights here 27th April to 8th May on bed and breakfast. Well situated for the brilliant beach of Playa San Juan and plenty of restaurants/shops within walking distance. Good size rooms kept clean by friendly maid service, friendly and helpful reception desk and good value hot buffet breakfast and bar prices as good as local bars. The hot part of the breakfast needs to be monitored a little better,If there was no eggs or bacon left it was a 20 minute wait for fresh. Thank you for a lovely stay.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r207512665", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good value", "review": "We checked in on 22/05 after leaving another hotel due to bad location and no pool. When we arrived the receptionist was very friendly and helpful, our room was spacious and clean. The pool area was small but clean and ideal for my 7 yr old. We paid for b&b and we were very pleased with the breakfast it includes egg, bacon, fruit, cereal,pastries and more. When we asked about a fridge the receptionist arranged for the mini bar to be emptied so we could use the fridge. The beach is 10 min walk max and is a lovely beach, there's a supermarket 5 mins away, more shops and restaurants 5 mins away. Overall for the money we paid no complaints.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r206812045", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Great week, good budget hotel.", "review": "Most staff we friendly, (the new girl was lovely) and what I expected, the rooms are quite large and value for money, the only reason we have not given a 5 was because the room still smelt of Cigarette Smoke when checking in and is not normal holiday inn standards. Great sun trap outside with lovely palm tree decoration. Will stay again.", "date": "March 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r198001096", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Friendly and good value for the money", "review": "I spent two nights here in Nov 2013. The hotel is clean, friendly and well-priced. I took my meals in the hotel restaurant and while the food was just okay, the prices were good, the portions ample and the service always pleasant. For anyone traveling to Alicante on business or for a beach break (the beach is an easy 10 minute walk), consider this hotel. The only really obvious flaw I saw was hallway carpeting that desperately needs replaced - fortunately the rooms were much nicer than the hallways.", "date": "November 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r190695427", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Pleasantly surprised !!!!", "review": "Lovely hotel, clean, good breakfast, friendly staff and great value for money. We are just back from staying there for a week over the Christmas and New Year period. From beginning to end, we really enjoyed our stay. We are regular visitors to Alicante and we have stayed in many other hotels around the area, however value for money, this is the best hotel we have stayed in and we will return. Very nice little bar area for coffee in the morning or a drink in the evening. Less than a 10 minute walk to the beach, which is just perfect. Nice pool area and padel courts. ", "date": "January 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r190303824", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "very helpful, pleasant staff & great location near beach", "review": "Stayed in this hotel over the New Year period & no complaints as such! Read reviews of hotel prior to booking & although they were quite negative, we were prepared to take the risk being major Holiday Inn users! We were not disappointed - the hotel is in a very good location near the beach & easy to get to from the airport by public transport. The staff are all very helpful, pleasant and can only praise them for their attitude. Reviewers have said that the hotel is tired and yes, it is a bit, but nothing to complain about and everywhere, including the pool area is kept clean & tidy - just don't go expecting an up-market hotel. The food is adequate but wouldn't necessarily use it for meals as there are plenty of nearby eateries within walking distance offering a more Spanish…", "date": "January 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r190174424", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Very below average but very few choices in San Juan.", "review": "We've stayed here a couple of times for a couple of key reasons--although it definitely has it's downsides. The \"value\" is the best in San Juan for a hotel with its amenities. Kids stay/eat free, parking is secure, decent kids program and various size of swimming pools are definite bonus. However hotel is in need of a MAJOR overhaul and renovation. Mattresses are old and squeaky. Noelia (manager) argued with me consistently that the room we had two years previously did not exist. She even told me she knows the hotel like her DNI! Red wine was served COLD at dinner. Fries served COLD. Given volume of guests in August, wait staff/ kitchen's priority are guests on full and half board. The hotel's proximity to Alicante, the beach, and the bus/tran are positives but it's wrinkles are…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r189211766", "sub_review": {}, "travel_purpose": "", "rating": 2}, {"title": "Staff let down by tired and worn out rooms and corridors", "review": "Dear Lucas T,  Thank you for taking the time to provide feedback on your stay. It is unfortunate the accommodations received prevented you from fully enjoying your time at the hotel. We take all of the reviews we receive very seriously as they allow us to identify areas that may benefit from additional attention. We have shared your comments with the staff and we’re confident the necessary adjustments will be made, in order to achieve complete guest satisfaction.   Thank you again for your comments, we hope to have the pleasure of serving you again soon.   Sincerely,   Adrian D Case Manager IHGCare", "date": "December 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r187201260", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Impossible to find, well almost!", "review": "Good grief! We left the airport in our hire car, thank goodness it was A. Full of fuel and B. v economical! What should have been a twenty minute journey took nearly an hour. The map provided on the Internet by the hotel must have been designed by someone who should have paid attention during their geography lessons. Apart from the drawing of the car park there was little resemblance between the map and reality! Most cities in Europe have sign posts specifically for pointing the weary traveller towards their chosen place of ret. well there is ..... One! And then nothing! Also some bright spark had decided that street names were a thing of the past so if you are psychic...no probs but if you are like us ... No hope!  Having eventually found the hotel you will be impressed by the…", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r186547825", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good staff, poor maintenance", "review": "Dear Falcoflyer,  Thank you for taking the time to express your thoughts and concerns. It is nice to know that our rooms were sufficient for your needs. However, please accept our apologies if this visit was not 100% satisfactory due to the soundproofing conditions and if you had trouble finding our location. We appreciate your feedback as this is our best resource for improving guest services.   We would welcome the opportunity to serve you again and make your stay as best as it can be.  Sincerely,  Pam G Case Manager IHGCare", "date": "November 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r186352767", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Average - nothing special at all", "review": "Comfortable, nice stay, friendly staff. The hotel needs minor maintenance that would make a world of difference... old paint, wore out sofas, humidity stains, etc... although we had a few issues they were all taken care of by front desk.  Ok breakfast for the price.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r184621415", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Different views", "review": "Dear Pukinano,  Many thanks for your feedback. It is pleasant to know you like our friendly staff. We strive to provide the best possible service and experience and it is always great to hear from our guests on how we are doing. I am sorry for any discomfort you may have experienced due to the condition of the hotel. Your comments about the property needing refurbishments will be forwarded to the ownership of the hotel to take into consideration for future upgrades.  Again, thank you for your suggestions.  Sincerely,  Zelyn N Case Manager IHGCare", "date": "November 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r184407198", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Nice, Comfortable Stay", "review": "We stayed here for one night in September en route to our holiday home and planned to explore Alicante for a couple of days.  It had a large free car park which was very handy for us, but the location was far outside of the main attractions of Alicante, our fault for not doing our homework properly, but tapas and drinks in the Old Town necessitated a cab ride (20 euro return) okay for one night but pricey for more.   I would disagree that this would be a business hotel, it is not to the standard one expects (and usually receives in UK and USA for example) from a Holiday Inn hotel.  Not a square metre of carpet in the corridors was without ominous stains, it smelt \"funky\" and all the doors were scratched. The room was okay but very tired, where the sconces for the wall lights…", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r183031832", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Superb long weekend!", "review": "Absolutely terrific long weekend away made all the better by this cracking hotel! Staff polite and knowledgeable, room spotless, pool area like a new pin! We cannot fault this hotel!!  The only slight negative we had was some noisy departing guest at 530am who was not a kid (!) who obviously found it funny to be talking very loudly as he walked down the corridors! ", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r182649806", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "life saver", "review": "Having been on holiday in Spain for 2 weeks, we arrived at Alicante airport a day early.We found the hotel quiet easy to find,( only 3 km from airport ).The staff as usual were very friendly and spoke good English.Check out time was 1100 am,i have a priority club card which allows us to a late check out.The room had air con which was very helpful,it was hot.We stayed on 30/09/2013 the local beach was very good if you had the right clothes ????.We would recommend this hotel .The price was 45 euro good value.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r182480965", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Difficult to find.....", "review": "First of all, you have to actually find it. This hotel is incredibly difficult to find, and Google map is not entirely accurate. The roads are \"one way\" in this area and they're are not signposted - (rare ones that are, normally have the sign hidden under tree branches and foliage!) This also meant that when we ventured out, we found it nigh on impossible to find the hotel again.  The hotel map is virtually useless, not accurate and the area that the hotel is in is not even on the main map! (A lot of the map was covered in ads, making it difficult to make sense of).  The hotel itself is nestled between high rise apartment blocks. Opposite the hotel is an absolutely massive block that sweeps around in a gentle curve for what looks like about a quarter of a mile. It is a complete…", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r181835835", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good stay", "review": "Dear kimski44,  Thank you for your review and for enumerating the good, the bad and the opportunities to improve.  Whilst I am pleased with the good comments, I truly value the negative comments as this gives us the opportunity of improving what we can offer. I am sorry for the shortcomings you have experienced during your stay with us. As we continually strive for excellence in customer service, we maintain the ideal of keeping guest satisfaction as our top priority. This feedback will be shared with the appropriate people that can help us make a difference to ensure our valued guests' needs and expectations are met in the future.   Thank you again for your review and I hope to have an opportunity of welcoming you back again soon.  Sincerely,  Krysllin G. Case Manager IHGCare", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r180883393", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely hotel, location not ideal tho!!", "review": "Stayed 5 nights on a mixture of paid stay and points. The hotel is situated in a residential area about 10 mins from the lovely beach. The rooms are tired but fit for purpose, the only thing I missed was a balcony to sit out on, don't know if they have any rooms with them, didn't see any.. There is no kettle, but we took our travel kettle and had a couple of cups from the restaurant. The pool area is nice, from previous reviews it appears that they have replaced the sun beds as we didn't have any problems with them.", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r180606578", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "lovely quite area", "review": "small hotel in a quite residential area , but 10 mins from a most beautifull beach , shops and bars , the hotel was very comfortable and clean  the linen was changed daily, most of the staff were very friendly and helpful  especially the reception and the two guys in the bar / restaraunt dominic and christian but if the lady with long black hair and glasses was on duty forget being served as she will ignore you and was very rude . we enjoyed our stay the pool was lovely not too deep and it was very peacefull no rowdy bars in the area but still a bit of night life", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r180453499", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "ideal for short break", "review": "had a thoroughly enjoyable 3 night stay here experiencing none of the problems of some previous reviewers. our room had a safe,air con,toiletries and daily towel change. hotel is situated in a residential area,10 -15 minute stroll from gorgeous beach. the resort itself is mainly Spanish,with very little English spoken or understood so would suggest swatting up on a few phrases and menu items as it would make for a more enjoyable break.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r179566282", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Would have been great except money was stolen from our room!", "review": "We spent the week from 16-20 Sep 2013 at the Holiday Inn. Decent location. We checked in and went up to our room to unwind and go about out our vacation. We paid the extra money for the breakfast, which was ok. They had a kid table with plastic plates and plastic kiddie cups with nesquick packets and straws but no kids plastic ware, which would have been useful for our two yr old. We had our room cleaned everyday, of course with two little kids it becomes a bit disturbed. The beds were ok, they had firm and soft pillows for preference. We had absolutely no shower gel/shampoo in the bathroom dispenser upon check in, and only one towel for all four of us to share. And as most of us know, after a long day of traveling its nice to take a shower once you arrive in your room. The…", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r178153840", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "A dated 3 star and nothing more", "review": "Dear sjdj82,  Thank you for your review regarding your recent stay at the Holiday Inn Alicante Playa De San Juan, Spain. I would like to address this with you further. I have sent you a private message to obtain more information about your stay. I look forward to hearing from you and being of further assistance.  Sincerely,  Dhan M Case Manager IHGCare", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r177796774", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Another great stay - Can't wait to come back!!!", "review": "Holiday Inn what are you doing in Spain with this hotel, it's poor. Booked as UK ones are very good and I use you often. Arrived 19th Sept for 3 days and given a twin room which stunk of smoke, booked a double room all non smoking. Rusty bath, wallpaper coming off the wall,  2 large holes in the net curtain and as previous user  reports air con is on last legs. We asked reception to find another room only to be told on the 3rd occasion we are full. We offered to go to another hotel and were told no refund as we had booked advance super saver. I reminded them that they were in breach of contract on their side, still no luck even though we had booked on the Holiday Inn web site.  Went to the swimming pool to cool off and guess what the loungers do collapse, twice in one hour,…", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r176260107", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely Hotel", "review": "Just spent a week here with 2 other adults.  It's  a nice clean hotel with basic facilities, which suited our needs.  They have a pool which is 1.3m deep - great for me as I don't like it when I'm out of my depth.  Plenty of sun loungers and umbrellas for shade - some of the loungers collapse unexpectedly - amusing the first once or twice but tiresome after that.  Some of the loungers have arms - these ones are more stable.  The life guard, who is on duty every day, spends time with the children playing games in the pool and helping the nervous ones relax. There are a variety of floats and even a floating basket ball net and goalposts which were used by adults also for a bit of fun.   The room was clean and comfortable however there were no tea/coffee facilities in room :( .  …", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r176152996", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Guest \"please can I have a glass of water?\" Waitress \"NO\"", "review": "I stayed here as a family of 11, 6 adults and 5 children at the end of August.  The customer service was extremely bad and this is just an example of when I asked the lady in the bar/restaurant for a glass of water as the bar pool had been closed for over 20 minutes: Me \"please can I have a small glass of water\"?  Waitress \"no go outside to the pool bar\"  Me \"its been closed for 20 minutes, please can I just have a small glass of water\"  Waitress \"No it hasn't been closed, go outside\" Me \"please just a small glass of water, that is all I want\" Waitress \"No\" Me in reception \"the waitress refused to give me a glass of water\" Receptionist \"she probably misunderstood you\"  Now I'm no travel critic but to me, that just bad customer service.  There were a few other incidents with…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r175710564", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "I love this hotel", "review": "Dear Susie R,  Thank you for your feedback. We take our guest comments very seriously and always strive to provide comfortable and friendly accommodations. I am truly sorry you received service which was unacceptable. We constantly strive to provide an environment of comfort and value to our guests, therefore, we are sincerely concerned when we fall short of your expectations. I have taken note of your valuable comments and will use these to monitor and improve the quality of services we offer to our guests.  Rest assured, your comments will be used for review and actions will be taken accordingly to ensure similar incidents could be avoided.  I hope you give us a chance in the future to show you how great our hotel is.  Sincerely,  Krysllin G Case Manager IHGCare", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r172458961", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Terrible Hotel!!!", "review": "We just got back from A week stay at Holiday in San Juan. After reading various reviews, we were very pleasantly surprised. The rooms Are clean and light, good space and Nice beds and AC. The pool areas Are great, my daughter spent full days in That pool and loved it. The sunbeds does collapse, but there is always available space. Beautiful beach and restaurants, supermarkets and all That You need close by and walking distance. The very best is the athmosphere in the hotel. The friendly, including and relaxed feeling from an excellent staff. They Are like A big family, always smiling doing what they can and more, for their guests. We will definetely come back to this hotel. V", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r169439669", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Nice Hotel", "review": "This hotel is just awful!! Dirty, terrible service, and needs to be majorly updated. I booked this for a weekend stay with my wife and daughters so we ended up booking two rooms. Dont let the photos on their website fool you. The lobby is nice but any other area and rooms/bathrooms are horrible. We had the sink blocked from the first night and when we asked the receptionist to get someone to fix the problem, we were told that there was no one to work on the problem since it was after 9PM and all rooms were taken and we had to use the bath tub instead! I could not wait to leave this place in the morning. I will never stay here again! Only good thing about this place is the close location to the beach.", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r167964669", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Basic, Holiday Inn. Ok, pool area.", "review": "Just visited this hotel with our 4 person family. Our visit was just a one night stay and for that purpose hotel was ok. The nice beach of San Juan is a 5 min walk, but if you want to experience Alicante city choose somtehing more centrally located. Room was big and basic family room with good aircon. Do not expect any luxyry here.", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r167847943", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Great location but could do with modernisation!", "review": "Dear merxell,   Thank you for choosing to stay with us and for taking the time to place a review regarding your recent visit.   We are very pleased to note that you were satisfied with the facilities and services that we have to offer. Your satisfaction is of utmost importance to us as we constantly strive to make your experience a pleasant one.  Once again, thank you for taking the time to write to us. We look forward to the opportunity of serving you in the future.  Sincerely,   Dhan M Case Manager  IHGCare", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r166365134", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Recent visit to Alicante", "review": "We have just returned from 7 nights at Holiday Inn Playa San Juan. We booked it because we'd been told it was close to the beach and all we wanted was a cheap week away in the Spanish sunshine. We also got a good rate for room only so that was great.  From Alicante airport it's really easy to get to the hotel by public transport - we got the bus from the airport and then the TRAM from the centre of Alicante. It it really cheap (about 3EUR each) and doesn't take too long at all. We had to do a bit of a diversion because it was the Spanish celebrations week, otherwise it probably would have been even quicker! From the TRAM stop in Playa San Juan it's about a 5 minute walk to the hotel and you can see where it is as soon as you get off the TRAM.  On arrival at the hotel, we were…", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r165547427", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Not value for Money Hotel", "review": "Dear s4bby85,  Thank you for taking the time to review our property. We take our guest comments very seriously and always strive to provide comfortable and friendly accommodations. I'm very sorry you were not satisfied with the condition of our hotel and it's amenities. The feedback we receive from our valued guests, like you, enables us to target problem areas. We welcome any opportunity to improve.   If there is anything we can do to make your next stay more comfortable, please do not hesitate to ask the Manager on Duty.   Sincerely,  Ferdinand G Case Manager IHGCare", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r165290593", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "GOOD FOR A SHORT BREAK", "review": "Sun loungers collapsed many times and our room smelt of smoke as did some of the bedding but they were the only negatives about our stay. Clean and bright hotel, lovely pool area with plenty of sunloungers. Really close to the beautiful beach and tram to Alicante and Benidorm where we visited. Food in the restaurant was beautiful, up with the best we ate on our holiday. Wi Fi quite poor but access to a computer for free in the hotel was a great bonus for planning day trips.", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r165017368", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "RECENT STAY", "review": "We have stayed at this hotel before, it was again very nice to stay there the room was clean and the Staff were very friendly and helpful, We also had dinner in the restaurant which was very nice and a reasonable price.", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r164950465", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Clean comfortable and friendly hotel", "review": "Our second visit to this hotel and pleased with the standards of the hotel. Room well decorated and very clean with good daily maid service. Nice breakfast and a good choice to suit all palates including lots of fresh fruit. Hotel situated in a residetial area close to a fantastic beach and close to a good range of local shops bars and restaurants. Small pool and sun terrace although watch out for the sun beds as they tend to collapse. Only small niggle is no courtesy tray in the room although there is a well stocked mini bar not too expensive. Free fast wifi and free use of a computer. Good value in a lovely quiet part of Alicante.Some Basic spanish useful in the hotel and local area. Excellent bus and tram service. Stay in Alicante if you want the nightlife, stay in San Juan…", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r163610451", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent value for money", "review": "My friend and I have just returned from a 5 day stay here and we were most pleasantly surprised after reading a bag of mixed reviews on here.  We arrived at Alicante mid morning and quickly cleared customs, (DO NOT waste your money on the expensive taxi ride approx €40 each way.) we headed outside where we bravely boarded public transport, there is a airport to Alicante transfer bus at the cost of €2.90 each in to the centre of alicante, we got off the bus at the central train station in the centre, this journey takes approx 25/30 mins.  We then crossed the road and got the number 21 bus to the holiday inn San juan at the cost of €1.45 this takes approx 25 min's but takes you right outside the hotel. Brilliant bus service at the fraction of the cost of a taxi!  When we arrived…", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r163606191", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Nice hotel, but could be improved", "review": "I had visited this hotel a few times in the past and it's a very convenient hotel for the San Juan beach. The hotel itself is nice with large rooms featuring safes and a good selection of tv channels. The bathroom is big with everything you need. However the rooms have a few little flaws. The beds are set up on wheels, which is practical for some things but even when blocked the beds still move around a little. The tvs are still those old style Cathode Ray Tube TVS which I think in 2013 is unacceptable for a 4 star hotel in a developed country. Now, the hotel is overall very nice with a nice pool outside, a little gym and padel courts in the back. The parking area is fine although fills up on weekends. The WIFI finally worked decently this time (in my last visits it was really…", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r162719698", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Benidorm in Ain't!", "review": "Dear mark1977Montreal,  Thank you for your feedback. Guest comfort and satisfaction are of the utmost concern to us and our hotel is committed to making every possible effort to provide comfortable, clean and friendly accommodations.  Please accept our sincere apology for the shortcomings you experienced. We also regret we fell short of your expectations in some aspects of your stay. Nevertheless, your feedback will be taken into consideration in our efforts to continually monitor and improve the quality and services we offer.   Though I would prefer you had a better experience at our hotel, I would like to thank you for sharing your thoughts and hope that you will consider us again on your next travel.  Sincerely,  Joel B Case Manager IHGCare", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r162716819", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A return to one of our favourite places to stay!", "review": "We had a good  four night stay in April at the Holiday Inn. It's well situated about a 10 minute walk  down to  the beach through a nice area which is relaxing and calm. The staff are always pleasant, helpful and welcoming and our room was spotlessly clean with a comfortable bed and separate bathroom. The bar and restaurant were really useful serving a well priced tasty menu. The pool and surrounding area is lovely ideal for sunbathing and swimming and extremely well maintained. Overall a great break at this very competitively priced hotel.", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r161769117", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good hotel for the beach", "review": "We visited this hotel for the first time in May 2013 and stayed for 8 nights. We had never stayed so close to Alicante before or in that area of the Costa Blanca. We were pleasantly surprised that the hotel was so quiet. To be honest we did not use any of the the facilities apart for a couple of drinks from the bar, prefering to go out for breakfast and meals. The room on the 5th floor was large and very clean, aircon worked very well and plenty of space for clothes etc. Full marks for the housekeeping staff, they were excellent!  This is a very good base to  travel from - start the day with a walk along the spotless promemade to one of the purpose built cafe/restuarants (Niza is the nearest and very friendly). Unlike some Spanish resorts very little English is spoken so prepare…", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r161560363", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Value for money", "review": "Stayed at this hotel in early May for 4 days. Its in quite a residential area, although there are a few bars and restaurants about five minutes walk away. There is a lovely quite (at least when we were there) beach very close by. The rooms were clean and modest. We were not expecting much at the price we paid, (160euro for the 4 nights) but were pleasantly surprized. Good sized bedroom and bathroom, with lovely big bath sheets, as opposed to the small ones usually supplied! The room did smell a little of smoke and when I pointed this out, they did offer to move us. We did not bother, as we both smoke anyway. They are quite short staffed, especially in the bar and restaurant, but Domingo did a fantastic job. The bar prices were very reasonable, as was the somewhat limited…", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r160760425", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Value for money", "review": "Excellent location close to the beaches, very comfortable and clean. The breakfast buffet is first class, as are the facilities. For travelers arriving by train, the tram station is only 100m away and the Cabo Huertas stop is very close to the hotel.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r159980307", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good location and kids entertainment.", "review": "This may be the third time we came to this hotel. Nice in general. Great service. Awesome kids entertainment. Though, this time we noted some lack of maintenance in our room: missing bulbs, some lights switches not working,...", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r159702554", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Thin walls and noisy...but", "review": "I stayed here for one night Easter weekend, which would probably explain why it was so noisy as the Spanish do like to celebrate Easter.  The walls are paper thin which means that you hear everything (and I mean everything - all that celebrating :)) from the adjoining rooms and the hallways.  I ate in the restaurant as I didn't arrive until late, it was OK - I'm a very picky eater - but nothing special.  Had I of had time I would have gone elsewhere anyway. It is a very long way from the airport.  I had to get two buses - one was the airport bus, and then another local bus.  Fortunately I got talking to a few locals returning from holiday and took advice from them.  I did get a taxi to the airport the next morning for speed more than anything else, but would have been happy to…", "date": "March 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r158784181", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Very disappointed", "review": "Dear Miki J,  Thank you for your feedback. We take our guest comments very seriously and always strive to provide comfortable and friendly accommodations. We appreciate your nice comment regarding the food.  However, We’re sorry about the noise during your stay. We will look into this point. I understand the discomfort this caused you. Again, I do apologize and regret that this impacted your experience at our hotel. We hope you give us a chance in the future to show you how great our hotel is.  Sincerely,  Orlando A. Case Manager IHGCare", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r158377891", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Quiet hotel close to the beach", "review": "My Family and I have stayed at this hotel many times. I also have an apartment next door. I am very disappointed that the hotel bar is closed randomly and that the only beverage available for some hours is from the vending machine!  On the basis that some days it is possible to sit by the pool with a glass or of beer or wine and then other days, nothing is available is totally beyond belief. The fact that the under utilised receptionist is unwilling or unqualified to get up and pour a drink for customers is ridiculous. Tried to get details of the manager so I could express my concerns but apparently he is only at the hotel twice a week!  Given that Spain has such economic difficulties how bad is this.  I ate at the hotel last week to find that the waiter said he had not been…", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r157208231", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Alicante Holiday with friends", "review": "Dear caroleek,  Thank you for taking the time to provide feedback on your stay.  It is unfortunate the bar schedule prevented you from fully enjoying your time at the hotel.  We are confident the necessary adjustments will be made, in order to achieve complete guest satisfaction.   Thank you again for your comments, we look forward to serving you in the future.   Sincerely,  Ben J Case Manager IHGCare", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r150582097", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Average hotel...good for the beach", "review": "It is a very quiet hotel close to one of the best beaches. Staff is excellent especially Eva and Marina at the reception. The breakfast served is a good spread, however the other menus are quite limited. The swimming pool was closed on first 2 days of our stay due to maintenance but it was really great for next 2 days. The beds in the room have wheels which can be quite annoying in the night. If you are looking for night-life then it is better to stay in Alicante city as there is not much to do in the evening around this hotel. Overall very good experience.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r149898802", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Pleasently Surprised!", "review": "I booked this as a secret Hotel option because it was advertised as close to Alicante centre, I guess there are many interpretations of close, mine was that it was not as close as I had hoped. However, after reading dissapointing reveiws I had no way of changing my booking so bit the bullet and off we went. I have to say that the Hotel was very nice, clean, pleasent staff and yes only a few spoke fluent English but for me even though I speak no Spanish it was not a problem. The pool and pool furniture was clean and in very good order, towels are available from reception to use at the pool only, not the beach, they get you to sign for a blue ticket and you exchange it for a towel when you want one and they pass it back when you return the wet towel. Breakfast was great, even on…", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r149342695", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Avoid This Hotel!!!", "review": "Stayed for 3 days,I am PC Platinum member, they didn't recognise my status, then didn't get any room upgrade. reception couldn't speak any other languages apart Spanish, then wrote down on the paper my Amex charge card details, when I ask what for, get quick answer that it's them procedures in Spain, and I am not in UK!... but overall at the check in time Receptionist (lady ) was one of the best staff in this hotel, probably she would like to help me, but Hotel is understaffed as there just 1 person on duty and no one else! Hoverer hotel is very old, later I found out that it's around 15 years, rooms is not nice enough for 4 star hotel or even for Holiday Inn. I get really upset on second day on my stay, when I been injured in hotel swimming pool, I've cut myself, then I went to…", "date": "November 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r146207251", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Fine for a cheap base for last minute sunshine", "review": "Dear Grigorijus,  Thank you for being a Priority Club Platinum Member and taking the time to write us a review. It is good to know that you found our location suitable for your needs. I am sorry that you found your stay less than satisfactory due to the service you received from our staff. Your comments have been taken noted and these will be used to improve our efforts.  Once again, many thanks for your feedback.  Sincerely,  Pam G. Case Manager IHGCare", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r145130427", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Good hotel", "review": "We booked the Holiday Inn as a top secret hotel on Lastminute.com when looking for a cheap break away for somewhere sunny in late October. For the price, we can't complain at all, and we got the sunshine we were looking for (around 18-20 degrees compared to 6 in London!).  The good things: Breakfast was plentiful and ran until 10.30am. Standard buffet food, but lots of it The pool area: big and clean, and almost empty when we were there. Too cold to swim but perfect for catching the sun The restaurant: we ate in one night and were extremely pleased with the quality of food and the portion sizes given the price The location: a 10 minute (max) stroll to the beach, where there are plenty of cafes, bars and restaurants (even in the off season, most were open), and a 20 minute bus to…", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r144820898", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Loved it", "review": "Hotel location is really great. It is withing 10 minutes from the beach and about 10-15 minutes from the main cafes and restaurants. The room we were gicen was in a new part of the hotel, on a high floor. It was comfortable, quite and clean. The only drawback was that the bed had rolling wheels and we were waking up with a gap between our beds.  Each room has safe, where we were leaving our documents and jewellery. The hotel has got free wifi and the signal was quite strong in our rooms, so it was a great plus. The pool was good and the area around it was organised well. There are some tables around the pool, where we had our birthday breakfast.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r144473243", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Good hotel, easy to get anywhere from", "review": "This hotel is about a 5 minute walk to the beach which later on in the season was quiet with plenty of restaurants to get a Drink at.   Has a good, if a bit shallow, pool which catches the sun for the vast majority of the day. Free wi-fi was a definite plus for this place too.  Would stay here again.", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r143676248", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Pleasant, Pain!!", "review": "We first arrived to the hotel and we were greeted by welcoming staff, extremely polite and efficient. But we ended up getting a twin room, not ideal for a couple whatsoever! especially after requesting a double. We enjoyed the swimming pool ( except the sunbed that collapsed ever other minute which drove me insane) other then that very clean. Woman at the pool bar was very nice! Right beside the beach which was great.  THEN, to my dismay,on the third day arrived at the hotel room to find that the door could be just opened from the outside without a key...thankfully nothing was missing! I then went to reception where I was told we could stay in the room for the night until it was fixed in the morning ( i thought she was joking as it was only 6 in the afternoon) but she was not!!…", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r143488632", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "2 night stopover", "review": "We stayed here for the last two nights of our holiday prior to our flight home from alicante airport. We had a hire car so this fitted in well as the hotel had large free car park and was only 35 mins drive to the airport.Rooms were large clean and spacious the only downside was there was a slight smell of smoke in the room.  Well located 10 mins walk from the lovely beach area,15 mins drive into Alicante which is well worth a visit.  Nice pool. Breakfast fine. Evening meal fine. Free wi fi all in all  good value for money.", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r143199372", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Affordable and close to the beach.", "review": "Not really my style but picked up a room for a few nights on lastminute.com as a \"secret deal\". Very friendly reception made for pleasant check in but room was as expected....Holiday Inn.  Rated the location as a 3 but depends on your needs. If you want beach, tourists it's a 10min walk away. Town with good restaurants are 20min by tram.  Got a great rate and would recommend for a family looking for affordable getaway option. ", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r142636259", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Nice small hotel", "review": "Had 2 days at this hotel which was well served by bus and tram. All up to the usuall Holiday Inn standard with only one complaint. You could not close the curtains! The rails on each side of the window only ran half way across the opening. A design flaw that should have been seen to when the hotel was new. Very clean and unusall to find such a well maintaiuned outside swimming pool", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r142623510", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Inexpensive hotel close to beautiful San Juan beach", "review": "This hotel is in a quiet neighbourhood of Alicante just 5 min walk away from San Juan beach. The hotel seems to be from the eigthies but has been partially refurbished. We had one of the newer rooms in the \"tower\" which was quite nice and spacious. We had breakfast in the restaurant (12 € per person) which was quite ok but every day the same. The atmosphere was not overwhelming. There is a litte pool with sun loungers. Towels are available but no cushions. There is also a small gym but half of the machines are broken. The staff is in general friendly and helpful. A tramway stop is not far away and you will be downtown in 20 minutes at very low cost. Free WiFi is available with good performance but does not work everywhere in the hotel.  Bottom line: The best features of this…", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r141993771", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely stay for 4 days!", "review": "I booked this hotel as a surprise for my then Fiances 30th birthday (he is now my hubby so I guess I did good ).  We had a lovely time. Clean well kept rooms, lunch menu in the bar was decent. Drinks on tap. The pool was lovely and was never too crowded even though locals pipped in to use it! Would definitely return.", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r141008391", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great Airport stopover", "review": "We stayed for one night before flying home after our holiday in Moraira. The Hotel is a typical Holiday Inn, very helpful and friendly staff on reception, comfortable Air Conditioned rooms, a nice pool area and a reasonably priced bar. There is plenty of car parking available.  The hotel is located approx 10mins stroll from San Juan's long sandy beach. Alicante old town is worth a visit with plenty of bars and restaurants to choose from. A single journey is appox 10 to 12 Euros in a cab.     All in all a great place to stay on the last day of our holiday and as only 30mins from the Airport, it was ideal for an early morning flight home.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r140238084", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Basic but clean and good location", "review": "This hotel is situated next door to our apartment and we use it regularly for family overflow and as our 'local'.   It is fairly basic and rooms and amenities in them are pretty sparse. We try to get a suite if we stay there and there are a few. The prices vary considerably and we have paid between 60 -120 euros depending on the time of visits  Other people say they get fantastic deals for as low as 30 euros a night  Restaurant is quite utilitarian and understaffed  Food not wonderful. Bar staff a bit ratty and unhelpful at times!", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r140194087", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "nice family hotel with a great beach nearby", "review": "We had two short stays in late August and September. Rooms 408 and 508 (both smoking which was the deal we got through Hotels.com). Nice hotel with friendly efficient staff (most of whom speak some English). Rooms were what you would expect from a Holiday Inn. The pool area was nice and the kids had a lot of fun in there. The beach is a short walk and is magnificent- very busy in August but by the time we left on 4th September things had really quietened down. We had super hot weather but the AC in the room made it really comfortable at nights. Pool bar provided us with an easy dinner one night (pizza. sausages and chips etc.) and the bar prices were also reasonable. The hotel has a lot of Spanish families staying in August and the two lifeguards played great games with the kids…", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r139574339", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "dont ask dont get", "review": "we stayed  for   4 nights  on our  arrival we were greeted  with  a  lovely welcome , everything  went  smooth we asked  questions  which were answered . the rooms  are  very airy with excellent  air con and  all you would expect from  a  4 star  spanish hotel. we  had breakfast  included  which was  help yourself  all  nicely prepared  hot  and cold  food  even  the  toaster worked !!  the pool area was  clean and roomy , except  the sun beds were very ancient  kept  breaking and  no cushions and  the  jacuzzi didnt work, plenty of beds  available  at any time of day, the pool bar was  mostly manned  but  for some reson the server went missing  on many occasions. the fantastic beach is  a good  pleasant  15 min walkaway  with ample beds parosols 3.50 euro each bed. many…", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r139479711", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Not that great!", "review": "We booked the Holiday Inn as we thought we could be pretty sure of getting a good standard.  Unfortuately not so.  The reception staff didn't give us any information when we arrived, it was only by accident that we found out that they provided towells for the pool, maps of the area etc.  The room had the loudest air conditioning I have ever heard.  We were there for 6 nights and complained about this after the first night.  A maintenance man was sent up that day.  However he couldn't solve the problem and when we returned to the room that evening we couldn't get in.  We were then told by reception that they had changed out room.  However we had booked a room with three single beds as we were 3 single people, the room they had moved us to had a double bed and a double sofa bed so…", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r136913863", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Holiday out!", "review": "Noisy leaking air con. No Wi Fi in room. Poorly informed staff on front desk. Safe also not working. A very very basic hotel. Nice guys at the pool who were v good at keeping the children amused with very little resources. Thank goodness we were just there for a couple of nights.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r136463898", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Very comfortable stay, lovely breakfast too!", "review": "Dear 5starforme,  Thank you for taking time out of your busy day to leave us a candid review. I appreciate the compliments on our hotel staff at the pool. We are very proud of our hotel and our high standards of service, cleanliness and quality. I am sorry to hear that we fell below your expectations on this occasion. My sincere apologies for any inconveniences and discomfort you experienced due to the condition of the air conditioning unit, internet services and  hotel front desk services. The feedback we receive from our valued guests, like you, enables us to target problem areas and take the necessary actions to ensure similar situations can be avoided in the future.  We appreciate your feedback as this is our best resource for improving guest services. We do hope you decide to give us another chance for a future stay.  Sincerely,  Zelyn N Case Manager IHGCare", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r135822817", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Excellent value for the money and great location close to beach and public transit", "review": "We only spent one night here but it was just great. Comfortable beds, quiet room and plenty of choice for breakfast, even for the British clientele there was plenty of bacon, sausage & fresh eggs. There was also plenty of fresh fruit, cold meats, cheeses & even a special area for children to help themselves! The air con was a bit too cold in the room, but that was soon remedied when we asked at reception for the air con remote controls which allow you to adjust the temperature to your liking. We didn't get chance to use the pool, but it looked inviting and there were plenty of sun beds free. We would definitely stay here again. One other thing, if you want a non smoking room, make sure you mention this on booking as the room we stayed in had a clearly been used by smokers, it…", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r135397444", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Lovely little hotel, great staff", "review": "Had a girly trip out to alicante, rooms were clean and tidy. Staff really friendly and very helpful. Short walk to the beach and restaurants. Sunloungers not comfy at all as old and bowed, umbrellas round the pool were broken but hotel itself was clean, good breakfast buffet selection.", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r134448963", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Excellent stay", "review": "Spent 3 nights at the Holiday Inn on a last minute break. Hotel is well located - 10 minute walk to the beach and restaurants etc.  It is in a quiet residential area and it is extremely relaxed.  The pool area is spotlessly clean and the pool bar was open whilst we were there (I think it is only open in the main season).  Never any problem getting a sun bed - and there was a mix of families and couples.   Guests seemed to be mainly Spanish with a few English.  All the staff at the hotel were excellent and spoke good English.  They were extremely helpful and friendly.   Breakfast was typical european fair - at 12 euros per person, unless you are on a B&B rate is is probably not worth the money.  We ate in the restaurant one evening only and to be honest I would not recommend it -…", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r133600474", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Not bad for the price...", "review": "I had been in Holiday Inn for many times not here. I found this place something amazing. The staffs are friendly, the hotel was clean. I found this place cleaner than other holiday inn franchise.  Definitely, worth for your money.", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r132949519", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Near the beach, nice people...", "review": "As some of the other opinions remark, the location of this hotel is maybe the most convenient in the area to visit the beach (after the hotel Sidi San Juan closed). The staff is nice and they use to promote (free) the breakfast during the weekends.", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r132887118", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Clean and functional", "review": "Convenient location - 15 minutes walk to very nice beach area, 5 minutes walk to the tram stop etc Clean - rooms and the public areas of the hotel were very acceptable in terms of cleanliness Polite - All staff we encountered were pleasant and helpful Bearing in mind two nights here cost us only £70, I'd be delighted to recommend.", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r132524019", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Nice hotel handy for the beach.", "review": "Stayed for a long weekend.  Hotel is 5 mins walk from the beach and is about 20 mins from the centre of Alicante by tram.  We had a good clean room on the second floor.  None of the rooms have a view of the sea, the area is very built up.  Nice pool but the sun loungers really need replaced before someone hurts themselves.", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r131330979", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Holiday Inn San Juan. Alicante", "review": "Just had 2 nights at this hotel. Really nice hotel easy access to Alicante on the tram. Very close to the sea and centre. The staff at the hotel .where very helpfull. Rooms good size and clean. Would stay again.", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r131140474", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Good hotel near the beach", "review": "Hotel is convenient in terms of facilities, is well mantained, clean, room sizes are alright, quality of sleep adequate and alright service. An average 3-4 stars near the beach but not so for a beach hotel (10-15 mins walk). Spa is not such, just a room with a self-service sauna.", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r129267106", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Good place for holidays", "review": "Hotel located very close to the sea - walking 5 min. Hotel have a lot of parking space. My room was clean and big. Hotel also have a outdoor sweeming pool and nice sitting area around , you also can order a drink and food. Staff is very friendly and speak good english.", "date": "March 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r128289099", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "I don't mean to be an American snob, but---", "review": "We had difficulty finding the hotel, and when we called the hotel, the sweet but not-very-fluent-in-English front desk clerk had great difficulty telling us how to get to the hotel.  Actually a clerk at another hotel drew on our map;  we were just a few minutes away. BUT, the room was fine for one night, and the restaurant was better than expected.  The dedicated parking lot was much appreciated.", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r127965234", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "peace and calm", "review": "Nice hotel, stayed a weekend with children, there was entertainment for them, big and clean room employees very nice, shame about the weather, sunny but windy. We will return of course", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r127735443", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "If you are sexually active give this one a miss", "review": "Thank god I god upgraded with my priority club membership otherwise I may have been in the toilet, The upgraded room had twin beds on wheels upon a wooden floor meant when we woke my girlfriend was on the floor and my bed was by the window. On the occasion we ate in the restaurant my side plate had a piece of bread which seemed hard enough to beat someone within an inch of their lives with. The waitress was serving others hot bread from a basket and when I dared ask her for fresh bread she proceeded to my girlfriends amazement to rip the bread to shreds right in my face and all over the table screaming it fresh, it fresh. Hunger forced us onward to order what was advertised as the best paella in Spain only to receive a bowl of rice and mushroom soup with a thumbnail of meat. The…", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r127576383", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Quite good hotel", "review": "Dear AlanBarber,  Thank you for staying with us and leaving a review.  We are pleased to hear you are a Priority Club member and glad the hotel was able to upgrade your room.  I was disappointed to read that when you visited the restaurant you did not find it to your tastes, we will review for possible modifications so to better accommodate our guest in the future.    If there is anything you need next time you stay with us, please do not hesitate to let us know.  Sincerely, Jaime W Case Manager IHGCare", "date": "March 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r127121809", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Good way to beach.", "review": "We (one couple) stayed there with two children (about two years) in one room (bonus point stay). They gave us a big room with two double beds. But it turned out that we needed an additional baby bed to separate the kids. This was charged additionally which was not so nice but at the end usual for hotels. The room (with four people) was ok (four star compatible) but it was always cleaned (four people produce a lot of carbage). Very nice was the WLAN availability in the room. The beds were a little strange (felt like a water-bed, sometimes), The restaurant was most of the time ok. Price -quality relation good. But one day (plate of the day) it was horrible. I can recommend the paellas and the fish. But You should not take the meat. The breakfast was quite good and ond emand they…", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r124442116", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Good value although perhaps a little too far away from the bustle of Alicante.", "review": "The breadth and room cleaning. Convenience and easy access to the beach. Staff pleasant and helpful. Parking facilities. Very good value for money. I liked the situation on the beach. Isolated and close simultaneously. I love how you rest at night. Tranquility. The tub did not work and the card room would crash constantly to use the facilities. That was in a basement room with horrible views.", "date": "February 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r124030745", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Good if you just wanna sleep", "review": "Cheap hotel, good if you're just looking for a comfortable place where to sleep, 10minutes away from the beach, better than the small pool who's always too busy... You better rent a car/or scooter if you choose this hotel, caused you'll be pretty far from town and the night-life of alicante!!!! So an easy-going hotel to recommand more for young travelers without much money than for families... ", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r123278701", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Sucky food served by hotel restaurant", "review": "Overall the stay was nice except for the dining experience i had during my stay at here... The fish that i had wasnt fresh and it tasted fishy, service was good only the food was disappointing", "date": "December 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r121898805", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Comfortable and friendly hotel, 10 minutes stroll from the beach.", "review": "Stayed for seven nights whilst on holiday in the area. Room was of a good size, comfortable, clean and well maintained. Complimentary wi-fi worked well in the room and was a most welcome added benefit. The hotel is well situated in a safe area, amongst other residential apartments and houses. The hotel staff were very friendly, helpful and informative. Breakfast at the hotel was good and to a standard one would expect from the Holiday Inn group generally. The beautiful San Juan beach is a leisurely 10 minute stroll from the hotel. The resort itself is fairly quiet and gives the impression of being a safe, relaxed area with several good standard restaurants and bars. I would have no hesitation in staying at the hotel again and would recommend it to friends etc.", "date": "November 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r121050673", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent customer service....really enjoyable stay - would definitely recommend!", "review": "First of all, as a group of 4 young guys, we found the hotel to be in a perfect location, literally just up the road from the san juan beach. Marta and the team were fantastic and catered for all our needs. Most definitely went the extra mile on each occasion. The decor and facilities of the hotel were up to a good standard.   A big thank you to the team from Amer, Omar, Fess and Abi", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r119978426", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Good value and helpful staff", "review": "Stayed here two nights. The hotel is easily reached by number 21 bus from where the airport shuttle stops outside the Melia at Alicante harbour, the bus stops right outside the hotel. The same bus can be used to go to and from Alicante town at 20 min intervals. A taxi from Alicante was about 13 Euro.  It has a small but nice pool area and is only a 5 minute walk down the hill to the beach. Our room was comfortable and clean with the usual basics. The girls who do reception are exceptionally pleasant and helpful, as were the rest of the staff except the grumpy barman. We had a late flight and they had no hesitation in allowing us to use the gym showers to clean up and change after spending the spare time after checking out on the beach.", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r119451474", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good choice if you travel by car", "review": "Hotel with a lot of parking places, therefore we choosed this hotel for two night stay. It has nice pool in hotel garden hidden from the street. Beach and restaurants are in few minutes walking distance. We were lucky, because 23rd of June thousands of eople were celebrating fiesta San Juan on the beach, made fire in hundreds of places and had fun. Amazing view and positive memories!", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r119333069", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "brief stay ... does the job", "review": "The hotel is near the beach and is a great place for sun worshipers. Previous reviews have described it as difficult to find but we followed the clear directions and got to the property first time. Our rooms were of a decent size and everthing seemed clean. We only had two minor issues - the air conditioning is not the best in or most efficient in the world and the spa bubbles in the pool/jacuzzi did not work and according to a staff member have not worked for the whole season ! Some lovely little restaurants on the beach seafront which is only a short walk away.", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r118366563", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Superb again!!", "review": "Had our yearly stay at the Holiday Inn Playa de San Juan. Fantastic staff.. a big hello to Domingo and his team. Rooms are large with fridge and air con with daily maid service. Food tasty and reasonably priced for bar meals.   Pool is large but never crowded, nor is it too dificult to get a free lounger,there is a pool bar selling drinks and hot snacks if needed. The centre of San Juan is a 10 min stroll away as is the fantastic beach.  This is a business hotel but has many many tourists visiting, there are English people but mainly Spanish in August.  Roll on next August 2012", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r117876192", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Very good family hotel", "review": "We had a problem when we arrived in that we had booked two rooms with the request that they be non smoking and together. The rooms that we were shown to where not like the rooms advertised on the website, they were small and they were not together and one of them smelled really badly of cigarette smoke. I wanted to change to another hotel straight away, however the manager assured us that we would be moved the next day. They handled the situation really well and the next day we were moved. The rooms were a lot nicer and they were together. We stayed at the hotel for eight days, our kids are 11 and 14 and they had a great time. The animation team are very good especially Fernando Salamo and Noelia we hardly saw the boys. We had breakfast at the hotel every day, it was okay. We…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r117830972", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Not much to excite you", "review": "Possibly a 3 star, not 4. Check in was friendly and the staff spoke English.The rooms were big and quite nice. Clean but needs some tarting up. Some lack of preparation as our fridge had not been turned on and contents were warm. The air conditioning was good and there is a swimming pool in the complex. It is pleasantly located about 400 mtrs from  the beach.", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r117337439", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Decent Hotel at a decent rate", "review": "Stayed here for only one night due to issues with the vacation rental we had. Efficient check in, good beds and very clean.  Rate was ok at a 100 Euro for 2 per night, breakfast was extra 12 Euro, but acceptable. Good selection of warm and cold foods, coffee, tea, juices. Breakfast by the pool under palm trees a big +.  Dinner was a bit more expensive, than outside but it saved us looking for a place. Food was good, service a bit \"spanish\", but acceptable.  Wifi signal in the room not good, but in all common areas and the garden very good, and free of charge.  Located not to far from the beach (Playa San Juan), but in a quiet area. Parking was ample, but not locked or guarded.  We would stay here again if we require a room in the Alicante area.", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r116345637", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent Holiday Inn - in a perfect Spanish location!", "review": "Perfect location, the hotel was very clean and well maintained. All staff spoke excellent English and were very helpful from arrival to departure one week later. I have stayed in quite a few hotels and this is definately one that I would return to. If you are looking for a family sun holiday you are only a few minutes from the beach which is absolutely spotless, there are several childrens playgrounds within 3 minutes walk and a very good supermarket again within 3 minutes from the hotel. The location has many local restaurants and bars, I would recommend you learn a few basic Spanish words as the majority of people here only speak Spanish. There are no drunken teenage Brits or 'English Pubs selling beans on toast' in this location which is great if your looking for a genuine…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r116219455", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good hotel not far from the beach.", "review": "Stayed here for 3 nights in July.  Arrived by tram from the centre of Alicante which took about 20 mins and cost about €2.50 each.  The hotel is a block away from the nearest stop (Plaza de Naciones), but the tram goes in a loop around San Juan so there are a number of other stops nearby.  Check in was efficient and we were given a room on the 4th floor.  Most of the hotel is just 2 storey but there is a 5 storey block at one end.  Room had plenty of space and a large comfortable bed. Both the room and the bathroom were clean.  There was also a sofa bed with a slightly tatty cover.  There was also a mini bar.  None of the rooms have balconies and our view was out towards a very large apparment block. We ate breakfast in the hotel twice which was a self service buffet.  No…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r115570465", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Quite a long way from Alicante", "review": "Couldn't agree more with the previous review regarding directions - very confusing. There seem to have been recent changes to route and exit numbers in this area. The correct motorway is the A-70, and the correct exit number is 68. The hotel itself is a decent enough Holiday Inn. Niggles - only one elevator was working (= some longish waits), the bartender charged for an extra beer (wasn't worth arguing - deducted it from the tip), the location is a long way from Alicante (certainly not walking distance - there is a tram but couldn't work out ticketing) and nearby there are many half-finished, half-sold building developments which look awful & will be waiting a long time for buyers in the current economy. The beach didn't look especially clean or attractive (brown sand, like…", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r108489070", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Don't follow the hotel's directions and you'll be fine", "review": "A perfectly good Holiday Inn. You know what you'll get: clean, airconditioned room, choice of pillows, excellent breakfast. But if you're driving yourself from Alicante airport my strong advice is not to follow the driving directions provided by the hotel. The directions on the hotel's website are different from those I received on the booking confirmation direct from Holiday Inn's reservation system - and both are misleading. I arrived at night, and this problem is compounded by the road system in San Juan: many one-way streets, with street signs almost impossible to see in the dark. I called the hotel's front desk for help, and their directions were vague and unhelpful. So if you've hired a car at the airport for your stay, pay a cab to lead you in convoy, and arrive without…", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r106122939", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Excellent all round hotel", "review": "Just returned from a 3 night break at this hotel and have to say it was excellently located for every thing we wanted.  We just got a taxi transfer from Alicante airport which cost 37 euros, then once we were there we used the locln bus service which is cheap and the stops are right at the hotel so no need to walk anywhere.    The beach of San Juan is a 5 min walk and is fabulous, at this time of year it was very quiet and fabuolous, spotlessly clean and you could walk for miles.  All round excellently located hotel and will definately be returning soon.", "date": "March 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r101250886", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "o.k. stay in february", "review": "Well, Friendly personal service, clean rooms, nice breakfast, nice poolarea, ok  stay !  a few minus- every day you have to ask for new on internet, would be nicer if they could just give you a log inn for you're total stay. -the location feels a bit in a neighbourhood with lot of high rice buildings, with no charm. The beach is probably on walking distance, it was to cold in this time of year for us. The location had no wow factor, but i guess if you're going for the beach, in the summer this will be a ok choice. -the rooms hads lots of space ! that's a plus.", "date": "February 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r99086281", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Clean break!", "review": "We went for long weekend on our Priority Points January 21st.   Great pool sun area protected enough to feel warm sun - just what we came for. Breakfast good value. Ate twice for evening meal and both times really good. We had room upgrade very clean and comfortable. Towels changed daily. Reception ladies very friendly and helpful. Only gripe was wi fi signal slow. Definitely go again.", "date": "January 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r94881758", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Ideal for a weekend getaway, superb location", "review": "My wife and I stayed here for a weekend in middle of October.  The hotel was just as I expected.   The check in was efficient and friendly and our room was clean and very comfortable.  It is obviously a hotel that caters for conferences and business meetings but at the weekend it was very quiet which made it very relaxing.  We didn't eat in the restaurant but did have drinks and a bar meal.  The quality was good and I was pleasantly surprised at the cost which was more than reasonable.  The supermarket was literally just round the corner and the restaurants on the beach front were excellent and again good value for money.  I had no problems with connecting to the free Wi Fi with my i pod, but just had to get them to authorise my room on the system each day.  The pool area was…", "date": "October 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r84446276", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "I love this Hotel!!!", "review": "This hotel really is good find and is amazing value.  We stayed there in June loved it so much we immediately booked for October and have already booked again for next year.  It is situated 600 metres from one of the most fantastic beaches I have ever seen. The rates are really attractive and the breakfast at €12 represents pretty good value.  The staff are very friendly and accommodating.  The rooms are spacious and clean and the housekeeping is excellent.  It is approx €30 (with tip) for the the taxi from Alicante airport but it is possible to use public transport (airport bus & tram) providing you only had hand luggage.  The internet is free but they have to activate your room everyday which is a tiny bit frustrating.  Alicante - Playa San Juan is a really nice quiet resort…", "date": "October 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r83961053", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great little hotel, at a fantastic price", "review": "Stayed here for 6 days in June 2009 and have to say, the hotel far exceeded expectations,  from the outside, it looked excellent, just like the promo pics, had seen the other reviews about overlooking apartments, but i have to be honest, they were far enough away to not cause me any concern at all,  the room was very comfortable and spacious, the decor was a little dated, but not badly so, air con in the room was fantastic, good bathroom facilities and a safe also. the only niggle would be that the double bed was two beds put together, which had a tendency to migrate away from each other in the night, leading to the odd bout of being eaten by the bed. but a few well placed books against the wheels helped out there  Housekeeping changed our linen every day, cleaned the room well…", "date": "June 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r81367298", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Perfect girlie weekend away...can't wait for Sept 2011!", "review": "This Hotel is perfect for a weekend stay.  The room was a good size and contained all the necessary items, including a safe and mini-bar.  There is a supermarket just a few minutes walk away so essential snack items can easily be acquired!! The Hotel seemed quiet and there were few children which was ideal for two Mum's who wanted to enjoy the last of the summer and get some R&R time!! The beach is about a 7/8min walk down a slight hill, from the hotel and it is beautifully clean and sandy.  The promenade has a variety of bars and restaurants that were reasonably priced. Will definately come back to tis area and will probably use this hotel again if can get great rates as we found on lastminute.com.", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r80685119", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "excellent hotel cant wait to go back", "review": "Stayed here for 5 days after our flight was cancelled due to the french air traffic control strike. We arrived at 2.30 in the morning and the staff were friendly and efficient getting us all into our rooms. we were  given a suite so grandaughter had her own room and tv.Room was comfortable clean and well stocked with toiletries and mini bar ( not too expensive) We cannot praise the staff enough especially the bar and waiting staff for how they looked after us considering they were unprepared for a coachload of disgruntled holidaymakers who wanted to go home. Swimming pool was excellent although jacuzzi part wasnt working,probably need a few more sun beds. breakfast buffet was excellent, good choices and nice quality food. excellent location, 3 blocks from a beautiful beach and…", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r80147470", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Not sure if this is 4 star", "review": "Stayed for a couple of days on  business trip. Staff are very friendly and helpful, but some struggle with English. I could not get the wifi connection to work (as reported in an earlier review.) decor is probably ready for a face lift. Food is average but reasonably priced. in terms of value for money, pretty good and I would return", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r77003646", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "What a lovely Hotel and atmosphere.", "review": "Just arrived home from a 10 day holiday in this lovely hotel. It was everything we expected and more. Very friendly, clean and the staff in reception were brilliant. We arrived on a late flight and were given a twin room, the next day we mentioned this at reception and were transfered to a large double room. No view but not particularly worried about that as we only sleep there. The walk to the beach is direct about 10 mins stroll down a sloping road. Here you can hire beds and umbrellas if you wish. The sea was lovely and warm and the families all played along the front. Quite wavey at times though. Restaurants and shop all along the front and we walked to El Campello one day. We also visted Altea via the tram which is beyond Benidorm and returned to a fantastic restaurant…", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r74669492", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely hotel - exceeded our expectations", "review": "Arrived quite late - and we were welcomed by name...  our 3 rooms were close together on the third floor.. The rooms were modern and  spacious, well appointed and with efficient but quiet air conditioning.  During the week the hotel was very quiet, but got busier during the weekend.  Free towels for the pool were a great extra - and there were always plenty of beds and umbrellas.  We were often the only family at the pool.  Breakfast was excellent value for money - good selection and regularly refreshed.  Bar service was really good and prices were reasonable.  Domingo and David were great hosts.......and ample outside seating areas.  There was a good selection on the Restuarant (Kids eat free) and Bar Meals menu.and the quality and prices were good.  The resort is mainly…", "date": "June 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r67265123", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good location, but 4* hotel???", "review": "I've stayed at this hotel many times before and I always enjoyed its location and price/quality ratio. However, every time I go it seems to me that the hotel is starting to get old and tired. When I went there about 4 years ago I got the impression that it was a great hotel for a great price but since then I'm a little more disappointed every time. The hotel is still good, but they would really need to change their bed covers that look like they're borrowed from some old motel. The pool is nice, the staff very nice. They claim to give you free wifi internet connection but it only seems to work in the hotel lobby, almost ever time I stay there the connection is very bad in the room and this time it was simply inexistant, at the reception they wanted to help but didn't know how. I…", "date": "June 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r67198929", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Nice hotel, wonderful staff", "review": "Got put up at this hotel for eight days during Iceland eruption.   The hotel is clean and staffed by the most welcoming people being put under extreme stress by the sudden influx of stranded passengers.   The staff coped very well and were very helpful when it came to providing information about the area.   My grandsons loved the pool and their parents loved the proximity to the restaurant and bar.   Agree about location being in middle of concrete jungle but beach was close and very nice.", "date": "April 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r66063590", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "hotel and staff lovely", "review": "we went for a short break and stayeds at the above hotel the hotel was lovely clean and spacious with really nice rooms, all the staff where very helpful however we found the food not satisfactory at all as stated the hotel is about a 15 min walk from the beach however it does not state that it is down a very steep hill making it and the resort very unwheelchair friendly which we where disappointed about because we had been told that it was", "date": "March 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r60559988", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good hotel in concrete jungle", "review": "The hotel has the qualities you expect and we didn't face any problem. The parking was free (which is a big thing in Spanish cities), the wifi was free, but had some minor problems. Generally, the hotel has \"summer resort feeling\". We stayed in March, out of season, and we were busy with our program, so the hotel worked great for us, but i wouldn't really recommend it for summer holiday (at least I wouldn't enjoy it there). It is in the middle of \"concrete jungle\" of tall apartment buildings and it is quite a walk to the beach (must be worse in summer heat). So, overall, good quality hotel in not so good place.", "date": "March 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r59509871", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great location, food, and hotel", "review": "We spent a week here using Priority Club Points which made the stay free but I did look at the prices and if booked in advance some great rates can be found.  The hotel is one of only a couple in Playa De San Juan and when we went in Oct was almost empty dispite the hote weather. Most guests using the hotel were business people and golfers so the pool area was often only used by us.  The hotel has good clean rooms with free wifi which is a real bonus the only down side in the rooms was lack of woking english TV stations. The resturant is great value and the evening meals and daytime snacks are good, the room service in contrast is vile and should be avoided. A business centre with PC and printer is handy for printing boarding cards. The pool is not heated and towels can be…", "date": "October 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r47616449", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good value for money, great for group of lads", "review": "Stayed here for a stag weekend in Alicante in Sept 09, a very decent hotel with a nice pool and good staff. Sergio at the main desk was particularly helpful in letting us know about the places to go and bus routes etc.  The hotel has a very nice restaurant, but is in a very quiet part of town. It's about 15 min walk to a very clean San Juan beach with nice beach side restaurant and close to a supermarket 5 mins away.  It is however, far out from from the centre of Alicante and bars/clubs, so if you're going for that reason it is probably best to go more central. The taxi is about 15 Euros to the centre although the bus stop right outside is only 1 Euro but takes about 25 mins.", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r43849119", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "A very relaxing quiet place - fantastic beaches", "review": "Stayed for just shy of a week and overall had a very relaxing time.  The hotel is comfortable but not spectacular - this in fairness is reflected in the price.  It is advertised on most sources as 4 star - I would challenge that this is good 3 star tops. Truth is it has barely any competition in the direct area.  Our room was spacious enough - very clean - a little tired style wise (but that doesn't worry me much) with all the basics you need - safe, minibar etc.  No tea or coffee facilities in the room which is frustrating and something Holiday Inn need to sort out as a brand - either it is a standard across the estate or not.  Experience has led us to take travel kettle and adaptor now whenever we travel.  I can absorb most cultural differences but I do need a decent cuppa in…", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r42623620", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very good as usual!", "review": "This is our third time staying here, staff are friendly with some like Karina, Domingo Sergio and David  speaking enough English to communicate without to much trouble. We like this hotel for a holiday as it is most relaxing. There is a lovely pool area at the hotel, but if you want the beach, which is spectacular it is just under 10 mins stroll from the hotel . Rooms are clean air conditioned, and modern as the whole of the hotel. Food is restaurant based or room service. we enjoyed whatever we had so I can only go on that. All in all we think that this is a very good hotel, and we will be going back next year.", "date": "August 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r38512942", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Very nice and comfortable hotel", "review": "This hotel is very nice and comfortable. Rooms are very clean, not small. Bathroom was big enough. Breakfast was very good, with lot of food, no matter what time you come to eat. Swimming pool is small.   The area of the hotel is ugly and dirty, with lot of beton block of flats but is very quiet at night. We were very satisfied with this hotel and we would come back if we decide to go to Alicante again.  Beach is about 10 minutes walk from hotel along the block of flats. The beach was clean with many people around. The sea is clean and is very good to swim.", "date": "October 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r34464632", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "decent hotel", "review": "The hotel is in San Juan away from alicante city but the area and location of the hotel is very nice. Its about 7 mins walk from the beach where most activities take place.  The beaches are very clean and very touristy. The people living in the are are posh.  The hotel is clean and immaculate with a lovely swimming pool and a nice restaurant around it but the food is average and not for vegetarians.  The rooms are spacious, clean with big bathrooms and service is excellant. Language is a problem like most places in spain so learn a few words to understand and communicate with them. overall decent nice place to stay.", "date": "April 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r31434923", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Brilliant value and super clean. Near to a beach", "review": "Stayed in the Holiday in for a hen weekend. We were on the top floor and the hotel was quiet - i think we were the only ones on this floor despite it being the UK bank hol. I can barely fault this hotel. It's not 5 star luxury but it is brilliant value and so so clean. The hotel looks very new and i could see no signs of wear. The only down sides were that there was no balcony (you don't need this is you are only there for a few days), no kettles in the rooms although there is a mini bar, and the food in the hotel for dinner was not too great but it's faitly cheap to eat out.   I would recommend this hotel if you wanted to go away for a long weekend to the beach for some sun. The beach is about 5 mins walk and has a long promenade with lots of bars and places to eat. I think…", "date": "May 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r29361982", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Hotel is fine, area is grotty", "review": "Stayed here for a couple fo nights in Oct 08. The hotel is fine - clean, comfortable, nice food and a bar that's open most of the day for snacks etc - pretty much what I expected for a Holiday Inn.  However, it is completely surrounded and overlooked by ugly high rise apartment blocks which are an absolute nightmare to look at.   We went in search of a local cafe and supermarket, and there's nothing nearby. The nearest one we found was about half way along the beach.  There is grafitti everywhere, even on most of the buildings we passed on the way to Alicante town (which is very nice and has good shops)   Shan't bother with this area again - there must be prettier places on the Costa Blanca.", "date": "October 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r21024927", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Average, ok for price", "review": "paid 90 euros including breakfast a night, and was happy with that price.  If i had paid any more I wouldnt have been.  its just a very bland business type hotel, in average condition.  room overlooked pool no  balcony or anything.  bathroom was good.   breakfast was pretty good. pool was okay was clean, but loungers were a bit old, pool fairly small and one depth all round,  good for younger kids. a fair walk from the beach, okay going down but coming back up the hill in 35 degree heat not great.  old town alicante is nice, the rest not great.  its a 10/15 minute drive away.  playa de san juan - the beach is great, loved it.  and some great restaurants along the beach. but you couldnt spend a week here i dont think.", "date": "July 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r18449695", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "ok but need to improve", "review": "Booked and paid 1 month in advance, when I reached the hotel the room was not ready, had to waste time in the restaurant a 4hrs wait, not the usual Holiday Inn service, the front staff were very defensive and were making all sorts of excuses. Rooms pretty basic no coffee or tea making facility in the room. A good decent breakfast, the pool was okay. Restaurant prices are reasonable and the waiting staff were very good with their service. Short walk to San Juan beach from the Hotel, which is very good. The Beach that is the main attraction in this area, which is really good. two supermarkets close by, and if you want to travel to Alicante bus No21 stops near the Hotel cost 1.1 Euro, don’t take the taxi the bus service is very good in this area. If you don’t speak Spanish Taxis…", "date": "July 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r18050803", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Nice Hotel", "review": "Stayed here for 4 nights whilst on a golfing trip with three pals.  Perfectly adequate hotel, clean rooms, friendly staff, good bar and a very decent breakfast. A little out of town but only 10 euros in by taxi.  Highly recommended", "date": "January 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r13887895", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Vacation hotel, room service issues- Not for Business", "review": "Hi,  stayed here 12-17 August.  Booked it because it has wi-fi, so I could stay in touch with my business while away... Wi-fi connection is poor, had about 30 minutes connection over the 6 days there. I would not go there again if I wish to connect to the internet.  Stayed there with my wife & 5 year old son, in a family room. Swimming pool is great, my son loved it. It has a small pool for kids. a jacuzzi - whirlpool, in which anyone can go, so my son loved that  too, and a larger pool. The hotel supplied lounger chairs, towels, and for the younger guests, a free beachball and 'penguins' carry bag.  The rooms are spacious,  with CNN,  a few sport TV channels,  the sofa bed springs can hurt after a few days.  First night we ordered room-service food, french fries and hot meat -…", "date": "August 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r8493200", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Nice hotel, ideal for short break", "review": "My partner and I stayed here for 2 nights in July 07. The other reviews are not wrong when they say the hotel is difficult to find, once passed the hospital follow the signs to San Juan beach then when you see Macdonalds on your left the hotel is more or less at the end of the road on your right. The hotel was very clean and the staff where friendly and helpful. The room was fairly small but fine for 2 nights and we over looked the pool. We paid for the buffet breakfast and I thought it was well worth the 11 euro's. There is some construction work taking place on a building next door to the hotel but we didn't really notice the noise. We caught the number 21 bus from outside the hotel to Campello, it takes around 20 minutes and is full of Spanish Bars and restautrants (and the…", "date": "July 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r8140665", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great short break", "review": "We visited Alicante the last w/e in May 2007.  I booked the Holiday Inn due to it's established name and brand and it did not disappoint.  Friendly accomodating staff, good food and good clean air conditioned rooms.  Location could be better but not a reason not to go back.  The area was VERY quiet but largely due to it being pre-season.  Outside of the hotel and in Alicante in general you can expect the language barrier to be an issue - much to our surprise.  It helps to have some Spanish phrases.  Tips: Walk out main gate of hotel and turn left.  Stay straight & 10 mins later you're on the beach.  Beach was perfect, as good as it gets.  The marina is a ten minute taxi ride (anywhere between €10 - €13) which is where you need to be for the good restaturaunts. The no. 21 bus is…", "date": "May 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r7728070", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Good Value", "review": "Recently returned from a 6 night say at The Holiday Inn Playa de San Juan. Before booking I checked previous reviews which seemed to indicate this would be a good choice. Thanks to openness of Trip Advisor, it proved to be spot on.  Arrival was early evening and the desk staff had everything to hand to ensure a swift check in except that they checked us in to a no smoking room. When they checked on the computer to see if they could switch us they were unable to do so. This proved to be no problem though, as they produced an ashtray and said it would be fine to use the given room as a smoking room !!!!.  Room size was above average and very clean as indeed was the bathroom complete with over bath shower. An efficient air conditioning controller provided the opportunity to have…", "date": "October 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r6029857", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Playa de san Jaun is a must!", "review": "We stayed at the Holiday Inn at Playa de san Juan in September. This is a nice hotel, with a good, though smallish pool which is usually quiet, good for getting sunbeds. Hotel provides towels for pool area. Avoid the pool lunchtime menu though, over priced and undercooked food. Located in a residential area with lots of surrounding concrete, so a car is recommended. Cool and clean rooms and staff were pleasent enough without being overbearing. Make sure you have good walking legs, as there is plenty of walking to get to nearby amenities.  Hotel is a good 10 minute walk to one of the best beaches I've been to. The beach is long, sandy, clean and scattered with nice fish restaurants. Close by are lots of bars, other restaurants and shops. The Frontera bar is excellent, real…", "date": "September 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r5815574", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Super Hotel", "review": "We stayed here for a week in July 2006 and found it excellent.  It is a fairly modern hotel in good condition ,clean and well maintained. The rooms are large, well equipped and comfortable.  There are always at least 2 staff on reception and they are very friendly and helpful. The fairly large pool and surrounding areas are well designed and very clean.  The restaurant is actually surprisingly good and  good value for an evening meal if you don't feel like going out. Breakfasts are excellent - usually included in the price  -with a reasonable selection of cereals, yogurts, cold meats and cheeses, breads, pastries etc as well as bacon, sausage egg etc - and a good selection of freshly prepared fruit -  as much as  you can eat. It is an easy 10 minute walk to Playa San Juan - the…", "date": "July 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r5510861", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very good value", "review": "We just spent a week there over Easter 2005. The standard is good as you would expect from a Holiday Inn. The staff are well-trained and helpful.  It's about a 10-minute walk down to the San Juan beach, although the southern end is currently a building site as the promenade (paseo maritimo) is being rebuilt. Further on, you can walk several miles north along the prom as far as El Campello.  The swimming pool at the hotel is well laid out and usually quiet. I advise asking for a room on the first floor facing the pool.  Outside the hotel is a bus stop for the Number 21 bus which run frequently into Alicante at a standard cost of 90 cent. It takes about 10 minutes.  If you don't want to pay the 20-25 euro taxi fare to the airport, there's an airport bus which leaves from outside…", "date": "March 2005", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1064230-d229442-r3318038", "sub_review": {}, "travel_purpose": "", "rating": 4}]