[{"title": "Comfortable Room and Friendly Staff", "review": "Sitting pretty with an age-old air about it, Karakoy is situated on the European side of the Bosphorus at the mouth of the Golden Horn. Perhaps the city’s most historically significant area, it’s currently one of the most happening parts of town as well. Here street vendors and alfresco fish restaurants line the banks of the Horn where the views of major attractions across the water rival Karakoy’s own key attractions, such as the iconic 14th century Galata Tower and the Museum of Modern Art. A major hub for local and international waterborne traffic, Istanbul’s commercial and maritime heritage remains as relevant and evident as ever in Karakoy. Commuter ferries mingle with luxury cruise liners at its busy port, ensuring a continuously cosmopolitan flow of people..", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2298109-r688204266", "sub_review": {"Location": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Good value ", "review": "Me, my wife and three-year old son stayed July 3-5. The memories are overall pleasant. The location, adjacent to the Galata Bridge, was ideal for us. Sultanahmet was accessible on foot. We had ample opportunity to sit late at the scenic Karakoy. Galata Tower was half a Km. There were plenty of lunch/dinner/breakfast options and a money exchange right outside the hotel street. The room was spacious, and usually peaceful at night, with adequate furniture and storage space and a modern cooling option. The breakfast was probably adequate. Tea was available round the clock in the lobby. The staff members were always smiling and tried their best to tackle any issues/needs highlighted. Mr. Bora stood out for his command of English and booking an excellent sea cruise for us. There were a couple of negatives however. The lift was quite small and suffocating, barely accommodating the three of us. Second, there were problems with the washroom – lack of proper drainage and a faulty door lock. However, given the various advantages we will not mind returning to stay here.…", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2298109-r630654982", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "IT WAS EXCELLENT!!", "review": "Read good and bad reviews but decided to take the plunge anyway. Booked 3 nights. Arrived way too early(06:30) for us to book in but the friendly young man at reception offered us coffee and tea. We left our luggage in a corner on the lobby and took a stroll along the Bosphorus quayside and Galata Bridge and returned at about 11. The good news was that he secured us a room so we could  book in and just rest our weary bodies  for a while. The room was small and had a small balcony with a table and 2 chairs. We ended up booking an extra night and found the room perfect for its purpose, sleep and shower. The breakfasts were adequate with a good selection of cheeses, olives, breads and juices, coffees and Turkish tea. Best of all is the situation of this hotel. Literally a minute or 2 walk to the karakoy iskelesi ( ferry station) or a similar walk to the tram station. You are literally next door to the Galata Bridge with its many restaurants and fisherman. If you like the area but want a more upmarket hotel consider the Ada Hotel Special Class in the same Street. The friendly staff win me over and we'll gladly stay there on our next visit.…", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2298109-r615869229", "sub_review": {"Sleep Quality": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "WORST HOTEL EVER", "review": "it is located in the best place in Istanbul, the room was very clean and the stuff was very friendly and kind. you can visit lots of places on foot due to its good location . it is very close to galatas bridge!", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2298109-r568537364", "sub_review": {"Sleep Quality": 1, "Rooms": 1, "Service": 1}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Perfect ", "review": "This is my 3rd time to Istanbul and my 100th time around the world and I have never been at a hotel this bad! Despite the location of the hotel everything was awful! me and my 2 other friends were crammed into the tiniest room, it can hold 2 people squished together so let alone 3 in the same room. The service was bad, I even asked for 3 extra pillows for each one of us because the pillows were so thin, yet the answer was we only have 2 left, we cannot do anything about it. So I had to sleep there for 4 days with an awful pillow.. I asked them how to get to the airport and they offered a taxi for like 60 euros or maybe a bit more with no other alternatives although I asked until someone walked in and told me to take the Hava Bus for 12 liras from Estiklal sq. so I asked the guy to order me a taxi at 5am to get to Estiklal he said it's close by you can just walk!!!!!!! Knowing that the walking distance is about 30 minutes while wheeling my bags there. I asked him again that I needed a taxi to be ordered at 5am and he said when you come down I will order one, breakfast awful, shower awful with no door or curtain so we shower and have water running all over the bathroom floor,  and people these are just the headlines, I can go on and on about the worst experience I have ever had, but this review will suffice for now. NEVER EVER AGAIN!…", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2298109-r313909770", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Lovely hotel", "review": "Sitting pretty with an age-old air about it, Karakoy is situated on the European side of the Bosphorus at the mouth of the Golden Horn. Perhaps the city’s most historically significant area, it’s currently one of the most happening parts of town as well. Here street vendors and alfresco fish restaurants line the banks of the Horn where the views of major attractions across the water rival Karakoy’s own key attractions, such as the iconic 14th century Galata Tower and the Museum of Modern Art. A major hub for local and international waterborne traffic, Istanbul’s commercial and maritime heritage remains as relevant and evident as ever in Karakoy. Commuter ferries mingle with luxury cruise liners at its busy port, ensuring a continuously cosmopolitan flow of people..", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2298109-r311495427", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Wonderful hotel!", "review": "Stayed here with my partner in January and  September. Rooms are beautiful, clean and modern. Short walk up to all the main clubs restaurants and shops in the high street Taksim. The staff and owner is very helpful and friendly. Me and my partner have both said that this is the only hotel we will stay in in Istanbul. Tried a hotel elsewhere but asked to get transferred to Galata palace again. Beds are really comfortable and prices not expensive. Really happy whenever we stay here. Love it :)", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2298109-r308658193", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "excellent hotel", "review": "This hotel was really comfortable and the staff were friendly and helpful. I used public transport during my stay and it was very easy. It's a good idea to buy a ticket for multiple trips, that way you won't have to keep paying, and you save a little money on the cards. I was booked on a cruise, and the hotel was near the port, but it was also close to everything else  The Turkish people were friendly and helpful, and the food was wonderful. The hotel provided a breakfast of fresh fruit, hummus and a selection of cheeses. I would recommend this hotel to anyone travelling to Turkey.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2298109-r273563761", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Way Better Than I Expected", "review": "Rooms had very good design  and also very comfortable beds.    Location of the hotel is perfect. It is close to everywhere such as Sultanahmet, taksim, Aksaray.This was very cruicual for our journey.  Great personel . They were so helpfull during our stay.Special thanks to mr.izzet and mr.bugra.  Next time I ll come again this hotel without any doubt.", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2298109-r262760285", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "smelly bathroom, no ventilation, wifi problems", "review": "Allright, let me start with what I expected. The hotels in Taksim are way more overpriced while Karaköy is 5 min away. It is also near the Goldenhorn and more close to Sultanahmet, its pretty close to every touristic place I ve been visiting like Galata Tower etc.   So after I spent a bit unnecessary money on Taksim's \"so called luxury hotels\" and didnt wanted to be keep robbed I decided to spend some of my time in Istanbul to find a cost efficient place. Therefore I checked the prices in the close hotels from tripadvisor. Karaköy generally seemed more cheap. I was gonna visit there anyway so end up visiting hotels in that area and find this one with very authentic entrance. It was a bit overdone actually but later I learn from the receptionist that the owner of the hotel also…", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2298109-r235303596", "sub_review": {"Value": 2, "Cleanliness": 1, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Great hotel", "review": "Sitting pretty with an age-old air about it, Karakoy is situated on the European side of the Bosphorus at the mouth of the Golden Horn. Perhaps the city’s most historically significant area, it’s currently one of the most happening parts of town as well. Here street vendors and alfresco fish restaurants line the banks of the Horn where the views of major attractions across the water rival Karakoy’s own key attractions, such as the iconic 14th century Galata Tower and the Museum of Modern Art. A major hub for local and international waterborne traffic, Istanbul’s commercial and maritime heritage remains as relevant and evident as ever in Karakoy. Commuter ferries mingle with luxury cruise liners at its busy port, ensuring a continuously cosmopolitan flow of people..", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2298109-r230054183", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Wonderful", "review": "The view from our room was great. The manager, Bura was very friendly and went out of his way to make our stay comfortable. The breakfast too, was good. The location was extremely central with it being close to the historic area as well as Taksim.", "date": "November 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2298109-r226818728", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Good but nothing special", "review": "Thank you for everything .It was the first time I came to Istanbul .I feel like in my house in this egzotic place . Breakfast was delicious also .Karakoy is a place must be seen in Istanbul. I Like Galata very much. I can live in Istanbul easily. ", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2298109-r207148332", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Good location but not a great stay", "review": "It's hard to find at first time. Very close to Galata tower and bridge - plus. Silent at night, noise at early mornings. Staff hardly speaks English but very nice and friendly.  good cost/quality ratio.", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2298109-r205361605", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "If You love yourself you dont go", "review": "The staff were helpful and welcoming when we arrived but the room smelled damp and musty and was rather warm. There did not seem to be any climate adjustment and the only window opened onto an internal atrium which carried the noise up from the bar/reception area and was quite loud. The dampness appeared to be due to a leaking shower. Despite a bistro menu being displayed outside no food was available when we asked on Sunday evening. The location was very good for seeing Istanbul and it was reasonably priced but when we asked for an airport taxi to be arranged for our departure at 4am the receptionist waited for us to arrive in reception before phoning the company leading to an anxious 10minute wait. The breakfast, which was a set plate, looked very pretty but didn't have much…", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2298109-r173525182", "sub_review": {"Value": 1, "Location": 3, "Sleep Quality": 2, "Rooms": 1, "Cleanliness": 3, "Service": 1}, "travel_purpose": "Traveled solo", "rating": 1}, {"title": "good location, but so basic", "review": "Sitting pretty with an age-old air about it, Karakoy is situated on the European side of the Bosphorus at the mouth of the Golden Horn. Perhaps the city’s most historically significant area, it’s currently one of the most happening parts of town as well. Here street vendors and alfresco fish restaurants line the banks of the Horn where the views of major attractions across the water rival Karakoy’s own key attractions, such as the iconic 14th century Galata Tower and the Museum of Modern Art. A major hub for local and international waterborne traffic, Istanbul’s commercial and maritime heritage remains as relevant and evident as ever in Karakoy. Commuter ferries mingle with luxury cruise liners at its busy port, ensuring a continuously cosmopolitan flow of people..", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2298109-r161913808", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 4, "Rooms": 2, "Cleanliness": 2, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Good hotel in Karakoy", "review": "We ware with a group of 32 persons and had the bad luck of having one of the smallest rooms (istanbul room on 4th floor). the curtains let the light throurgh, so you got awake very early morning, my hairdryer did not work and was not repaired for three days although I asked every day. also the bath room was very small ant the tap of the shower got broken the room was so small, only 4 hangers for clothes. But ok, the weather was nice the location of the hotel is very good and the staff is friendly. Always free water and coffee. Breakfast is just ok , not al lot of choice.  I would only go back if i would have one of the more comfortable rooms, which some of our group members had.  the carpet in the hotel room was not clean beds were ok and we slept well;", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2298109-r144012746", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "do not go there nnnnnnnnnnnnooooooooooty nice", "review": "We didnt planned to stay in this hotel originally but we found it by chance while a walk and went inside to check if they have anything free. The staff was friendly, they showed us a free room, which was big, clean and comfortable so we booked it for two nights. The hotel is in a side streed right next to the Galata Bridge. In a 3min walk one can reach the sea, one of the best restaurants for traditional turkish breakfeast Namli, a famous shop with sweets Koska, the Galata Bridge from where u can take the tram to anywhere. I would say its very central located. Not every room is same , but we had the luck to get a big one. The room itselfe was clean, so was the bathroom, altough it could have been a bit cleaner. The toilet wasnt working for some time, but it got repeared. What i…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2298109-r133814076", "sub_review": {"Value": 1, "Location": 1, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled solo", "rating": 1}, {"title": "Do not go there", "review": "its not nice no swimming pool nothing the breakfast not Delicious don't go there ever", "date": "March 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2298109-r127912535", "sub_review": {"Value": 2, "Location": 3, "Sleep Quality": 2, "Rooms": 3, "Cleanliness": 1, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Excellent", "review": "I don't know how somebody can say that this place is recently renovated.  The carpets are terrible, dirty and the bathrooms were not clean . It was supposed to be a smoke free hotel but our experience was the opposite.  Location was fine but to top it all off the manager Esa  processed the credit card twice and when we can back home we realized what he had done.  Even after telling us he will sort it out he is now ignoring our calls.  We have left it up to the bank to sort it out.  Overall poor experience.  Loved the city though.", "date": "January 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2298109-r123296960", "sub_review": {"Value": 4, "Location": 5, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Very good !!", "review": "Sitting pretty with an age-old air about it, Karakoy is situated on the European side of the Bosphorus at the mouth of the Golden Horn. Perhaps the city’s most historically significant area, it’s currently one of the most happening parts of town as well. Here street vendors and alfresco fish restaurants line the banks of the Horn where the views of major attractions across the water rival Karakoy’s own key attractions, such as the iconic 14th century Galata Tower and the Museum of Modern Art. A major hub for local and international waterborne traffic, Istanbul’s commercial and maritime heritage remains as relevant and evident as ever in Karakoy. Commuter ferries mingle with luxury cruise liners at its busy port, ensuring a continuously cosmopolitan flow of people..", "date": "January 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2298109-r122988770", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "One of the best business hotel in Istanbul", "review": "We spent a lovely vacation in Istanbul staying at the Galata Palace. First the position: the hotel is strategically situated at only 100 mt from the tramway stop of Karakoy and the pier of the boats to the asiatic side and the Galata bridge as well.The Hotel is new, has opened only 3 months ago. Our room was big , clean, and the bed had a high-comfortable mattress. We really appreciate the politeness of the entire staff especially of the director mr. Eldek. We  surely advise the hotel  for a business trip either for a vacation.", "date": "December 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2298109-r122097245", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}]