[{"title": "Beware of unautorised credit card charge.", "review": "Booked and paid in advance for my booking through Hotels.com. The hotel with out any notification also charged my credit card for the room hire. Despite contacting the hotel the day after my return, there subsequent agreement they should not have made the charge and assurances my card would be credited for the unauthorised charge immediately, it was only some 3 weeks later and with the help of my credit card company that my account was finally credited. Very poor customer service from what purports to be a 5 star hotel.", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r723794553", "sub_review": {"Sleep Quality": 3, "Rooms": 3, "Service": 1}, "travel_purpose": "", "rating": 1}, {"title": "Amazingly close to Alhambra", "review": "Very nice modern hotel across the street from Alhambra. Our room was very modern and well appointed. However it could have used a couple of shelves or drawers. The sheets and blankets were very nice. They do have an assortment of pillows as ours were like rocks initially. Reception Staff were excellent. Lots of room in the hotel to enjoy sitting rather than being in the room.  The bus was less than a block.we were not in Sevilla long enough to spend much time in the old section so I’m not sure if the location would have bothered us.", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r720968607", "sub_review": {"Sleep Quality": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Wonderful location & beautiful ", "review": "A wonderful location for touring the Alhambra and beautiful hotel (very nice pool and patio), the service is slow, the restaurant lacking in cuisine and guest attention. Average to poor hotel value, many other places to stay in Granada.", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r716572419", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Great location and property", "review": "The staff was particularly charming and accommodating as the bar was closed at the pool and they were happy to make sure we got cocktails! The room is well appointed and the location is fantastic. The only comment would be that the pool furniture could be refreshed as the chaises were in distress, but otherwise, it was super!", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r715874017", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "It's All About The Location", "review": "Okay. Disclosure. We booked this hotel first because of its location.  We did not want to climb up a steep hill or get crammed in a bus to see the Alhambra.  Lazy, absolutely! This hotel was perfect for us.  We booked a Double room and it was very comfortable, clean and a good size.  Plenty of closet space and room for our luggage.  Loved the bathroom!  Very modern. Had a choice between using the tub in one room or the shower in the other room.  Yes, there were two separate rooms.  The shower head was amazing.  Could have stood there all day after a long day of travelling. The air-conditioning worked well, no issues which was important because it was SO HOT outside!  We booked directly with the hotel website and we received a free breakfast and two bottles of water (which we used at Alhambra).  Breakfast was very nice.  Plenty of choices at the buffet.  There is also a menu at the tables which indicates different styles of eggs you can order- no extra charge.  Had dinner at the hotel. The pizza, burger and salmon were very good.  Staff were very nice and accommodating.  They spoke English well.  They provided maps and recommendations on what to do in Granada.    If you are like us and just went to Granada for a quick stop to see the Alhambra (and lazy), then this is the place to stay.  Great hotel and it's all about the location.…", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r715601557", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Excellent stay", "review": "Had a very good stay at this hotel. Location is next to the Alhambra. Very clean and modern room. Courteous staff. Good breakfast. Walking distance to a few restaurants. Area location was green, very clean. Will stay here again when in Granada.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r715518161", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Right Next to the Alhambra", "review": "The Eurostars Washington Irving has pluses and minuses. The most positive thing is that it is a 4 minute walk to the entrance do the iconic Alhambra. The downside is you are way up a hill with lots os steep steps tp take you into the center of town. There are buses and of course taxis to help you. The rating is 5 Stars which is iffy at best. 4 Stars would be more accurate. Most rooms are rather small as well. A swimming pool is a plus.", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r715263807", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Great location for the Alhambra.", "review": "nice hotel near to the Alhambra.  Hot when we were there so great to have pool on the roof and good aircon in the rooms.  Rooms are good and the food is good as well.  Easy to walk into the centre of Granada.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r715209391", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "Service is Lacking for a \"5 Star\" Hotel", "review": "After the initial check-in, we really didn't have great service at this hotel. No one offered to help with our bags or showed us to our room (typical in a 5 star hotel). I felt like I was bothering the staff when I asked how the coffee machine worked at breakfast or when ordering a glass of wine at the bar. The bar at the pool was closed early and there was no way to ask about it except for going down to the front desk. Also, no washcloths or tissues in the room and an odd layout for the bathroom. The location can't be beat and it was clean, but still not 5 star.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r713125895", "sub_review": {"Rooms": 3, "Cleanliness": 4, "Service": 2}, "travel_purpose": "", "rating": 3}, {"title": "Good location adequate hotel. ", "review": "Front desk staff very helpful. Room was a typical modern basic and comfortable bed.  Art work was beautiful. Breakfast quite good.   Great lunch on terrace which is lovely. Near the Alhambra. Pool was small unheated. Good for cool off followed by sauna. Netflix available on tv.   Housekeeping staff seemed slim and room service not great. Said it would be an hour later in the day. Phone did not work. We ended up with Mini bar dinner.    Nice but needs a bit of work.    ", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r712626670", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Incredible Hotel!", "review": "It gets 3 stars because it was under staffed. The front desk guys checked you in carried bags served as concierge and got the bags to your room. They were very busy and took some time for them to get the bags up and make dinner reservations. Other than that hotel is wonderful. Far away from city center 30 min walk but next door to Alhambra so depending on what your plan is its either comvinient or not.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r711994596", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Nice but not really a five star hotel", "review": "This is a well situated hotel for visits to the Alhambra being right across the street from the entrance. Also the train that does a tour of the city stops right opposite too - handy. It is at the top of a very steep hill through a forest into town so not for the infirm or those not used to uphill climbing. We arrived early and they kindly parked our car and we were told our room was ready. The room itself was fine, but just little things let it down. Firstly the operation of the light switches was strange. Couldn’t get the lights to turn off or on properly. No hooks to hang towels or bathrobes, no tissues in the room -  a used glass left in the room for two consecutive days, no turndown service - all things that a five star should have. The staff were very nice and helpful -…", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r711892792", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Granada weekend break", "review": "Excellent hotel, we had breakfast included and there was good choice.  The staff were pleasant and helpful.  They had many recommendations for what to do in Granada.  The valet parking was very handy when we arrived.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r710603734", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very good location and great hotel", "review": "The hotel is 2 minutes away from the entrance to the Alhamba and also walking distance from the other attractions and many restaurants. The rooms are very nice and modern and breakfast was good.  The staff was nice and helpful. ", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r710289784", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Ideally located for Alhambra Palace", "review": "Step out of the hotel and across the road is the main entrance into the medina of the Alhambra & Nasrid Palaces and amazing gardens. The facilities are excellent with a roof top pool & bar to relax after exploring the palaces and the staff are all very friendly and have good english language if Spanish is a problem. Breakfast is fresh, varied and fully stocked every morning. Finishing touches include robes and slippers in your room which are all modern and exceptionally clean.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r710289343", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Great choice for visiting Alhambra ", "review": "Located right next to the magnificent Alhambra, the hotel allows us to take the night tour of the palace and go back the very beginning of the next day to explore the full glory of Alhambra and Generalife.  It will take a bit walk to the town centre, back and forth.  Well, I would say it is actually a benefit after a full meal in the old town.    The room is spacious, clean and well equipped.  Plus the courteous staff are always attentive and helpful.  Definitely a top choice when visiting Granada.", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r707189531", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Very Poor Service", "review": "The Pros:  Brilliantly located for the Alhambra.  Stylish decor - a modern take on the Alhambra Moorish theme.  The Cons:  On multiple occasions the service from staff across the hotel was poor and disinterested.  We had a problem with a power cut in our room while getting ready, which we were told would be sorted while we were out at dinner. We returned at midnight to find still no power in our room and be informed by reception when asked that we would have to move rooms at this point. We were offered no assistance while we scrambled to find a few belongings in a pitch black room and locate a new room.  The next day we were told the power would be sorted but we again returned from our day touring to find this had not occurred and were told we would need to change rooms again.…", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r706540692", "sub_review": {"Value": 3, "Cleanliness": 3, "Service": 1}, "travel_purpose": "", "rating": 2}, {"title": "Fabulous Stay", "review": "The staff is really profesional and helpfull. We really enjoyed our stay. Lovely room, clean and big. Excellent breakfast and food are really nice. Fantastic Experience we had. We will be back for sure.", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r705722386", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Best place to stay", "review": "We stayed in this hotel and decided to stay another night ... it’s right next to the Alhambra... but more than that ... the rooms are stylish ... clean ... the house keepers should be commended .. I returned to the room to get something and the housekeeper had pulled the bed away .  The pool was lovely and the team serving food at the pool area were fantastic ... perfect Ambassador ‘s for a business ... What can I say ... we live in the Uk and Spain but when not if .. we return to Granada we will be staying here . Thank you to all the team for a pleasant stay .", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r701609818", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent hotel with a fantastic location opposite the Alhambra", "review": "We stayed in the Andalusia suite, beautiful room. We really enjoyed our stay for 3 nights. During our stay the staff provided us every day with nice treats to make our stay even more special. We really appreciated that! Nice swimming pool which gives you the possibility to chill out after a day visiting the city of Granada.", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r701181562", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Exceleent hotel on a excellent location", "review": "Excellent location, near the Alahambra ( 2 min walk)  and an exceelent hotel, beuatful modern hotel, friendly staff, spacious rooms. We enjoyd our stay very much. Staff speaks english very well.  Rooms and bathrooms are very clean. ", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r701164009", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Quality and Style", "review": "I am a frequent 5* traveller and I really liked this cosy hotel. Staff is friendly, rooms are beautifully decorated with quality materials and bfast is very good. The pool on top of the roof is really nice and when I come back I will surely stay in this hotel again. ", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r697782959", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Excellent", "review": "Modern 5 star hotel within walking distance of Alhambra Palace. Only three years old so everything is new and in good condition. Rooms are comfortable and spacious and bathrooms are well appointed. No onsite parking but valet parking available at 20 Euros a day. Reception staff were friendly, efficient and helpful. Great value for a hotel of this standard at 95 Euros for the night although breakfast is expensive at 16 Euros. Rooftop swimming pool is a bonus.", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r696702553", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely but there were shortcomings.", "review": "It was a lovely hotel but our room was not really made for three people.  The room was a little tight. The pool was rather small and when filled with children-- it was not conducive for a relaxing time.", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r696322983", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Al that at Al Hambra.", "review": "We visited Granada for one night stay with the main goal to see Al Hambra. The hotel is perfect situated regarding that and if you want A short and nice stroll to the center and Plaza Nueva. We stayed in room 308 and 309 with 3 kids and 2 adults. Great accomodation and with windows towards the Al Hambra. The hotel has also a nice pool and great breakfast and serviceminded personell. If we visit Granada again we would surly go back👍🏻", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r693087593", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Across the street from the Alhambra", "review": "The hotel is very nice and not at all expensive compared to other similar places. Location, you are right across the Alhambra which means on top of the hill so if you like to go into town you have to come up, which is a 10-15 min walk depending how fit you are. We enjoyed it after a dinner meal. Te staff is very friendly and the Hotel itself a very nice Boutique style hotel with a small pool and an even smaller gymn. If in Granada I would stay there again.", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r693036082", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Fantastic property, but...", "review": "The property is lovely with a nicely decorated lobby/ bar with restaurant terrace and a small rooftop gym and pool.   The location was ALMOST perfect. It’s right across the street from the Alhambra grounds. I say almost perfect because there aren’t many restaurant options nearby and they are both uphill. However, it is only a 15 minute walk  downhill to the city center where you’ll find shops and other food options. If you find the hills too steep, the hotel  is very close to the city bus stop.   The buffet breakfast has a good variety of healthy and hearty selections - including pancakes. I thought it was a good value.  The staff was wonderful - very friendly and extremely helpful. They even provided a “brown-bag” breakfast our last morning because we had an early train.  The…", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r691452090", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "great location, helpful staff... but not a five-star hotel", "review": "We were looking for a 5-star hotel in granada and chose this hotel based on reviews on tripadvisor.  Pros:  • great location (right across from the Alhambra) • very friendly and helpful staff Cons: • this simply does not have the amenities of a 5-star hotel.     • There are only 2 front-desk staff, 1 of whom is the porter who has to move all the luggage from the cars to the     rooms. Of note, we were aware that there is no parking on premises but there is a valet service, which was fine.    • The air-conditioning is not up to par (reading some other reviews here confirms this). This is the only hotel in which the thermostat will not actually tell you the temperature in your room! to do that you have to call downstairs and have them check it on the computer. When we arrived the…", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r690709796", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Beware: not the service expected of 5* hotel", "review": "BEWARE! Booked on their website direct to try and support the hotel. Made an error (my own, clicked wrong button) with dates and contacted hotel within 48hrs.  The daily room rates for the new dates were more expensive and I offered to pay difference and extra for a more expensive room!! Told no changes could be made due to non-refundable rate. Terrible service for a 5 star hotel. WILL NOT BOOK OR STAY AGAIN", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r689963933", "sub_review": {"Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "5 Star Hotel - not really", "review": "Positives: Great location just steps from the Alhambra, capable and friendly staff, a guitarist at breakfast - a charming touch.  Negatives:  Cramped and poorly laid out bathroom (beware the awkward doors - we had a thumb badly bruised), not enough towels in the room, breakfast selection and quality not up to par, no AC in the hall ways, crowded pool area.  Overall: An ok hotel, but just doesn’t measure up to other five star properties", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r689636134", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Dissapointment", "review": "We had lots of expectations with this hotel. The pool service was very poor with only 1 attended and poor food. The location was fantastic but the lack of a car park only made us lost a lot time. The personnel was very helpful but the loading and unloading of bags were too much of a hassel for a 5 star hotel. ", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r689500103", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Loved It", "review": "Just got back from this hotel and we had a fabulous time. The room and staff were both excellent. Breakfast was also lovely and set us up for a day being a tourist, very well. Would happily recommend.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r685191964", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fantastic location, great rooms!", "review": "Eurostar Washington Irving offers a fantastic location right next to the Alhambra entrance (2 minute walk), and you can see it from the entrance. Rooms are well appointed and comfortable, modern great taste with hints of local decorative styles. Highly recommend this place. Staff are friendly, and knowledgeable. ", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r685180731", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great Hotel ", "review": "Nice, elegant, comfortable and perfect location!  Nice decor, just renovated! Big rooms and bathrooms.  Delicious buffet breakfast and good quality restaurant!  Very knowledgeable, helpful and friendly staff! The Alhambra just in front!!!  ", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r683377863", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Excellent", "review": "It is a hotel with excellent service and location. Everything in the hotel is furnished so that one can relax and do nothing. A big plus is the sea salt pool. This hotel has 5 stars. I was very satisfied. And I'll be back.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r683201140", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Very nice hotel and location, rooms a bit dark", "review": "Eurostars Washington Irving enjoys a privileged location at the footsteps of the Alhambra, making it very convenient for guests to tour this historic site. The decor is modern and the service is businesslike. The bed quality and bathroom/shower was of good quality. The motion sensor lights in the closet kept turning on and off which was a bit annoying. The wood panelling in the rooms with yellow lighting made the rooms somewhat dark but this is a small issue. I would rate the hotel 4-4.5 stars instead of 5. Very competent hotel. Overall grade A-", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r682697718", "sub_review": {"Location": 5, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Beautiful Property", "review": "I was amazed with the service of each one at the front office. Every person were very friendly and very co-operative.  The rooms were very nice and all the amenities were excellent.  The food is excellent.  Highly recommended.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r682312395", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Clean and Efficient with no Soul", "review": "We were very happy with this hotel in every way. It is right next to Alhambra and a pleasant walk away from the town. The rooms are new and clean. Breakfast was nice as well.   My only issue with the hotel is that it feels like a business hotel in Dusseldorf. No feeling of the surroundings whatsoever. So if it is the Andalucian experience you are looking for you will not get it. Other than that you will find a good hotel with good service which was more than enough for us.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r681816592", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Perfect location - friendly staff - quality hotel", "review": "We spent two nights there in June 2019. It had the feel of an international 5 star hotel throughout. Room was spacious and bathroom was high spec with brilliant shower. Hotel is located almost on the grounds of the Alhambra Palace. Hard to get any closer. I had one problem with the valet parking   But Angela the manager called me later and personally apologised and cancelled all my parking charges.   You can walk to the centre of town in 10 minutes all downhill and get a taxi back for €5.   Staff were professional and helpful.   We didn’t get time to use the pool, gym or sauna but they looked well appointed and clean   I would not hesitate to recommend this hotel.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r681530223", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Granada and the Eurostar", "review": "The Washington Irving is a good place to stay at. Modern, spacious and very well located to La Alhambra and to downtown Granada (through a beautiful garden forest).  Breakfast is great. The vallet parking  service is mandatory if you go driving.  The hotel staff was always ready to recommend what to visit and where to eat. ", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r680945192", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely", "review": "A very happy two nights in March with a luxurious bedroom overlooking the Alhambra.  The hotel is definitely worthy of its five stars, very stylish and really comfortable - room and bathroom were amazing.  Hotel staff were helpful and friendly, providing directions and great food recommendations for the town.  Bar staff were chatty, explaining the craft beer options.  Breakfast was really good, fresh and delicious.    We parked in the Alhambra car park and left it for two days.  It's walkable to the city centre from the hotel; Granada is busy and not a great city to drive in as roads in the centre are way narrow.  Top class! ", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r680039669", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Glad we stayed there", "review": "We debated whether to stay here or in the city centre, and felt we had made the right decision. The hotel is opposite the Alhambra, but is equally convenient for trips intot he centre. Easier to walk downhill into the centre thanto go back up the hill, but only a short taxi ride if you are feeling tired. Not sure about its 5 stars, more of a solid 4 star in my opinion, but still very good. A good bar lunch. aND VERY PLEASANT AND HELPFUL STAFF, ESPECIALLY cRISTINA WHO HELPED US SORT OUT A MINOR PROBLEM THAT WAS ENTIRELY OF OUR MAKING AND NOTHING OT DO WITHTHE HOTEL BUT WHO HELPED US WITHOUT HESITATION. wE WOULD STAY THERE AGAIN.", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r679804226", "sub_review": {"Value": 4, "Location": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Close to the Alhambra", "review": "Granada is a hilly city so may not be ideal for guests who cannot walk unless you have made arrangements for the hills. Took a tour of the city unfortunately could not get tickets for the Alhambra. My husband had a fall so we were restricted to what we could do however it would be a paradise for jogger and hikers..there are a lot of interesting places to eat we however stayed for one night and ate at the hotel. Rooms are very comfortable the breakfast was very good a lot of variety. bought chocolates at Sabor Espano", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r678324288", "sub_review": {"Value": 4, "Location": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Perfect hotel", "review": "We had 3 rooms overlooking the Alhambra for a 4 night break with family.  Rooms were spotless and very modern.  Large bathrooms with bath and shower. Breakfast was fantastic; lots of choice and Nespresso coffee. One evening, we ate in the bar, which was very nice.  Drinks reasonably priced. This was our second time to Granada, it is a relaxing city, and is worth going to just to see the Alhambra.", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r678279620", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great service & great location!", "review": "This is an excellent location for visiting the Alhambra.  Service is excellent!  Highly recommend staying here.  Hotel offers valet parking off-site, has a small rooftop pool and has nicely appointed rooms.  The Alhambra is less than a two minute walk from the hotel on a quiet tree lined street.", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r678044646", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Perfect Hotel to visit the Alhambra", "review": "It is the perfect Hotel to visit the Alhambra. Very friendly staff, excellent room and parking services, nice recommendations for restaurants in the old town. We liked the hotel a lot and enjoyed the time.", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r677988554", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great location, great facilities", "review": "Our stay at Washington Irving was great. On arrival check in was easy and our hire car whisked away and valet parked for us. The room was spacious and well appointed. Decor is modern and quite minimalist. The room was spotlessly clean. The bathroom had separate bath and walk in shower and   lovely toiletries. We enjoyed late afternoons at the pool with cocktails - a great way to spend a couple of hours after sight-seeing. The walk into the centre takes about 10 minutes and is down hill through gardens next to Alhambra. We also walked back each time as although it's uphill it was a pleasant walk. Breakfast was great with loads to choose from on the buffet which served hot and cold choices. All in all a great hotel with friendly service in a great location.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r677988348", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Best Location for the Alhambra", "review": "Wanted something close to the Alhambra and parking so we didn't have to drive in Granada. After a rustic hotel in Ronda, we decided we wanted something different. The Washington Irving is beautiful, walking distance to the Alhambra and the center of town.  We enjoyed the beautiful room, awesome shower, secluded patio and the ambiance of The Who,emplace. The staff spoke English, were very helpful and such a pleasure to work with. Wait staff at breakfast and for late night cocktails were professional, courteous and fun.  Breakfast is a vast array of items with superb coffee, tea and fruits, meats, cheeses, eggs to order and beyond. Best breakfast by far.  This location is really nice.  Parking is nearby, it's a walk to the Alhambra and a bot longer for sunsets up the hill.  We…", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r677225508", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Comfortable and convenient hotel", "review": "Location is perfect for visiting the Alhambra-- less than 10 minutes walk to the entrance.  It's an easy walk down hill in to the main part of town.  We took Ubers back to the hotel (it's a steep walk up hill)  The hotel has as excellent bar and restaurant with friendly staff.    Our room was nicely designed and clean.  Excellent air conditioning and shower.", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r677199023", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fabulous Hotel", "review": "We thoroughly enjoyed our stay in the Washington Irving hotel. The room was excellent with views over the Alhambra and the staff were very helpful. Breakfast was always good but walked to the town in the evenings so never tried dinner.", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r676502370", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Echo all the 5 star reviews", "review": "It's hard to think of anything that's not perfect here. The service and staff couldn't be better; your whim is their command. Ok, it's modern, nestled just below the Alhambra entrance, but being modern is refreshing after so much glorious architecture and history. Give yourself a treat and stay here. It's our second visit and I hope not the last. ", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r676340352", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Beautiful  fully restored hotel ", "review": "Located directly opposite the Alhambra Palace and walkable into city centre- downhill. Get a taxi or minibus back ! Hotel is understated luxury. Very comfortable. Very stylish. Staff are very customer focussed. Lovely pool area. As a tribute to Washington Irvine- there is a small library/collection of his books. Chargeable valet parking available if arriving by car.", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r676038922", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Carolyn O’Gara", "review": "Excellent hotel.  Staff so helpful & friendly.  Rooms - soooo clean and all you need.  Breakfast - excellent.  Tip - book a room with breakfast & parking included - well worth the tiny extra.  Great pool area.  ", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r675999060", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent and we haven’t even left yet!", "review": "I just know the rest of our three day stay will be good. Luxurious room, spotlessly clean, very helpful reception staff and barman. Quite unlike our previous Eurostar at Mijhas golf, where we had no hot water for two days!  But according to them everything was ok as they said we could move rooms on the third day! Unfortunately we are leaving this brilliant hotel and going back for one night to Mijas. I wish we could stay here instead.", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r675511632", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Amazing hotel and 3-4 minute walk to Alhambra.", "review": "Great hotel and every detail of the room is designed for perfection. All lights are either backlit or recessed. Service was amazing. There is a cool little library of Washington Irving's earliest books.  There is a pillow menu! What is that!?!?", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r674067286", "sub_review": {"Location": 4, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great location so close to Alhambra", "review": "My husband and I stayed here from 7/26-7/29/2018.  Breakfast was included.  Cost was 551€/$603.82 for the 3 nights in the cheapest room which was a double/twin.  The per day charge was different depending on the day of the week.  We stayed Thursday, Friday, and Saturday.  Thursday was the cheapest rate and Saturday was the most expensive rate.  We had a rental car so parking for that was an additional  54.0€/$62.99 for the 3 days.        We were driving from Cordoba.  No GPS in the car.  We had no trouble finding Alhambra but all we saw was a parking lot.  Couldn't seem to find the street for our hotel.  No signs.  Eventually we were directed by a guy walking near the parking lot we first saw.  The street that we thought was for the parking lot is actually the street where our…", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r673980946", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Perfect place!!!", "review": "First time in an Eurostar!! Always stayed in an American brand but we try this hotel because the location. A true 5 star hotel! Everything works as expected! Comfy beds, very spacious room for european standard. They charge about 18 euros for breakfast buffet but you can have fresh fruit and order custom eggs. We didn't have a formal dinner at the restaurant, instead have some drinks ,pizza and pasta at the bar. Great food!. Location is just in front of the Alhambra in a hill. You can comfortable walk down to the town about 20 minutes or take the bus that stop a few feet from the hotel. The personal is very courteous and willing to help you. I definetely recommend this hotel and stay again when back to Granada.", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r673848315", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Hot", "review": "Room way too hot despite repeated requests to have it turned down it would always revert to scorching.  Handy for the Alhambra but  nothing else. Bar is soulless and breakfast a bit hit and miss, not enough staff, one poor man doing everything. Pool area a little shabby, uneven paving, dirty pool. Woman hosing down the pool area carried on and sprayed us with water while we were on the sun beds. Poor lighting throughout", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r673361646", "sub_review": {"Location": 3, "Cleanliness": 4, "Service": 2}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Almost 5 star", "review": "Given 5 stars by the city of Granada criteria but 4 stars for the hotel and 5 stars for the kitchen and service. Reception outstanding and very helpful about tourist sites. Rooms great but, as noted by others, nowhere to hang towels and robes and no complimentary water. The hotel is perfect for access to the Alhambra but at the top of a hill which may be daunting for some but ideal for us after a big lunch! We had a wonderful dinner at the hotel with amazing service from our waiter Moses. The food was 2-3 star Michelin.", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r671437360", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "The best hotel to visit La Alhambra", "review": "A couple of weeks ago, we stayed at this hotel and rented two rooms. One with a King and a second with 3 beds (it was actually two beds and the opened sofa bed).  If you are going to visit La Alhambra, you MUST stay here. It's right across the main entrance and in the middle of the Alhambra environment.  It's 15 - 20 minutes walking from downtown, so if you want to be in the city environment, the hotel is not for you.  Very peacefull and quite environment. Don't come here if you want to party, because it's not the place.  The Front Desk staff is very corteous and accomodating.", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r669239680", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Well presented but lacking for a 5 star", "review": "The property looks nice and so do the rooms, although there is a distinctive lack of character. It looks like a stylish business hotel.  The rain shower in the rooms is fantastic and the breakfast buffet was of high quality. Sadly the staff at breakfast were not the most enthusiastic.  Unfortunately there are several points that lead me to leaving a 3 star review.  We were celebrating a significant birthday. I emailed them in advance and they promised a surprise to recognise the birthday, but they didn’t do anything. Not even a birthday card.  On arrival by taxi under the rain with 4 suitcases, no one offered to help. A 5 star hotel without a porter is something I’d never heard of before.  No water in the room apart from two small bottles on arrival.  No turndown service.  One…", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r669182097", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Warm and welcoming", "review": "Hotel is lovely, staff went far above to make us feel welcome!  The location is perfect for touring the Alhambra or walking in to Granada.  Gorgeous gardens and paths.  Ask for a room with a garden view. ", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r667851654", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A real 5 Star hotel", "review": "The location, facility and staff of this hotel are the absolute best.  We had a beautiful view of the La Alhambra. I would recommend this hotel to anyone.  Although not inexpensive, it is a very good value.", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r667636974", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good option if you are just visiting the Alhambra", "review": "The hotel is immediately opposite the entrance to the Alhambra so very convenient for that.  It is about a 20 min walk downhill to the town and a bit of a slog back for the able-bodied and potentially very difficult for anyone else.  Not much else near the hotel - there is a bar-restaurant next door and the Alhambra Palace hotel a few minutes away, which has an outside terrace bar with an amazing view.  Well worth a visit and a drink, which was also excellent.  Nothing at Eurostar that you would make you want to have dinner or a drink in the dark, nondescript bar.  The buffet breakfast was excellent.", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r665355256", "sub_review": {"Rooms": 3, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "So close to the Alhambra!", "review": "Such a great hotel in the best location for the Alhambra. We even walked to and from the city, but be prepared for hills. Excellent staff, so polite and helpful.  Good size room and a lovely bathroom! Will definitely recommend to friends and will choose the chain for other locations. ", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r663533722", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Quiet and convenient for visit to The Alhambra", "review": "Beautiful hotel in easy walking distance to The Alhambra across the road and down the hill to the town center. Staff was really helpful in retrieving and sending something I left in the room. Great breakfast included. Bar is nice place to relax and have a salad or sandwich.", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r663305058", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Granada at its best", "review": "The best hotel to start our road trip of Andalcia!  Hired a car from Granada  Pre booked car parking arrived at the hotel to be greeted by valet parking which was fabulous as the hotel is in the grounds of the Alhambra. Perfect position hotel and staff can not do more for you. Room was perfect, very modern, beautiful bathroom with separate bath and shower.  French balcony overlooking the Alhambra. Beautiful view day and night . Breakfast was fantastic couldn’t have wanted for anything. Hotel recommended Restaraunt for the evening in the old Town together with great tapas in the day. Would highly recommend this hotel you won’t be disappointed. ", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r662886035", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Super location and service!", "review": "Stayed for 1 night and wish we could have stayed longer.  The hotel is located very close to the Alhambra and a quick 10 minute walk into the town area.  Rooms are very modern and bathrooms are up to date.  Breakfast was included and it was great.  The staff is very helpful and friendly.  I would stay here again.", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r661862292", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great experience ! ", "review": "We visited Granada to submerged ourselves in Alhambra for a couple of days. If that’s your plan, this is the hotel for you. All you have to do is open your window and you will see the Alhambra walls, listen to birds and breath the Fresh air. Quiet lovely!!!  The hotel is modern, well kept/maintained and well managed as far as I could tell. Staff are very friendly, informative and helpful.  Rooms are spacious, modern and comfortable but if you can go for a suite.  The views and the fresh air you get when you open all the windows is very very nice.  I recommend talking walks during the evening. You just have to step outside and trust me, you won’t regret it. ", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r658635368", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Overall good", "review": "This hotel is in a great position minutes from the main entrance to the Alhambra and a short walk through a beautiful park down into town. Overall it was a great hotel,the reception staff were very good especially the young man who arranged our flamenco evening and collected our car. The bed was very comfortable and the room spacious. A few niggles The cleaning of the room was just about ok there were some suspect hairs on the floor !!! The towels were thin I would expect better if it’s a five star hotel The breakfast was poor with hot food running out and it appeared understaffed The lighting in the room was overly complicated That said we had a comfortable stay and the location makes up for it all.", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r658507800", "sub_review": {"Location": 5, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Superb Hotel by the Alhambra Palace", "review": "Recently stayed at the Eurostars Washington Irving based on a recommendation from a neighbour. Didn't disappoint. The location is next to the Alhambra Palace which is the number one tourist location in Granada. The centre of the city is a 15 minute walk down hill although a little longer when coming back. The staff were friendly and helpful. The room was comfortable and we had a view of the Palace from our balcony. The breakfast buffet had a good selection. Would stay at this hotel again. Recommended.", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r657555030", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great location and services", "review": "So close to The Alhambra for easy access.  Great services at reception and breakfast venue.  Highly recommend.  Easy connection to town by bus, walking, taxi, and could enjoy the quiet evening.  Room is clean and well equip for all we need.", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r656163927", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "In love with Granada", "review": "The Hotel it have a perfect location, in front of The Alhambra! Surrounded by nature and history. Walking distance(by a beautiful park) you can get to the Albaicin, Paseos de los Tristes and the shopping area. Rooms are very clean and spacious, very quiet area comparing with other hotels in Granada. Is you need parking they have Valet service for 18e per night.", "date": "February 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r655426661", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "A chic design hotel very close to Alhambra at the uphill ", "review": "The reason to choose this hotel is because it is just 4 minutes walk from Alhambra.  And some of rooms can see the Alhambra very closely.  Our stay is in winter time, so the surroundings is quiet and peace.  Every morning and evening we walked 10-15 mins to the downtown via a beautiful garden (we believe it belongs a part of Alhambra)  right next to the hotel, it’s just a straight ramp, very enjoyable if you like walking and don’t kind to get yourself few exercise.  Otherwise you can take mini bus right C30 or C32 right next to the hotel.  The hotel is neat and clean, I was informed that it is just 2 years old, so everything in the room is quite new and in very good condition.  A tiny but beautiful balcony   Staff is very helpful and responsive in all aspects, our special thanks…", "date": "February 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r651321540", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice hotel next to Alhambra", "review": "Nice modern facilities, well maintained. Very white location. Walking distance tó Alhambra. City centre is by taxi for 5 Eurós in 10 minutes. Taxis are widely available. Excellent breakfast but a bit expensive. Very pleasent and helpful pesonnel. English is well spoken.", "date": "January 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r649853930", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Great staff and location", "review": "The staff are wonderful, you get sense that they would accommodate any request.  Also the location for the Alhambra is perfect.  There are a couple of negatives though.  If you get a room facing the road you will get some noise from the cars going over the cobblestones.  The other negative is the hotel seems a bit flimsy, for example when my neighbours slammed their door my bed would actually shake and the screen behind the bed would rattle.  Despite these two things I would definitely stay again if I return to Granada.", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r645881237", "sub_review": {"Sleep Quality": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Mixed Review - pre-book the Alhambra !", "review": "It's a 5 star hotel right opposite the Alhambra castle. We arrived to find there is no parking and told the valet will park your car some 3km from the hotel. Also were informed that you have to pre-book online access to the Alhambra which we had no idea so that option was taken away immediately. Walked into the town of Granada down the hill from the hotel some 10 mins and found the area really disappointing, somewhat dirty crowded tapas bars and really no good food option. We had dinner in the hotel , ordered a well done steak that had to be sent back twice as first time came out raw, this is something that really bugs me in restaurants of a 5 star hotel. The restaurant could do with some music , it had no atmosphere and the bar area is pretty dark and gloomy, only one member of…", "date": "January 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r644520524", "sub_review": {"Sleep Quality": 3, "Rooms": 3, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Visiting the Alhambra", "review": "The hotel location is extremely close to the Alhambra and within walking distance of number of bars and cafes. Be aware that the hotel location is high up and so the traveller needs to be reasonably fit to access the shops at the bottom of the hill by the steps. The staff were really helpful and the room really good value for money and peaceful. Breakfasts were served in a small restaurant being a mix of table service and a buffet with a good selection. We eat out at night so can't comment on the evening meal quality.", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r644258031", "sub_review": {"Sleep Quality": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Highly recommended", "review": "An excellent modern hotel with friendly and attentive staff. The rooms are spotless, spacious, comfortable and stylish. Breakfast offered everything. A genuine 5 star option for any visit to fabulous Granada.", "date": "January 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r643797779", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Pleasant Stay", "review": "Excellent attention by the Staff. Room very comfortable and very nicely decorated. Expectations from such a 5 Star hotel fullfilled.Excellent breakfast, too. Surrounded by the beautiful Gardens El Generalife the hotel is in a quite place, in a relaxed atmosphere far from the crowded main streets which was what we were looking for.It's a nice 15 minutes Walk to the centre.", "date": "January 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r643457457", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent ", "review": "It is really difficult to say what could be found wrong with this hotel. Location is excellent, good price for value, staff is excellent. Receptionists are really helpful. Separately I would like to say thank you to receptionist Kristina for your help. ", "date": "January 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r643361724", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great Stay", "review": "The hotel is large, spacious, and modern. The service was flawless, hospitable, and fast. The hotel is right across from the Alhambra, making it a great location to access the complex before the crowds come pouring in. They have valet parking for about 17 euros a day. It is a quick taxi ride down the hill to the city center or if you are up for a jaunt about 10 minutes down the hill. I recommend staying here for a morning visit to the Alhambra.", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r640707944", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Alhambra visit", "review": "Very good location rooms are brilliant along with the facilities staff very helpful I would stay at this hotel again close to the bus stops and easy access to the walkways into town very clean well presented hotel overall.GK", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r640355037", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "First hotel I  have stayed at with a “ pillow menu”......", "review": "Yes you can even choose which pillow you would prefer. I rang down to reception to change mine, and 3 minutes later there was a knock on the door and hey presto - two feather pillows. This really is a nice hotel to stay in, clean, modern and roomy. Go up to the top floor and checkout the fitness room and sauna, and outdoor pool - immaculate, although I did not avail myself of the facilities. The breakfasts are lovely, you can go and help yourself to the usual fare, of which there is plenty, or order your eggs poached, scrambled with ham or cheese, boiled or fried. Coffee from capsule machine, good selection of teas and fruit juices and the selection of cakes and pastries has my mouth watering, even now. Bedroom very nice, with a small balcony overlooking the wall of the…", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r639135449", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Fantastic hotel in a great location", "review": "Stayed here for one night as family of 4 in two rooms (2 adults and 2 kids) and honestly cannot and do not want to find any faults.   The rooms are spacious, the location is superb (1 min from entrance to Alhambra and a 5 Euro taxi to the centre of Granada).   We spent 2 hours in the bar which was lovely and cosy.   All the staff at the front desk and the bar were really pleasant, knowledgeable and friendly.   We are returning in April 2019. ", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r637418956", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "FANTASTIC", "review": "We had a wonderful stay at the Eurostar Washington Irving. The hotel it’s self is beautifully decorated, and the rooms are excellently appointed. The hotel has a very peaceful ambience with the various water features and roof top pool.  The hotel is set in amazing surroundings, in close proximity to both the Alhambra as well as the town.  The staff are as you would expect of a 5 star hotel and you would be hard pushed to find a better alternative in Granada.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r636855580", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Fantastic Alhambra Location", "review": "Beautifully fitted out inside with lovely well planned rooms. everywhere spotlessly clean. Reception very helpful. The rooftop pool would be lovely in the warmer months. The Alhambra is minutes away so the location is excellent. The centre of town is 10 minutes walk down hill with various routes all of which are different and lovely walks. The little red busses cost 1.40 euro's per trip and its possible to go to all places of interest on these buses from outside the hotel - great to avoid walking back up the hill!!", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r635360399", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Beautiful Spanish hotel in a forested park just outside the walls of the Alhambra", "review": "We were in Granada in November when the city is alive with autumn magic.  Washington Irving is really a 5 star hotel with very low prices.  I don't know how they manage because everything (rooms, dining room, hotel style and amazing location) is very first class. The rooms and the entire hotel seem new with a contemporary Spanish style.  The location is in the vast forested park that surrounds the Alhambra.  When you walk out the door into the park you're only about 100 yards from the Alhambra entrance (couldn't be better)  It's a beautiful downhill walk of about 15 minutes through the park to the best Granada neighborhoods.  You can walk back up the hill or take a cab for 4 or 5 euros. A very restful and romantic place to stay in the enchanted city of Granada. Note on the…", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r632359692", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great service", "review": "The hotel staff has been really great and with their friendliness and helpfulness has made up for much of my travel disaster (hotel-unrelated flight issues...). I'd go there again!Especially in summer, this hotel is wonderful. And its proximity to Alhambra is another plus!", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r630964212", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Great hotel a few steps away from the Alhambra", "review": "I stayed one night at the Eurostars Washington Irving with my wife (November 2018).It was our first time in Granada.The hotel was surprisingly nice and welcoming.Great welcome from the front desk team. The rooms are spotless, large and well equipped. Our room (#303) was overlooking the Alhambra walls: wonderful at sunrise!Breakfast is succulent. All in all a great, modern and well managed property in which you feel good.   ", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r630613241", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent hotel and brilliant location!!!", "review": "Great stay and extremely pleasant and courteous staff! Full points.  The rooms are really nice,toilets are a bit small but pretty manageable. Tea coffee facilities in the room are good. The outside patio is lovely and great to just unwind and chill. The food to is great. We had lunch and a breakfast, both were super. Great sangria's!!!  The location is superb and just 2 min to the Alambhra so it was really convenient as we could just come back and and then go back again. ", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r628771352", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great hotel, great location ", "review": "The main attraction of the Washington Irving is of course its location. The hotel directly faces the Alhambra with both the main and secondary entrances less than 5 minutes walk from the lobby but is also a very reasonable 10-15mins  walk to Plaza Nueva (centre of Granada) down a lovely tree lined path. For reasons of location alone I would wholly recommend the Washington Irving. The hotel itself is modern and stylish and we found our room very comfortable with lots of space and a really nice rainfall shower in the bathroom. An added bonus was the fruit plates that the hotel staff kindly brought to our room every afternoon! The food at the Washington Irving was well above our expectations with the wide variety of cakes at the breakfast buffet being particularly delicious.…", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r627998610", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Unexpectedly lovely hotel", "review": "Great hotel just outside the Alhambra walls.  Very modern, great wheelchair accessible room, friendly staff, wnderful breakfasts - what's not to like?  The hotel is quite small (63 rooms I think) and, at least when we were there, no coach tours.  The restaurant, bar and terrace are all wonderfully peaceful.  Great food too.    Lovely.", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r626911598", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "All look impressive but service and customer service severely lacking", "review": "The hotel looked modern, classy but anything but!!! It's all a facade. Location is great for Alhambra, Hotel appeared 5 star and classy. Hotel leaves something missing. 2nd day i reported to reception a leak from bathroom the room above. I got re-assured maintenance had looked and said the leakage resolved. To my horror, the leakage happened again. I almost slipped and fell on the floor. The following night i got moved to another room on the same floor. Barely no apologies or word spoken when i checked out. Over 1 month has passed, the hotel has charged to my credit card for a parking fee when i did not bring my car! 7 days has passed and no refund but a limp apology. Still no refund; is this how a supposed 5 star hotel behave and conduct a complaint??", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r626618621", "sub_review": {"Sleep Quality": 4, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 2}, {"title": "Kevin T", "review": "I would like to say that this hotel was good value for money. The staff where very helpful and quite unusually the bar prices were very reasonable. As for location we found it was a really nice downhill walk (15/20 mins) walk to the centre, which has a great number of bars and Tapas bars, really enjoyed the beautiful city of Granada, we will see u again ", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r625895097", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nice hotel but not a 5 stars !", "review": "The location is definitely the advantage of this hotel, just across the famous Alhambra. From this point you can easily reach the city centre with the minibus C30 or C32. It is also possible to go by foot ( 15-20 min ) but the return will be hard ( steep climb ). The taxi station is nearby and a ride costs 5-6 Euros. The touristic train starts from here but it's not worth the money. The audio-guide is useless ( more music than comments ) and the train is so uncomfortable that you will get back pain in place of informations about the city.  The Eurostars is a well designed, very clean and lovely hotel but the negative is essentially the poor service. The staff is rapidly overwhelmed and sometimes you may wait a long time for small things. Our experience at the bar was…", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r625086556", "sub_review": {"Location": 5, "Rooms": 4, "Service": 2}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Extremely rude bar keeper", "review": "Was stopping at this place to have lunch with the family after a visit to the Alhambra. I have encountered one of the rudest services I have experienced so far in the Spain. Especially the attitude of bar keeper everything than customer oriented. ", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r624217286", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "About that Wine...", "review": "We’ve been traveling through Spain and have stayed at Eurostar’s in route from San Sebastián to Granada. Ascetically, we love them. They have beautiful facilities with modern design and an attention to detail that is impressive. But, the service has been merely good, not *great* and it isn’t consistent or anywhere near as congruent as their properties are visually.   To point:  Inconsistent bath/robe/tea station items resulting in calls to housekeeping.  Lighting/HVAC in room not easily managed resulting in more calls “for help”  Breakfast buffet is nice, but while breakfasting asked for WiFi password and was told to go to reception desk to get it ( what?)   At Bar, bartender was openly hostile when we asked him if he would make a recommendation on a bottle as the offerings  “by…", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r623579267", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great Location if Visiting the Alhambra", "review": "I visited Granada specifically to see the Alhambra so this was a great hotel for that. However, it is a little ways from City Center, though there were several buses that came and went quite frequently so it was too inconvenient to get around. My room was very nice with a view to the courtyard. I had breakfast included which why only four stars because the breakfast was just so-so. My omelets both mornings was really overcooked and not so nice. Actually I could have left off that expense and enjoyed breakfast out in town. The receptionist was really helpful in showing my how to walk through the park to town which made the walk so much shorter. But returning in the evening after walking all day I had to hop on a bus because the walk would have been a bit up hill and I was…", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r621857589", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Luxury, great service & perfect location", "review": "This 5 star hotel met every expectation.  The staff were all outstanding especially Cristina.  All of our questions were answered with a smile & endless patience.  The location is perfect if the focus is on visiting Alhambra (5 min walk to main entrance or Puerta de Justicia closest to Nasrid Palace).  The room & bed are very comfortable.  The shower is amazing!  There are supplies to make tea & coffee in the room. Air conditioning worked fine in room plus reception & restaurant had a comfortable temperature.  We ate at restaurant our first night due to late arrival & pizza/pasta were fine with excellent service & reasonable prices.  The cold fruit infused water was a welcome treat at reception in the warm early October weather.  Take some time to explore the library & history…", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r621330198", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "5 Star ratings but 3 star facilities - lacks good air-con", "review": "The location should not be an excuse for being complacent about giving great service. A 5 star rating is deceptive - the communal areas of the hotel were too hot and and air on was off and the air con in the room was almost useless. The room was on the verge of being uncomfortable and the fan was very minimal with only a trickle of air. The centralised system means that guests don’t have proper control of the temperature in their room despite the wall mounted control which seems to be irrelevant. I requested an iron and ironing board and was delivered an iron on its own.  I rang reception and was told that the board was in use and told to use the bed as a replacement for the ironing board. Is this really 5 star service?.  Ironing facilities are amongst the very basic of hotel…", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r620076044", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Worst experience ever!!! Be careful they might sale your booking to other hotel!!!!", "review": "We booked a junior suite with Alhambra view 3 months ago through Agoda and fully paid in advance. When we checked in, the lady in counter just told us it’s fully booked and there’s no room for us and we have to be moved to the other hotel assigned by them already !! What’s the hell? I was speechless and the lady looked at my face calmly and asked “don’t you understand English?” I responded angrily because I surely understand every single words she said but I cannot understand how this thing happens in a 5 star rated hotel? She said vaguely it’s because there’s some trouble between them and Agoda. If it’s true, they should inform their guests in advance and give them the choice to refund the money and book the hotel of their own choice. On the contrary, the took your money, in…", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r619922545", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Mixed experience", "review": "A bit disappointed that when we booked through the official website it redirected us to the Chinese version, which seems to be an outsourced provider. That was counted as our bad luck then as we could have booked through the English website and got free breakfast and water!  There were 7 flies on the ceiling. Glad we kept some light on at night so they didn’t really move!  Shower area was a bit small compared to the large bathroom.   Room was quite modern and looked new. The tv was wayyyyy too large given the room size but we would gladly take it.   The best part is the location of course which is so close to the Alhambra Palace.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r616777049", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Romantic trip to Andalusia", "review": " I tour of Andalusia would be complete without the Alhambra and this hotel is the closest to the gates. It is ranked 5-Star and generally lives up to its rating friendly staff (maybe a bit young and I experienced but not to the point it was a problem). We got a junior suite and the Alhambra was literally right across the street. They have a full bar and restaurant, swimming pool, sauna, and available massage. I took advantage of that. Loved the shower combination of overhead, waterfall effect, and handheld. Includes bidet.   Beds comfortable and a wide array of pillows available. We chose memory foam. On our final night we returned to the room and were met with a rolling tray with a nice plate of fruit complimentary for last night. ", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r616614633", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Location, location,location", "review": "Fabulous hotel in the perfect location. Ideal for visiting Alhambra. After five hours walking around Alhambra the hotel being so close was fantastic. Staff very well trained and courteous.Can recommend this hotel highly.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r615742205", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Wonderful stay!", "review": "My friend and I stayed here on 6th September and we loved everything about this hotel! From the moment we arrived we were struck by the friendly staff and peaceful environment. The hotel is very stylish and even has a rooftop pool and bar. Gorgeous room with a fantastic bathhroom with twin sinks, bath and the best rainfall shower we had ever experienced. The food is excellent too. We had some delicious tapas and breakfast was superb. Perfect location for the Alhambra, 10 mins walk to Plaza Nueva just a bit longer coming back up the hill but you can always catch the bus. Wish we had stayed longer!", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r614761795", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Perfect hotel, right next to Alhambra", "review": "The hotel has an unbeatable location, right next to Alhambra. The service personal was exceptional. They openly offered to help with planning a great surprise for my wife. Thank you !!! The breakfast was also very good. Rooms are very well organized with everything you need, and amazing bath. ", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r614748531", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent location", "review": "We stayed at the Washington Irving in early August.  The location is great, directly across from the Alhambra.  It is walking distance to town (downhill) and on the way back you take a bus or taxi.  The hotel was very nice, the rooms were modern and even a quaint swimming pool.  The only problem was that we had ants in our room and changed rooms but he second room also had ants.  I think this is a problem in the south of Spain at this time of the year as we had the same problem in Seville. But regardless they need to find a solution. Everything else was great but because of this I can't give them a higher rating.", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r613580792", "sub_review": {"Value": 4, "Rooms": 3, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "One on the best hotels", "review": "Stayed in the Andalucia suite,greated  with delicious pinacolada at arrivals,very good location for those who planning to visit Alhambra Palace.Walking distance at the right is the main gate to get the tickets, walking distance to the left to get into the palace through the justice gate.The hop on bus across the street.Walking distance to the city centre.Nice spacious suite two rooms with large family room,well supplied,the breakfast is nice specially the outdoor area.the staff so nice specially seniorita Cristina was so sweat, helpful and professional ,we wish her and all of you the best.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r612931291", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Fantastic for the family ", "review": "We stayed at the Eurostars as the family room looked like s good option (4 of us travelling) and we were not disappointed. We had a junior suite with an adjoining room. It was very spacious and meant 2 bathrooms which is handy. The location is perfect for visiting the Alhambra. We had tickets booked for 8.30 for the Palaces. Had breakfast (which was included) and headed down to the justice entrance. Probably could have left at 8.15 and still arrived on time but was paranoid! There are plenty of signs showing you where you are so it’s not too tricky. The main entrance is only 2 mins up the hill. We went to a concert at Generalife at night so that was convenient. It’s about a 15 minute walk up or down the hill to town which we walked a few times (legs were a bit sore the next day…", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r612761166", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Disappointed", "review": "My husband and I chose to stay here for a special birthday visit to Granada. I must say the hotel is in a fantastic location and the room we chose was a deluxe superior with terrace. Unfortunately when we were getting ready for bed on our first night we noticed we had ants on our bed! We discovered they were coming in from the terrace and climbing up the wall. We were then given another ‘basic’ room with twin beds to sleep in for the night and a promise to clean and spray our deluxe room for the following nights stay.. unfortunately this was not the case and again at midnight my husband and I were moving rooms due to ants. Although we loved our time in Granada our stay at the Washington Irving was extremely disappointing. To make matters worse on checkout we were told that only…", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r608936680", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Superb", "review": "What a delightful hotel. We couldn’t have asked for more from the friendly staff, gorgeous suite and wonderful breakfast. The location so close to the Alhambra was excellent. Drinks at the bar were relaxing and room service was most efficient, though next time I would ask for the pasta dish to be hotter.  We would not hesitate to highly recommend this hotel to anyone visiting Granada!", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r606464373", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great hotel", "review": "We wanted to stay close to Alhambra during our visit in Granada, because we had tickets both for day and evening entries. This hotel is as close as it gets. It was easy to drive to the hotel with our rental car, and they took care for the car for us (there aren't many places to park in the area).  Breakfast was good, and we tried the lunch menu as well. The city center is reached by walking down the steep hill. A lovely walk, but you may want to reconsider if you have a difficult time walking a lot.  The hotel has a rooftop pool. It was not very clean when we visited in march. The staff probably though no one would swim in this temperature, but we would have if the pool had been clean.", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r605582478", "sub_review": {"Sleep Quality": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great stay", "review": "It seems like the building itself has been renovated recently. The hotel is beautiful as well as the decoration. The breakfast is excellent and the food in the pool area as well.   Everyone in the hotel is extremely friendly and happy to engage with you at any point. They genuinely try their best to please you.   The hotel is located within 3 minutes of the Alhambra by walk.   By far this is the best Eurostar hotel I’ve ever stayed. After Granada I went to Córdoba and it wasn’t as good as this one.", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r604507902", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "About Eurostars Washington Irving", "review": "Great experience: allocation, decoration, Staff behavior, breakfast, rooms details and one incredible and fantastic swimming pool (...probably this is not a reason in Winter...) ...I will back for sure!", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r603545429", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Loved it", "review": "Great location, lovely rooms with very quiet air-con and amenities, excellent well informed staff, great buffet breakfast, valet parking worked a dream and rooftop bar was great for cooling off in . All in all a perfect hotel from which to explore Granada for a few days..", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r597731800", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Really a 4.5!", "review": "The Washington Irving is located about a 3 minute walk from the entrance of the Alhambra.  The location for that could not be any better.  It is not located in the city center however so you should decide where you will be spending your time.  The C-3 bus runs from the Alhambra to the city center, right by the hotel, and with cabs being pretty cheap, about 5 euros each way, the location was right for us.  The BEST things about the hotel is the nice pool they have.  After a long afternoon of sightseeing, the pool was great!  Also the staff of the hotel is absolutely first rate.  They were helpful, not only with issues related to the hotel, but also in helping us address a flight issue we had, recommending places to eat or places to shop, and were extremely professional.  The…", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r597097960", "sub_review": {"Value": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Very good", "review": "We stayed for two nights for visiting Alhambra and the old parts of Granada.  The hotel was beautiful and well designed  and the breakfast was good, 18€. The stuff was very polite and friendly. I would have given five stars if the WIFI would have been better and the swimming pool bigger. ", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r596414689", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Washington Irving would have loved to stay here!", "review": "My husband and I spent two tourism-packed days exploring Granada and the Alhambra. Knowing that the city is hilly and not always easy to navigate, we sought a 5-star hotel online that was in the best possible location. We found it, for sure! This Eurostars hotel was a bit disappointing on the outside, with an unassuming exterior, but inside the recent renovation was more than satisfying. Our room was not what I would call spacious, not compared to other 5-star hotels, but we did not request an upgrade and were satisfied with the soothing pallet and modernist vibe. Likewise the bathroom was accommodating but not grandly spacious. Now, wouldn't one expect a turn-down service, 'free' water, and maybe even a bon bon on one's pillow after a day of touring in high 'thirties temps?…", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r593018098", "sub_review": {"Value": 4, "Location": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Fabulous staff and hotel", "review": "Friendliest most helpful staff fabulous  From the moment you walk in to your departure they are incredibly helpful and friendly. The hotel is wonderful just a 3 minute walk from the main gate to the Alhambra and the city tram tour almost directly across the street. The pool area is on top and required going up some outside stairs but Eady to navigate. Pool is salt water and very nice as is the pool.area. we canned into the old city and cabs cost about 5 Euros well worth it Alhambra park directly across street. Rooms large and very nice.   Loved this hotel", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r592536569", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "ULTRA-MODERN AND BY THE ALHAMBRA", "review": "A very modern hotel with a rooftop pool situated just about as close as you can get to the Alhambra Palace complex. The reception staff are most helpful. The rooms are furnished and equipped to a very high standard. There’s a courtyard where you can find shade for much of the day. Excellent buffet breakfast. Valet parking makes use of a nearby car park. Access to the remainder of the city is down a long shady pedestrian tree-lined walk: what goes down has to come up which takes rather more effort but, all round, an excellent choice of hotel.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r591984882", "sub_review": {"Value": 4, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Almost 5 star", "review": "This is an excellent location for viewing the Alhambra as it is directly across the street. We had a view of it from our window. The lobby and the restaurant/bar and the rooms are modern and roomy. The bathroom had a separate tub as well as a rain shower. The bed was king size with luxurious linen. We did not think the hotel deserved its 5 star rating because of the lack of attention to detail in housekeeping. Items removed from the honor bar were never replaced. At one point I had to go to the front desk to request more coffee packets as they were not replaced each day. We stayed three nights so replacements were in order. The price charged was in keeping with the 5 star rating, but the hotel did not live up to it.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r591497350", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Amazing hotel and next to the Alhambra", "review": "We stayed three nights at the hotel and we highly recommend staying here. The hotel is practically brand new and it is clean and luxurious. A visit to the Alhambra is mandatory while in Granada. Well, the Alhambra complex us just across the street. So there is no need to rush if take a taxi if your tour starts early. You can also walk down to the city without leaving a beautiful park located across from the hotel. So walking all the way to the city is easy and using the easily accessible trails of an amazing park. The breakfast at the restaurant is good but expensive. A better option is to buy pastries when in town and bring them back to the hotel to have breakfast. While in Granada do not forget to eat Churros con chocolate. The churros in Granada were better than in other…", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r590332214", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Almost perfect", "review": "I honestly really liked this hotel. I thought the aesthetic was really nice and the modern style of the lobby was very appealing. The service was really great from what I experienced. The guys at the front desk were super nice especially this one dude named Alberto. The rooms were pretty small but I didn’t mind because we were only there for two nights. The biggest issue we had was that our rooms were four rooms apart because our suite was cancelled. I mean it worked out in the end but that was kind of disappointing. Overall though I really liked the hotel.", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r589343839", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Can’t fault", "review": "Excellent location for the Alhambra, Albaicin and for the old area of Granada most are interested in etc. Cannot fault room, helpful staff, breakfast very good. Down a quiet road so we had undisturbed sleep. Pay for parking but they drive it away for you so no concerns finding space.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r588970689", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Super city hotel with rooftop pool", "review": "Stayed here in June for one night. Virtually opposite the Alhambra. Very friendly and efficient staff. Fabulous buffet breakfast and great rooftop pool and bar. Valet parking 18e per day but worth it - would definitely stay here again.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r588848617", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A gem of a hotel", "review": "This hotel offers everything to make your stay very comfortable indeed. Friendly and helpful staff. Excellent rooms. Delicious, top quality food in the restaurant -especial thanks to Moisés who made our meals memorable with his recommendations and attention. Fantastic location -opposite Alhambra and ten minutes walk to the centre. Will certainly stay again and would recommend it to friends and family.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r588553205", "sub_review": {"Cleanliness": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very tasteful", "review": "This hotel is lovely but decor is a little dark so my not suit the visually impaired. The rooms are well appointed and the location could not be better for Alhambra Palace.  There is no car parking at the hotel but valet service is availabe at €18 daily rate.  Breakfast choice is good and staff all very pleasant and helpful.  Automatic toaster (Kitchen Aid) has too many buttons with icons that don't seem to mean very much. I needed assistance which is embarrassing for a guy with a degree in Electrical Engineering. If we were in Granada again, I would book this hotel as it is in a really tranquil location but only a short walk to the city centre albeit down a steepish hill. Taxi back up hill from main square only €5 - money well spent after an afternoon at   one of many local…", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r587327725", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Superb hotel, room, breakfast ", "review": "Just opposite Alhambra you find this hotel. What did I enjoy it, service is very good, rooms are very good, breakfast is very good and it has a small pool and roof Terrace. Small notes: not all staffmembers did understand english and lunch is not That good ", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r587208337", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Our favourite hotel over our 3 week trip", "review": "We chose this hotel for its close proximity to the Alhambra Palace - in fact just across the road,    Quite a trendy, minimalistic  hotel inside with a lovely pool and bar area.  We had a problem with our shower on the first night and straight away we were helped to move to an upgraded room.    Superb breakfast - it had everything.  My favourite breakfast of our trip.  We had two lunches by the pool bar and dinner one night in the restaurant.  Excellent food and excellent service and in fact my husband's pudding was to die for.    Everyone we dealt with in this hotel  was very pleasant and helpful and certainly a credit to the hotel.  Great stay.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r587016760", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "so disappointed", "review": "I asked if possible for a room with a view (garden or pool etc) we booked months ahead yet met people who had booked  a few days before, at a similiar rate and got the view. We had booked the hotel as it was close to Alhambra as I cant walk a long way after chemo- hence when resting a view is nice. We actually got NO VIEW at all, just a look at another window with bars on it. Checkin was very friendly but after that standards dropped. the bar and restaurant was way understaffed with one person managing both, so we gave  up trying to get a drink and waited a long time for lunch. This was the only hotel on our European trip that disappointed.   breakfast was ok", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r586818389", "sub_review": {"Location": 4, "Sleep Quality": 3, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Nice hotel, in front of the Alhambra!", "review": "The Washington Irving Eurostars hotel is perfectly located to visit the Alhambra and the city center of Granada (walking distance).  The nice rooms are very clean (big tv screen), with a nicely decorated bathroom (rainshower).  A rooftop sundeck with a small swimming pool and a poolbar is the perfect place to relax after a walking tour in the city center or the Alhambra. Even though a few more sunbeds would be appreciated by the guests.  We enjoyed the breakfast with a varied offer of cheese, ham, fresh fruits and bread.  If you visit Granada by car it’s good to know the hotel has a private parking with valet service.  We appreciated the friendly attitude of the staff.  Highly recommeded!", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r586685172", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Perfect location for The Alhambra", "review": "Stayed at 5* Eurostars Washington Irving for two nights whilst visiting Granada and The Alhambra, Very conveniently located, modern and well furnished. We were located on the third floor which was very quite and overlooked the restaurant patio area. The room was clean, comfortable and the bathroom was modern and well laid out. Breakfasts were excellent with a good buffet choice and made to order eggs. We had dinner both evenings and the menu choice was good, food quality was excellent and well presented. The staff were all very helpfull, friendly and attentive. Was surprised however as is expected in a 5* hotel  that a daily bottle of water was not provided", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r586464821", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Great stay", "review": "  great location, quiet place. almost in front of Alhambra entrance and about 12 minutes downhill to busy historic downtown. After hours of walking in the Alhambra it was good to have  the hotel just in front of it.      Rooms are spacious, modern, quiet, good sleeping bed and quiet air conditioner. Great shower.     Restaurant for dinner deserves an special comment: It was a hidden gem. We decided to try the first night and end up having dinner every day in the hotel. It was peaceful and quiet. Special attention to the service where Moises run the place efficiently. Food was very good and prices similar to many restaurant in the old historic center. Most of the restaurant in the historic center are packed, noisy,  not cheap for the quality of food offered,  for the simple…", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r585846450", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Comfortable room and fantastic location", "review": "The location of this hotel was perfect for us. The hotel is across the street from the Alhambra and tucked away from the noisy Plaza Nueva. The walk from the hotel to Plaza Nueva was serene. The hotel lobby is beautifully decorated. There is an outdoor seating area to soak in the sun. The fourth floor has a swimming pool, gym, sauna, and changing room. The bar on the fourth floor was closed during our stay. At check-in, the front desk recommended a few popular restaurants. Our room had a nice warm decor. There were different master setting for the lights in the room (relax, work, welcome, sleep). The fridge was tucked away in a closet that was not easy to find. They do not provide complimentary water for making coffee and the cleaning crew took away the water bottles we bought.…", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r584856783", "sub_review": {"Value": 4, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice enough but not a five-star hotel", "review": "Self described as elegant and romantic, it is neither. It’s a very decent functional hotel. The staff is very good. The rooms are nice but nothing special and certainly not luxurious. My room is very dark which makes staying near the Alhambra nothing special.", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r583388345", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Great staff, greatlocation", "review": "This hotel is within a comfortable 5-10 minute stroll to the Nazrid Palace and the whole Alhambra complex. The rooms are very nice, including excellent shower and bath, etc. Lovely breakfast. Overall, however, it is the staff who make this place a cut above the average. The reception staff do a good job of seeming to know their guests and Rosa deserves special mention for orienting us on the city, the sites, and, critically, the buses for those uphill climbs to Albaicin and back to the hotel. ", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r582704193", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great rooms!", "review": "This is a great hotel located directly next to the Alhambra.  The room was VERY comfortable and everything exceeded expectations.  I got a great rate booking the day of for two nights.  The buffet breakfast is very nice too.  When you're travelling for a while and you want some modern comforts - stay here.  ", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r582218545", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Five minutes from Alhambra", "review": "The hotel is well located for visiting the Alhambra and a reasonable distance from the bars and restaurants in town- there is a network of stepped paths leading to the centre.These are quite steep coming back but there is a regular bus which runs until 11pm and the taxi service is readily available. The room was clean and a good size.  Food in the bar was fairly ordinary, for example a club sandwich at lunchtime was generous but not special and the avocado salad was plain- just a collection of ingredients on a plate. Breakfast buffet was good and worth taking at the hotel if you are going straight to the Alhambra, but otherwise walk into town and find a cafe with much cheaper options. The thing that sets the Washington Irving apart is the fantastic customer service and well…", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r580898068", "sub_review": {"Location": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice room, good location, friendly staff", "review": "My husband and I stayed for 2 nights in April 2018. Our room is quiet, modern, clean and large with a king bed, a small sofa, a desk and a chair. The bathroom is good size with a tub. a separate shower and double sinks although the sinks are small. Our room has a view to the nice outdoor area outside the bar where we hung out and had a drink.  The hotel is right across from the Alhambra. It is a short walk uphill to the Plaza de la Alhambra entrance or a short walk downhill to the Puerta de la Justicia entrance.  There are several restaurants and stores within short walking distance of the hotel. It is not far to walk downhill to the city center. But it is pretty steep walking back uphill. You can take the C3 bus which stops near the hotel.   The staff was very nice. One staff…", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r580736360", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great staff, great location", "review": "This hotel is really good. Rooms are a good size and wonderfully furnished. The hotel is 100m from The Alhambra so point to note is it is up the top of the hill and any walks into the city, which only takes 10 minutes, can be slow and tiring if not fit.  The front desk staff were exceptional. I wish I had remembered the name of the gentleman who took time to share his thoughts on the best places to visit ( he wore glasses is all I can remember!).  The rooftop pool is good and the gym is fine with nice views of the surrounding area.  The only thing that could be improved is the WiFi speed.  Would highly recommend.", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r579686498", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great location, Excellent customer service", "review": "We have stayed there for 2 nights, the location is very good it is right opposite the Alhambraand which is very handy and it is 15-20 walk to town and the shopping area, it is a nice walk through a lovely park.The staff are very friendly and helpful. The hotel is very nice and well furinshed, breakfast was so good, lots of choices and excellent coffee.", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r578991970", "sub_review": {"Location": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Truly classy", "review": "Had two nights here in April. Everything about the hotel oozes class. Great staff. Great rooms. Location is A1 right opposite the Alhambra. Daughter loved the gym. Easy valet parking. 5 star in every respect.   I wouldn’t stay anywhere else in Granada. ", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r577103435", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "OK, not amazing.", "review": "If you're in town to see the Alhambra, this hotel is ideally located.  If you want to explore the town of Granada, this hotel is quite isolated.  Desk staff was kind and helpful.  No door staff, so expect to manage your own luggage (which is a bit of a pain on the cobblestone out front).  Hotel decor is nothing special and amenities are fine, but definitely not luxury hotel.  Rooms are fine & pretty clean, but not at all special.  Not really worth the price.", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r576869893", "sub_review": {"Rooms": 2, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Luxury and Location!", "review": "Arrived to Granada via Bus from Malaga. Easily hailed a taxi outside the bus station. It felt like we drove away from the city to the top of the hill, however the surprise was how amazing and convenient the location of the hotel was.   A luxury hotel located immediately outside the walls of the Alhambra, truly incredible! Our room was ready upon arrival around mid-noon prior to standard check in. A short 5 minute walk and we were within the walls of the Alhambra and were able to explore all day.   The walk to center city is about 10 minutes down the hill from the hotel, closer than it could even seem. The walk to Sacromonte and Albayzin is stunning from this location, behind the walls and through the paved hills of the Alhambra about 15-25 minutes away depending on your pace.…", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r576866712", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Great choice in Granada", "review": "Perfect location just across the street from Alhambra. The place looks brand new (even though it’s been there forever) and the staff is very friendly and helpful. Would definitely stay again when in Granada. Note that there’s no parking on the premises- you have to use their valet service if you arrive by car. ", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r575478137", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very nice hotel", "review": "The hotel was exceptionally clean and quiet. King bed was very comfortable. There was large bathtub and after walking all over Granada for two days,  it was so nice to soak in a hot tub at the end of the day. The location was right near the Alhambra and also near a bus stop so we could go down into the neighborhoods to eat and have drinks. Only ate at the hotel once for breakfast and it was good. ", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r575411842", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Comfortable, convenient hotel", "review": "Stayed for 2 nights in the Eurostars Washington Irving hotel.  The room was lovely and the bed (including pillows) was one of the most comfortable hotel beds ever.  Very relaxing stay - our room faced the back of the hotel.  The staff were very polite, friendly and helpful.  It is very conveniently located across the road from the Alhambra and is a short walk away from its' entrance.  There is a small shop located uphill from the hotel.  The centre of Granada is located ~10 mins walk down a steep hill.  Would have given it 5 stars except that the toilet had not been properly flushed before we checked in which was unpleasant.", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r574869296", "sub_review": {"Location": 4, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great hotel across the road from Alhambra", "review": "Stayed two nights in a first floor room almost directly above the entrance and facing the Alhambra. This is a really nice hotel would have been five stars except for a few issues. 1st parking you have to park on the Alhambra car parks which costs about €20 a day and is a bit of a walk (uphill) they do offer a valet service for an extra €18 euros, I think that's a bit steep. 2nd breakfast, pretty good but one coffee machine which means queuing and it ran out of water etc. 3rd gym it's only a few cardio machines and was very warm inside and lastly the air con, we couldn't get it to work and we overheard other guests with the same issue. Having said all that, I'd still stay there again as overall this was a good hotel. Clean, comfy huge bed in a great location. Staff also very…", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r574245807", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Well positioned, quiet hotel with very comfortable room and good service.", "review": "The hotel was very well placed for the Alhambra and  a lovely, traffic-free walk into the town. The staff were very helpful and pleasant and our room was quiet and comfortable and very well looked after. Breakfast was excellent and very varied The only drawback was that on the third night our meal was of a much poorer quality which discouraged us from eating there on subsequent evenings. Having said that we weren't charged for the meal, which was good.", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r573395150", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Not yet ready for primetime", "review": "We had 3 rooms here for a family vacation.  It is a very clean and relatively stylish hotel and very convenient to the Alhambra.  However, the room layouts are very odd and not very convenient for a traveler.  The light switches are so overly complicated as to be virtually impossible to use, and the air conditioning control does absolutely nothing - literally.  You can push all of the buttons you want, and absolutely nothing changes.  Therefore, you have no choice but to open your windows and being right on the main road across from Alhambra makes that a noisy proposition.  I also did not think the front desk staff was as knowledgeable and ready with suggestions as I have experienced in other hotels in Granada and elsewhere in Spain.", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r570430211", "sub_review": {"Value": 3, "Sleep Quality": 2, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "The service is what sets this hotel apart", "review": "The service in the hotel and bar was outstanding. The front desk was very helpful. The rooms are nice, modern, clean, and very well appointed. And of course the location is fabulous if you want to be RIGHT BESIDE the Alhambra.", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r569751246", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Beautiful hotel across from Alhambra", "review": " Loved this hotel! Location is perfect, not so close to city center but the walk to and from downtown is very picturesque, although you have to be in shape if you plan to return walking since it is a steep climb back. I reserved the hotel via their website and because of that they gave us a free welcome drink and free breakfast, latter which was wonderful. When you arrive you are greeted by very nice employees, smiling and ready to help. They gave us the room before check in time which was also a nice touch. The room is beautiful, bathroom as well, nice toiletries and they also provide an electric kettle for tea or coffee, perfect. Our room had a small balcony with an amazing view!! Loved everything about this hotel and if we come back we won’t hesitate to book the Washington…", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r569582929", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Excellent modern hotel, right next to the Alhambra", "review": "What can I say, everything was just perfect... not sure why it's not a 5-star hotel. It's an excellent modern and shiny hotel, with modern internal design of the rooms and facilities. Bathroom also includes a bidet. Note it's not in the center of Granada, but right next to the Alhambra, which is why you come to Granada at the first place.  The place is generally very quiet, and the rooms are also quiet. The staff was great and helpful. They also parked our car and brought it back when we needed, for 18 Euros a day (a much needed service in Granada). Breakfast was rich and very good. There are 2 elevators.", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r569425313", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great stay", "review": "This is definitely a 5 star hotel without the hefty rates......bathrobes, slippers, comfortable beds, beautiful bathrooms, plus it seems brand new. It is less than a block away from the ticket office of the Alhambra. Valet parking is a major plus. The staff was great and very accommodating.", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r569307351", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "First time southern Spain", "review": "We have travelled many places, but never southern Spain. We ended booking a trip to Granada, which turned out to be a very positive experience. The hotel is very quiet and calm but due to the busses, only 10 min. from the City center. We would book the same hotel next time. Granada is a very cosy city, and we did enjoy our stay. Good restaurants, friendly people and also the hotel staff were kind and serviceminded. ", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r569105291", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Another great hotel on our travels through Spain", "review": "We stayed here for two nights during our visit to Granada.  Hotel staff was very friendly and our room was clean and comfortable - easily accommodated a sofa bed for our family of 3.  Extensive and delicious breakfast was included with our rate, and we received great recommendations on dining from the front desk staff.  Location is literally steps from the Alhambra which was very convenient for our 10AM tour the second day.  That also means it is at the top of the hill as compared with City center.  Coming back from the city was a vigorous walk, which was our choice versus tram or taxi.  It did make us think twice though about \"walking back up the hill to get refreshed before dinner\" on the first night.  Would definitely recommend this hotel", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r568684161", "sub_review": {"Value": 4, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Staff really helpful.  Great hotel", "review": "Stayed during 3 days of torrential rain.  Hotel was lovely and in a convenient location.   Carmen spent nearly an hour getting us tickets for the Alhambra and we had the only half day there when it didn't rain.  Fantastic.  All staff were lovely and so helpful.  Probably could have done with more staff in bar and restaurant on Saturday night but we suspect more people ate there than usual to avoid the rain.  Food was reasonably priced.  Would recommend ", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r567517122", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Wonderful stay for our mini moon ", "review": "Beautiful comfortable clean rooms, modern hotel with Andalusian touches. We didn’t opt for the breakfast and went for a morning walk to the wonderful 4 gatos in Albayzin instead.  The location is idyllic - a 10 Minute walk from the city centre, great to walk off all the delicious food  - inside the alhambra parkland surrounded by trees and fountains.  The pool was small and not a lot of sun-loungers but it was perfect for a late afternoon chill. The tapas on offer are delicious and reasonably priced. We loved it and would come back again.   ", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r566516680", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great views used as an excuse/ las grandes vistas usadas como excusa", "review": "We got here on 11 March coming down from Sierra Nevada. the view of the Alhambra are great, and the menú at the bar is good as well, and that is where the good news end. It is a shame that a landmark hotel like this is Managed so poorly and with such a service...the Network inside the hotel is very Bad, breakfast is much worse that in a Four Star hotel, the people at reception need a clear wake-up call to provide good service rather than procastrinate with everything.", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r566018016", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "High on the heights above Granada, across from the Alhambra, lies paradise", "review": "I loved everything - the warm, welcoming anf informative front desk staff. I asked for a room on the upper level with a view of the Alhambra, and received a beaufiul spacious, comfortable room with two sets of French doors, opening to a beautiful view of the Alhambra walls and towers. It's less than a 5-minute walk to the front entrance of the Alhambra. Breakfastsl were abuindant w/great variety and eggs-made-to order and a large selection of foods. Everything in hotel description is true. It would also be a wondrous romantic get-a-way - the Washington Irving is a fitting gateway to the Alhambra-Generalife.", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r565924102", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Super stay opposite Alhambra ", "review": "Really liked this hotel. Check in was friendly and efficient with time taken to talk us through some useful information about Granada. We were allocated a first floor room facing out the rear of the hotel which meant it was very quiet. Room was spotlessly clean with a large comfortable bed and no maintenance issues to report. Extras included a room safe, kettle/tea/coffee, hair dryer, toiletries, separate bath & shower cubicle, pillow menu.  We thought that adding breakfast was well worth doing. There are few alternative options in the immediate area but, even so, the hotel offering was good. All the usual bases covered albeit with a limited selection of cooked options.  Location perfect for the Alhambra.", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r565893772", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great value and location but service just ok", "review": "We selected this hotel for proximity to the Alhambra and that part was great. It is a short 5 min stroll uphill to the main entrance and you can walk down to town in 20 mins or get a taxi from the hotel. The tourist train (€8) departs from just outside too and this is a great way to see the city and reach the Mirador San Nicholas, one of the best viewpoints, where you can sip sangria gazing out over the Alhambra towards the Sierra Nevada. We got a good b&b rate of €140 and our room was very comfortable and overlooked the Alhambra. So, as a base for exploring its great. But the service was sadly lacking in the small details which a 5 star hotel should have. For example we had to ask several times for the water to be replaced in our room, and it still didn’t happen; we booked a…", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r565277229", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Excellent hotel", "review": "We really enjoyed our stay in this hotel. The hotel itself is quite new and in great condition, the room was lovely and spotlessly clean (as was the rest of the hotel). Our room faced the Alhambra and we did not find it at all noisy. The hotel is in a very good location, right beside the Alhambra and about a 10 minute walk downhill to the centre of Granada. It can be a bit of a walk back up the hill after a days' sightseeing however there's a very good bus service that runs from right in front of the hotel, the buses are cheap and frequent so it wasn't an issue. Besides, Granada is a very hilly city so you'll be walking up and down hills where ever you stay!", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r565239763", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "New hotel ", "review": "Love this hotel the moment the taxi stop in front . Clean lines and spacious rooms. Service is great and well located . Quiet room and well location. Good value for money . Would come again to this hotel  ", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r563219137", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent location and nice staff", "review": "Perfect location beside Alahambra. This is helpful as it means it's easy to go back for a short break in the middle of the day. Comfortable rooms and friendly staff. Booking direct seemed to get the best rate and breakfast included. ", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r561640098", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Next to the Alhambra", "review": "Lovely hotel opposite the Alhambra and very close to the city centre and Albaicin. Would have given it a 4,5 if that were possible on Tripadvisor. Very friendly reception, who generally took their time, but were very charming about it. Amazing breakfast with live (classical) guitar on Saturday and Sunday, which we very much enjoyed. We started out with a room facing the Alhambra, but asked to switch to a room at the back of the hotel, which was much more quiet, with a view of the patio and soothing sounds of a water feature. The room was lovely, with tasteful furniture, and provided everything we needed, including a bath and separate shower. The swimming pool is outside and unheated, so only for dare devils - we tried it after a visit to the gym and sauna, to cool off. The hotel…", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r558241160", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Family holiday", "review": "fantastic location in close proximity to the historic sites and the city. good service by the reception and breakfast team. comfortable rooms and very spacious. interior decor of reception and rooms of high standard.", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r555825469", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Lovely Hotel", "review": "This is a really nice hotel located next to the Alhambra Palace. Our room was spacious and well fitted out. The en-suite was also spacious with a separate bath and shower. The hotel is at the top of a small hill up from the central town area and is relatively steep. It is a nice walk down into the town but if you have limited mobility or use a wheelchair you may need to use a taxi or bus to get back up.", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r554558474", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great hotel, very friendly staff, next to Alhambra", "review": "The feel of the hotel is really nice, relaxing and welcoming. Very close to Alhambra, 15-20 minutes walk down to the city centre. Rooms are luxurious and quiet, a bit warm (around 25 degrees) when we arrived before the airco was on.", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r554211129", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Way better than expected!", "review": "We really enjoyed this hotel, and as it is across the street from the Alhambra, it was already a good thing. However, the amenities and staff were far beyond what we expected for the price. The staff was friendly, helpful and made our stay just great. The breakfast was beyond what we expected, and yet not over the top. Ask for the king sized bed rooms facing the Alhambra, at night it is so pretty. Bathrobes and slippers, of course! Internet is a bit spotty, but ths is pretty normal for a lot of Spain and Portugal,no real issues, but a little slow. We would go back any time.", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r553612254", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "5 stars", "review": "The hotel staff in this hotel are extremely great and extremely helpful. The rooms are new and interior finishes are of high standard. If you wish to visit the Alhambra this is the place to stay as it is only a 2 minute walk. Tip: you can purchase the tickets to alhambra at reception. 5/5 stars well worth the money", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r552300820", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great Place above Granada", "review": "Crazy close to Alhambra. Our balconies faced it.   Wonderful hotel. Not cheap but worth every penny.  We will have to come back when it is warmer to enjoy the rooftop pool.   Great room with Alhambra right across the street.  They had a wonderful breakfast, and friendly staff.   Christina at the front desk was the best. She went out of her way for me. I don’t sleep very well and get up early to work if I can’t fall back asleep. The first morning I was up about 5 am and went to work downstairs on the couch in the lobby so I didn’t  disturb my wife. Christina opened the library for me so I could work at a table. The next morning I was up at 3 am and she once again set me up in the library and She went out of her way and got me a cup of tea.   I am in an industry that relies upon…", "date": "December 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r549887934", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Cheap, clean and comfortable ", "review": "We came to Granada to see Al Hambra palace but instead ended up staying very close to it. This is a gorgeous location, lush green with great interesting views.   The room itself was very comfortable and neat. My kids managed managed well here. We ordered pizza from in-room dining which came a little late and they were kind enough not to charge us. The staff were very helpful and knew a lot about the area. There are only 3 floors so it felt quite calm. There wasn’t a buzz of activity which is something I always worry about with my kids!", "date": "December 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r549432793", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Excellent stay right next to Alhambra", "review": "No trick photography, no bait-and-switch, the Eurostars Washington Irving met and surpassed our expectations.  It is in fact, just steps from the entrance to Alhambra (which was awesome, as we had an 8:30 entrance to Nasrid), and a \"generous\" walk (about 15 minutes) down the Gomerez to the City.  Very quiet, solid doors and solid floors, so we had a great sleep.  Wonderful, full breakfast and a WONDERFUL staff - highly recommend", "date": "December 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r546648196", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Great location, excellent service", "review": "We chose this hotel because of it's proximity to the Alhambra, just a minute away. This hotel had so much more to offer. The rooms are cozy, clean and comfortable. What made our stay so special was the excellent service. The staff is courteous and always willing to help. The breakfast spread is really good. They have a lot of Andalusian sweets as part of the spread. A special shout out to Moises who walked us through all the ingredients (we are vegetarians) and encouraged us to try the sweets. I am obsessed with Tortas de Aceite. So if you are in Granada you know where to stay and what to try! Can't go wrong with this one", "date": "November 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r545677447", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Perfect for a one night visit to Granada and the Alhambra", "review": "We only got one night in Granada, and since we were driving we intended to stay away from the centro or the Alhambra area so we didn't have to drive on streets built in the 1500s.  And yet a quirk in our hotel search ended up getting us a last minute fantastic deal at this great EuroStars place, so after all that we found ourselves waking up in the morning 200 meters from the entrance to the Alhambra.  :)  Granted, that didn't end up being very convenient to the rest of Granada, but you have to choose one or the other, and this worked well for us.  In a town like Granada I usually like small, quaint hotels over modern and posh, just seems more appropriate to the locale.  So this is not what I would have normally chosen - it is a EuroStars chain place, slick and modern, not very…", "date": "November 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r545375160", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Convenient for Alhambra but no life", "review": "Comfortable room. Lovely bed and great shower but not much else to rave about.  Breakfast was disappointing especially on Sunday morning when we kept having to ask for things - glasses, juice etc. Reception staff were helpful in explaining about buses etc but would have been helpful to have this on the website. Car access is particularly difficult so don’t bother unless you need one. Bus c3 runs stops near by and runs up and down to the plaza nueva. The tourist sight seeing bus also runs past the hotel. Alhambra entranced are just a few minutes walk.  If you need to be close to the Alhambra then this is an option but if you don’t, look elsewhere.   ", "date": "November 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r543649298", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Outstanding service by staff", "review": "We spent three nights at the Eurostar Washington Irving in November, 2017.  My wife and I were on a leisure trip. As a general matter, the hotel room was spacious, comfortable, clean and well equipped with amenities and other items.  The location of the hotel was outstanding, just a short walk to The Alhambra and a 10 minute walk downhill to the center of the Old Town Granada.  Prices were reasonable.  We ate breakfast each day and had dinner one night. The food in the restaurant was very good, and the service at each sitting was attentive and quick.   The most important aspect of this review relates to the service of the front desk staff. Our luggage was lost enroute to Granda by Iberia Airlines (another story altogether). Thus we arrived in Granada having traveled overnight…", "date": "November 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r540773387", "sub_review": {"Sleep Quality": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "True 5star hotel", "review": "Excellent hotel all round placed perfectly for our visit to Granada and the Alhambra. Beautifully and tastefully furnished extremely comfortable rooms excellent staff. Walk out of door and cross the road and there is the Alhambra plus a few seconds walk and an excellent bus service down the winding streets into the centre of town or if preferred taxis always available.", "date": "November 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r540331182", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Quiet luxury", "review": "We went to Granada for the first time, and booked a room at Eurostars Washington Irving. The hotel is just next to the Alhambra complex. Very nice and quiet location, with excellent bus connection to the City center. Just a 5 min ride. The hotel is  a nice 5 star hotel, with friendly staff. We enjoyed our stay, and you like a quiet and nice hotel, this is a good place to stay.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r539803907", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great Location, Great Hotel Great Service", "review": "The hotel is on the doorstep of the Alhambra.  The rooms are modern, bathrooms clean and well equipped and most important the beds were comfortable.    At check in the desk was very helpful with respect to advice about local attractions.   We also availed of the breakfast which had a wide selection of offerings of fresh foods.   Superior experience.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r538540981", "sub_review": {"Value": 4, "Location": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "brilliant, accommodating place to stay", "review": "arrived a day early in schedule and the Hotel team slotted us right in with views of the Alhambra Palace right over the road, food is good, staff very friendly and helpful, roof-top swimming pool, gym and treatment rooms all in immaculate condition. a well set out & run hotel", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r537045396", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Exclusive Choice Right Next to Alhambra", "review": "Right next to Alhambra (easy walk to the city, coming back is preferable by bus). Very good facilities, very helpful reception desk, valet service for 18 Eur per day, since no parking at the site. Expansive", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r536859282", "sub_review": {"Value": 2, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Both slick and sloppy", "review": "Modern appearance and really close to the Alhambra;  However haven booked through Booking.com we got there to find no room at the inn. The lovely lady at the desk could not have been more helpful in getting us in elsewhere.  However as things unfolded I am reasonably sure that the overbooking was the hotels error and not Bookiing.com who had confirmation of the dates months earier.  We were able to check in the next day again with extremely helpful front desk staff.   The pool area is small and going up there in the afternoon for a bit of lazing in the sun there was simply no space.  Getting a drink was a problem and barmen had to be summoned in situations where we expected the bar to be manned.  The room was up to scratch for the price and the hotel is properly maintained and…", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r534423624", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Fabulous Hotel", "review": "My husband and I spent 2 nights at the Eurostars Washington Irving and wished we had stayed longer.  The  hotel is wonderful!  Our room was lovely and very  clean and had the best shower we had the entire time we were in Spain.  The breakfasts were delicious and included the option to order eggs any way you would like them.  We did, and they were perfect.  We also had lunch in the dining room and it was the best lunch we had on our 2 week travels through Spain.  The staff are so friendly and welcoming and can't do enough for you.  The location is the best part especially if you are interested in seeing the Alhambra.  It is just a few minutes walk up the hill.  After our 3 hour tour of Alhambra, which was outstanding, we were so happy that our hotel was just a short walk from…", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r534048609", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Almost perfect", "review": "This hotel is just within walking distance to the Alhambra and just outside the old town. Driving to this hotel will allow you to skip the chaotic road around the old town.  The old town is about 15min downhill walk but coming back from the old town you need to walk up the slop. The room is comfy and cosy. The decorate is modern and one of the nicest one that I have stayed in Europe. Room is clean and huge. The front desk staff are helpful and cheerful. It makes the stay pleasant.   The room rate is on the high side but it worth the room, service and location.   There is no parking in the hotel but they provide valet parking. I booked my room with the valet option. When you arrived, you need to park at a small corner opposite the hotel. After you have check in, the hotel valet…", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r533903648", "sub_review": {"Value": 4, "Location": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great hotel", "review": "This hotel is perfect for the Alhambra as it is just across the road.  But it’s also good for Granda as it’s either a 15 minute downhill walk or a short, cheap bus ride away.  The hotel itself is immaculate, the staff are friendly and the room was spotless. In fact all the hotel was spotless.  We had room 207 which overlooked the Alhambra and my only slight issue was we could hear the buses outside sometimes.  But that’s a minor issue. Overall would highly recommend.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r533037652", "sub_review": {"Sleep Quality": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great Location", "review": "Unless you stay in the Parador or the Alhambra Palace hotel, both very expensive, you cannot get a better location for the Alhambra. It is modern clean well presented and great to stay at. The staff are smiley and efficient.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r532683375", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Short staffed", "review": "This is a nice hotel, on the positive side a very short walk to the Alhambra (5 minutes at worse) and a brisk pleasant walk of just over 10 minutes into Granada for the bars and restaurants.  Staff were very friendly and rooms were fine.  So why only three stars? As some previous reviews have said, the hotel does not have enough staff. No concierge, which I can live with, but the pool bar which is supposed to do food and drink from 12pm - 8pm was left unmanned for an hour plus at a time. I went to find somebody and eventually somebody came up from the restaurant, but only stayed 20 minutes before having to go back downstairs again. People came up later, wanting food or a drink from a bar, but nobody there for them.   There was also no option to ring down to get somebody.  It's…", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r531747280", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Fantastic!", "review": "We stayed here as a group of six in early October. The hotel is fantastic - the friendly and very efficient staff told us that they had only been open for a year so everything is pristine. The public areas are spotlessly clean, stylish and lovely and cool which was great considering the high temperatures outside! The breakfast buffet, cooked options also available, was also excellent with an amazing choice and constantly topped up. There is a small pool, gym, bar etc. on the roof. The rooms we had were clean, modern and very well equipped. I have no hesitation in recommending this hotel. The location is good and our room overlooked the courtyard at the back so was very quite.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r530477860", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "First Class", "review": "Perfect location, a short stroll from the Alhambra. The hotel is modern stylish and very clean. Staff enthusiastic and very helpful. I can't speak too highly of this hotel, it provides the perfect base for a short Granada visit.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r529921893", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Return visit", "review": "We visited this hotel soon after its reopening and experienced a few teething troubles back then. However now all seems to be resolved and this is an excellent hotel and the best modern hotel (in a  historic building) in Granada. Best period hotel is of course the nearby alhambra palace hotel! It is in an enviable location directly opposite the alhambra palace itself. Only a short minibus or cab ride down into central granada city. Also possible to walk down although walking back up is rather strenuous as it is up some steep and rather unforgiving streets/roads!  Staff are efficient and friendly throughout hotel. Design is provably best described as modern understated luxury? Lovely swimming pool but this does not seem to be  heated. All of this comes at a price and I would…", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r529678664", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A Beautiful Oasis Next to The Alhambra", "review": "My wife and I stayed here for our 27th Anniversary. Across the board, the hotel staff were top shelf. Friendly, conversational, and very helpful, the staff were available for us everywhere (dining room, reception, and housekeeping). The hotel design is ultra modern (and very comfortable and QUIET). Its breakfasts and dinners were among the best we had in Spain (Madrid, Seville, and Granada). Best of all, the hotel is located adjacent to The Alhambra, and the very handy mini bus service (Line #3) offers a convenient 5-minute ride down the hill and into the City Center to experience the Albayzin and Alcaiceria. We've traveled through Europe extensively, and found Eurostars Washington Irving to be near or at the top of European hotel lists. Strongly recommended!", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r529225053", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Tranquil place next to Alhambra", "review": "Stayed here for a week, which surprised the receptionist as we checked in, so I guess most people do a couple of nights in order to take in the Alhambra.  For us, we were looking for a comfortable place to chill for the week rather than just passing through.  Plusses include the location.  It is ideal for the Alhambra and a pleasant half mile walk downhill into town.  A bus will bring you back uphill if you don't fancy the return gradient.  The hotel has a pool/rooftop bar, so there's somewhere to sit when you've done sightseeing.  The room was nice, if a tad on the small side, with a comfy bed and adequate storage.  Staff were nice too, particularly on reception - very helpful and good English.  So what's not to like?  The pool was unheated and, given this is a modern hotel,…", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r528830214", "sub_review": {"Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Best hotel in Granada", "review": "Excellent service all over. Nice rooms and cosy pool area. Good breakfast. Very quite and the best distance to Alhambra. You can easily walk to the city or take a cab, it will not cost you a lot of money. We will come back!", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r526280742", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Turn right out front door and walk 5 minutes to Alhambra entrance.", "review": "This is a luxury hotel in Granada that is a short five-minute walk, with a slight uphill grade, to the Alhambra entrance.  We booked a  spacious room that overlooked Alhambra.  There were two sets of French doors which could be opened at night but wait untill Alhambra flood lights are turned off as the lights were very noisy. There was a lovely cedar scent in the night air.  When closed, we did not notice any traffic sounds as the windows were double-glazed. Very comfortable air cooling system. But it was necessary to insert room card and have the French doors completely shut and locked in order to have the air conditioning. There was a desk with chair, free and fast internet service, fast charging USB ports, double vanity sinks, separate room with a bath (tub), and another…", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r526135534", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great comfortable place", "review": "This was the first hotel on our tour through Andalusia. The hotel is very new and modern. The rooms are beautiful and have a lot of facilities. There is a little pool on the roof wich is very nice after you have spent the day in the town. A little gym as well as a steamroom we used a couple of times. The breakfast is fantastic here.  Just one little thing could be improved. There are not so much beds at the poolside and there is plenty of space to place some extra. The beds are constantly taken and that's a pitty.", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r525652719", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Brilliant hotel - best breakfast on our Spanish trip", "review": "We had 3 fantastic nights here - very comfortable room and easy access to town on bus which left every 10-15 minutes just by hotel. The hotel is right by Alhambra so perfect for the star attraction. A short bus ride from town was nice to be a little out of the middle. Fantastic staff and best breakfast on our trip.", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r525269948", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Wonderful stay ", "review": "This hotel is a gem for visiting the Alhambra, as well as other sites in Granada.  It is exceptionally clean, with lovely common areas (bar, patio, restaurant and rooftop pool).  The rooms and bathrooms are not huge but very nice (and I am a hotel snob), with a sitting area, double sinks and separate shower from bathtub. The staff were wonderful: always cheerful and attentive (including Carmen, who immediately pointed out the key sites on a map during checkin).   It is also surprisingly well priced, particularly given its location across from the Alhambra.  Breakfast is extra, but a good buffet selection.  If you are looking for a more modern, nicely designed, and conveniently situated hotel in Granada, I highly recommend this one. ", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r525021685", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A short but perfect stay", "review": "My daughter, two teenaged grandchildren, and I spent a week at the Washington Irving hotel at the end of August 2017 and although the weather in southern Spain was too hot for my comfort (it was the only time of year we could make this trip!), the Washington Irving was a perfect place to stay in Granada. The hotel is surrounded by large leafy trees which made it feel secluded and cozy while complementing the hotel's beautiful modern decor.  There were so many things we enjoyed about the hotel, from the fantastic breakfast spread to the amazing service by the hotel staff. The two rooms we occupied were spacious, clean, and well-maintained. The lobby had several comfortable seating areas. The hotel staff were professional, friendly, and very helpful. There was truly not a day in…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r524685968", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Location, Location, Location!", "review": "This hotel is situated perfectly for a trip to visit Alhambra in Granada. The one thing I will say is that the road noise was some what continuous and did wake me couple of times. However the staff were brilliant. I arrived quite late and the gentleman on the front desk was great. Breakfast had a good selection, and the walk to and from the hotel was very manageable. Check out was a breeze and the hotel managed my luggage whilst I attended my tour! A good, easy stay! ", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r524077777", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Overall a great stay, but not quite perfect...", "review": "First of all, I really did like this hotel and I would definitely stay here again.  The view of Alhambra from our room were wonderful, and the room and bathroom were beautiful, very comfortable, impeccably clean, extremely quiet and fairly spacious. The pool was really lovely, with drinks and tasty bar food available and a very relaxed vibe. You also couldn't ask for a better location to get to Alhambra--about 5 minutes' walk away!  However, the service still needs to be taken up a notch in order to earn 5 stars.  When we came to check in (after dropping off our luggage earlier in the day), there was only 1 couple in front of us who were already in the process of checking in, yet we waited at least 10 minutes behind them without any other staff showing up to help us.  This…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r523892240", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent location for Alhambra", "review": "Great hotel with a 2 minute walk to the Alhambra entrance. The bathrooms are spacious. The staff spoke English which was helpful and they gave us wonderful restaurant recommendations.  We requested parking with our room reservation and that was nice not to have additional fees at checkout. The breakfast was 17 euros which seems pricey, but it had a lot of variety and we needed something convenient because we had an early morning tour of the Alhambra.", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r523418838", "sub_review": {"Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely beds", "review": "Stayed here for two nights while passing through Granada. Nice hotel. Fantastically comfortable beds. Very close to the Alhambra so it suited getting up early to queue for tickets (tip: I joined queue at 7:05am for the ticket office opening at 8am and there were approx 70 people ahead of me. I did get to buy the full Alhambra ticket incl. Palace access at 6pm but they sold out shortly after me). Lovely walk down to the city and back up. Bus option available too. Would recommend this hotel without hesitation. ", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r522702970", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Newly renovated", "review": "Stunning hotel that is newly renovated and great service. Nice rooftop pool and very modern.  Don't come after 10pm otherwise you will have to park your car yourself at the Alhambra parking lot - only downside.", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r522585234", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Short break", "review": "2 night  family break, hotel had lovely staff, great scenic position opposite Alhambra Palace Nice walk downhill into the main city centre but worth a taxi ride back for €6, Hotel bar was a complete ripoff, 1 x gin & tonic and two large beers €24, considering the price I had to go to the reception for them to call a member of staff to serve you, and Wait 10 mins for service Breakfast was ok, pool nice but sauna was not hot on any of the days I used it Got a good price for room but just ripped off on the bar", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r520337060", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Brand new not great", "review": "They claim tone 5 stars not so. Small rooms very nice since it is new. They forgot to give the simple things like extra soap etc. you can ask but why should we have to. At best maybe 4 Stars. The food for dinner was very good. Breakfast was ok this was not 5 star.", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r520106180", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Memorable stay, excellent hotel!", "review": "Stayed for a week with my family in this beautiful and modern and homely hotel - everything from the moment we checked in was smooth, professional and led by staff who were incredible and genuine. Service always went above and beyond - breakfast was great with live guitarist on weekends and fresh array of choices.  Location was a short walk from the main attraction of the city (Alhambra) and near plenty of restaurants, desert and coffee shops.  The hotel even had large smart TVs with Netflix in room (kindly set up by one of staff) which was nice bonus after long day of walking and sightseeing all day to kick back and watch your favourite show in bed.  As we had early flight home and would be too early for breakfast staff even went to effort to make a lunchbox pack to takeaway. …", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r520021394", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Very enjoyable visit", "review": "We opted for a central hotel with easy access to Alhambra. You can't get much closer than this.  The hotel is very modern inside.we didn't use the very limited restaurant but the breakfast offering was very good. The valet parking is very useful but check they correctly record when you want the car.  The pool is small with a few sun beds but is a very useful addition in this location.  Would definitely stay again", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r519644204", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Historical Sightseeing Trip", "review": "An excellent refurbished hotel with an easy access to Alhambra. The tram which runs through the town of Granada is only less than 5 mins away. The hotel straff was extremely helpful to plan our stay and make the best of our time. After a tiring guided tour, we were few mins away from our hotel which was great after being in the hot sun. Located on top of the hill added to the holiday atmosphere. The management needs to work on their sound proof facility as you can hear people outside your room even talking at a distance. Overall an excellent place to stay if planning to visit Alhambra/ Granada. Our daughter loved the big screen TV with all her favourite channels accessible along with UTube.", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r518409059", "sub_review": {"Sleep Quality": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Perfect for Alhambra", "review": "We absolutely love this hotel. When we arrived, we were served a cold drink while our room was being prepared. The staff showed me a map and pointed out places of interest to me. He suggested going to Mirador de San Nicolas for a good view of Alhambra during sunset. The proximity to Alhambra is the top reason why we chose this hotel and secondly, the sumptuous breakfast. The main ticket office to Alhambra is a short walk away. Perfect to arrive early and avoid the crowds. In addition, we can visit Alcazaba & Nasrid Palace then walk back to the hotel for a nap or lunch before spending the evening at Generalife.  This proximity means it is a bit further from the town areas so it is a matter of priorities- whether Alhambra is more important than entertainment like restaurants and…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r517483874", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Best location for the Alhambra", "review": "This hotel is literally across the street from the Alhambra. We had a reasonable view of it from our room. Our room was nice and we also found staff to be nice and friendly. When we checked in, I was wished a happy birthday. There was also a handwritten note in the room, wishing me good things, which was nice. Valet parking was extra, but we arrived after 10pm, do the valet had gone for the day. This was a bit inconvenient. We ended up parking in the Alhambra car park and walking back to the hotel, which didn't take more than five minutes, in fairness. We left the car for three days. The bill for parking was nearly £60! Parking is pretty expensive in Andalusia, we found. This hotel is a five star one, but didn't have a turn down service. There was also no assistance volunteered,…", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r517203272", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Perfect stay in great location, high quality decor and facilities, professional staff, good value", "review": "I believe this hotel was completely rebuilt and opened only a year ago. it is not too big with approx 60 rooms and has the feel of a 'boutique hotel'. Location is great for La Alhambra and the walk to and from town is manageable for the reasonably fit, so glad we stayed here rather than in main town, quiet outside at night.   Standard of decor and cleanliness throughout is very high and our double rooms on high floor facing La Alhambra were large, had multiple windows and separate areas for double sinks, bath and shower/lavatory.   Pool area does have limited seating and shading, but think this is sensible to avoid overcrowding around a smallish pool. This is not designed to be a place to spend all day there so avid sun-worshippers should look elsewhere.  Staff numbers are low…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r515685906", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great location for The Alhambra", "review": "The rooms and lounge/foyer have been refurbished to an excellent standard. The pool is fine in terms of size although there are way too few sun loungers and chairs and umbrellas around the pool. Given the sun/heat in the area having 8 sun loungers and three umbrellas is way too few to the extent there were people lying on their towels next to the pool because all the chairs and loungers were taken. This I thought was very poor. The gym has minimal amount of equipment. 1 spin bike, 1 life cycle, 1 elliptical and a treadmill which doesn't work. It appears the hotel was trying to achieve a tick boxing exercise with the pool and gym. It's a shame because the rooms are really nice and finished to a very high standard. We didn't eat there as we prefer to eat out. No concierge which…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r514174193", "sub_review": {"Location": 5, "Rooms": 5, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Small rooms, very understaffed, never a 5 star hotel in a million years", "review": "We had booked for a week and left after 2 days it was so disappointing.   +The location is brilliant for Alhambra.  +The lobby is modern and stylish.  +Some staff care about you and work hard. One privately told me that the management cut back on everything and they don't need to care because they are opposite Alhambra and people will always come here.   -The room we had measured 4m x 3.5m, no balcony. Tiny. Inadequate storage for luggage.  -Parking is 18 Euro per night valet between 8am and 10pm -Expect to carry own luggage to room and back again. -8 sunbeds for 60 rooms around tiny pool. Forget it unless you want to lie on floor.   -1 waiter for pool bar from noon, if you can find him. Do not expect waiter service (we waited 30 mins and gave up). - Don't expect soap or towels…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r512233294", "sub_review": {"Location": 4, "Rooms": 1, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Great staff, perfect local, good hitel", "review": "The front desk staff are so helpful, amongst the best I have experienced. The hotel is a short wall from the Alhambra entrance and an easy stroll down to town. Modern, clean with a small pool to cool off.., perfect", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r509200463", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "location was key for me to book this hotel", "review": "2 minutes away by foot from the Alhambra only! hotel rooms are really 5 star level, I appreciated the valet parking service and the friendly staff at the reception; the check-in time is excessively long (can easily take 10 minutes and more - what kind of crap IT system do they have?) and the pool is poor, very poor.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r507651322", "sub_review": {"Value": 3, "Location": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "high quality", "review": "The hotel is located close to th Alhambra, a little bit far to downtown (15 min walking distance). Rooms are new, elegant and clean. Wide enough to have a third bed inside (for my son). This is also a nice swimming pool on the roof. Breakfast is good, but the buffet is a little bit small compared to the ones of same category Staff is kind and always smiling", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r507075026", "sub_review": {"Value": 4, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "This is not a 5 star hotel by any stretch of the imagination!", "review": "I would not consider this hotel to be 5*. There are simply not enough staff on duty with long waits at breakfast, the reception desk and especially at the pool bar. On the first morning the choice of food at breakfast was limited because previous guests had already eaten most of it and none was replenished. The two members of staff waiting-on disappeared into the kitchen for long periods of time during service. We left after waiting over an hour for eggs and ham to be cooked and served; they never came. The restaurant was so busy that we could not even attract the attention of the waiting staff. On the second and third days, we were early for breakfast and were astonished at the very good spread of delicious food available. Although the service was much better with only a few…", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r506829388", "sub_review": {"Location": 3, "Rooms": 4, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Nice rooms but small pool", "review": "Chose this hotel because it had a pool and parking. However, the pool is on a very small roof terrace and was very crowded, with not enough loungers and no shade. Several doors off the pool area but not signed as to where the pool bar/sauna/toilets were. Location is good ONLY for the Alhambra, but is about a 15 min walk down then uphill to city centre. Think about how many times you'll be going into town compared to visiting the Alhambra before booking this based on location. Parking is valet parking 18/eur per day which is pretty standard. However car is only accessible between 8am and 10pm and they require 30 mins notice to retrieve it so bare this in mind if departing /arriving outside these times. When you arrive at the hotel there is a small lay by on the downhill side of…", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r506769901", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "GREAT HOTEL GREAT LOCATION", "review": "This hotel compleated renovations a few months ago and it looks great.Its small,quiet and across from the Alhambra.The restaurant is good the rooms are superb,clean and quiet.The airconditining works perfect.The staff is very helpful and friendly.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r506572225", "sub_review": {"Value": 4, "Location": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good place but between good and average", "review": "The hotel is super well located, basically in front on the Alhambra ticket counter. From the hotel down to the town the walk is super romantic, you can go via the park, \"el bosque de 500 años\" or via the street side. Is like 10min distance from central Granada.  The room was mostly clean, however we did say hi to one cucaracha (my wife screamed!) however I suppose is natural from the area.  The service is good, however the restaurant/bar was basically dead during our stay. I suppose most people rather go for the tapas in the town.  Overall it was a good stay. However nothing to go back and do it again in that same hotel.  ", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r506430732", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Excellent location friendly stagf", "review": "Excellent location for  The Alhambra .  The hotel was lovely and modern. It does have a pool but it is  a little small with limited sun loungers.  You can get lunch there which is good.  The restaurant food was ok but nothing very special.  However the waiters were very attentive.  The receptionist was very helpful and couldn't do enough for you. ", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r503818910", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Excellent stay!!", "review": "Excellent property located minutes from Alhambra. Front desk was helpful with recommendations for dinners. Room was decorated tastefully and beds were comfortable. Rainfall shower was fabulous and we were sorry to leave. Breakfast was fabulous and the guitarist was a special bonus.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r503779888", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great Position", "review": "This hotel is an oasis in Granada. Across the road from the Alhambra but so peaceful and the roof top pool is perfect to cool down in after a hot day - and it does get hot!  The breakfast is quite expensive so we walked twenty yards up the hill to Jardine Albert which was excellent.  Top tip, book a couple of days on the tour train, for ten euros, early in your trip and use it as a cheap taxi and to familiarise yourselves with the town.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r503377554", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Luxury in Granada", "review": "Great boutique style hotel literally two minutes from the Alhambra. Fab location on a hill so great breezes to cool things down. 10-15 mins walk downhill into town , 5-7 euros in a cab back up depending on the time of day.Very quiet too. We had an Alhambra view room which was perfect. Huge bathroom with tub and walk in shower and the quality of the toiletries was really impressive . Super efficient air con which was almost silent.  Amazing breakfast with everything you could want including perfectly chilled sparkling wine plus red or white.Eggs made to order and served to your table. Great pool with loungers on the top floor with table service, perfect for a dip and a cold beer after a day sightseeing. Really genuine friendly staff throughout. Will definitely book a Eurostars…", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r502510520", "sub_review": {"Value": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "awesome experience!", "review": "unbelievable to stay at this great hotel at this price. Located just in front of Alhambra (2 mins?) with a pool and sauna to heal a exhausted body from Alhambra tour. Staffs are so kind, a room is clean and wide compared with those of other Spanish hotels, and Wi-fi is fast. If you don't mind getting to main streets by bus or taxi (you can walk to get there but not easy because of steep) it will be one of the best choices in Granada.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r498539340", "sub_review": {"Value": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very nice hotel across the street from the Alhambra", "review": "Convenient modern hotel with spacious rooms.  Very comfortable and clean.  Very helpful staff.  Large bathroom and comfortable bed.  Literally walk across the street to the Alhambra.  Can take the minibus to the center of town by walking 100' up the street.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r497015370", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Perfect Hotel to visit Alhambra", "review": "This is an excellent hotel. The rooms have big comfortable beds, are large and very clean.  The hotel is quiet, the breakfast reasonably priced and substantial with a full range of items. Small plunge pool a delight after being in the sun all day. Staff all extremely helpful and pleasant.  Pre-booking Alhambra a must - also pick up tickets early morning because the pick up system is very slow - two windows serving 100+ people in the line  at 0900hrs.  Distance hotel to Alhambra entrance 250 m - ideal.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r494514688", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Excellent location, great hotel", "review": "It's a great hotel, charming and warm, very well located, just in front Alhambra and to reach the city center it has a very nice path under trees shadow. The hotel facilities are high tech and modern. The breakfast is delicious and complete. We had a lunch at the restaurant and we recommend it.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r494308430", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Amazing hotel", "review": "We stayed here as its virtually opposite the Alhambra. Only a few minutes walk to the ticket office and a lovely ten minute gentle walk to the entrance by the palace. The front of desk staff were really lovely, parking the car no issue 18 euro for 24 hours. The room was so cool and the bed was huge and so comfy. The drive to the hotel very easy skimming the city boundary so no worries about getting caught in the hectic central roads. Very quiet area at night but an easy 20 minute walk into the centre. The paths that surrounded the Alhambra were well lit and felt very safe late at night. ", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r493574989", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "2 min away from the Alhambra", "review": "Nice, quiet and modern hotel 2 min away from the entry of the Alhambra and 10 min walk from the city center. Room are confortable and clean, breakfast is very good with eggs made on request. There is no parking in the hotel but the concierge will take care of your car ( external parking) don't look for a parking entrance when arriving.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r490413838", "sub_review": {"Value": 4, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Smart well located hotel", "review": "2 nights.  Helpful staff, good breakfast comfortable bed and well equipped room. smart decor. Right opposite Alhambra. Easy walk down into Granada. Steps back up but taxis plentiful. Parking off site. Suited us fine. ", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r490260465", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Alhambra on your doorstep", "review": "Incredible location with Alhambra visible from balconies and taking 5 minutes by foot. We had chosen this hotel due to proximity to Alhambra but what we got was so much more! Staff was incredibly accommodating and facilities were impeccable. ", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r489862388", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "high-end hotel near the Alhambra", "review": "The hotel is a truly exceptional place to stay with a beautiful lobby, large and luxurious rooms, incredible A/C (rare for Southern Spain), and a great bathroom vanity and shower. The drapes were truly black-out. The bed was really comfortable. The views are nice too. It is close to a 5-star rating, but it fell just a little bit short on staffing and hotel amenities. Hotel staff were terrific, but there weren't enough of them. No one around from maintenance in the evenings/nights for routine assistance (e.g., changing a light bulb in a dark bathroom). Staff handled the situation extremely well by offering another room, but we were very happy with our room. Staff simply couldn't be everywhere at once. We came back a bit late close to 2am and found the front doors locked and no…", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r489732986", "sub_review": {"Rooms": 5, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Enjoyable place for a short stay", "review": "The hotel is very friendly, quiet and cozy, and located just a hundred meters from the entry to the fantastic Alhambra. The room is clean and efficient, very good shower, and the buffet breakfast has perhaps not the richest but good enough choice of dishes. Very quiet and efficient climate control. Rather long and steep walk from the downtown.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r488264787", "sub_review": {"Location": 4, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good location.", "review": "Nice staff, gentle and cooperative. Hotel is very well located, just outside the Alhambra. Room was comfortable. The only question was with the WiFi that did not work properly, however this probably was due to the world hamsonware attack that happened during our stay.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r486682556", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Splendid hotel & location", "review": "The hotel was very good and very attractive in its surrounding decor, I particularly liked the quotation art work displayed on the corridor walls which captured Granada and its history. The staff were very pleasant. It was located opposite the Alhambra which was beautiful & amazing and worth a stay just for the Alhambra. Our room was very Attractive in a modern design with a large spacious bathroom and walk in shower room plus a giant double bed. My only trivial criticism is that they should Provide free bottled water and more coffe facilities i.e milk & coffee for the morning etc,  also breakfast at 18 euro was steep and they should have a cheaper option for the light bite breakfast persons, anyway we enjoyed our stay and would recommend it.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r485064977", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Right next to Alhambra", "review": "Beautiful setting right next to Alhambra, which allows you to get to your tour early (and you will need too).  The hotel has a very luxury atmosphere, but through Trip Advisor you can get a more reasonable rate.  They have a pool, which was great in the hot afternoon.  Sitting by the pool with a glass of wine, PERFECT!  Beautiful rooms, weight room, and helpful staff.  I was too tired to walk down the hill for central city (although there is a bus).  So the staff directed us to a restaurant right next to the hotel.  Excellent food and great service.  If you go, stay here!", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r485050059", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very Good with Outstanding Location", "review": "One night stay.   Short walk to Alhambra. Very friendly staff.  Ice cold A.C. for European standards.  Room was very quiet, in fact we overslept due to quiet.  Only complaint was  internet was out (not the fault of hotel, but annoying), and as we had poor cellular reception.  A good place to stay.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r484474996", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent hotel", "review": "This is a five-star hotel through and through. The rooms are comfortable and extremely clean. There are great amenities like a sauna, a comfort room, a reading room a spa, an outdoor pool.  This property is located directly across from Alhambra which makes it very convenient if you come to visit the palace. Just a short walk down the street to the town, we highly recommend visiting the Gypsy Village for a great views and picture opportunities Alhambra and Granada", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r484274536", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Sadly (And Badly) Lacking", "review": "First the positives: The hotel is in a great location (right next door) for visiting the Alhambra, the rooms are a really good size with top notch equipment - 60\" & 50\" tv's in the jnr suite, automatic lighting control, really lovely Hierbas De Ibiza toiletries. The rooms are well priced on the hotel website considering the equipment levels & the included buffet breakfast was really comprehensive with hot dishes (eggs cooked to order) great choice of pastries & breads as well as good quality cava to make yourself a bucks fizz.Valet parking service was a really nice touch & staff at reception were very welcoming & friendly However here is the sadly & badly lacking: We chose this hotel for our wedding anniversary due to its peaceful location away from the city centre (we weren't…", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r483469212", "sub_review": {"Sleep Quality": 4, "Rooms": 4, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Perfect for Alhambra visit", "review": "A modern, clean, quiet and comfortable hotel with flawless service for a reasonable price. It is in easy walking distance to the Alhambra, and a 5 EUR taxi ride from the city center. Careful when driving to the place with your own car, as many of the streets leading to the hotel are for public transport only.", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r482701649", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Fantastic location for the Alhambra", "review": "It's a new, modern hotel only a 5 minute walk to the main entrance to the Alhambra, and not more than a 15 minute down hill walk to town.  We stayed in a junior suite, which was compact but comfortable. The bed was comfortable. The bathroom was poorly designed, with a shower and commode together and 2 sinks and bath in an adjoining room.  The sinks were small bowls...splashed all over trying to rinse out clothing, and the shower had no shelf for soap, shampoo, etc.  The breakfast buffet was terrific, but dinner (fish) was lackluster.  Staff friendly, but most had limited English.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r482453179", "sub_review": {"Sleep Quality": 4, "Rooms": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Modern hotel in quint surrounding!!!", "review": "Important Advise : -  if you want to walk from hotel to center of Granada, Go through the gardens and don't take either road surrounding the garden.   EWI is a contemporary hotel in a historic town. From location point of view, its 15 min hike from center of town.  We enjoyed the hike but if you are not active and fit then you have alternative to take C3 bus from Plaza Isabel La Catolica which will get you to hotel in 5 mins. Going to town will take 10 min downhill hike amidst gardens. Specially night time walk is so serene and picturesque.   We chose this hotel over the ones near center of town due to concerns about noise during the night time in town and we are glad that we weren't wrong.   Rooms are well appointed and modern with all necessary amenities.  Bathroom has…", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r481708104", "sub_review": {"Value": 4, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good for the Alhambra ", "review": "This was a good hotel with a large room. The restaurant opens at 8 and we didn't see it open for lunch. The breakfast was above average for Spain and gluten free bread was available on request. The room service food was good, but there wasn't a huge variety. The staff was very helpful and the restaurant let us order stuff from that menu and have it delivered to the room, which was great after an exhausting day of walking the Alhambra! The location is very close to the Alhambra, but you have to walk down and up a giant hill to get to the other interesting part of town. There are not really any restaurants in walking distance. There's also a very narrow road leading up with difficult turns and a section that's one way depending on the light so be aware of this if driving! Overall,…", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r481594895", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Perfect location and worth every penny ", "review": "Stayed here in beginning of may and the hotel was beautiful. It had a very attentive staff, the place was clean, the room was spacious with a lot of detail and confort. The bathrooms were also big with a great shower. The view of our room was right to the Alhambra and it was just a couple minutes away from the entrance. As for the bad... the parking is a little unusual but that's due to the small town. Secondly we were not able to get tickets to the Alhambra even though I thought a 5 star hotel would be able to find a way to get them for their guests, but again... it's understandable they couldn't. Room service was great, the ham was to die for, and the room tv has Netflix which was a great extra. I would definitively recommend this hotel and I hope to come back soon. ", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r481166945", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellence, this is what Hotels should strive for", "review": "Great Location, (next to Alhambra Palace/grounds)  Great Staff, Good Food.   Best Hotel Room to date, In Spain,  every conceivable little extra you could think of was there, even down to our own Netflix :-) on the internet and bluetooth enabled 50 Inch Grundig TV. Excellent WiFi.  Everything was just right, what we both expect from a Hotel room.  When  in Granada a must stay.", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r479071326", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent in everything ", "review": "The hotel is located right in front of Alhambra castle. The room is very good, the food is outstanding and the staff very friendly. No question about the excellent quality overall.  The tour to the castle it's at walking distance. ", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r478817605", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Ideally located – especially if you are driving", "review": "We chose this hotel because it was as about as close as you can get to the Alhambra visitor center; even at a slow pace, it would be no more than a five-minute walk. Perhaps more importantly, we selected the Washington Irving because it is very easy to reach by car. Since we arrived after dark, this was especially helpful. There is no need to navigate the often-confusing city streets, and you can leave the car just across the street until the staff parks it for you.  This hotel is clean and modern, the rooms offered more space than is typical in this price range, and our rate included a wide-ranging breakfast buffet. Our room faced the Alhambra – and the somewhat busy road leading past it -- but the soundproofing was excellent, and we heard none of the traffic.  If you want to…", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r476249771", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Brilliant location", "review": "Hotel is literally adjacent to Alhambra and 2 minutes from entrance.  Bus C2 stops outside front door if you don't fancy walking up hill from city.  Well appointed modern rooms with bath & separate shower. Great breakfast. Pool on rooftop if you need to cool off.  We arrived by car & valet parking works superbly. They take car & then have it ready for you when you want to leave. You don't need it during your stay.  Can't fault Hotel at all.", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r475078048", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Get the breakfast package!", "review": "The hotel is right across from the Alhambra. It is new, modern and clean. The staff is friendly. But the breakfast is unbelievable. The variety at the buffet will leave everyone in the family satisfied.  The only downside is that if you want to go into town, it's quite a walk (on the way back it's uphill!). We didn't mind though. It was only 20 min to get to town and it was good to get the exercise after all the yummy tapas!", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r474904557", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Quality Business Class Hotel, Adjacent to the Alhambra", "review": "This is an upscale, modern property that would please any discerning business traveler.  My room was large and quiet, with blackout curtains. The modern bathroom was very well appointed.  The Wi-Fi was very fast.  The hotel breakfast was good, although perhaps not as good as the room.  The live music in the breakfast room was an unusual touch.   The hotel hasn't been open that long, and I did notice a few teething issues, but nothing major and all of which I'm sure will be corrected soon.  This is not a charming, boutique hotel, but it is a quality business class property, so keep that in mind depending upon your preference.   There is an outdoor pool and a small exercise room with four cardio machines.    The location for the Alhambra is ideal, it is literally across the road. …", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r474826344", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Besides being excelent it is the best place to visit Alhambra in Granada", "review": "One of the best hotels I've been in regarding accomodation, Staff professionalism and kindness, restaurant quality, decoration and quietness. Also the location is perfect not only to visit Alhambra and Generalife but also transportation.", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r474220784", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great Stay", "review": "Fantastic hotel in a fantastic part of town. Right opposite the Alhambra Palace.  Nice and relaxed atmosphere within the hotel and staff very helpful and friendly.  From a personal point of view this was the ideal part of town to stay. Nice and quiet in the evening. Very pleasant walk in to town. About 10 mins. Nice to experience the hustle and bustle of town but nice to leave it behind when ready.    Room was a delight and very comfortable.  Thoroughly recommend this hotel.", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r473165626", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Perfect location", "review": "Great hotel situated perfectly for visiting Granada's Alhambra and Generalife.  The staff was pleasant and helpful.  The rooms were clean, well appointed and quiet.  Would highly recommend the Eurostars Washington Irving hotel.", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r472706669", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "new hotel in fabulous location", "review": "This hotel is located in easy walking distance to the entrance to the Alhambra. You do not have to go uphill very much.  My room was very new with attractive, modern decor that gave a nod to the Moorish influence of Granada. The bathroom had both a tub and a walk-in shower, and towel warmer. Visually the room was quite pretty; however, I feel that the hotel has some kinks to work out due to its newness. These are growing pains perhaps. Certain things did not make sense. They provided 2 heavy terry cloth robes, yet there was no hook or designated place to hang them in the bathroom when damp. Also the kettle location and electric outlet were inside a cabinet. Thus, the steam from the kettle went directly into the shelf a couple inches above the spout. This will ruin the furniture,…", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r471124932", "sub_review": {"Value": 3, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Booked at short notice", "review": "Beautiful hotel set in the hills close to the Alhambra Palace, polite and helpful staff and only a short taxi ride to the centre of Granada. Very comfortable extra large bed and beautiful toiletries in the bathroom.  ", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r470578660", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Exceeded Expectations ", "review": "newly renovated this modern hotel is a fabulous place to stay in Granada. from the point of arrival the service was fantastic with the porter taking care of bags and valet parking. check in was a breeze with bags being droped into room effortlessly. we stayed in a deluxe room and it was spectacular... modern fittings super comfortable bedding with the smothest sheets ive ever slept on. the hotel is positioned next to the Alhambra Palace and the main town is a pleasant 10 minute walk away through the picturesque park. memorable stay and for sure will return. ", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r470256704", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Visit Alhambra", "review": "Very friendly staff, clean room and great breakfast. Especially the valet parking service was more than welcome. Free wifi worked very well, which should be normal but is not always the case. Perfect!", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r468862533", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good hotel, & room, bad breakfast, reception not listening", "review": "This is a good hotel,  in some ways, but it is not 5 star in any international sense.  Bedrooms with view of Alhambra are large and comfortable.  Reception was charming on check in and check out.  Breakfast was very poor fare indeed and extremely understaffed - Items on the menu were missing, and not being replenished, tea and coffee were hit and miss; special cooked items were not offered.  Prices reflect the view that the hotel is 5 star so be careful of extras ordered, e.g. and indifferent wine was 5 times the prince of a better one down town.   As other reviewers have noted it is a few minutes walk to the entrance of Alhambra and therefore great for an early start.  But do note if you prefer to stay in town the C3 shuttle bus serves the Alhambra every few minutes.  On the…", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r467370166", "sub_review": {"Value": 3, "Sleep Quality": 4, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Great visit to Granada", "review": "Stayed at the Washington Irving for 2 nights. Room was modern and comfortable with a view of Alhambra which is across the street. Restaurant Staff and food were very good. Reception staff were extremely helpful. 15  minute scenic walk to centre of the city, down hill there uphill back. The location makes it very easy to wander the \"free\" areas of Alhambra at your leisure and convenience.", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r466449327", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great stay but....", "review": "The rooms are great, new and quiet with all the bells and whistles.  The location could not be any better, right across the street from Alhambra.  Friendly helpful staff.  But for a five star hotel you would think that you could have umbrellas for your guests in the event that it does rain, they are not a great expense if bought in bulk.  There were no umbrellas to be had on this rainy weekend!", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r464563755", "sub_review": {"Value": 5, "Rooms": 5, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Highly recommend", "review": "Lovely hotel in perfect location right beside the Alhambra and 5 mins walk (downhill) to Plaza Nueva. Don't worry if you don't fancy the uphill return there is a bus. Very friendly and efficient staff.", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r464414952", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Superior Rooms and Service", "review": "The hotels delivers on its promise of luxury with well appointed and comfortable rooms. The staff are exceedingly helpful and make the experience all the better. The location is literally at the door of The Alhambra so for visitors, you can not be better served. It is a 8-10 minute walk down hill to the center of town.  The amenities are first rate with comfortable beds and pillows, well appointed toiletries, and spacious rooms. Rooms on the front of the hotel look at the Alhambra and provide a great view at nighttime.  The restaurant offers an excellent breakfast buffet with standard and local favorites and is well worth it. The pool and fitness area are very good and the pool would be a good retreat during the summer.  The parking is a little difficult. The valet parks all…", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r464139612", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great hotel in Granada", "review": "Really great hotel with friendly and helpful service team.  Fantastic location opposite the Alhambra.  Modern, well sized room and we even eat at the hotel restaurant 9which we usually avoid) and were pleasantly surprised at the quality of the meal.", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r459924889", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Few days in Granada", "review": "Everything beautiful. The hotel si completely new and absolutely comfortable. Great location for visiting the Alhambra but also reach the city center. Tiny but nice jym and spa. Extremely kind staff. Comfortable bed.", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r459518647", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Wonderful hotel", "review": "We arrived for a 2 night stay in Granada and found this hotel on line.  What a find it was, simply across from  the Alhambra itself and so  perfectly located.  It was €4 to €5 into the city centre by taxi;  I certainly would not recommend driving in Granada.  Our room was lovely.  The staff were very friendly and helpful.  I really loved everything about this hotel and would highly recommend it to anyone travelling to Granada (itself a fantastic city).  Would I return?  For certain", "date": "January 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r452585540", "sub_review": {"Value": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Surprising find - recommended", "review": "In a way it's not entirely fair to review this hotel as it wasn't where we had booked to stay in Granada - see my review of Casa Palacete 1822 where we were double booked.  However having said that it turned out well as the hotel is very well located for the Alhambra - a five minute walk as well as the city centre. It allowed us to have dinner in the Parador on the site (see my review) and stay late.  Part of a chain of hotels, with the rather off putting ‘Eurostars’ prefix – it is however not a railway train! Don’t be put off by the hotel chain tag, it was an historic hotel well refurbished in a modern chic style.   Parking and check in was difficult - we arrived at a busy time and it meant there was nowhere to park outside except directly on the road and there was a line at…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r452394589", "sub_review": {"Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A great surprise!", "review": "We've had an excellent stay at this hotel and I can really recommend it. The location is perfect if you don't have a lot of time and want to focus on the Alhambra. The rooms are quite big, modern, and very well decorated. The service was really good and the breakfast was excellent, with a big variety of high quality products. I would stay here again. To make it perfect, the only thing missing was a heated pool...but you would not have this problem visiting during summer time.", "date": "January 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r452310862", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Perfect", "review": "Very friendly staff. Quiet, peaceful and comfortable.  Very complete breakfast.  Nice shower that is like being under a waterfall. We had lovely garden views from our room and a big and comfy bed.  Will return in the near future. ", "date": "January 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r451529760", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent Stay", "review": "Very Nice Hotel. Excellent location. Nearest hotel to Alhambra. Not far from town. Local Bus is cheap and very regular service. The junior Suite was perfect for our family. Comfortable bed. Nice décor. Wonderful Bathroom with rain shower. The breakfast was superb. Special thanks to the Lady manager and her staff. Superb Service. The reception staff was very helpful and friendly esp Mrr nd Christine.  Overall an excellent experience with Eurostar Hotels chain in Granada, Cordoba and Malaga during our visit to Andalucia. Will definitely book & stay again. Highly Recommended.", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r450947821", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Hard to beat for location and comfort", "review": "I got lucky with a good rate for this hotel which had only been open for a few months when I made my booking so I didn't pay 5 a star price for the luxury. I think the location of this hotel could only be beaten by the Alhambra Parador which is within the grounds themselves. The hotel itself is modern and luxurious though the pool area isn't large and I could imagine that it could become overcrowded in high season. For me in September it was a perfect area to sunbath between sightseeing and because I had booked a night visit to the Generalife gardens it couldn't have been more convenient. I also found it easy to walk down the hill and back again to the town. The path through the woods is well lit, full of people and runners and perfectly safe. For anybody not wanting to walk…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r450232584", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Credit checks on guests", "review": "Not actually stayed at the property nor do I think I will be now. Booked on January 3rd for a junior suite for 3 nights through hotels.com I then notice on the 5th January that the hotel made a transaction on my card for 87p (€1 I assume) was charged a none sterling transaction fee by my bank then received a refund of 85p from the hotel.  The issue I have is not the amount of money your little exercise cost me but the fact this was clearly a credit check a check to see if I was good enough to stay at your hotel. I'm not in a habit of booking hotel rooms to either intentionally not check in or be unable to pay for my stay. Do you do this with all your guests?  I have travelled all over the globe and stayed in numerous top quality hotels and can honestly say this is not a regular…", "date": "January 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r449632041", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Absolutely Bad Service 2 Star Hotel ", "review": "Walking through the doors of this hotel u are greeted by beautiful decor ,helpful reception desk staff and sadly after that all somehow goes downhill ....understaffing is a big issue at the hotel ...2 staff serving breakfast to all the guests in the breakfast area ,ridiculous how long ppl waited to be seated,food was slapped down in front of u ,u couldn't get anything you wanted ,no one around for long periods of time staff disappear in the kitchen ...then there's the room service ,what we ordered we never received ,ordered Pesto pasta received arabiatta ,asked to speak to the general manager this morn was told he will be in after 1 ,no wonder the hotel is a mess no one is here running it ,no turn down service at night ....no ways 5 star at the most 2 and I'm being generous…", "date": "January 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r449092790", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Very good location", "review": "A very good located hotel if you come to visit Granada and want to stay away from the touristic crowd of the old city. Modern interior with spacious rooms.  The restaurant service is excellent  and very client oriented. Even if late and after hours, even if just for two persons opened and set up a table to let us have dinner. Thank you reastaurant team, very much appreciated.", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r448913810", "sub_review": {"Sleep Quality": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Someone was asleep at this hotel....Rip Van Winkle?", "review": "You are a stone's throw away from the amazingly beautiful restored palaces across the street from you and up a hill literally when you stay at this hotel. It is nearly impossible to navigate the winding, steep and ridiculously narrow ancient streets. Ok. So walk, take your life in your hands with a taxi driver that does know how to get to point B to point A amazingly with safety. It is a thrill to walk some of the steep hilly roads and even a bigger coup when you walk uphill to your destination. The hotel is very lovely and the room that we had was very guest friendly: a bath and open shower, double sinks, closable doorway that opened to your enclosed rain bird shower, toilet and bidet and the hottest towel heater ever! The room had faux wood floors, dark walls, subdued…", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r448844072", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Nice but difficult to navigate", "review": "Recently we stayed at the Eurostar Washington Irving hotel in Granada, Spain for 3 nights. The hotel is relatively new or recently refurbished. Overall, our stay was enjoyable, but I do need to point out some issues which the hotel should address and some considerations anyone reading this review should take into account. First, this hotel is located down hill about a 5 minute walk from the entrance to the Alhambra. In fact the outer walls of the Alhambra face you as you walk out the door of the hotel. For those of you like me who did not get tickets to the Alhambra on line in advance or through a tour, the location of the hotel is a plus. The first day, I got on line for tickets for the Alhambra at 645 am and by 930 had moved little on the line only to find out that the tickets…", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r448505864", "sub_review": {"Location": 3, "Rooms": 5, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great stay, great service!", "review": "The hotel was fresh and crisp.Soothing colors as well as very modern bathroom fixtures and lighting amenities. Did not turn on the tv but it was quite large flat screen Everything worked. The hotel personnel was very helpful, very knowledgeable, and very friendly. Walked down to the plaza nueva to savor the local cuisine and stop by a few drinking establishments", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r444663929", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Great Location and Service", "review": "This hotel is in 2-minutes walk from Al Hambra Generallife. The staff were very helpful and friendly. The food was excellent. The room and facilities in general are excellent. The writings across the hotel was a good idea.", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r443426574", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A Wonderful Stay", "review": "Ideally located directly across from Alhambra, a wonderfully clean and hospitable hotel. Staff was great especially Christine at the front desk who treated us like family and then Estelle from hospitality who could not do enough for us. The room was wonderful, the hotel was enough to prompt a second visit to Granada.", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r440951799", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "beautiful hotel", "review": "This is a lovely hotel: very modern (if you want Spanish style, not for you), super-clean, great shower (although rain-shower head is a tad too large for size of shower), arge rooms esp.for European hotel,. good restaurant (great buffet) which is aspiring to be high-end, it has service which needs more training, pool and sauna, very good service. Location is mixed: if you want to be near Alhambra it is excellent, but is otherwise isolated. Considering this is a new hotel (only 4 months), it is top-notch.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r439196058", "sub_review": {"Value": 4, "Location": 3, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Outstandingly Good Hotel.", "review": "My husband and l were staying in Malaga and decided to treat ourselves to a night in Granada. It was November and the weather was perfect at 23degrees for walking. We checked into this fabulous hotel and it was a real wow moment when we saw our room. We really loved it, the bathroom was a dream with gorgeous toiletries and fluffy robes. The bed was the most comfortable l have ever slept in and had exquisite bedding. The hotel is the last word in luxury, and although we were only here for one night we enjoyed every minute. The staff could not be any nicer and every one we came across was so polite and smiley. The efficiency of everyone could not be surpassed. This place is not cheap but it is worth every euro. Highly Recommended. Ann G.", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r437528545", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "MORE EXPENSIVE BY PHONE THAN ON THEIR WEB SITE", "review": "On September 22, we booked a room in Granada for 4 days for a stay starting the next day. To make sure that there will be no error in the reservation, we decided to contact directly the hotel’s booking service in Granada. Loreta, the customer service agent, was very helpful and booked a room for 4 nights. A few hours later, on the Web site, we saw that the same room was available for 587.82 Euros including breakfast and parking.  We arrived at the hotel the next day, we did share this information with Loreta. Unfortunately, she couldn't match the price offered on the Internet and we have to disburse 726 Euros.  We travel often. This is the first time that a reservation made directly with the hotel does not equal the Internet price. We enjoyed our stay at the hotel, but we regret…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r436221779", "sub_review": {"Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great value at 75 euros, but many service issues. ", "review": "This is a beautiful, modern hotel that's a great location just steps from the Alhambra, and I was surprised how nice it was for the price (75 euros/night). But the hitch is that we ran into some serious service issues: (1) We were initially given the key card to the wrong room. (2) This was our only 2-night stay in one place during this part of the trip, and thus our only opportunity to have laundry done, so we asked a lot of questions to make 100% sure we had it right: Housekeeping would come before 10am to pick up our dirty laundry, and would return it by 6pm. Therefore we were VERY surprised when we left the room at 8am, put the \"please clean room\" sign on the door, and returned at 1pm to find that the room had not been cleaned and, more importantly, the laundry had not been…", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r435693969", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Staggeringly Good!", "review": "I booked in to this hotel last-minute for one night over the late October/Early November National Holiday in Spain.  I was attracted primarily by the availability, but also by the location - which did not disappoint.  Arriving through the quiet and sheltered Generalife Park is wonderful.  It is a bit of a walk from the Train Station and edges of town but if you're happy with the walk it's a lovely one - and useful after gorging yourself in the many tapas bars you'll find at the bottom of the hill.  The location does guarantee tranquility AND from my room (no special view requested) I could see the walls of the Alhambra which was a real treat.  Inside it is spacious and well lit, clean and very modern.  The staff were exceptionally helpful from the moment I dropped my bags (I…", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r435095938", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Modern surprise ", "review": "This hotel is in a great location directly opposite the Alhambra. The hotel itself is clean, modern and welcoming. The staff are incredibly helpful and no request is too much. The bar is lovely and the hub of the hotel. My room was super clean with a huge comfy bed and a power shower to die for (maybe a little extreme! 😜). I would recommend this hotel as it's close to Granada city center but  in an area that is quiet and relaxing. I'll be back for sure.", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r434028322", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Pretencious with no real style", "review": "The hotel is not a 5 star rating, but they know how to charge. The booking process was an experience, trying to book a room for three nights. Rooms price was advertised on the web at 607 euros, but the system was down. I tried to book direct but this was not processed as they did not have the full card details. Consequently, I booked on the web the next day, because \"few rooms were available\". to my surprise the same deal had risen to 790E, but this was shown as the \"best price available\". I then mailed reservations to ask if they would honour the original quote, but after two days they refused. The situation was worse, as by this time, the web price had dropped back to the original low price. Opportunist pricing !  When we arrived, the bathroom was small, dark and the room …", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r432460856", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "A Lovely Hotel in a Great Location", "review": "We found all we could wish for in this Grenada hotel  We chose a junior suite for our stay and were impressed by the size and amenities in our room. The room was very clean, nicely decorated  had a kettle, bar fridge and large bathroom. There was a very good WFI connection, In our case this was important as my university student daughter had several assignments due that week.Only thing missing  were face clothes. Seems they do not supply those in European hotels. The hotel has a nice terrace adjacent to the bar and dining room. On the top level there is a pool and another bar. There is also a good fitness room. Overall the hotel has a pleasant ambiance and staff were very helpful.  The area around the hotel is lovely, lots of trees and many major sights are all within walking…", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r431372812", "sub_review": {"Value": 4, "Location": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Splendid hotel in an excellent location", "review": "This is a very nice hotel with excellent facilities and a friendly staff. Rooms are impeccable and quiet. The Alhambra is at the doorstep which allow you to spend the morning visiting for example The Generalife and in the afternoon the Alcazaba and the Nasrid Palace. The restaurant serves good food but a wider variety of dishes would be welcome. The breakfast will cost you 16 Euro but is one of the best we ever had in a hotel. Every imaginable thing you want to eat in the morning is present. From the map it is easy to see that you cannot park for free anywhere near the hotel so you have to pay for the (valet) parking service provided by the hotel a substantial sum of 18 Euro a day. The website of the hotel and the booking information could be more explicit about this. Our…", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r430391372", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Wow, Skip This One", "review": "What a disappointing experience.  The good news started and ended with the bellman, who was courteous and helpful.  Parking is a huge hassle as is unloading your car due to the narrow streets and absence of a place to pull over in front of the hotel.  Parking is listed on the website implying it is covered but it is an extra.  The price for the rooms changed to a lower rate before we checked in but they would not honor the lower price saying it is your bad luck that you booked at a higher level.  Towel drying rack did not work.  Electricity is a chore as the all lights off button also shuts all the electrical plugs except for the bed side lights which is incovenient for recharging ipads and iphones etc.  Only one in room phone and it was without buttons or directions and neither…", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r428327238", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "ok place  terrible policies", "review": " Dear Guest, As you wrote both reviews, I replied your previus feedback. Best regards,  Ángela Caracuel Manager ", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r428248780", "sub_review": {"Rooms": 3, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "An excellent hotel but definitely not a 5 star hotel", "review": "I just checked in paying 229 e and I see on line that the price tonight is 179e  They will make no adjustment.....said I had to be checking every day to see which way the prices went.......also...when it says the room includes parking, it isn't free.   The room was ok...nothing special.  however, the bellman Michael, was so helpful and accommodating.  I would not stay here again", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r427915778", "sub_review": {"Value": 3, "Sleep Quality": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Fabulous Hotel a must stay in Granada", "review": "Dear Guest,  Thank you very much for letting us know about your recent stay at our Hotel.   We are very sorry we have not reach your expectations and we want to inform you that yesterday when I noticed about your request, we tried call you back for inform you that we can make you an adjustment in the price, if you look your phone or e-mail you will check it. However, as the air lines, price are changing if there are more or less people requesting rooms. Sometimes you will find better prices with advance but sometimes not. We are looking forward to see you and welcome again, so that we may have a second chance to show you our philosophy on Guest care. Best regards,  Ángela Caracuel Vera Manager", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r427340812", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Wonderful new hotel ", "review": "Having seen the old Washington Irvine hotel closed and close  to derelict for a number of years, it is wonderful to see the hotel reopen as part  of the Eurostars group of hotels. Whilst it appears there have been a few teething troubles, this is certainly a quality hotel and with delightful staff. The hotel is very inviting externally and the decor inside is understated luxury- quite a contemporary feel. We will definitely return. ", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r426956579", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "5 star rating but certainly does not deserve it!", "review": "Just returned from a 3 day break in Granada and hotel was ideal for visiting Alhambra.  We chose it for its rating but were disappointed.  Room not ready when we arrived at 2pm.  Be careful in the pool - it is unfinished and should not be open!  The inside is not tiled and the inside of the pool is concrete.  The circulation spots on the floor stand proud and my husband caught his toe. Tea and coffee making facilities in the room - only thing is there is no milk!  I rang room service and was brought a jug of hot milk.   This however was left in the room for the whole of he two days and the tea bags we used were not replaced. In a fantastic location for Alhambra and the city.  Shame there is not one scrap of reading material or leaflet in the hotel on either!  Surely most people…", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r426187042", "sub_review": {"Value": 3, "Location": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Extra Special ", "review": "Dear Guest,  Thank you very much for letting us know about your recent stay at our Hotel.  We are very sorry we have not reach your expectations and we want to inform you that an action plan is already in place.  Regarding the reading material about the Alhambra and the city, hotel has a library full equiped in, and you have one channel in the room tv with Washington Irving's works: Tales of the Alhambra. We are looking forward to see you and welcome again, so that we may have a second chance to show you our sound philosophy on guest relax and care. Best regards,  Ángela Caracuel Vera Manager  ", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r426123617", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Ideal location, high quality hotel and friendly staff", "review": "Recently spent two days in Granada and picked this hotel for the convenience of it being next to the Alhambra Palace. The location is stunning and the walk into the centre of the city takes about 20 minutes, it's downhill therefore an incline walking back. Plenty of taxis and buses to catch around the area. Staff very friendly and welcoming, food and service good. Sleek design throughout . The minibar and tea/coffee facilities are not obvious in the room so look to the side of the wardrobe. This is a  top quality hotel, well worth a little extra for that special night or weekend .", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r425088008", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent Hotel", "review": "I'm so pleased we chose this location for our 3 day stay.  The location was ideal for visiting the Alhambra, being 2 minutes walk from the main gate.  The 1 Euro small bus that takes visitors up and down the hill between the Alhambra and old city of granada is clean convenient and a short 5 min ride to the main square making it very convenient to explore the city.  The hotel is soundproof, no street noise or noise from other rooms which made the stay feel private and restful.  Staff were friendly and helpful.  The hotel is about 3 months old and build with high quality and tasteful specifications.  Really lovely.  We felt that choosing this hotel enhanced our holiday.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r424957932", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Beautiful hotel close to Alhambra (so outside the old town)", "review": "This hotel is on the doorstep of Alhambra therefore outside the old town. So if you don't mind a 15 minute uphill stroll from the old town choose this hotel ( it is a lovely walk). Hotel is beautiful, rooms are superb. There is no parking but the hotel will park your car for you for a charge of about €15 per day.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r424706302", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "It's a very comfortable Hotel", "review": "There were a couple of bonuses to this hotel. One it is almost directly across from the Alhambra (just a 3 minute walk away). Two it was recently renovated and is very nice to stay at.  The front end staff were the best although we found that at all the hotels we stayed at in Spain. The restaurant was okay, primarily the service needs work the food was quite good.  They have a very nice roof top pool deck and bar with sauna. We didn't get to use this area unfortunately but we did scope it out.  One other bonus is if you need to clean out your lungs you can go for hikes up the mountain and get some spectacular views of the city and also the Sierra Nevada's. I personally enjoyed Granada the most primarily because of the added bonus of hiking.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r423867148", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Helpful staff, ", "review": "Great value hotel. Nice styling and seems new or newly renovated. About 2 mins walk uphill to the Alhambra. The town is about a 10-15 mins walk downhill however is easily accessible via the local mini bus service (C3 bus) or a stroll up the gentle slope. The walk down the hill through the greenery is serene and cool.  The room facing the street with the balcony was really comfortable. The food at the hotel was poor quality which is unfortunate because the hotel and it's staff are really great. It was my husbands birthday when we stayed and the staff went out of their way to help  organising activities, birthday cake etc. Thanks, much appreciated. ", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r422973229", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great hotel and location", "review": "Beautiful hotel and less than 5 mins walk to the Alhambra. Spacious rooms with the inner ones looking over the quiet hotel courtyard. Peaceful and with very comfortable beds, this is a good value stay.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r420991823", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Must try harder", "review": "Stayed just one night on a flying visit to Granada.  The main advantage to this hotel is that it is about 50 metres from the Alhambra ticket office.  On pulling up in the small lay-by near the hotel I was met by a bell-boy who told me that I wasn't allowed to park there as it was for hotel guests only!    Check-in was swift and the room was very okay.  The bathroom was ridiculous - bath, separate shower, two wash basins, toilet and bidet.  As the bathroom was so large, it meant the room was a smaller than I would expect from a five star hotel.  The tea/coffee tray was in a cupboard and the light was supposed to come on when the door was opened.  The problem was that the catch that should switch the light off didn't work, so the light stayed on all night.  The problem was that…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r419712527", "sub_review": {"Location": 4, "Cleanliness": 4, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Almost an excellent but has a few teething issues", "review": "We stayed at the Eurostars Washington Irving hotel  in a deluxe room with terrace,  room 223. We had a very enjoyable stay in the hotel. The location was perfect for us. The staff are very pleasant and helpful; the beds are very comfortable; the bathroom and in particular the shower is excellent and the breakfast is very good. The pool area is very good and the pool staff helpful and efficient. There were several minor issues which I have brought to the Managers attention and to be honest most were resolved quickly during our stay.  However I did experience an issue with my hire car. I paid the 18 euros a day for the car to be parked by the hotel but there is a procedural issue which I have informed the manager of so hopefully improvements will be made. I recommend you take a…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r419484307", "sub_review": {"Sleep Quality": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Excellent hotel!", "review": "This was a great stay in a chic and modern hotel. Beautifully proportioned room with lots of space and good facilities. The pool area was lovely and we were able to order an evening meal (also good) there. Bonus was the near proximity to the Alhambra Palace.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r419204801", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Perfect hotel for visiting the Alhambra", "review": "Loved this hotel for its high quality service, cleanliness and fabulous location just outside the Alhambra walls and a pleasant walk into Granada through the Alhambra woods. Excellent breakfast and the complimentary fruit-infused fresh water on tap at reception a lovely touch! ", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r416830095", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great hotel and lovely staff!", "review": "We have had positive experiences at some Eurostars in Europe, but were unsure about this new Eurostars and its the location in Granada. But the big and clean room, with a very comfortable bed made up for our reservations. Much to my happiness, it was also very, very quiet for the light sleeper that I am. As for the location doubts, there are some pros and cons. The main positive aspect is that the hotel is directly in front of the Alhambra, which was perfect since we had one of the very early morning visits (highly recommend starting early - fewer tourists, weather is not so hot if going in the summer). The downside is that you away from the central area, so in the middle of summer, it's not the most convenient location to take a quick break heading up to the hotel from the…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r415830286", "sub_review": {"Location": 4, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "magical", "review": "Everything about the Washington Irving was breathtaking. The service and the staff impecable, and the proximity to the Alhambra is unrivalled 😍 highly recommended. Thank u Eurostar, u surpassed all expectations", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r415774610", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Perfect", "review": "A new hotel c3 months old which offers a very high standard of accommodation for visits to the Alhambra and Granada.  Location Opposite the main gate and at the top of a walk way to the centre of town via the Alhambra forest.  + High spec hotel Friendly staff Excellent breakfast Perfect location Superb bedrooms with a very comfy bed, mood lighting for all scenarios, unbelievable shower  -   N/a  A Perfect place to visit and stay in Granada", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r415768163", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Beautiful, comfortable hotel, excellent location, loved the pool", "review": "I stayed here with a friend on a three day trip to Granada. We loved the Washington Irving hotel - the location cannot be beaten, as it is situated just outside the Alhambra walls and about a one minute walk to the entrance.  Despite the fact that it is so high up, it is only a 5-10 minute walk (depending on how fast you are) to Plaza Nueva down a beautiful tree-lined avenue.  The hotel itself is beautiful and the rooms are really well done - lovely furnishings, big bathrooms, excellent showers, comfy beds.  We loved the pool and sauna area as well.  The only reason I am giving it 4 out of 5 stars is because the food in the restaurant is absolutely awful - I ordered a club sandwich and it came with fries that were only half-cooked.  My friend had pasta and it came without the…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r408357766", "sub_review": {"Value": 5, "Location": 5, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Great location for Alhambra", "review": "It's a new hotel and it shows - e.g. the pool area is not yet finished, or at least it feels that way... At the same time, our room was clean and spacious, and adequately furnished - do ask for different pillows though. We thought the breakfast was very nice and service friendly. The best aspect of staying in this hotel is definitely its proximity to Alhambra - just two minutes walk to the visitor centre.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r404567065", "sub_review": {"Sleep Quality": 4, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good but nowhere near a 5 Star hotel", "review": "Stayed here for 2 nights. After check in and getting to our room and unpacking the front desk asked us to move to another room. Travelling with a baby is already difficult so we refused to move having already unpacked everything.   In a nutshell, this is a stunning looking hotel but the service is absolutely disconnected with its appearance. The food is poor and expensive compared to what you will find a few minutes walk away.  Overall I would recommend this hotel but also recommend not to have too high expectations of the staff.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r403990732", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Poor experience", "review": "It's definitely not the 5* hotel it claims to be, and possibly not 4*. There were no bathrobes or face flannels in the bathroom, nor did they have any when asked. The rooms are lovely in some respects, but odd in others - no drawers, for instance, and wardrobe rails so high that you can't reach the coat hangers if you're less than average height.  The restaurant has a limited and quirky (ie strangely put together) menu, though the quality and service was fine.  However, we had to send back warm white wine, and cold red wine, more than once.  My partner had  a bad experience. Finding the pool bar unstaffed one afternoon, but with no sign explaining why and no staff around, she looked in the room next to it, whereupon the door closed behind her and couldn't be opened from the…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r403963073", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Beautiful hotel", "review": "Fantastic rooms, beautifully crafted. Extremely well located, next to Alhambra and 5 minute walk from the crowded city area and Albaicín, with its atop mirador to Alhambra Magnific service by attendants. Very recomended!", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r402681432", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Hidden Gem right next to the Alhambra", "review": "This lovely hotel has just been fully renovated, it looks and feels brand new.   It's a hidden gem and should be much higher up the review list of hotels for Granada.   It's just a short down hill walk from the city centre via the Alhambra gardens, although the up hill walk may put some people off.   Its location almost right next to the entrance to the Alhambra complex means that hotel overlooks the garden and is very quiet and secluded.   The restaurant offer breakfast and evening dining; useful if you want a quiet evening after a tiring day walking all over Granada.   Use the hotel coordinates on its website for your GPS device for easy access by car. Parking is by valet only using the Alhambra's carpark.   I highly recommend this hotel; all the staff we met were friendly and…", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r401609112", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great location", "review": "This hotel could not be closer to the Alhambra… literally across the road. From our room, we could see the outer wall of the Alhambra a mere 30 metres away. The check-in went smoothly and the room was large. The hotel was generally very nice, staff very helpful and well-priced. Hence, my 4-star rating. I would stay here again. However, on a side note, one of my pet peeves is ‘smart’ lighting where you push a button and a different lighting ‘ambiance’ is created with each button showing which ambiance it creates, be it ‘office’ or ‘welcome’ or ‘sunset’ or WHATEVER. The issue is that it is impossible to read the letters on each button so you end up pressing them all until you manage to finally switch the lights OFF. It may be great at home where you just learn which button does…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r399846727", "sub_review": {"Sleep Quality": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Perfectionism ", "review": "I would like to thank every person in this magnificent hotel for making my stay enjoyable . I dont know from where to begin ! I think I was fortunate to be here and to achieve my father's dream visiting Alhambra . It's very near to the palace where you can go walking . Even if you'd like to visit the center it was perfect for me and for my family . They loved it so much .  Thanks to Loreto 🌷 for the constant smile , greeting and for information . ", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r396933340", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Beautiful hotel, bad service", "review": "The hotel is very nice, brand-new and fresh. However, the service was far below what you would expect from a 5* hotel. Our check-in took 45 minutes, and although our two kids were getting crazy from waiting, the staff did nothing to speed up. The parking was full when we arrived, so when I asked a girl at the reception where to park so we can at least check in, she just looked a bit stressed and suggested that we wait untill a spot becomes available..not something I would be glad to do after a 3-hour drive with two kids. The rooms don't have irons, and when I asked reception for one, they said it was being used by another guest. I called several times, but they didn't get it back, so I had to wear the same not-so-fresh dress. The next day, the iron was still not available, but…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r396884693", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Hijabi traveller- great place but with a few let downs", "review": "Stayed here for two nights with hubby we drove down from malaga airport, though easy to locate, there was no space to stop and take our luggage out, the few car spaces available had been taken, so i had to jump out and seek advice from the reception staff as we did not want to block off the narrow street. She advised we parked further down and then the man will come and take our car and park it offsite somewhere.. Payed 18euros for that service, Bit much if you ask us. We sat in our car with hazards on until he arrived as it was not safely out the way.. We figured parking is a real issue in granada. Anyhow moving on all checked in at 12pm midnight starving from our long journey, we wanted to order room service only to find there was such a limited menu, to what we could eat. We…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r396572488", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Perfect all around", "review": "Great location, great staff. The rooms are brand new and they are equipped with the latest technology. They have a great outdoor pool on the top floor, and best of all is that you are across the street from the main attraction \" Alhambra \"", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r392178039", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "New hotel with some issues", "review": "We stayed at this hotel for 4 nights after travelling around Spain. It's located opposite the Alhambra entrance with a few restaurants nearby, we decided at the end of our travels we wanted to be out of the main city, this was perfect location if you want it to be quieter and will be visiting the Alhambra. It is a nice 15 minute walk down a wide tree lined pathway into Granada, it is quite a gradient and cobbled and uneven in parts so nice to walk down but we got a taxis back for 5 euros, we also bought a 2 day pass for the small city train the green route stops at the Alhambra. (Ladies flat shoes essential).  The hotel is new and decorated beautifully, though I did find some rooms dark with all the brown wood, we requested a brighter room and we were moved straight away. The…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r391483528", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Almost Perfect....", "review": "I actually changed my booking in Granada late on as I found this new hotel just opened and got a superb opening offer that I could not refuse.  Granada is not easy by car.... but as you find yourself right next to the wall of the Alhambra you feel that you are somewhere special.... and when the hotel take your car away you have arrived.  Easy and early check-in was great.... with very few guests the hotel was so quiet.  Plush decor.... dark tones.... modern and old styles mixed.... the place is just syle personified.  Our room on the 4th floor had a juliet balcony facing the Alhambra.... Magical.  The bedrooms are darkly decorated but also well illuminated.... a bath tub, twin sinks, shower toilet and bidet.... with two internal doors makes it seem special.  The air con was…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r391270716", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Excellent modern hotel near the entrance to Alhambra", "review": "New hotel opened recently. Everything was brand new. Great value for the price. Best location for visiting Alhambra, walk to entrance. Easy to find, easy to park. Surrounded by trees and gardens. Fabulous pool and terraces. Good breakfast in a beautiful restaurant. Designer furnishings. Quotes from Shakespear and Washington Iving inscribed on the walls. The best hotel in Granada.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r391075142", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Our best stay in Spain", "review": "This was definitely the best hotel we stayed in during our roadtrip in Spain and actually the only one which was able to offer appropriate sevices to the price you pay and really deserves five stars. The staff was helpful, location of the hotel is just fantastic (and Granada is so romantic), the rooms are lovely equipped and the breakfast is delicious. When you are tired after all day of discovering all the city, the swimming pool on the roof is a great choice.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r390498445", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fantastic hotel in front of the historic Alhambra", "review": "Fantastic hotel Amazingly well equipped and decorated rooms Great & very friendly staff Superb scenery and setting Easy walk to center Big Breakfast buffet Very clean  Price/quality one of the best ever visited Highly recommended for Geanada trip  ", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r390176252", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Brand new and excellent ", "review": "The hotel is a refurbished place directly opposite the Alhambra. The rooms are about 20sqm with most overlooking the leafy street. Air conditioning is the quietest I've ever experienced. Bed and sheeting was top quality. Bathroom had a separate bath and shower with great power.  To walk down to the town is an easy walk on the wood track past the Alhambra.  Or walk straight down the road to the Hotel Palace Alhambra then turn right down the cobble stone path. It's 700m straight down but the quickest way down. It's also to the closest supermarket 'courivan'.   ", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r388815210", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great find!", "review": "Booked this hotel last minute for only $89 a night! Perfect location for la Alhambra! Only a 4 minute walk to the entrance. About a 12-15 minute walk into the center of town, but a beautiful path through a wooded area. A little bit harder to walk back from the center since it's up hill, but worth the walk. Service at the hotel was amazing, the bar at the pool wasn't opened yet, but we ordered in the lobby and they brought it up for us once we had changed for the pool. The pool was a perfect temperature and a beautiful area to lay out. Rooms were quiet and very tranquil. They parked our car for us in the Alhambra parking area and at a discount. We actually had an Airbnb for our second night in Granada but decided to forgo it because we loved the Washington Irving so much. ", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r382905180", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Outstanding", "review": "Stayed for 2 nights, from 11-13 June. Far exceeded expectations. The service of hotel personnel was outstanding, the room very cozy and ample...excellent location very close to Alhambra and walking distance to centre of town. Highly recommend the hotel", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r381994564", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A nice surprise", "review": "I booked this hotel just one day before travel and was a little bit nervous as there were not yet any reviews or photographs of any of the communal areas! Normally I am one to scope out the best hotel for weeks, so this was a leap of faith for me!  We were though very pleasantly surprised! The hotel is literally brand spanking new, has been open just one week in fact! It was a great location with spacious and comfortable modern rooms. The staff were all very friendly and helpful.   The pool and gym I don't think we're yet ready for use. The gym didn't have any equipment and it was more like a sauna than a gym (roasting!), I think it will go on to be a very popular hotel, we'd definitely go back!", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187441-d231592-r379906435", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}]