[{"title": "Cheap but cheerful", "review": "This is an older small hotel. It is cheap but the staff are helpful and friendly.   A good 10-15mins walk to main attractions but an easy walk.   Near the train station, about 10mins. Not worth a taxi if your physically well, but it can be tricky to find as the internet map has it marked wrong.  Head for the American cafe and ya just 10meters up from there! ", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r703532858", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Great location and good overall", "review": "We stayed for 3 nights in a Quadruple room. The room was fairly dimly lit but spacious. The beds were fine but the aircon didn't feel like aircon and was more like cold air. There was a large cupboard in the room but not loads of storage space. Luckily we weren't staying that long. The breakfast was good and a wide variety of cereals and ham and cheese and bread etc. There wasn't much seating room so it must get packed when they are fully booked. The location was good walking distance from Florence Train station and close to the main sights. There are also supermarkets nearby which is nice. Would return again purely for the location and price.", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r702235639", "sub_review": {"Value": 5, "Location": 5, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Jail Break", "review": "The positives of this hotel are:   •Comfortable bed with good linen •Nice towels  •Very quiet and dark (our window opened to the pipes and conduit of the next building over, less than a meter away). •There were two nice staff who were friendly and helpful. The others seemed a bit blasé (understandably, I guess!) •Consistent aircon which wasn’t too loud or cold. •Close to Mercato Centrale, which was fabulous for food and drinks and people watching.  On the downside: •In a seedy area, drunks passed out near hotel entrance, dodgy types all around.  •Some terrible cafes and restaurants in close proximity. •Very disappointing breakfast selection with possibly the worst coffee I’ve ever tasted. We didn’t bother eating here after the first morning.  •Whilst comfortable, the bed was two single beds side by side, which slipped easily across the floor. •Dirty and dated, shower pressure and temp was good but dingy and dark, with gross shower curtain.  •Extremely loud buzzing for entry into the room - think prison cell style.   We are pretty positive people and like to make the most of our short time together, so we definitely made light of the situation and had a lot of good laughs 😂 A bit of comedic imagination can do wonders 😂  We would definitely not stay here again, though.…", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r699267858", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Good value hotel. Confirmed: rooms facing Via Nazionale are noisy.", "review": "This hotel is very good value. Very close to the city centre, clean and the staff are very helpful. Our room was on the first floor and facing Via Nazionale and indeed it was noisy, I do not understand it, because I think it had double windows, but still, I could hear the traffic. And I am a bit hard of hearing, so I do not usually complain about the noise. Nonetheless, for the price, I think it was a great deal.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r687051315", "sub_review": {"Value": 5, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Better than average and well situated to the train station", "review": "Last minute changes to your itinerary are often challenging, if not impossible!  Changing our destination to include Florence, we scrambled to find a hotel.  After calling a couple of hotels listed in a guide book, we found a room at the Galileo.  Likely much more grand in the past, everything about our stay was satisfactory. The hotel staff was very welcoming and very helpful. They offered to store luggage if you arrive before check-in or hold after check-out time. The desk manager helped us with train schedules, provided maps and directions. All of the staff was very accommodating and friendly.   Our room was clean and everything in the bathroom was in working order.  Breakfasts were buffet-style and included all of the usuals, coffees, teas, meats, cheeses, pastries/breads, cereals, etc.   The hotel has an elevator and is only a few blocks from the train station. The Duomo was an easy walk, perhaps 4 blocks, one turn and a couple more blocks to it and the Campanile (bell tower). There are places to eat near the hotel and a small convenience store en route to the Duomo.  I've noticed some negative reviews, but our experience was in line with most 2-3 star hotels in Europe.…", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r684495715", "sub_review": {"Value": 3, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Don't stay here!", "review": "Stayed for 3 nights. Only amenities in Bathroom were 1 small hotel bar of soap, Towels and toilet paper. No Facial tissues. Strangest flush arrangement on toilet I have ever seen. In room safe was so small it was a joke; couldn't even get an iPad mini in it. Lock jammed on minibar fridge would not open and called for service. Later the guy at the desk tried to charge us for the repair said we broke it. We did not force it. Told them what to do with the repair bill. To be fair the hotel has excellent location; walking distance to almost everything. Included breakfast was minimal very little selection. Would not stay here again.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r683482063", "sub_review": {}, "travel_purpose": "", "rating": 2}, {"title": "Not great", "review": "Room not clean, lights didnt work,   breakfast was very poor.  Shower overflowed. The staff were helpful at the desk Overall, I would never go there again this was our 4th hotel in Italy and the worst. Its only redeeming feature was it was 5 minutes walk from the metro and station", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r677638229", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Nice looking hotel but ordinary service and conditions", "review": "This hotel looks great and is ideally located in Florence.  However the conditions inside leave a bit to be desired.  Firstly the night noise from the corridors and neighbouring door locks is excessive.  Next, mosquitoes in the room cannot be tolerated and the bedding was not comfortable.  All in all a very ordinary experience.", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r676147977", "sub_review": {"Value": 2, "Sleep Quality": 2, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "A little disappointing!", "review": "We have been travelling through Italy staying at mid range hotels but this would have to be at the bottom of the range. Firstly the positives: Great location, close to the old city, railway station, cafes and shops The staff were fabulous- concerns were addressed immediately, as much as they were able to e g all 3 electrical outlets in our room were not working so we couldn’t charge our phones or iPads, and they organised for an electrician to come and do so within a few hours. However the cleanliness of the room was not great, cupboards could not be opened, curtains were very dirty and the towel rack, electric, was inside the shower where it got wet. Very concerning. Gave a new meaning to a quick shower. It had enormous potential to be really good but was underwhelming to say…", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r673030391", "sub_review": {"Value": 2, "Rooms": 2, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Decent place with a weird bathroom!!", "review": "Decent,clean, 3 star hotel. It has a lift,Thank heavens!!  Decent room, rickety cupboard,though!! It has the weirdest bathroom I have ever seen!!! I wonder who designed the configuration!! In the land of ancient masters of Churches and Palace builders,this is laughable and shameful!!  Look for yourself and judge!!  My husband and I are of very average height!! 5 feet 4inches max and we still had difficulty using the toilet so I wonder what would happen if anyone big and tall were to use it!!! ", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r665105580", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "A well-located hotel", "review": "The hotel is set close to all the sights of Florence. It is also close to the airport and the central station. The staff is kind. The rooms are large and comfortable. There is free internet. Breakfast is good and well balanced.", "date": "January 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r654242230", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Weekend of culture and fun with family.", "review": "Cannot say anything negative about this hotel. The location is fantastic. A 6-7 minute walk from the train station along a bustling street. Because my sister and I have young children, ages 10 and 4, we were given a suite with an adjoining door. Wasn’t sure at first but each room was very large and we had our own bathroom. Only negative of having this room was it is positioned directly next to the breakfast area, so scraping chairs from 7:30 not so good. Lovely staff. Helpful and accommodating. Made Mum a pot of tea late one night. Had a really positive experience here. Our party of 10 all said their rooms were clean and comfortable. I would definitely recommend to friends.", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r638669871", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great hotel in beautiful city", "review": "I stayed at this hotel with my daughter. It is a short walk from train station and close to main sights in Florence. The room was clean and had everything we needed. There was a noisy fan on when we arrived but asked for it to be turned off and didnt have any other problem with it. Breakfast was included and there was a good choice of food available. The staff were very friendly and helpful especially Stefano who went above and beyond to help us. All in all a lovely stay in a beautiful city.", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r633228951", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Brilliant hotel for city break in Florence!", "review": "This hotel had everything we needed. It was in a great location- right by the train station and within an easy short walk of all the main attractions. The staff were very friendly and helpful; from booking us taxis, advice on where to go and discounts on places to eat. The hotel is in a great spot for evening food and drinks choices. This hotel was very Clean which is a must for me.  Great hotel. We would highly recommend.  Thank you for a lovely stay.", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r627037446", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A nice surprise!", "review": "The hotel we had booked had a mix-up for the first night of our 3 night stay in Florence.  We were escorted to the Hotel Galileo and were pleasantly surprised.  This hotel excels in \"charm\" - just in case you are looking for sleek and modern.  We could have easily stayed here all 3 nights.  The room was larger than we expected, staff was friendly and extremely helpful ( got us last minute reservations to Accademia), Wi-Fi worked great for us, and despite being on a very, very busy street, our evening was quiet even with the window open.    I would not hesitate to recommend based on our one night there.  Thank you, Hotel Galileo for being what you are, a gracious, comfortable, charming boutique style hotel in the middle of a very chaotic part of Florence!", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r622153282", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Average to not impressed", "review": "Hotel is in great position. Although: the bed has steel springs sticking through it, the WiFi was intermidant and the city tax is far too expensive for what we experienced. Plus side they cater for gluten free breakfast and majority of staff are very friendly.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r619060756", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Average hotel", "review": "When arriving in our non smoking room, it smelt like a smokers area in a bar.. unsure of whether it was connected to a smoking room? But if we left the windows shut, Every time we returned, the room was full of cigarette smoke smell.   Other than that, the hotel it’s self is nice enough, I can’t even remember what we paid to stay there! The breakfast option is pretty poor in relation to other places we stayed on our trip of Italy. Just some jams and bread to choose from!   The beds are small in a double room, literally just a double bed, which is rather uncomfortable.   The hotel has wifi, but you’re better off not using it. It’s constantly drops out every minute or so..  Over all, I wasn’t very impressed with the hotel, but it is in a good location.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r616193692", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Looked after us well...", "review": "A last minute booking and we found this very pleasant hotel in a central location that will accept a dog. They were helpful with the parking arrangements we required and to provide us with a good sized double room and nice bathroom facilities. Thank you to Vincenzo for his assistance. The continental breakfast was particularly nice. ", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r611156614", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice surprise", "review": "I was in a low budget trip but was extremely well surprised with the hotel. Good internet service, very comfortable rooms, nice location. Everything clean an good for a good price. I realy recommend to stay there.", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r609964485", "sub_review": {"Value": 5, "Location": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Quite a good place to stay", "review": "We just spent the night here but I found it to be quite good.   Four important things to me are location, a firm bed, air conditioning in the room and a good shower with decent water pressure and this hotel ticked all the boxes here.   It’s nothing fancy but I was happy with my stay here and I’d stay here again. ", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r597733614", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great Location", "review": "Stayed in this small hotel recently for four nights, close to the station. 20mins. walk to all the main sights. Good Breakfast and helpful staff, our room at the back was a good size and clean. Could be noisy at the front as it is on a main road. Bars and restaurants near by and it was a reasonable price considering its central location.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r594927794", "sub_review": {"Value": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great Location", "review": "We stayed here for 3 nights great hotel except for their WiFi which was constantly dropping out which made it hard to book tours online. Great location walking distance to everything from the markets to the Duomo & Ponte Vecchio. Breakfast was great if your on a budget this is a great place to stay. ", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r593281690", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Everything in walking distance", "review": "Very close to the main station and very close to the sightseeing highlights, we were happy to get a hotel for a reasonable price in Florence. Very small front desk, but friendly personnel (especially the asian guy) we were happy to get our room already in the morning. The view out of the room was to a backyard. The advantage was the quietness in the night. The room was clean, the bathroom as well, nothing to complain.  Breakfast was  italian like, so a lot of sweet things. Don’t expect a typical continental breakfast. Coffee from the machine was very good.  If the wardrobe would have been in a better shape and the room itself would have had a nicer interior, I would have given more points. Nevertheless, because of the price for the room and the location i can recommend it and…", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r590012592", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent hotel with decent budget", "review": "The hotel is just 10 mins walk from the station. located on the main road. walking distance to Uffizi, Duomo,Galleria and you name it. the Staff are very courteous and helpful and provided us with lot of tips on sightseeing. the breakfast spread is also good. rooms are big and spacious and so is the toilet (frankly in our entire Europe trip, this had the largest room with toilet). We really enjoyed our stay.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r588247100", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great Location", "review": "The hotel is clean and neat with very friendly staff. Nothing a problem. Close to train station and several supermarkets in the street. Free wifi and free breakfast. Everything available within walking distance.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r585240840", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great location. Friendly staff", "review": "The location of this hotel is easily walked to and from the main train station. Everything is an easy walk around this beautiful city. The accommodation is quite rudimentary and simple however it is great value, very clean and the room itself is quite spacious. Breakfast is basic however the cafe next door is very good.  ", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r582853782", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "ideal location,great value", "review": "Three of us staying for four nights as a base to see sights and then head to the rugby in Rome on the Sunday. Ideal location as 10 minutes walk from the train station and 10 minutes walk to the town centre (less than 5 minutes to the Central Market & one of the main museums & only 15 minutes to the other side of the river). Loads of bars & restaurants nearby including a great craft beer bar (Mostoldoce) about 20 yards away. Adequate breakfast, nice clean rooms & good size bathroom. Good value. Also 90 minutes by train to Rome & 60 minutes to Pisa. The staff were lovely and I'd definitely stay there again.", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r559092080", "sub_review": {"Value": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "A quick weekend", "review": "The location is really good, close to the station and 10.min on foot to the centre. The downside was an hour and half of delay for the check in. The room was clean but not so equipped. The staff very gentle. We didn't have breakfast. In short, Not so good to make me come back next time.", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r556916305", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "suitable stay for Coeliacs", "review": "We stayed here in early December and found the location was ideal for our short break in Florence.It was about 10 minutes by foot from the railway station and in an area where there were plenty of bars and places to eat.Also really only a short walk to main sights.The rooms were comfortable enough,nice and warm and the bathroom perfectly adequate ,very clean,with nice fresh towels daily.The breakfast was continental style but with enough choice to keep us going til lunch time.I had emailed in advance to say I was a coeliac and although no bread was provided I did well enough with the yogourts fruit,and cold meat etc together with nice coffee and juices.I was able to purchase gluten free items locally but it would have been nice to have had a roll provided instead of me using my…", "date": "December 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r552962332", "sub_review": {"Location": 5, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Not bad", "review": "I stayed at the Galileo hotel for 2 nights. Overall it is a decent little hotel. The staff is wonderful and they serve a really good complimentary breakfast.  A few observations: The rooms are on the small side The hotel is located about a 10 minute walk from the Duomo and the main tourist area If you ask, the front desk will give you a coupon for a 10% discount at a good restaurant right around the corner  It's about a 10 minute walk to the hotel from the Santa Maria Novella train station, which is where most visitors arrive in Florence You have to insert your key card into the outlet by the door in order to keep the lights on. (We rarely see this in an American hotel.)", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r535141690", "sub_review": {"Value": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Great hotel", "review": "This hotel is in an excellent location. Close to sights, train station, tourist meeting points, local markets, city squares, cafes, restaurants etc.  Staff were very friendly, helpful and welcoming. Reception was able to book tours. Wifi was excellent strength. There is a lift that services all floors.  Breakfast has a good selection for a continental breakfast including fresh espresso coffee.  Our room was absolutely huge! It could of fitted at least eight queen size beds in the room. Bathroom was similarly large. It is decorated in old Italian style - for us this was all part of the charm, but this is not for everyone.  It can be a bit noisy as people come and go from their rooms. But we did not experience any street noise as our room was at the opposite side of the hotel.  We…", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r534671691", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Central location is the asset", "review": "We stayed here for two nights. The positive of this hotel is that it is walking distance from the train station, amongst the city centre cafes and restaurants, close to the laundromat and free wifi.   The negatives are the rooms are very small and dated, tiny shower, tiny tv, loud buzzer to enter your room which you can hear everyone else's go off, you can hear people walking up and down the hallway, loud reoccurring toilet system, on a very busy noisy street, no air conditioning and unwelcoming reception staff.  If your after a centrally located hotel and okay with putting up with the negatives than this is the place for you. ", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r526574900", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Great location ", "review": "We loved this hotel! It is in a great location very close to train station, laundromat, Santa Maria Fiore, and San Lorenzo Market. Great breakfast with several options and attentive staff having espresso waiting. The front desk staff was also very friendly and helpful and the tours that they offer were great.  It was a little loud outside the window at night but that was expected with a room with a street view and in an active part of the city. ", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r524133836", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Value for money", "review": "we had two rooms. hotel in 12 to 15 min walk from the train station walking distance from all the local sight seeing attraction. there are lot of local cafes and restaurants near the hotel, just in the lane next to the hotel. there is indian restaurant just two min walk from the hotel. Rooms are very functional and have window that can be opened. Rooms are not very spacious.", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r516323250", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great location ", "review": "It has been a pleasure staying at this hotel for 4 nights , the location is great on Via Nazionale a couple of minutes walk from the train station and to major tourist attractions. Breakfast was the usual cereals , juice,... Cappuccino of course. On the other side, there was a mishap with the A/C so got a fan instead and a discount for the room , that was a nice move from the staff. Definitely a nice hotel for a stay in Firenze. ", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r508020592", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Karen S", "review": "Location was excellent as close to train station and not far from popular tourist attractions. Rooms clean . Breakfast was the usual cakes and cereal and fruit - would be nice to add option of eggs. Buzzers on doors very loud and annoying as was noise in the hotel as walls very thin - could hear the gent in next room using the toilet. Reception staff not especially welcoming and did not help with luggage. Definite room for improvement.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r500568151", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Great Service and location", "review": "It has been a pleasure to stay at this hotel for four nights. The man on the desk was so helpful with leather purchases, places to eat, and he even sorted out a tour that had been booked for the wrong day and time so we could still go. A marvellous location Thoroughly enjoyed our time here and thanks so much for all your help", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r496876147", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Good Location & Large Room even for a family of 4", "review": "Rooms are large compared to Italian standard. Stefano at the reception was very helpful and the lady in the breakfast table was very charming & caring even though she was the only person to take care of the guest breakfast. The location is good and if you speak to Stefano he would help in planning the place to visit.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r496388091", "sub_review": {"Value": 4, "Location": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Unfriendly staff and poor rooms", "review": "Noisy room, no hot water on second day. Unfriendly staff ( lady looking after breakfast didn't smile once and just grunted and pointed) when asked if we could have a beer at the bar we were told that was what the mini bar was for! Would not recommend staying there even though ideally suited for main attractions. Decor is tired .", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r484532500", "sub_review": {"Rooms": 1, "Cleanliness": 1, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Gorgeous rustic hotel, well located", "review": "Gorgeous rustic-style hotel, decked out with wooden furniture, vases of flowers and the cutest little breakfast dining room you've ever seen! Very friendly and helpful staff, and really well located, walking distance to the train station, the popular museums, piazzas, shopping, food etc. Can't go wrong with this little gem... it is situated on a busy street so traffic noise was a little loud in the rooms, didn't bother us as we slept pretty easily after a big day!", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r479470185", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A nice stay in the heart of Florence.", "review": "The rooms are actually pretty big for Italy...bed was a bit stiff, but not bad.  Rooms were clean, and the included breakfast was good.  You're a short walk from downtown and the Duomo, the Florence Market, and the staff was very informative.  Also very close to the train terminal.  Good for a short to mid term stay.", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r478960593", "sub_review": {"Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A Wonderful Hotel", "review": "Stayed here for 2 nights, from check in to check out, everything was smooth. The rooms are very nice and comfortable, wifi is excellent.  Hotel staff are very friendly, and go out of their way to make you feel comfortable.   All the sights of Florence are at a walking distance, and 7 mins walk from the main train station.   Would definitely recommend this hotel to all.", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r468649575", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Barely acceptable", "review": "What's good: Room size,we were five, the room had an appropriate size.  The beds are comfortable. Staff was friendly. Location is good, 5 min walk to train station walking distance from main attractions. What's fair:  Everything seems old including the building. Cleanliness very superficial. Breakfast not so good. No ventilation in bathroom. What's bad:  Very noisy.  We could hear the people in rooms around us, the plumbing is very noisy you hear when people open water faucets or flush the toilet.  You hear cars and people outside. In summary barely acceptable.  I would not return.", "date": "January 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r448763628", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Lovely place", "review": "Good area. About a 10 minute walk to the Duomo. Staff were lovely. Room was basic but I suppose you get what you pay for. Also in prime location to the train station as it's on the main street (Via Nazionale).  Only problem we had were that we were woken up by ridiculously noisy neighbours who decided to was a good idea to 'practice' opera at 7AM and then at 9PM until late. We reported this to reception and the elderly gentleman didn't really seem bothered and told us there was nothing he could do.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r448279196", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Comfortable and Reasonable", "review": "We planned a quick trip to Florence to explore the city. Hotel Galileo is a short walk from SMN train station and located close enough to the center of the city. It is conveniently located on an avenue with many shops and bars for all of your needs. The staff was extremely accommodating and considerate. We were able to check-in early, access to free Wi-Fi that actually works, and free breakfast/brunch which included a wide selection of fresh fruit, croissants, meat, cheeses and beverages to choose from. The room itself was a standard double room with enough space and also a closet which included additional blankets, etc. Everything was clean and comfortable.", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r448070114", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Enjoyed our stay!", "review": "This hotel really suited us. The location is brilliant- 10 minutes walk from the train station and all the main sights. Staff spoke good English and were helpful and friendly.  The room was very spacious for a European city hotel and also very clean. Bed was comfortable. Small TV with a few English channels. The bathroom was clean and big and there was a powerful shower, always with hot water. I Didn't ever get up in time for breakfast so can't comment on that.  My only slight complaint is the noise the key card opener makes - it's really loud and can disturb you in the night. There is also some noise from outside as the hotel is on a busy main road. I would absolutely stay here again when I next visit Florence - good hotel and good value for money.", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r444619856", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good Hotel, Lovely Staff", "review": "We stayed here last week and were very happy. The hotel is only 10mins walk from the train station and about the same from the Duomo. The room we had was comfortable and had a good bathroom and a little balcony with a small table and two chairs. The breakfast was good, although there weren't so many things to choose from.  The staff were very helpful and professional. At night the noise from the other rooms was a bit much, but it stopped once they all went to sleep.", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r440121061", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "A Good Choice!", "review": "The hotel was conveniently located to all attractions as well as the train station,  The hotel was clean and the staff was very helpful.  The breakfast was simple but good.  We enjoyed our stay at Hotel Galileo.  We  would recommend this hotel to friends.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r433392998", "sub_review": {"Value": 3, "Location": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Convenient and clean", "review": "A convenient, clean, and good value hotel. The welcome was friendly and helpful. The free breakfast had sufficient variety for most tastes. We visits a restaurant around the corner, I Toscano, which we can also recommend for a tasty and expensive meal.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r433068104", "sub_review": {"Value": 5, "Rooms": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very ordinary", "review": "This hotel is possibly the worst hotel I have stayed in. Although check in was a pleasant experience it was downhill from here-on in. Firstly the lift...the most disgusting smell ever..it did not get better over 5 days. Secondly, the noise...when you can stand in the corridor and hear conversations from within nearby rooms speaks volumes for privacy. Every time people in the next room went to toilet you heard it. Loud electronic door openers that woke you up if the next door room came back late at night. The street noise ...unbearable. check out my photos of how the bed was presented after make-up, how the towels are presented in the bathroom and dirty used glasses not replaced or the plastic bottle and cup not removed, toilet paper in the bidet not removed. This is not a nice…", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r429999183", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Florence break", "review": "Not far from station, extremely helpful staff. My friend and I thoroughly enjoyed our stay. it was small but was clean and breakfast adequate, I wouldn't hesitate to stay there again if I went to Florence.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r429142091", "sub_review": {"Value": 4, "Location": 5, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "october in florence", "review": "we stayed at the galileo hotel for four nights, at begining of october 2016, some would say the decour was a bit tired, for us it was just right, it gave an atmosphere of old florence, room was clean ,shower worked well , the hotel is central and easy walking distance to most attractions, reception staff friendly and helpfull, continental breakfast was good, may be busy in july august, not a big dinning area, overall good value for money, note: you have to pay city tax on your stay, taxi to airport was 24 euros, train station to rome or venice is only 10 minutes walk, there is a shuttle bus from train station to florence airport for about 5 euros each.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r426738919", "sub_review": {"Value": 4, "Location": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Cute Hotel", "review": "Good staff I really like interior of the hotel of the room nice and sweet. Rooms were BIG I loved my room very sweetly done in pink old style with very cute look. Staff was also good location is brilliant extremely close to the railway station walking distance I must say and close to the market and restaurants. It’s a definite yes for everyone to stay and according to European standards rooms were luxurious.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r423228815", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Near train station (that's all).", "review": "The only good thing is that this hotel is near train station, super tiny room and bathroom, old furniture,old accessories at bathroom, employees are just ok .. doing their job, the guy at the reception will give you basic information and will not take any extra step to answer further questions, barely  meets expectations, place is good enough for a sleep only. Over priced. You can find better places with better prices.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r422193045", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "5 days in Florence", "review": "The hotel is within easy walking distance of the train station and pretty close to all of the main sites as Florence is a pretty compact city. The hotel was clean, comfy enough, not too large, great location and the staff were very helpful. As a solo traveller it suited my needs perfectly.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r419230059", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Affordable accomodation", "review": "The Galilleo Hotel is located central to the most sight seeing places in Milan. Recommendation to nearby restaurants were spot on, as it was mostly visited by locals. Room clean and comfortable. Breakfast is enough to get you going for the day. Will return and recommend the hotel for budgeted travellers which want value for money", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r410141677", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Very decent 3star, convenient location ", "review": "Very decent 3star,  great price to quality ratio. Convenient location - close to the train station and walking distance to the hip on hop off bus terminal stop and most sightseen places. Full-sized room and bathroom, Good breakfast. Highly recommend, would stay again.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r408519134", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Great stop-over in Florence", "review": "We spent ohne Night in Florence and had a Double room in the Galileo Hotel. Staff was extremely friendly, room was super clean and comfortable, parking was easy around the corners as it was weekend - overall great stay in this small but sweet Hotel.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r406328990", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Probably the best choice to stop in Florence on budget", "review": "We found this hotel with a help of TripAdvisor. It was late, we were tired, our BIG mistake was to go to Florence by the car. Never do this :) Tried several hotels in a range of 2 miles city center. This one was the best: friendly staff, clean, comfortable rooms, really good prices. If i will come to Florence once more - i will stay at this hotel for sure.", "date": "January 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r396832697", "sub_review": {"Value": 5, "Location": 5, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "An abundance of moths", "review": "Truly. Every time we opened the one armoire in the room, one or two moths flew out. At least my kids sort of enjoyed chasing them down. I just hoped we wouldn't bring any home with us.   Although a good location, close to the train station and the fantastic Mercato Centrale, it was almost impossible to find. In part that's because of the street numbering which starts and stops multiple times between the train station and the hotel. Just note that it's likely a good bit further down the street than you thought it would be. In fact, when I stopped in a tattoo parlor to ask where it was (after trying a restaurant and other hotels), I found someone else in there asking the exact same thing! Perhaps a marketing campaign to let the neighbors know where it is would help.   As other…", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r396283068", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Convenient area for shopping", "review": "I have to be honest it was bit of drive from the station when i arrived and at night i was bit worried thinking about area but i had to say i was wrong. The hotel staff was great and helpful. The station was actually walking distance when i return back and all shopping areas and attractions were close by.  It s mid range hotel for budget trips but definite  place to check out!", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r393400960", "sub_review": {"Sleep Quality": 3, "Rooms": 3, "Service": 3}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "A good three star hotel", "review": "Our travel agent recommended this for us.  Our room was small, so small one cannot sit at the desk while another walks between the person at the desk and the bed.  The bathroom has no counter space.  Wifi is free, but it can come and go.  The beds are comfortable.  The fridge is small and keeps things cool, not cold.  There is almost no closet space.  Hot water is plentiful, though the pressure fluctuates.  No wash cloths were provided.  The towels are large and absorbent.  The gentleman staffing the desk was cheerful and full of good advice on things to do.  He recommended a tour that we thoroughly enjoyed.  He also made the reservation and arranged for us to be picked up at the door to the hotel.  The location is about a ten minute walk from the rail station.  The market is a…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r393248614", "sub_review": {"Location": 4, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Very friendly staff! ", "review": "Very friendly staff who are always willing to help with any information we needed. They were always willing to supply us with what we needed! Even some tea at night! This hotel is walking distance from the train station and from the central markets and museums. A great little hotel! ", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r391747588", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Rustic beauty in the heart of the City", "review": "I chose this hotel because of its location near the train station. The hotel had cute rustic charm. Being in the heart of the city it wasn't really very peaceful but didn't made a big difference. After sightseeing for the entire day I anyway slept like a log. Room was clean.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r387391503", "sub_review": {"Value": 3, "Sleep Quality": 3, "Service": 3}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Good location and large room", "review": "2 nights at The Galileo Hotel. Our room was quite large and airy and the decor was cute. Upon checking in we were given discount vouchers to 2 restaurants in the area. We went to both over our 2 nights there and found them both to be great recommendations. The shower was a little difficult as it was hand-held and there was no shower curtain but it was in a good sized bath so that was always an option. If we had more time to spend running a bath I'm sure it would have been lovely. The location is good as it is a 10 minute walk to the train station and a short 15 minute walk to the street stalls where you can buy all the dubious leather products you could want. Our departing train was later in the day so leaving our luggage with them after checking out was a handy option and freed…", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r386120142", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great location ", "review": "This hotel is in a great spot. It's close to markets 3 minutes away, the academia gallery and duomo are also close by and if don't mind about a little extra walking only 10/15 minutes away from the main shopping streets.  Also close is a supermarket, laundromat, lots of restaurants and buses and trains.   Although it is quite and older hotel so the bed was not the best and the bathroom really squishy, it was clean.   It also had air conditioning, not the best however we found closing the shutters throughout the day helped to keep the room cool. ", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r385374021", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Clean basic hotel in good location", "review": "Well located near train station and car parking. This hotel had smallish rooms, bed was Ok, bathroom in need of a refit, silicon repairs all over. Double glazed windows overlooking street OK to reduce noise while the air con was working. Florence doesn,t appear to sleep. Breakfast basic continental with adequate choice , not much room to move when busy.Easy walk to all attractions around Florence and very close to nice restaurants and markets.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r384473420", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Rustic and charming hotel", "review": "Stayed at this hotel in June , small but adequate bedroom with a lot of rustic charm . The room was cleaned each day for the week we stayed , clean towels , bedding each day . Nice sized bathroom . The breakfast was basically a continental breakfast , which we found more than adequate , plenty of coffee ,tea, juice , it was a good start to the day . It suited us perfectly , has eating out in Florence is one of the pleasures of this beautiful city . We found that the staff were very helpful , and really gave us good idea's about where to go in and around Florence ,. A great hotel clean and tidy , and the location was perfect for the bus and train station , just 10 minutes walk , basically walking distance to everything you need to see .", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r380857108", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Not For Us", "review": "Very disappointed. We would not have rated this hotel 3 stars. The bed was hard, the pillows were hard, the water to the room was very smelly and a communal toilet abutting our room may as well have been inside our room. The noise from the street outside was all encompassing (air conditioning was off and needed the window open for air) and the staff were aloof.  We will go elsewhere next time.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r375265108", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Ok hotel, unpleasant staff", "review": "The hotel was maybe a 2-star hotel. Room was small and the sink leaked in the bathroom. No screen in window, so when the cleaning staff left the window open, I came back to flies buzzing around the room. When asked for assistance at the front desk or in their breakfast lobby, the staff were not helpful and very unpleasant.", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r370268346", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 2}, {"title": "Bella Bella", "review": "The Hotel is a fairly easy walk from the train station, even with my large luggage in tow.  Very clean and the front desk staff spoke enough English to make the stay much more enjoyable.  They were able to recommend great places to dine and gave great directions.  Close to the open market for your shopping needs.  A definite stay the next time I go to Florence!!", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r366473579", "sub_review": {"Sleep Quality": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Girls weekend away", "review": "Firstly, the reason we decided to book this hotel was for it's excellent reviews on the location, which was great. However, there are a huge amount of hotels within this area which will be of similar price. The hotel is small, typical Italian decor. Breakfast was fine, nothing amazing. Only had a small selection of cereals, croissants and toast. Staff were nice, were always willing to help when possible. The bed sheets were changed daily, however the cleanliness of our hotel room was appalling, we soon realised this after walking around without shoes on. I have attached a picture of my friends feet to show you just how bad this was. The floor was marble, and had clearly not been mopped in a very long time. Also, on checkout, we had to pay a fee of 6.50 euros per person for city…", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r366126666", "sub_review": {"Value": 3, "Location": 5, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Very nice hotel", "review": "I really liked this hotel. The location is perfect with busy restaurants, markets and other places of interest nearby. The train station is also only a short walk away. The room I had was nice and clean, spacious and had a very comfortable bed. The hotel has wifi but unfortunately I couldn't get it to work in my room. A very basic cold breakfast is provided but it is good enough to kick start your day. The staff are friendly and helpful and I have enjoyed my short stay. Oh and Florence is an amazing city. ", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r363401770", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "A perfect hotel!", "review": "I stayed at this hotel for 3 nights as a city break with my Mum. It's a quaint hotel with friendly staff. It is perfectly located - a 5 minute walk from the main train station and a 5 minute walk from the very heart of the city!  The room was very cheap and the staff are all incredibly nice and helpful. They were able to tell us which sites were open on which days, where to get the best deals and how to get to places. The breakfast has cereal, bread and cheese, tea and coffee, cakes, yogurts, fruit - anything you'd want.  The room is quaint and well kept - we stayed overlooking the Via Nazionale and as soon as you close the window there's no sound!  I could not recommend this hotel more. We will definitely be returning!", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r361556003", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Early season trip with friends", "review": "To set off the travel season, we, (a group of 8 friends), traveled to Florence/Firenze. This was a 5/6 day trip. We stopped in the Galileo Hotel which is in the center of Florence, handy for restaurants, attractions and shops.", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r358084066", "sub_review": {"Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Good location", "review": "The hotel is in a good location, within walking distance of many of the attractions in Firenze and close to the main station and bus station. The rooms were comfortable and clean, staff friendly and helpful. Breakfast was adequate but no hot food.", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r356399488", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Good location, nice hotel", "review": "Located not far from the centre, this hotel offers a lot for its cheap prices: included breakfast (which is quite small but everyone should find something that satisfies their appetite), large bathrooms, 24/24h reception, etc... Additionally, the rooms were clean and spatial. I would recommend this hotel for people who don't want to pay much for their stay but still care about clean rooms, who don't care about not having a modern interior design and who don't want to walk a lot to reach the centre of Florence.", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r352089296", "sub_review": {"Value": 4, "Location": 4, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Handy Hotel with good facilities and service", "review": "We stayed here with a small group of students who had just finished their final exams. The rooms, facilities and included breakfasts were of 4 star standard. The location is excellent - close to all major attractions and train station. Staff were friendly and very helpful.", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r333071879", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Disappointed", "review": "The Galileo Hotel Via Nazionale 22A 50123 Firenze  Disappointment   Located close to Stazione Centrale, S M Novella (Florence Central Railway Station),  with walking time of about 10 mins. Close to it is the central attraction of Florence, S Maria Del Fiore (Duomo). Except for the location , nothing much can be written about the hotel. The interiors appeared to be in very depressingly vintage condition with dirty and discoloured walls in dire need of a fresh coat of paint.  With dimly lit corridors and rooms, crammed up washrooms, (just imagine the predicament of Fred Flintstone or Obelix), mirrors with smudged glasses( more like antiques from Galilean era), the hotel offered a rather somber and austere breakfast fare. Two single mattresses on a double bed were quite…", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r326422812", "sub_review": {"Sleep Quality": 2, "Rooms": 2, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Worth a look!", "review": "We stayed at Hotel Galileo over the past four days and loved it.  The hotel is ideally located within a five minute walk from the train station and the city centre so no need for long walks to get to any of the amazing restaurants or sights that Florence has to offer.  The hotel is very quaint and typically Italian. There are no airs or graces to the place but it offers you everything you would need. The room we stayed in was small but with a huge window looking out onto the road outside you didn't feel closed in at all and actually made you feel that the room was very airy and bright. The breakfast on offer was very European but adequate to set you up for the day but leaves you with just enough room to be able to indulge in a gelato or some street food.  Definitely worth a look…", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r320580968", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good Location In Florence", "review": "The rooms were clean an comfortable but  small. The hotel is a short walk from the train station and all sights. Hotel staff was very friendly and helpful, good breakfast in the morning. Good value for the money and would stay again when in Florence.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r319676364", "sub_review": {"Value": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Clean, comfortable & close to station", "review": "This was my 1st solo visit to Florence and I needed a place to overnight. When my taxi stopped outside the hotel I initially had some reservations about the area but once I entered I was pleasantly surprised. The check in was prompt and the man on duty spoke English and offered me a city map and explained the surroundings. The furnishings in the room looked old but everything worked and it was quite spacious (especially the bathroom). My view was the back of the hotel and there was a terrace if I wished to climb out the window. The hotel and my room was spotless. The breakfast was a cold buffet (typical European with breads, cheeses, cold meats & cakes and some fresh fruit). I had some time that afternoon and the next morning to explore the town and found that everything was…", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r319553445", "sub_review": {"Sleep Quality": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Cute hotel,  nice area", "review": "The hotel has an old world charm to it and is pretty cute. The rooms were a decent size, but the bed wasn't the most comfortable. It wasn't bad and I slept fine, but I've been comfier. The breakfast was okay, there weren't a ton of options. I don't eat a lot for breakfast, but if you have a big morning appetite, you might have trouble filling up. The hotel is in a good area, about a 10 minute walk to the train station and lots of little restaurants lining the street. Overall, it's a good place for the money, and I would likely stay here again.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r317563819", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Helpful Staff in Florence", "review": "Central location, clean and reasonably comfortable. Breakfast just average but reception staff absolutely outstanding! So handy for the Central Market and Palazzo Medici Ricardi. Also within walking distance to the train station and Teatro Del Sale. Any query was met with friendliness and efficiency. We had all our tours booked within minutes.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r316514606", "sub_review": {"Value": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Perfectly Located in central Florance.", "review": "This was my first ever European trip and did not have anything to compare as far as European hotels. The location was wonderful, it is close to everything in Florance. We stayed in a double room and quarters were very cozy. 2 single beds pushed together and no room to separate them. Thankfully my roommate and I got along well and didn't mind sharing a sleep space. Bathroom also very tiny with a pedestal sink toilet and shower stall.room had a small tv however only 2 non English stations came in. Hotel has wifi but you need to be in lobby for strong enough signal to really use it. The breakfast in the morning was good. Assorted cheeses and meats. Coffee and pastry.  The hotel is clean and comfortable and staff is very nice. I would go back if ever in Florence again.", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r314150461", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Lovely stay", "review": "Excellent location in central Florence. The staff are all very friendly and give great service. When we arrived they even went over a map of Florence with us, telling us of the best places to visit, best places to eat and drink etc.  The hotel is very quaint, with lots of traditional Italian furnishings and all the communal areas are very well equipped and clean. The bedrooms themselves are exceptionally clean and more than large enough. There is plenty of wardrobe space and the shower is great, with plenty of hot water. There are lots of options from the mini bar, and its all reasonably priced.  We couldn't get a picture on our TV, just the accompanying sound, but how long does anyone watch TV for in Florence?! Our bed was comfortable, but it was actually 2 single beds pushed…", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r310136124", "sub_review": {"Sleep Quality": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Wonderful stay", "review": "Well located hotel. Near the central market. Very nice reception staff. The only minor problem was that the airconditioning was programmed & not adjustable in the room. The breakfast was nice and we were able to reserve cooking classes, taxis & restaurants at the desk.", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r307433211", "sub_review": {"Value": 5, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Perfectly acceptable", "review": "Large room and bathroom that where functional if basic. For its rating and price I think it was good. I could find fault if I had wished but the bed was comfy and the breakfast pretty good and the rest of the time in Florence was spent exploring. I would use this hotel again. It is handy got the city and the train station. ", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r304174793", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very nice room, centrally located hotel with excellent serivice from the Front Desk", "review": "Arrived at this hotel on a 3 city package tour of Italy with my 16 year old daughter. (I don't usually do package tours but Thomas Cook in Farnborough, Hampshire surpassed themselves on the itinerary!!). I had booked a Walking Tour through Florence online and had to confirm that I was still doing it on the day booked so I asked the Front Desk to confirm for me. Stefano and Francesca worked through their morning/afternoon shifts whilst manning the front desk, to arrange another tour after it turned out that my online booking had not been booked! A very nice breakfast with good, strong coffee. This hotel is 10 minutes walk to/from the main train station, ideally located to Florence city centre (10 minutes walk), certainly a hotel I would revisit if I am in Florence again.  Our…", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r296111215", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Short stay", "review": "The hotel was quite atmospheric and reasonably comfortable.  The room was a decent size, the furniture was a little worn, but clean and fresh painted walls. It was very hot whilst we stayed but the air-con did keep the room comfortable whilst being slightly noisy. I would have liked a slightly higher level floor room guessing it might have a better view than just the street. The bath room had bath tub, big plus for me ! The WiFi could be a bit on / off but on the whole was ok. Typical continental breakfast which was adequate.  Location was great, easy walking distant from the train station, into the city easy in just a few minutes walk.  The staff were extremely helpful in sorting out our return transport.  We would consider returning, if in Florence as it was adequate for out…", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r294025730", "sub_review": {"Value": 4, "Location": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Needs maintenance but good location", "review": "We stayed as family of 4 in quad room 108, 1st floor back of hotel. The room was spacious enough for our short stay however a few minor items detracted from our stay.  The aircon only just coped with the hot days and the room had no direct sun on it so the street side rooms must have been hot. The wifi is useless anywhere in the hotel. There was a bath, no proper shower refer photo, there is a hand held shower head attached to the tap but nowhere to hang it up high. Breakfast is basic continental and is a crowded affair.  On the plus side staff were helpful, room was clean and the property well located.  Would we stay here again, NO  ", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r289749618", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Old rooms, poor wifi, bad air conditioning", "review": "Stayed in this hotel during July. The location was perfect, an 8 minute walk from Santa Maria Novella station.  The rooms are old, we asked for 1 king bed but got 2 singles aligned side by side. The air conditioning in the room was very bad. Had to call the reception many times but without luck. The wifi was so poor, it couldn't load a basic homepage.  The toilet flush of our neighbors could be heard in our bedroom. Not to mention the construction works early morning.  Extremely disappointed. Would not recommend & definitely not come back again.  Been to better places with similar rates & ratings but the experience was way better.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r287399223", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Great location, great staff, great place to stay", "review": "Stayed in this hotel several times and never disapoints.  Great location to central market, nice breakfast and very accomodating staff.  Rooms are clean and great for travelers.  The elevator is small like most European hotels, so plan ahead or take the steps (hard with luggage!).  Would go back again and again.", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r286704123", "sub_review": {"Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "All in all a good experience ", "review": "Not initially impressed but by the time our stay was over, came to appreciate its finer points. Great location, staff, and cleanliness. I've had better breakfasts but was good enough. Great recommendations were given for restaurants and train station was short walk away. A reasonable and comfortable experience.", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r280533253", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Good location,clean and comfortable", "review": "We stayed here as a family of 4 and found the room comfortable and clean. The location was good , within walking distance of shopping, cafes, supermarkets and nearby laundromat.  Staff very friendly and helpful.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r277409162", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Good location but very slow internet", "review": "Location is close to major sight seeing places and short walking distance from main train station.  Breakfast is good and room is clean.  Only negative point was that internet was very slow and on the second night during our stay, there were no internet at all.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r275684156", "sub_review": {"Rooms": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "One day atay", "review": "Very poor quality of sleep, bad mattres condition, noisy room coming from the constant traffic. This hotel should be avoided if possible, location and proximity to the main city center is the only asse. ", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r274572598", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 2}, {"title": "Close to everything", "review": "Like most hotels in florence it was handy to everything including the station, restaurants, markets etc. Basic accommodation but had everything you would require for the cost. Reception staff were very helpful. Basically if you want more plush surroundings then you have to be prepared to pay more.", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r273538827", "sub_review": {"Sleep Quality": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Avoid this seedy place.", "review": "It's in a rundown section of the city. The rooms (our room, anyway) are small and cramped. We had a problem with the toilet that was not fixed. I asked, reasonably so, for fresh bath towels on our second day and was snootily told \"5 star hotels change the towels every day, we do it every second day.\" You can't turn on the AC without going through the front desk. Breakfast is a dry, uninspired affair. The only good aspect is a relatively strong wifi.  We're looking for another hotel to switch to before we leave. Save yourselves trouble and avoid the Galileo. ", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r272672123", "sub_review": {}, "travel_purpose": "", "rating": 1}, {"title": "Centrally Located", "review": "Walking distance from the train station, centrally located. Rooms are clean but small and cramped. Everything in the room creaked ; the tables, cupboard doors, the bed. They offered complimentary breakfast, but the spread didn't have many options.  Staff is courteous , friendly and very helpful.   All you need in Florence is a good nights sleep and a centrally located hotel, you'll spend the rest of your time exploring this beautiful city so would recommend this place.", "date": "February 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r271726623", "sub_review": {"Value": 3, "Rooms": 2, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great location & size -Family of 4", "review": "This hotel had helpful and friendly staff.  The room was a great size for a quad room. ( the best we had in Italy).  Everything was with easy walking distance.  Would recommend this hotel for families travelling with children.", "date": "December 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r263561404", "sub_review": {"Value": 4, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Location is the only advantage plus an english speaking reception", "review": "Location was good for this hotel but room was very small and bathroom even smaller. Rooms linen also is not being changed daily but I guess that is ok. Everything from Piazaalo e signora to the famous river was near. Just walking from Railway station (less then one km.    Breakfast was very basic and again europeon style but not too much stacked. Choose this hotel for location and off course spending night after seeing beautiful florence through out the day.", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r262825645", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Good", "review": "The hotel was clean, and the staff was helpful. Breakfast is included in the price, and it was good with pastries, cold meats, and fruit. It is within a walkable distance of the train station and all major sites within Florence. It is right on a main street with thin walls; if you are a light sleeper, you may want to bring ear plugs.", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r261397930", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good for limited stay", "review": "Our agent chose this one because it was both close to the train station and the city sights; in addition we were only staying one night.  The staff was friendly but not helpful when we did not have hot water the night of our stay....reason given: too many guests checking in.  The problem was resolved in the morning...thankfully.  The room was draconian and no temperature control so it was a bit warm during the night.  The breakfast had limited selection but fit the bill.  Our room was ready when we arrived mid-morning so we could store our bag, etc., in the room.  The saving grace was the close proximity to the main sights.  I don't think I would stay here if for more than a night or two.", "date": "December 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r247831977", "sub_review": {"Value": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Brilliant!", "review": "We convenient location! About 10-15 min walk to the train station and everything is relatively close. The 'Italy on a budget' tours company is directly opposite for those wanting an awesome day out! (18-35 ages). The hotel has a buffet breakfast with yummy cakes, toast, cereal, coffee, juice etc (no hot food but still filling). There is an elevator and they also kept my suitcase behind the desk for the day while i was on tour after checking out. Also the hotel is beautifully decorated in Tuscany style with cute rooms and a large window which looked over the street. There was a tv and he bathroom was clean, the rooms were small but not too tiny, overall a very enjoyable stay.", "date": "December 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r244290584", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Hotel made our trip lovely", "review": "The hotel itself wasn't outstanding but we didn't expect it to be for the good price we got it for. What did make it amazing was the extremely helpful and friendly member of staff there called 'Adriano'. He made us feel welcome as soon as we arrived, spoke great English and showed us exactly where to go around Florence. The breakfast was also delicious! Would definitely stay again. Feel free to read more about our trip here and what we did in Florence on my blog - http://www.missyred.co.uk/2014/11/florence-things-to-do-and-my-trip.html", "date": "November 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r241680947", "sub_review": {"Sleep Quality": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Pet friendly! ", "review": "We are have a great stay so far.  Convenient location! Easy access to central market and downtown. The breakfast isn't that great but we don't leave hungry. The staff is friendly and eager to help. The wifi isn't the greatest also but I'm sure they would work with you if you had any issues with it.", "date": "November 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r240457550", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Fantastic", "review": "After coming from an ok stay in Rome, this place was a breath of fresh air. Friendly staff, quite rooms, location close to everything we wanted. Breakfast was modest but nice. Chocolate brownie cake was best item and the cafe latte was great (just ask the girl downstairs who will make fresh coffee for you). The only problem we had was finding the hotel from the station when we arrived, as the street is not clearly marked and is quite narrow.", "date": "November 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r237918522", "sub_review": {"Value": 5, "Location": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Torn between good and okay", "review": "Was set up by our travel agency but we were excited because it was a Rick Steves recommendation. He needs to re-review this hotel.   First off the 3 front desk men were very accommodating. Room was nice and the breakfast was good.  Had read a comment saying no protein but I seriously thought ham to be a protein. Really enjoyed the coffee also.   Now the downsides.  It is an Eco-friendly hotel which is good, but one of their Eco-friendly things is to turn off the air off at midnight and turn on at 6am.   Maybe.... Ours never came back on that morning. When we got back from a long day out sightseeing we had to ask them to turn it on because it wouldn't on its own. Also you have NO control of the aircon - they control it by the computer downstairs.  Had to ask twice for them to…", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r229809543", "sub_review": {"Value": 1, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Brilliant service, excellent location.", "review": "Very traditional hotel only five minutes away from the market and station.  Service was brilliant and very attentive with perfect english.  Breakfast was what you would expect for a small traditional hotel.  Only downside was the air conditioning - went off during the night and needed staff to adjust for you.  Other than that a perfect hotel for a short stay in a beautiful city.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r221799723", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Pleasant stay in Florence", "review": "Our experience with Hotel Galileo this past July 2014 was very pleasant. Stayed three days and did not encounter any of the problems identified in \"recently\" posted reviews! Rooms were clean, aircon worked well, housekeeping was done every day. Front desk staff friendly and helpful. Hotel is on a busy street, but if you're in Florence for quietness you should find a b&b out in the countryside. We enjoyed our stay!", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r221589380", "sub_review": {"Value": 4, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "The little things ", "review": "We stayed here for 2 nights recently and on first appearance the hotel was clean, tidy and a good location. It's close to the train station and only a 5 minute walk to a few attractions. The room was a decent size and the hotel had brochures of things to do.  But it was the little things that bought it down. 1. The aircon, was very the noisy the first night and when we asked to have it turned down the second night it was simply turned off. Which meant it got very stuffy and to open the windows meant there was a lot of noise from the street. I couldn't sleep because it was so stuffy and when it was on my partner had to sleep with a pillow over his ears.. Something really needs to be addressed with how much noise it puts out. 2. I know it's normal to have breads etc for breakfast…", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r216039189", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "short break in florence", "review": "Hotel was situated on a busy road which was quite noisy on a night.Aircon didn't work most of the time and certainly never during the night cause they turned it off.Free wi fi didnt manage to reach our room 120 .although you could get it in the breakfast room and maybe in rooms nearer to there ? Staff on front desk were not unfriendly but not very welcoming either .Breakfast room was far too small and the quantity of food was poor ,they kept running out of things like ham and you had to make do ,it always appeared to be overcrowded with little room to move .It wasn't too far to walk to from the station which is the reason we booked it about 15 minutes,and the Dumo and Uffizi were within easy walking distance ,on a night when it got dark you had to walk through some streets which…", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r212297226", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 2, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "I don't recommend this hotel.", "review": "Good-ish location. Just don't go up to the park 1/2 a block away. You'll come across seedy people taking pharmaceuticals and drinking.   Reception:  - The old Italian guy makes you feel like you should leave as soon as you enter. The Asian immigrant workers were much more hospitable though.   Internet:  - It's free witch is great. Can you use it to load anything? Nope. Can't even stream a basic audio file on YouTube. (I was staying in 103, it's about 3 M away from front desk wall to wall).  Housekeeping:  - Went a full day with no toilet paper, the 2 glasses I had were left in the room, even though they decided they would make the beds. Once the glasses were finally washed, it looked as if they had rinsed them with cold water and wiped them with my towel. Reception claimed that…", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r211250754", "sub_review": {"Value": 2, "Location": 3, "Sleep Quality": 2, "Rooms": 3, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled solo", "rating": 2}, {"title": "Great hotel, good value and central", "review": "Room was very clean and good space. Cool and quiet in spite of busy and hot holiday season. Facilities very good and wifi best I have come across in hotels. Breakfast fresh and adequate. Staff very helpful and friendly. Best thing is how close to centre this hotel is. Close enough to return for a shoe change or rest before the next foray into the very hot weather. Florence felt very safe and is much more relaxed than Rome. Traffic was not a problem but mind the cyclists!", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r209785978", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "BASIC IN EVERY WAY", "review": "Location central enough but seedy district. Very basic facilities in room although good size. Very basic breakfast with narrow range of food and not enough of it. Very slippery bath. More lodging house than serviced hotel.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r205571677", "sub_review": {"Value": 2, "Location": 3, "Sleep Quality": 3, "Rooms": 2, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Fantastic Hotel", "review": "I booked a family member to stay here for 7 nights recently, and he couldn't say enough nice things about this hotel.  Wifi had great coverage, staff very friendly and breakfast was great.   Great area and located close to the station and within walking distance to main attractions.  3 star hotel and worth the price paid!", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r204208788", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Average Hotel in a Great Location", "review": "We stayed for for 5 days with 2 adult children. Location is great.  Within walking distance to the main train station.  Close the shops and.a laundrette.  The room  for 4 was basic and spacious. Good wifi in the rooms The bathroom was spacious but didn't have a shower only a bath which was a little inconvenient. Breakfast was average and coffee was terrible.", "date": "December 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r204098202", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Miniature but Good", "review": "Staying in this hotel reminded me of the scene from Harry Potter when the bus had to compact itself in order to fit through the streets of London. Everything is miniature in this hotel: the rooms, the beds, the televisions, the bathrooms, the showers, the breakfast room, the elevator. Nevertheless, if you don't mind wedging yourself and your luggage into the room this is a fine place to stay. This hotel is a hop-skip-and-a-jump all the major sites of Florence, particularly the leather market, the Duomo, the Piazza della Signoria, and the train station. It offers a typical Italian continental breakfast (pastry, cereal, sliced meat, coffee, cake) and friendly staff that is ready to help you with whatever you may need. I would definitely consider staying here again.", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r202823325", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "NO INTERNET", "review": "I was staying here on a school trip and was relying on the promise of free wifi so that I could contact my parents who were overseas, however, the hotel did not deliver on its promise which caused great problems for me. The room was extremely noisy, hot, and the sink made noise for 20 minutes after you used it. Also, the hotel was better off saving money and not even providing pillows, because the ones they gave were basically a sheet of paper. And, the stairs in this hotel are quite dangerous. Multiple people in my group fell down them, one even badly twisted their ankle, so they could not walk around and enjoy the city. Another problem, is the amount and placement of the outlets. In my room, one outlet was smashed into the wall, leaving us with one functioning outlet, and many…", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r201274781", "sub_review": {"Value": 1, "Location": 5, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 2, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Great Location and Helpful Staff", "review": "My husband and I stayed for four nights in January 2014 on arrival the room our agent had booked was far too tiny for two. We went and asked if a larger one was available. We were informed one would become availabe next day and if we leave our bags packed they would move us while we were out sightseeing. Next day when we arrived back to hotel we had been moved to a more spacious room.We found the staff very helpful and nothing seemed to be a problem. Comments on breakfast seems a bit harsh seeing it is complimentary it is quite adequate. Our room was always made up for us each day and bathroom was always cleaned. We would have no hesitation in staying at this hotel if we visit Florence again.", "date": "January 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r191128332", "sub_review": {"Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Fantastic service, great location ", "review": "We stayed here after having a bad experience at a hotel around the corner. The man at reception was very helpful when we arrived showing us around the city on a map and then when we left we had problems with Our train tickets and he called the company and resolved the issue for us. We couldn't ask for a more central location the only reason I couldn't give a 5/5 here was that the wifi had no signal in our room and the shower was a bit annoying because it didn't spray right. If you are just looking for a good 3 star hotel where you have your own comfortable space, stay here. ", "date": "January 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r190867742", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "\"Great Location, Good service\"", "review": "The hotel has an amazing location. In midst of the city, with lively streets and great restaurants, and all the important places to visit, a stone throws away, it makes the perfect place to stay. The rooms very proper cozy and warm. They were clean and properly set up.  Unlike the previous reviews, we did not have a problem with matters covers or the bedding. It was all, the way they should be. The bathroom was big, though I had a tough time figuring out the way to switch between tap and shower. But that's probably because it was new to me and nothing to do with the hotel. We stayed there during November. We were greeted by warm staff and help was always at hand. Though I can't talk about the breakfast, as we always had them at the many bistros nearby. I would recommend this…", "date": "November 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r190630299", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Worst coffee in all of Italy", "review": "How can a country that makes the best coffee in the world serve up this brown gunky dishwater for breakfast? It's that American style stuff that sits on a hotplate in one of those glass jugs and stews away tasting more gross by the minute. And speaking of breakfast - don't bother. We turned up at the specified start of breakfast to find the very cranky staff still setting up. Half an hour later they were still at it and considering breakfast was stale rolls and croissants - not to mention that vile coffee - they hardly had their work cut out for them. The room was large, the bathroom enormous but the shower managed to spray water everywhere despite my attempts to adjust it. The hotel is on a very busy street but thankfully the windows shut out the noise really well so you're not…", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r183413398", "sub_review": {"Value": 2, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Don't stay here", "review": "The walls in this hotel are paper thin.  I specifically asked for a quiet room and was given one away from the street.  However, when one uses the key card to enter a room, it makes a very loud buzzing sound.  I was awakened each time a neighbor opened their hotel room (which was all hours of the night).  The double rooms are tiny and not really appropriate for more than one person if they want to stand up at the same time (similar to a small cruise ship cabin).  If one moves the furniture to move around the bed, it makes a loud screeching sound on the tile floor, which can also be heard in neighboring rooms.  The mattresses have plastic fasteners that poke out.  In the bathroom the sink is also directly in front of the toilet, so you have to sit sideways (and I'm only 5 feet…", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r182001797", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 1, "Rooms": 2, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled on business", "rating": 2}, {"title": "Good location, poor service", "review": "We stayed in July was a great location about a 5 minute walk from the dome. The workers on reception were quite miserable and not very helpful. The room looked nothing like the pictures in the website, very small and dark and quire drab. Breakfast was basic but ok.  You probably could get a cheaper budget  hotel that's cleaner and better looking if you shopped around! ", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r177228267", "sub_review": {"Value": 2, "Location": 5, "Rooms": 2, "Cleanliness": 3, "Service": 2}, "travel_purpose": "", "rating": 2}, {"title": "Central and Quiet", "review": "We were checked in nice and quickly and found that our room was very spacious. It even had a small 2 seater couch in the corner! The rooms were quiet and we didn't have any issues with the air conditioner. The shower though was barely a shower, it was more of a tap dribbling. It definitely wasn't the best shower I've ever had. Luckily, staying in Summer and being hot you can put up with minimal water. But if I was staying in winter, it would be a very cold shower.  The hotel is very close to the train station and a 10 minute walk into the centre of Florence.  The check in staff were polite and very helpful. Breakfast was minimal and they some how ran out of forks very quickly.  Nice quiet hotel to use as a base for exploring the city.", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r176424658", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Anywhere but Here", "review": "The owner turned off the AC at midnight and we had to beg for it to be turned on before the regular time of 6 AM.  We also had to request that our linen be changed, they did not have mattresses covers for the bed.  Our first room was so bad( the toilet came within an inch of the wall so that we had to climb over it to get to the shower. They did give us another room since we were staying for an extended period.  The staff was great.  We booked through Avanti and never had a problem until this time.  The hotel was run on the cheap and it was not a cheap place to stay. We were not familiar with Florence and the staff was accommodating so we thought it better to stay where we were.  There was also a lot of noise.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r176236556", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "great location, wonderful staff", "review": "I stayed here in early September for 4 nights and would definitely stay here again. The staff were all extremely friendly, spoke good English and very helpful when Air France misplaced then destroyed my luggage. Breakfast was perfectly fine, if you want a hot breakfast go to an american chain and pay a fortune. Rooms weren't huge but again, by European standards not tiny, and my bathroom was fine. The hotel is very close to the train station and the central market, and no more than 15 minutes walk to all major attractions. If you don't like walking, don't come to Florence!", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r175830253", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Wonderful happy smiling reception", "review": "Stayed a week, but wish it was more, a family run business with really happy helpful staff. After staying in 8 hotels on a tour, it was a refreshing change to meet such polite people. Excellent location only 5 mins from station, 2 mins from the biggest market & all attractions. Small hotel but great personal service. We would definitely be happy to stay there again, as the price was also away affordable.", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r175417039", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Amazing Service!", "review": "We were warmly greeted by the wonderful staff! They helped us find great places to eat and where to find the best bags and shoes! Close to the train station and central for all the great attractions. Great wifi, friendly staff and wonderful service! I highly recommend staying at rhe Galileo Hotel ;)", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r174970536", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Beautiful City and Large Room", "review": "I selected the hotel based upon a recommendation in Rick Steves' guidebook.  It is only a 5 minute walk from the train station (although the sidewalk is narrow) so the location is great.  The room was large based upon any standard.  The hotel staff was friendly and helpful.  The breakfast was spartan.  The price was very reasonable so overall, I would strongly encourage you to consider this hotel when you visit Florence.", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r174536256", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Nice hotel with great location and service", "review": "It was my second visit to Firenze and I chose Galileo hotel again because of great location and service. The location is so perfect(close to train station and to the city center) that I could go every place by walking! The size of room and bed was enough for me. Also the room was quiet at night so I could take a good rest.The air conditioning worked well. It provided clean bathroom and new towels during my stay.  The staff was super nice. They explained famous places in Firenze wih a map and recommended some great restaurants near hotel. I could use free Wifi in my room but it worked better in the lobby. The lobby had a calm atmosphere. Also I liked the furniture and pictures hung on the walls. In the morning they offer good continental breakfast too. Overall, I could relax and…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r172909626", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Good Hotel in Florence", "review": "My wife and i just stayed in Galileo Hotel. Staff very helpful and kind. Breakfast was ok, like the rooms. Location of the Hotel is really strategic, you can visit everything by walk. Generally we enjoyed our stay.  Andrea", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r171527422", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Old room with loud air con.", "review": "This hotel is on the street close to the main train station. Single room is not too small but the air condition is make so much noise.  The room look pretty old.  You can hear the toilet from the room next to your room. Slow Internet .  The best part of this hotel is good location.  The bad past are very old room and the aircondotion is working well.", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r169068081", "sub_review": {"Value": 2, "Location": 4, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 2, "Service": 3}, "travel_purpose": "Traveled solo", "rating": 2}, {"title": "Average", "review": "Dear customer, We apologies you did not enjoy your stay here, the air condition noise is because the hotel is not new, but we are renewing and fixing the entire air condition system, same thing for wifi which slowness is because the room was a bit far from the lobby where the signal is the strongest, we will fix this issue too. regards the oldness of the room, we keep it on purpose because it is the tuscany style. Thank you anyway for your review.  The director.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r166425362", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Great Hotel in Great Location", "review": "Inconsistent presentatiob. Aircon on one night off the next. Clean rooms, good service, but communication an issue at the desk. Bookings made ok, initial welcome ok perfunctory. Noisy teen group moved in, yelled, giggled, played door buzzer tag. Noisy toilet and shower next door. Could do better with consistency, some enthusiasm and quality control", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r165255870", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Average hotel in a central location", "review": "As a single woman, I was very happy with my stay at Galileo Hotel.  It was comfortable, had a wonderful continental breakfast, and was well located for seeing all the well-known places in Florence, including the main train station. The room was small, but comfortable, and the air conditioning cooled things down.  The staff at the front desk were kind and quite helpful in showing how to get to various places and ensuring a good stay.  Also, they recommended what ended up being my favorite restaurant, La Divina Osteria.  While the hotel has WiFi, I had to bring my laptop closer to the computer/front desk area on the first floor.  However this was not a big problem.  The price was very reasonable, and all that was necessary was provided.  I would definitely stay there again.  Judy…", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r165110286", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 4, "Rooms": 2, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great hotel in a central location", "review": "We enjoyed our stay at Galileo. We asked for a room away from the street and it was very quiet.  Breakfast was fine (continental) and the staff were helpful. Our room was spacious. Wifi only available near reception. There are very cheap restaurants nearby. Watch for mozzies if you leave the window open.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r161157446", "sub_review": {"Value": 4, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Clean, convenient, charming", "review": "Galileo Hotel is just a 5 minute walk from the train station.  Very convenient, and over flat streets.  The staff is outstanding, helpful and knowledgable.  Nice breakfast with the package.  Rooms and beds were small (in our room at least), but totally adequate.    The hotel is within 10 minutes walk of almost all the Florence activities.    Lots of restaturants (LOTS of good restaurants aroound the hotel),  This hotel was recommended by a travel agent friend, and worth it.  Advance reservations are a must.  Totally full when we stayed and staff says this is the norm.  Great place!", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r161047541", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great location", "review": "Our room was spacious and clean. The staff was very gracious and helped us to book an excursion to a wine tasting in Tuscany.  Location is great but is on a noisy road and not possible to sleep with the windows open. Windows are sound proofed though. Maybe ask for a room off the street.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r160949883", "sub_review": {"Value": 3, "Location": 5, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "", "rating": 3}, {"title": "Not what we expected", "review": "We checked into the hotel on a hot day (room temperature was 26 degrees) and wanted to ring reception to ask about the air conditioning ... but the phone didn't work. So we went down to the desk and asked for help in getting the air conditioning to work, but were told that we were between seasons so the heating had been turned off and air conditioning not yet turned on from the central controls. This made sleeping at night near impossible as we had the choice of melting in our beds or having the window open and being kept awake by passing merry-makers or bin lorries! Room 115 was 'cosy' (i.e. small) with minimal wardrobe space and no drawers or shelves for clothes. There was a room safe, but someone had obviously made off with the mini bar that should have been in the room.…", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r160096292", "sub_review": {"Value": 1, "Location": 3, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Primitive Hotel Room", "review": "I was so unhappy about our stay at this hotel, I emailed the booking agency we used to complain and  a copy of my complaint which covers the facts is below:  \"I have just returned from a 3 day break in Florence, having booked our hotel accommodation through you. I would like to know how to make a complaint about this 3 star??? hotel as it did not meet the standards I expected when I booked it: When we arrived at the hotel, we checked into our room which I would best describe as primitive!  The room was very small and there was insufficient storage space for our clothes, so we had to live out of our suitcase’s. There was a very small ancient wooden wardrobe with 4 coat hangers which was all you could fit in it. There were no other drawers for clothing. It was hot and stuffy, so I…", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r160074725", "sub_review": {"Value": 1, "Location": 3, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Average hotel", "review": "This 2 star hotel was quite good. Clean, large room, big bathroom and free breakfast each day from 7:30 to 9:30.  There was a safe in the room (that didn't work), a small fridge and a wardrobe to hold both hanging and folded clothes as well as a very light power blow dryer in the bathroom. The area was sooooo noisy! Given the proximity to bars and a 2 minute walk from the train station, the motorcycle and pedestrian noise was immense.  Its as if the noise traveled up from the street and bounced off the buildings into your room.....even though your window was closed!  I'm a heavy sleeper and I was constantly woken up, so beware.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r159744931", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 1, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Only good location", "review": "There is no internet connection despite the advertising of free wifi. The lobby was filthy with dust that look like it has never been clean. The shower was clogg. You take a shower in a pool of water. Heating and cooling system in ou room and whole hotel was freezing. I went to the front desk because our phone was not working, they told me i needed to ask for heat,,because they had the control from the front desk. Free breakfast was ok. Very simple. Old pillows, very small rooms. The only good thing was the location. Near train and most sites.", "date": "March 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r156253747", "sub_review": {"Value": 1, "Location": 5, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Nice stay in Florence", "review": "The staff is amazing, Stefano at the reception knows everything about Florence, best spots, restaurants and he also planned a trip outside in Tuscany!!! Room is simple but clean, the bathroom was a little small. Breakfast was great like a traditional Italian breakfast. Position is very close to Duomo and the station, we walked all the time. To sum up, great value for money!!", "date": "February 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r154058314", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very cute hotel in the middle of Florence", "review": "I stayed at this hotel in January for 2 nights with my family, the position was supernice, close to the station and to the Duomo. The staff welcomed us very warmly and gave us a lot of info for visiting around and places to eat. Our room was quite small but clean, and I liked the style: traditional and simple. I really recommend it if you want to stay in a Florence-style hotel without spending too much.", "date": "January 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r152088249", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Really great location. Nice clean rooms.", "review": "Great location. Walking distance to a lot. Breakfast typical. Staff friendly and helpful. Street view was good for some people watching. Busy street but not noisy...except for sirens of course.....would revisit.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r146971150", "sub_review": {"Value": 4, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 3}, "travel_purpose": "", "rating": 4}, {"title": "Good location, decent value, but...", "review": "Windows were opened by cleaners during the day on a day that was forecast for heavy storms. Due to the small rooms (which there is enough space to survive) our luggage was saturated.  Thinking it wa an honest mistake and in need for some towels or similar to dry things we asked at reception, where the grumpy old man offered no apology and huffed and sighed when towels or something to dry the water was asked for.  We booked a day trip with some of the female staff who were very friendly and helpful, as our pickup for the trip was early we were told we could get breakfast early. However arriving with 2 other couples that morning we had the pleasure of the grumpy old man who would not let us eat breakfast at the previously arranged time.  There was mold/grime in the bathroom and…", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r141736218", "sub_review": {"Value": 4, "Location": 5, "Rooms": 4, "Cleanliness": 3, "Service": 2}, "travel_purpose": "", "rating": 3}, {"title": "Good Hotel", "review": "We stayed in Galileo few months ago. My girlfriend and me just stopped here for one. I have to say that our stay there was really good. The hotel is very close from the train station and the staff was helpful. The room was a standard room with the essential things for a three star hotel. ", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r137577999", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "A friendly and warm place.", "review": "I was on trip with my family, we got a big nice room and the receptionists were lovely. Breakfast was not wonderful, but reasonable for a three stars. I think small hotels like this one are warmer and more friendly than big hotels.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r137356074", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 3, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Very good value for money.", "review": "Having come from Venice, the friendliness and helpfulness of the staff was a pleasant surprise. They helped us find a way to break our lock after we lost the key to our bags late at night. Nothing was too much of an ask. They booked our tours and arranged for hotel pick ups. They even gave us vouchers for dinner. Breakfasts were pleasent and included in the price. Overall excellent value and a great location just near the Santa Maria Novella station.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r136646979", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "Disappointed", "review": "I would not return to this hotel. We were in the middle of a heat wave and they kept turning off the air conditioners in the rooms. We returned from day tour late in the afternoon to find our room sweltering - air conditioner turned off - and the window unable to be opened. The staff were manipulating the air conditioners in the room from a computer at the front desk. I demanded the air conditioner in our room be turned back on. The breakfast was extremely poor. The toast bread was the thinnest white sliced bread you have ever seen and stale. The rooms were very ordinary and no linen changed. No card was left in the room to request linen be changed.", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r135299902", "sub_review": {"Value": 1, "Location": 3, "Sleep Quality": 1, "Rooms": 2, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Does not showcase Florence", "review": "Customer service was very rude - our booking had apparently not been received, staff were unhelpful and not welcoming.  When we finally checked in, the air conditioning in our room did not work (- when we complained, we were given a fan) the bathroom was stained with mould.  Not a pleasant experience - do not stay here.  The location, while close to the hotel is unsafe and certainly does not showcase the best of Florence.", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r134970425", "sub_review": {"Value": 1, "Location": 1, "Sleep Quality": 3, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Worst hotel ever", "review": "The room was small dirty and very smelly, the smell in the lift made us gag, the bathroom was tiny dirty and mouldy the filth on the plastic screen and shower curtain was digusting. Room at night was 28 degrees air conditioning was turned off for enviromental reasons couldnt open the window as street so noisey. Bed was hard and uncomfortable like sleeping on an ironing board top cover was dirty, curtain hanging off rail, wordrobe smelt like someone had urinated in it, hair dryer held together with sticky tape. breakfast was meagre orange juice served in plastic cups, toast, a few stale cakes some bits of fuit. How this hotel has a three star rating is beyond me it is the worst hotel we have ever stayed in and ruined our time in Florence.", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r134709538", "sub_review": {"Value": 1, "Location": 5, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Do not go here worst hotel of our trip", "review": "Old,dated dark and dingy. The first room we were given was dusty and dirty, seems like it had not been used for a while and was not even prepared for us coming, layers so dust. The hallway was dark with stained yellowing shades. We asked re zircon as the room was stuffy and when window open very noisy, was told that it was illegal to puton air cooler in Florence until june, what the!! Offered courtyard room so we could get air, I do not think these people know what a courtyard is!! Next doors Dirty rooftop, littered and stray cats, not a courtyard to get out on. Breakfast was poor and room cramped, worst hotel we stayed in all trip, do yourself a favour. The reception staff very nice,they should go some where else, as too good for that place.", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r131427598", "sub_review": {"Value": 1, "Location": 3, "Sleep Quality": 3, "Rooms": 1, "Cleanliness": 2, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Great Location, Nice Rooms", "review": "We found this hotel in Rick Steves book. This hotel is within walking distance to the train station, convenient to restaurants and all the sites. We chose the superior room which was not ready when we arrived but the manager quickly provided another that was facing the rear courtyard. Room was quiet and clean had queen bed and large enough to move around. Breakfast was basic but good. The hotel value here was very good for the location.", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r131279211", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Not impressed", "review": "We arrived at the Galileo Hotel after traveling all night.  The room wasn't available, but the receptionist was nice enough.  The room was tiny and the bed and pillows were of the lowest quality. We didn't know how to operate the lights and had to ask the receptionist as we weren't given the information upon arrival.  The wallpaper was coming off the wall and one could hear the plumbing in the next room.  It was very warm and we couldn't leave the windows open at night because the room faced the street.  We were told that the a/c doesn't get turned on until June 1 in Florence.  The breakfast was adequate; the dining area small.  The staff was friendly.  I would not recommend this hotel and wished we could have begun our trip to Italy in a nicer hotel and better location.  The…", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r131102442", "sub_review": {"Value": 1, "Location": 3, "Sleep Quality": 1, "Rooms": 2, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Noisey and moldy", "review": "My husband and I did a tour of Italy for our one year wedding anniversary. We stayed at the Galileo for two nights. Here's the good and the bad:  Good: - about a 5 min walk from Santa Maria station - lots of restaurants and gelato places around (highly recommend Trattoria Bondi, and the restaurant beside the hotel is good too) - walking distance to the Duomo, Galleria dell'Accademia, and shopping - supermarket and laundromat across the street  Bad - bathroom had mold all along the shower - the a/c didn't work, front desk said it doesn't turn on until June - you can hear other guests shower, flush, and have conversations in their room - the room entry system emits a loud buzzing sound that you can hear other guests enter their room - breakfast consisted of just cold bread and…", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r130414766", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 2, "Rooms": 3, "Cleanliness": 2, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Terrible experience", "review": "We were scheduled to stay here for 4 nights by a travel agent.  We left after only one night. The first room we were given already had someone in it.  The second one was so bad we complained about the moldy shower curtain, tiny bathroom (3 feet wide by 10 feet long), poor lighting and being located right beside the first floor gathering room. The staff tried very hard to accommodate us, but they can't control the high school kids who were banging doors, talking loudly in the hallways, or the loud music coming from the apartments across the street. The neighborhood feels dangerous. There are groups of  men crowded onto the sidewalks. They make you push your way thru them, as they won't move.  By 1 am we still hadn't had any peace and quiet, and they were expecting another full…", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r129715176", "sub_review": {"Value": 1, "Location": 2, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 2, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Florence amazing city and amazing hotel!", "review": "My family and i went to Florence in June to spend some time in contact with art. We found this hotel that was very close to the centre , that's very comfortable. The rooms were very clean and they have the needful things for a family. The staff was very kind and helpful, they answer every question we made. The breakfast is a  buffet breakfast and it was good. They also have italian espresso and cappuccino!  Florence left me a good impression , i wish i could spend more time in Florence and in the hotel but i had to go back to work.", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r117223992", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Huge room", "review": "This was in Rick Steve's book, so I booked it based on that. Unfortunately, in his newer version of the book, he refers to the area as \"sketchy\". The hotel is just blocks from the train station and very close to the Accademia where David is located. We liked that the room was huge as was the bath. But it's difficult to take a shower without making the whole bathroom wet because there wasn't  a curtain or doors. We liked there was a convenience store around the corner as we bought bottles of water everyday, cookies and milk once. The hotel is a bit dated, and the breakfasts are very basic.", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r116955896", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Wonderful and Excellent staff", "review": "We had booked this hotel through a travel agent after reading its reviews on Tripadvisor.com. After Rome B&B  Debacle, we were quite Skeptical about florence as it was our next destination but it turned out to be okay. Lets check the good points first - The hotel staff is charming and helpful to a fault. It is centrally located (walking distance from the station and the Duomo) and also houses brochures which offers variety of tours for Florence and neighouring cities in Tuscany, the staffe also helps you to choose them. It was value for money as it costed us 69 Euros a night +tax. Negative - the airconditioning was not working when we entered but the staff was helpful in rectifying that,even though it gave us problems over the next few days we stayed. The internet in room was…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r116888124", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Very disappointing", "review": "We had saved up for a long time to visit Florence. We went into our room and the air conditioning did not work. We spoke to the staff who checked the computer and said it was working. They gave us a fan and said it was a hot night. The heat became more unbearable and we complained again and were told that, according to the computer, it was working. Eventually we asked a receptionist to accompany us into our room and she agreed that it was too hot. She promptly disappeared downstairs and we had to go and ask what what being done after nothing happened.   We were moved from a double room to a single room where the air con worked. However, when it was switched on the noise was unbelievable. We were told it would rattle for about twenty minutes. it did settle a little, but was…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r116755963", "sub_review": {"Value": 1, "Sleep Quality": 1, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Very nice hotel!", "review": "the hotel is located about 10 minute walk from the central train station. the rooms are not so big comparing to other hotels i'v been in, but they are very clean. breakfest was nice, including coffee, pastry,cereals, fruits.... though the dining room was a part of the lobby. i had no trouble sleeping there though i do remember construction noises late at night and early at the morning, i would not recomend it for people who can hear everything while they sleep.", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r115835669", "sub_review": {"Value": 4, "Sleep Quality": 3, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Wonderful hotel and service - loved it!", "review": "This hotel was the best one we had stayed at in Italy. The hotel is neat, pretty and clean. The receptionist Francesca is a honey and she was so helpful with anything we asked her, even with helping track down my lost luggage. The other receptionist (a young asian guy) was also very friendly and helpful. There's a guest computer with free internet and the breakfast was good. You also get a special if you stay from Sunday to Tuesday, Monday is free! It is also close to the train station and museums/markets so very convenient This hotel was great value for money and exceeded my expectations.", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r115708692", "sub_review": {"Value": 5, "Sleep Quality": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Basic but not that good", "review": "They gave us the room for the handicapped.  It was spacious but so dimly lighted we could hardly see to read anything or do anything easily.  The bathroom was very large and adequate.  The windows looked out on the piping area so there was only enough light to let in that showed whether it was day or night.  The air conditioning worked during our stay but one day it did have to be worked on.  The breakfast provided was okay, nothing special....typical continental breakfast.  There was one desk clerk, an older man, who was a bit brusque.  The Wi-Fi wasn't free and actually expensive and of course didn't work on our 2nd floor room anyway.  The street it's located on was very narrow and dirty.  This was not a favorite room for us though was in a pretty good location. There were no…", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r115212591", "sub_review": {"Value": 2, "Sleep Quality": 2, "Cleanliness": 2, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "We have enjoyed it for the third time", "review": "The Galileo Hotel in Florence is close to train station and San Lorenzo outdoor market.  It is about 5 minute walk to everything.  The rooms are abit small, but enough room for the amount of time you are in them.  The breakfast could use some fruit, but is enough.  I enjoy talking to the staff, Gorigo is the best!  I will stay there again.", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r113136374", "sub_review": {"Value": 3, "Sleep Quality": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Conveniently situated, decent property", "review": "The main advantage of this hotel is it's close proximity to the main train station, which is about a five minute walk away.  The property is well maintained and rooms were comfortable and reasonably priced.  When we were there it was quite hot but the air conditioning wasn't working -- something about a filter requiring changing which I couldn't quite understand -- but fortunately the night cooled down and the room was very pleasant.  I'd be sure to ask for a room NOT facing the main road as it will be pleasantly quiet.  Nothing is that far away in Florence and we could make it to the heart of the city in a 5-10 minute walk.  Breakfast was fine, nothing extravagant.", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r112581784", "sub_review": {"Value": 4, "Sleep Quality": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great centrally located hotel", "review": "My mom and I were greeted warmly by the hotel staff, they carried our bags, showed us around our room and it was great.  But then we realized there was a lot of street noise and that would be a problem.  We called the front desk and were told someone would be up soon.  A few minutes later, there was  knock on the door, and staff was there to show us another room, carried our things there, and made sure the room was to our liking, which it very much was.  It was bigger and had a private balcony.  We asked about a price difference and they said, \"not to worry, it is the same price.\"  We were very pleasantly surprised that we had such quick service, had a lovely room and it didn't cost any more.  The staff was always so helpful in guiding us where we wanted to go, breakfast was…", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r111687792", "sub_review": {"Value": 4, "Sleep Quality": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "The most amazing staff", "review": "I stayed at the Galileo Hotel for 3 nights. After many travel plans going wrong I needed an additional 4 nights. Though they were completely booked the amazing man at the front desk, Vincenzo, found a way to extend my stay for one night and then personally called several hotels with the same price range to find me a place to stay. I didnt even ask, I was planning to take care of it on the computer in the lobby but without hesitation he found me a place to stay within just a few minutes. The friendly front desk staff and beautiful facilities have made me wish I could stay here for the entire duration of my trip. After almost too much traveling and finding the majority of my hotel experiences disappointing, the Galileo Hotel has been an extremely refreshing experience and I would…", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r108446782", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "An enjoyable trouble free stay in the centre of Florence", "review": "Staying at this hotel was the best decision we made for our stay in Florence. It is central, short walk to the station and in the middle of everything. The room was basic with all you would need, towels changed every day, adequete and plentyful breakfast but the best of it all was the staff. Extremely helpfull in every way possible, we never felt that we were any trouble to them no matter how simple or complex our requests. We were far away from home and the airline had misplaced one of our suitcases, phone calls were made for us (we didn't speak Italian) and the pressure was eased. A wonderful stay thanks to Hotel Galileo and its staff.", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r108432655", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A really nice place to stay!", "review": "The hotel is really close to the station and a really good spot to get to the main attractions in Florence, we stayed in a double room, which was clean and comfortable. The staff desk was kind and gave us a lot of information about restaurants and attractions nearby. I really liked the furniture of the room, which was simple but traditional. The breakfast buffet was basic, but good because included in the price. If i will be back to Florence, i will definitely stay here again.", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r105553054", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Dirtiest hotel ever.", "review": "The room was booked by a travel agency.  Had to be moved three times because the rooms were dirty--mold & mildew in bath, dust & cobwebs on walls and ceiling, linens old and holey, mattress with buttons had no pad mattress pad, etc.  The desk staff was young, inexperienced and unprofessional.  Finally moved to a handicapped room which was cleaner but so small that the closet door couldn't be opened because it hit the bed, and the door to the room couldn't be opened all the way because it hit a small chair.  The location was near the train station on very busy, noisy street.   Unable to understand a 3-star rating for this hotel?", "date": "February 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r100404408", "sub_review": {"Value": 1, "Location": 1, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Basic, not good", "review": "We picked this hotel because it is near the conference centre, and also near the old centres of Florence, so we could walk everywhere. However, the air conditioning was wonky (and had a sort of \"you break it, you pay\" sign on the switch), the wifi (not free) was only in the upstairs common area (used by the chambermaids so not so inviting) or in the breakfast area (where I found a single plug). Not good for 2 consultants travelling together! They really need to replace their pillows. Some of the desk staff are moderately helpful.    We didn't eat there, but at the corner cafe next door.", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r80899618", "sub_review": {"Value": 2, "Location": 5, "Sleep Quality": 2, "Rooms": 2, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Worst hotel during 12 day Italy stay", "review": "Close to train station but Via Nazionale is not a pleasant intro to Florence.  Room and bath were big but that's it.  Atmosphere of room was so overwhelmingly depressive that we hated to return.  Breakfast was bad.  Day staff very brusque, almost rude.  Night gentleman very pleasant.  Out of 7 hotels in Italy (2 and 3 stars), this was by far the worst and made our Florence stay unpleasant.", "date": "May 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r67640845", "sub_review": {"Value": 1, "Location": 2, "Sleep Quality": 2, "Rooms": 1, "Cleanliness": 2, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "A basic hotel that will serve all your needs.", "review": "I didnt stay there during high tourist season, and hence, my room rate was really reasonable.  Its a hotel that will serve your basic needs....my room was big, though the windows opened up to a rather nondescript view of the ventilation system.  The toilet was extremely spacious.  Loved it  Breakfast was really basic.  Just cereals and some breads and some other stuff.  My father did open a cup of yoghurt to find that it was already spoilt and watery.  Which was a turn off but i guess it did not bother me.    The hotel is clean and comfortable, though there is a slight musky smell.  Nevertheless, you could say it has a charming atmosphere.  Its location is great too.  Next to the san lorenzo leather market and near the train station.  Dragging your luggage to the hotel from the…", "date": "December 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r52443639", "sub_review": {"Value": 4, "Location": 4, "Rooms": 3, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Galileo Hotel at Rome, Italy - Nice Place to Stay", "review": "1) Location is very convenient - it's a 10-minute walk to Termini train station.  We (2 people) were hauling 1 big and 2 carry-on luggage with no problem to the Termini station to catch Lenardo Express to the Airport or to catch Euro Star train to other cities.    2) The property is renovated.  The room has a lot of recessed lights and quite roomy in European standard.  3)The breakfast is good quality.  It has ham and cheese, boiled brown eggs, bread, yogurt,cereals, tea, fresh juices or coffee.  It's quite a good breakfast considering the food that were offered.    4) Location is very safe.  It's close to two embassies, German and Turkey and hence you'll see 3 soldiers in an armored car with machine guns stationed outside of the embassies 24 hours a day.  I don't think there…", "date": "October 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r64623946", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 5}, {"title": "Overall not very good", "review": "Good things: very well located right in the centre of the city. No need to use the bus, everything is at walking distance. People in the hotel are very friendly. Bad things: The smell of the hotel was terrible. The bathroom was not properly clean. Some rooms are big but others are very small. The breakfast is one of the worst I have seen.", "date": "August 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r45366064", "sub_review": {"Value": 2, "Location": 5, "Rooms": 3, "Cleanliness": 1, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Not a nice place", "review": "I stayed in this hotel for 4 nights and couldn't wait to leave. The room we had was on the second floor on Via Nazionale and I can best describe it as depressing. I didn't have any problem with the noise from the street as I could not hear it over the noise coming from the airconditioner. The breakfast room was small and the selection was poor. The only redeeming quality was friendly staff.", "date": "August 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r42081609", "sub_review": {"Value": 1, "Location": 3, "Rooms": 1, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Hotel Galileo: Great Value and Service!!", "review": "My husband and I recently stayed at the Hotel Galileo for four days.  The hotel was a good value and the location was very convenient (walking distance to all attractions, close to train station, safe location).  The service at the hotel (Barbara at the reception) far exceeded our expectations.  It was the great service that made our stay at Hotel Galileo so memorable.", "date": "August 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r38651648", "sub_review": {"Value": 4, "Location": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good place to stay in Florence", "review": "We were impressed with the size of our room, particularly its spacious bathroom--including what seemed like a luxurious bathtub (compared to other places I've stayed in Europe). The staff was friendly and very helpful--the front desk even helped us call ahead to our B & B in Cinque Terre to get directions, info, etc.   We were able to roll our suitcases there from the train station (a bit annoying on the very narrow sidewalks in Florence, but do-able), and found the location practical--particularly since Florence is small and easy to get across on foot.  My only complaint would be the oddly dingy bedspread and covering on what looked like a fold-out futon in the corner (which we didn't need/use). For the most part, this economical hotel was clean, classy and comfortable, so it…", "date": "July 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r34775141", "sub_review": {"Value": 4, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Not Bad, Not Great", "review": "I booked this hotel after finding it in Rick Steves' Florence book.  I contacted them online and was able to reserve rooms easily through e-mail.  The hotel is within easy walking distance of the Santa Maria Novella train station, on a busy street.  Because of this, the noise at night, even with the windows closed, can be a little much.    The area of the hotel is safe, but not very picturesque.  The room and bathroom were clean and comfortable, and the staff was helpful and cheerful.  The breakfast was just okay - nothing special, but a welcome meal at the beginning of a day of sightseeing.  You can have an espresso made for you, which is a nice touch.  I would not recommend this hotel to anyone looking to spend a lot of time in the area, or to relax while in the hotel, but it…", "date": "April 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r15445417", "sub_review": {"Value": 4, "Location": 2, "Check in / front desk": 3, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Questionable Business Practices", "review": "I booked 5 rooms in this hotel 6 months in advance of the date( Nov) I wanted to stay there. When I was booking the hotel they resonded to my emails quite quickly. I verified the cancellation policy and provided them with my credit card. The trip had to be cancelled a few weeks later( April) and I emailed them to cancel the reservations well within the guidelines provided to me by the hotel to cancel at no charge. I was unable to get a response from them. I emailed again 4 days in a row  with no response. I know that they were receiving and reading my emails  as I have a \"read receipt \" from my email but they would not provide me with a cancelation confirmation. I find their  refusal to respond or provide me with a cancelation confirmation a suspious business practice and would…", "date": "April 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r15292840", "sub_review": {}, "travel_purpose": "", "rating": 1}, {"title": "Good Location, very clean basic hotel", "review": "We stayed four nights at the Hotel Galileo in Florence during March 2008. We found it to be in a great location----------we could walk to everything. The hotel was very clean which is always important to me. It's a basic hotel and the morning breakfast  was a nice way to start your day.  The price was very reasonable and I would recommend this hotel to anyone who is looking for a clean, basic place to stay that's within walking distance to everything.", "date": "March 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r14431554", "sub_review": {"Value": 4, "Location": 4, "Check in / front desk": 2, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "loved the room do not like hotel", "review": "stayed here two nights.  my family stayed in other hotels in the area.  I was the loser.  while the hotel was clean and the room and bathroom was spacious, the front desk staff was very unhelpful.   I traveled thru italy for 3 weeks and this was the only hotel that i had to pay for internet service.   There were internet cafes all over the place in Florence that charged .99 euro per hour while the hotel charged 3.00 per half hour.   my family had lap top in every room in nearby hotel.   just do not think it is right to charge for internet service.  also front desk staff very rude.  like i was bothering them.   went out and got home at 1 in the morning to find the hotel all locked up. could not get in    will i stay there again?  only if i was desperate.", "date": "September 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r10027992", "sub_review": {"Value": 3, "Location": 3, "Check in / front desk": 1, "Rooms": 3, "Cleanliness": 3, "Service": 1, "Business service (e.g., internet access)": 1}, "travel_purpose": "", "rating": 2}, {"title": "Wonderful stay", "review": "My husband and I stayed at Hotel Galileo during our 2 night stay in Florence in mid Dec 2006. The hotel was further from the main train station than I expected (8 minutes walk) but it was a good hotel. The room was clean, of an adequate size and with a wonderful shower. It was not as noisy as what was mentioned in some of the other reviews, as the room had a double glazed window. Probably December was a quieter time compared to other months. In fact, I opened the window in the mornings to hear some of the traffic sounds just to remind myself that I was in the centre of Florence.  The breakfast was adequate - breads, jams, cheese, ham, juices- enough to get you going for the day. The good thing about this hotel is the free internet in the lobby - you just need to register at the…", "date": "December 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r6500053", "sub_review": {"Value": 4, "Location": 3, "Check in / front desk": 3, "Rooms": 4, "Cleanliness": 4, "Service": 3, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "good basic hotel", "review": "We stayed 3 nights at this hotel and found it very comfortable. It is in a good location for walking to all of the Florence sights, it is very clean, there is plenty of very hot water. Our room was a good size with plenty of space for lots of luggage. There is nothing fancy about this hotel but it is very comfortable. We didn't find the staff to be especially friendly, but were helpful when asked. We would probably stay here again. ", "date": "November 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r6149408", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Good hotel", "review": "Stayed here for 2 nights in March. Would recommend this hotel as it is central and close to the main station. Good value for money. A short walk to the sights. Don't miss the main meat and veg market close by, interesting stuff and cheaper than the other shops. Especially the huge olives and strawberries! Also go up the hill on the other side of the river - good view of the city. B'fast room is tiny and food is ok but for the price ,w e would recommend this hotel. ", "date": "September 2004", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r5355653", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Tuscan Delight!", "review": "We stayed here for half of our two week vacation to Italy in 2004 and LOVED it!  The room was lovely, the bath was spacious (for European hotels), the staff was most helpful and it is located very close to many of the top sites.  We walked everywhere--the city is MOST navigatable on foot and we found that the walking helped us to find some of the out of the way places that we may have otherwise missed.  The breakfast is lovely--wide variety of choices and LOTS of coffee choices!    We are planning to return in May, 2006 and cannot wait!  There are several restaurants that are very good and reasonable nearby--and it is close to the city's main market.  Further, the staff was wonderful when we asked for recommendations for restaurants both nearby and across the Arno.  Excellent…", "date": "June 2005", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r4255511", "sub_review": {"Value": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 5}, {"title": "All we could have wanted", "review": "Our three nights here were thoroughly enjoyable. Benefits included a modern lift, huge luxurious bathroom, big bedroom with double glazing insuring quality sleep, nice breakfast room and helpful English-speaking staff. The location was perfect for walking to the major tourist attractions like the Uffizi, Duomo, Palazzo del Bargello, Galleria dell'Accademia, markets, restaurants and the Santa Maria Novella railway station. We will definitely stay here next time we visit Florence. ", "date": "August 2004", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237518-r3680612", "sub_review": {"Value": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}]