[{"title": "Near the station and that’s about it", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "November 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r725781362", "sub_review": {}, "travel_purpose": "", "rating": 2}, {"title": "Enjoyed our stay", "review": "A dated property , which although clean is mediocre in most respects. Getting a cup of coffee at breakfast is a gamble, the rooms are down rambling corridors and I did wonder what I would do should there be a fire. Rooms were clean but dated.  Breakfast had tinned fruit...do I need to say more? The location is however very convenient both for the tram to the airport and the railway station.. mind you in Florence one spends very little time in the hotel room so this hotel may suit some.", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r720256928", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "My poorest accomodation experience in Italy", "review": "We stayed for 3 nights. The staff were helpful and polite, room was clean and comfortable, the hotel is very centrally located and easy to walk to all the attractions. The bed was comfortable however the pillows are a bit flat, maybe could ask for an extra pillow! The breakfast was adequate but not great, enough to get us started for the day though. For what we paid, we are really happy with the hotel.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r713286850", "sub_review": {"Sleep Quality": 2, "Cleanliness": 3, "Service": 2}, "travel_purpose": "", "rating": 2}, {"title": "Dated hotel", "review": "Where do I start? Upon arrival, I had no towels in my rooms. Had to ask for it twice, was dismissed by the 2nd individual because it was ‘too late for service’ and had to find a cupboard some out myself  The bed was umcomfortable. I was bitten by bugs, not sure if they were mozzies or bed bugs. The noise insulation was terrible, I could hear the entire conversations of my neighbours.   Breakfast is very average. The saving grace of the place was good brewed coffee. However, I had to wait for 45mins on one day and was almost late for my tour.   Overall, less than pleasant attitude by the staff. I constantly made to feel like I was causing an inconvience whenever I had to ask for milk for my coffee or asked the receptionist to about where to explore or confirmed my booked tours for me.   Upon check out, I was told that they only accepted cash for tourist tax even though they had facilities for credit cards. It would have been nice if I was informed about that anytime in my 3 days stay there. And I was charged an extra 1 euro for paying with credit card which is not standard practice. This dishonesty is disappointing.   It’s a shame because my experience in Florence has been tinted by the experiences at the hotel and I would have definitely had a more pleasant time elsewhere. In conclusion, I would definitely be choosing another hotel in future.…", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r709119878", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "loss personal belonging in the room", "review": "The hotel was close to the train station which was convenient however we didn’t enjoy much else about our stay.   The hotel was very dated and our room smelled of block drains. The bathroom door needed pulling closed every time and it’s likely the room next door heard. The toilet had a weird flush. Both of us had to turn the shower off mid-shower in order to let the water in the tray drain away.   Breakfast was basic.  Wouldn’t recommend.  ", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r705741641", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 1}, {"title": "BAD EXPERIENCE", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r703431099", "sub_review": {}, "travel_purpose": "", "rating": 1}, {"title": "Good location and that is it...", "review": "Someone broke my zip of suitcase and stole my Thai money(=euro285), BOSE Soundsport, a ring with one set of earring from Burano Island.  While the door-knob of the room is fine. I asked the manager to talk with the housekeeper who cleaned my room. Not only he did as my request, he invited us to move off if we, I and my friend, do not sure about their security.  The conversation was very bad so I tried to record his word.  His worker saw my mobile and told him. He stopped talking and waited until I stopped recording. He threatened me to give him my mobile if I do not he will call a police. I was glad if he did but he just lied us.   We tried to notify the police but one station was closed and another infom us to go to another station because they did not concern about this case. …", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r697227771", "sub_review": {"Value": 3, "Sleep Quality": 3, "Service": 3}, "travel_purpose": "", "rating": 3}, {"title": "Excellent location and basic service", "review": "The hotel has an excellent location, being at 2 minutes walking from the tram for and to the airport and at maximum 10 minutes walking from the main attraction - the doumo :) The staff are very nice but the building is very old. We were disappointed by the aspect of the rooms - very old and dark...but especially by the bathroom: the shower didn't have a tub or some glass around it so the water was everywhere...the other surprise that we had: the bathroom had a direct door to the main hall of the floor...very strange... The breakfast is poor... I will not recommend it.", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r696800790", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Charity conference", "review": "We chose this hotel because of the excellent location within 5 mins walk from Florence SMN Train Station which is easy for us to travel to Pisa, San Gimignano and Cinque Terre. Florence is basically a walking city as all the top attractions are within walking distance. There are many eateries around especially along the hotel, there are quite a few of Chinese and Asian restaurant which is good to settle our cravings for Asian food. Room size is okay for us and hotel did help us to arrange take away breakfast due to our super early schedule. However, no drinks or drinking water for takeaway since they only have dispenser for drinks without any bottled drinks. Hot shower heater seems inconsistent and the front desk staff were not so friendly/ helpful, but smooth check-in and…", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r692824850", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Lovely Location", "review": "Stayed here for 3 nights in May 2019 and it was a great little basic hotel. Friendly helpful staff that were willing to help in any little way to make the stay more comfortable. Location was very central and we could walk round loads of the beautiful Florence sites. For my first trip to Italy it helped a lot and defintely made me want to return.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r686133477", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Exelent location, great service", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r682488780", "sub_review": {"Sleep Quality": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Handy location and good amenities", "review": "Ok for the price, location is fantastic, convinient garage next door, great and helpfull service (Andrea  is the best ever), lobby is nice, rooms are clean, but somehow you feel in your room that belongs in cartoon not in same hotel you entered- lol You have shower and bed and place to keep your staff, and do not expect more... Would be so nice if they deside to renovate rooms..... same storry in Paris and Rome.. Breakfast was okeish, again, good service cover everything else", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r681047170", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Conveniently located", "review": "We're five New Zealanders who stayed two nights in early June and had three rooms (two couples and a single) . Staff were amazing and even swapped rooms after check in for one of our group who had terrible jetlag so he could be away from any street noise and sleep peacefully. Although you don't even hear the street from the 4th floor! The hotel is clean and although somethings are a little worn it is mainly due to how popular it is (we noticed a lot of Italians on business stay here which was comforting). Security is good and we never felt unsafe leaving our key at reception. It is located 5mins walk from the Napoli Centrale train station which was great when arriving, leaving and popping to Pisa for a half day. There's a fun market at the end of the street with great leather…", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r678069437", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Good for the price", "review": "I stayed here recently as part of a larger group (an adult with a college tour). The hotel is a short walk from the train station, and is conveniently located. You can walk to just about anywhere in Florence in 15 minutes or less (often times much less). The hotel is an older building, but it works. A few things that might be worth noting, as it is not a chain hotel (so therefore don’t expect the same generic experience):  1: I had room 402, which overlooks the street. There are NO window screens, so you can literally open the windows as wide as you want. There is no “safety” mechanism-so if you lean out too far-you’ll fall directly onto the pavement below. I personally enjoyed the freedom of opening the shutters and windows and getting the cool breeze at night. Plusses: this…", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r671310510", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Ok hotel", "review": "Thank you for the kind review, it was a pleasure having you here. We try to improve every day in order to make our Clients stay as pleasant as possible.  Hope to see you again. Regards,", "date": "February 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r650264519", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "It was the perfect hotel.", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r636914523", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Needs renovating", "review": "It was the perfect hotel. I will also use this hotel if I go to Florence.  · The staff greeted me with a smile and the check-in procedure was completed in 1 minute. Also taught me a delicious shop nearby. · You can arrive from the station in 5 to 8 minutes on foot, and there are many restaurants around the hotel · The facilities of the room were fulfilling, and cleaning was also solid. I got tired after bathtub was soaked whole body. · Departure date was free and kept baggage  パーフェクトなホテルでした。 フィレンツェに行くならまたこのホテルを利用します。  ・スタッフの方が笑顔で迎えてくれてチェックインの手続きは1分で完了。近くの美味しいお店も教えてくれました。 ・駅から徒歩5〜8分で到着でき、ホテルの周りには飲食店が多い ・部屋の設備も充実していて、掃除もしっかりされてました。バスタブは全身浸かれたので、疲れがとれました。 ・出発日も無料で荷物を預かってくれました ", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r626813341", "sub_review": {}, "travel_purpose": "", "rating": 1}, {"title": "Nice, comfortable, clean, great location..", "review": "Thankyou so much ! we do appreciated .... best regards  cristina", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r622125205", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Italian hospitality", "review": "Hotel is in a good location but is in need of a complete renovation and new furnishings, it’s tired and run down. Staff were very helpful though. It’s walking distance to the railway station and all major attractions in the city.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r621840965", "sub_review": {"Value": 3, "Location": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Comfortable stay", "review": "We stayed here for 2 nights.  The hotel is located within 5 minutes walk from S.M Novella station, there are plenty of eateries and shops around and a supermarket just 50m away.  We easily walked to the Duomo, uffizio gallery and ponte vecchio, all within walkable distance.  The room was reasonably spacious and was cleaned every day, beds were comfy just a bit of noise from adjacent rooms but not so disturbing.  Breakfast was good, coffe needs to be requested but they bring it to the table.  WIFI was reliable most of the time.  All staff day/night were friendly and helpfull  I would definitely stay here again ", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r619612649", "sub_review": {"Value": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Perfect Hotel, clean rooms - New towels every day. Simple but good breakfast- Nice staff- open 24h - in centre", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r610367319", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Disappointing - especially the leaky roof ", "review": "Allthough the shower is a bit small(i am 1.90mtr), the bathroom was complete! New towels every day and they even make up your bed!  The hotel is in the old centre, 3 min walk from the main treinstation . Friendly people! Breakfast was the same every day but good enough.  We recommend you to go there!! Price is good for wat you get!", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r604222664", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Decent stay and experience", "review": "I stayed here with my 2 children for 2 nights at the beginning of August. We booked a triple room through booking.com however due to a mix up we were initially allocated a double room. The hotel contacted us back in November to ask if we wanted to upgrade to which I agreed. However upon check in it was clear this had not been done. However after a word with reception we were able to change rooms to a triple as requested. On the surface the new room appeared ok. However on our 2nd day in Florence there was a thunder storm with very heavy rain. We were out of the hotel at the time but when we returned the carpet in our room was soaking and our suitcases had been moved. The clothes inside the suitcases, some books and the suitcases themselves were soaking. We had not totally…", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r597226637", "sub_review": {"Sleep Quality": 4, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Absolutly recommendable ", "review": "Dear Sir/Madam,  first of all, thank you for the review. The booking made was for a double room, you've made a request for the third bed so the cost of €60,00 was not for an upgrade but for the third person. It's true that the heavy rain caused several unpleasant difficulties, but it wasn't just your room, it was interested the entire part of that floor, we had to move 4 rooms, a custumer made us aware of the situation so it wasn't something that we knew before. Our employees apologized for the inconvenience and did their best to minimize the gravity of the situation.  Best Regards, Hotel San Giorgio  ", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r596918278", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Great stay, great location near train station", "review": "First of all, let us be clear. This is a 3 star hotel and is exactly that. We were there for 2 nights of 6th and 7th July 2018. The hotel is very very near the Florence train station - walkable in 5 minutes! It is bang in the middle of the city centre, and so once you are checked-in, getting around town on foot is a breeze - the Duomo, for example is literally 5 min on foot! That is the biggest plus point of the hotel. The rooms are adequate - not too big, not too small. Our room was, however not big enough to open 2 suitcases at once :-) The food - breakfast, in our case, was adequate. The rooms do not have coffee-tea makers, so remember to take it along!", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r596167541", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Great location", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r594354797", "sub_review": {"Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very close to train station, only thing got going for it sadly ", "review": "We found this hotel to be in a great location and great value for money. The staff were amazingly helpful and sought to assist us whenever we asked for anything. The rooms aren't amazing, but neither are you paying amazing prices. The breakfast was adequate, again not great - but neither is the price. It certainly worked for us.  We were on the 1st floor so used the stairs except when taking luggage up or down. We really enjoyed our time in Florence and if we were looking for a budget hotel in a great location, we would certainly come back to this hotel.   Luca from the front desk was amazingly helpful and gave great advice in terms of where to eat and how to get to different places we wanted to go to. Big shout out of thanks to Luca.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r591744962", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Great location ", "review": "I paid an absolute bomb for this hotel after “upgrading”’from a previous hotel which was booked ages ago which had very bad reviews.... the pics are so deceiving... and other than the close proximity to everything it’s not worth the money I paid.  Staff are mostly friendly except one youngish fellow who was rather gruff when we were leaving.  Checking out took ridiculously long as the young girl there must not know how to do necessary tax payments so we were left waiting until gruff guy was free... meanwhile times a ticking and we had s train to catch.  Anyway to say I was disappointed is an understatement...  Pros: clean, tidy, hot water (takes a few minutes but once it gets going is very hot) Air Cond works super well.. we had a quad room so was kinda spacious, beds were…", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r585222268", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Bad experience, really NOT a 3-stars hotel!", "review": "Dear Sirs,  thank you for reviewing our hotel. I'll start by specifying that we don't know exactly how much you've paid for the room, we have a contract with the agency your booking came through and the rates are fixed throughout the year. About the check out, there were other people before you, three couples to be exact, we understand that you had a train to catch but one has to prepare itself accordingly. The young girl is an intern from a local school, she just started that week and she is still learning obviously. Our hotel is an historical building inside the historical city centre, most hotels don't even have a lift and the speed of it it's subjective, as it is the aboundance of choice of the breakfast. The street is a quiet one, no pubs around and just a few cars during the day, almost none in the night.  We will take in good consideration all your suggestions. Best Regards ", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r571852029", "sub_review": {"Rooms": 1, "Cleanliness": 3, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Great location, spacious rooms, good breakfast", "review": "Stayed 3 nights here. Extremely close to train station. Staff friendly. 5 floors of rabbit warden. Not sure how you would get out in an emergency. We had breakfast included, but only bothered with it for the first day, pretty minimal continental breakfast provided. Appears to have a shortage of table knifes, have to wait till waite brings you one but there are plenty of forks and spoons.  Weird set up with room keys, you leave your key with reception as you leave the hotel. They never checked our ID on our return to get Our key, we could have asked for any key. ", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r570937361", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good stay.. close to Train station", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r537779665", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Close to train station ", "review": "Overall a very good stay.. breakfast was not so good(no options for Indians and Veggies)  Wi-Fi was at its high speed.. walkable distance to Train station.. Good surrounding environment..  helpful staff at reception..", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r535231568", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Cheap  Hotel, well situated", "review": "Easy walk from and to train station. Although the room was a little dated in decor, it was clean and bed comfortable.   Our bathroom was a great size, not too small.  Breakfast was good with several cereals, yogurts, croissants, meat, cheeses and great coffee. The gentleman who checked us in was very helpful at marking a map for us to guide us on a walking tour of the biggest sites to see.  I would stay here again.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r535090093", "sub_review": {"Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Considerate venue", "review": "grazie infinite! saluti cristina", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r534690140", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Average Hotel", "review": "This  hotel is situated  near the bus station. Just up the road there  is an excellent  market selling leather goods and  further on a nice square with  several  very good restaurants. We liked our room, taking the  lift  upstairs  but  walking  down! Their little lounge is  very useful  for  relaxing or  meeting the  group  at the start of the  day.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r533845341", "sub_review": {"Sleep Quality": 4, "Rooms": 4, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "\"Nice traditional italian hotel\"", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r524559464", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "What a Joke", "review": "A charming hotel in the heart of the center of Florence.Nice ,clean rooms, friendly staff, vintage fernitures.Its very close to Piazza Duomo, to S.Maria Novella and to cental train station. Highly recommended!!! ", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r522998951", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Beware of thefts!", "review": "Do not go here. The rooms are tiny. The wifi doesnt work. The beds are hard. No room to wash in bathroom. Staff unapproachable. There is a lift but there are still 6 steps to get your bag into the room. Does have nice lounge. Go somewhere else it will be worth the extra.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r519677544", "sub_review": {"Service": 1}, "travel_purpose": "Traveled solo", "rating": 1}, {"title": "Great Location, but dated interior", "review": "My son stayed in the San Giorgio Hotel for a weekend this summer with a group of students. After checking in on Friday afternoon, he left his backpack in the room. When he returned a couple hours later, he could tell that someone had gone through his backpack, but since none of his electronics or other valuables were missing, he didn’t alert anybody about it. However, the next morning, he realized that an Under Armor golf shirt was missing from his backpack. As he thought there might be a small chance that his memory was mistaken about packing it, he did not report the theft until after he left Florence and confirmed that the shirt was indeed missing.  When he contacted the hotel, the hotel management denied that the shirt could have been stolen and was unhelpful in resolving…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r517215668", "sub_review": {"Location": 4, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Nothing Special ", "review": "So geographically the location is perfect. very close to the train station, and a very short walk from the Duomo and the rest of the city centre. However, it is on the back-alley to a main market, so through the night there was often shouting from foreign traders.  Interior was very dated. Floors creaked, bathroom was very shabby and rattled a lot. Very old fashioned décor. However it had a very nice lounge downstairs. And Wi-Fi was painfully slow, and signal in my room was patchy.  Staff were very helpful, particularly when I was after a trip to Monteriggioni. They were very helpful in finding me the perfect tour.", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r515144989", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Great location and lovely staff ", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r512791101", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Lovely hotel", "review": "I really liked this hotel. The building is old and a bit dated but the room is clean and there is a lot of space. There is air conditioning that works really well which was a definite must as it was very hot! Breakfast was included and had a selection of breads, pastries, some cheese, meat, butters plus coffee, tea and juice. The staff were very nice and helpful.   Florence isn't a big city but it was close to everything and near the train station too. Easy enough to walk to the main sights or to find a restaurant. ", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r502240819", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Clean, comfortable and helpful staff", "review": "Nice and efficient staff, a short walk from the train station and a 10 to 15 minutes walk to most attractions. The room was very pleasant, nice bathroom, very clean but the bed could have been more comfortable, joint twin beds that were sliding apart. We were very happy with our choice, and for the Chinese among us it is next to some of the best Chinese food options in town", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r499258176", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "No hot water or working toilet", "review": "Stayed at this hotel for 5 nights in June 2017. Room was clean with old fittings. Breakfast was basic compared to other Italian hotels. Big shout out to Luca who was extremely pleasant and helpful with his suggestions and local knowledge ", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r498734381", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Charming & well run", "review": "There was no hot water in my bedroom. My friends in another room said they had a but but it was lukewarm.   My toilet did no flush.  Breakfast was very boring.  Positives: very well located - close to the cathedral and very close to the train station , and Friendly staff", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r493439291", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "a fantastic stay", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r492286203", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Adequate", "review": "The hotel is not a 5 star but it is a very nice place to stay and it is near the train station which is a plus for us as we travel by train when we visit Europe and the United Kingdom.  The breakfast is very substantial and presented well.  This is our second time to stay here and will stay here the next time we are  in Florence.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r491494594", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "The Tourist's Choice ", "review": "Hotel was fine, staff were absolutely wonderful, couldn't do enough and appreciated guests trying to speak Italian. Hotel Probably needs updating but it's an old building in an old city and it needs to keep some of its authentic Italian feel, dark furniture, curtains etc and it would be a mammoth task to revamp plus and it would increase the prices. Wi-fi worked for me whenever  I needed it. Bed was comfy, bathroom ok, shower needed a shelf to put toiletries on though, but no big deal. Cleaners did a fantastic job each day. All in all we had a nice stay and would go back ", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r490258903", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Stayed at better", "review": "This review is for all those who want to explore Florence and who view accommodation as a place to rest, refresh and replenish. If you are that kind of tourist, then San Giorgio would fulfill your needs.   The charm of this hotel, for me, was it's proximity not only to the station, the hop on facilities, the bus and taxis, but also  tourist sights, including the Duomo.   If you arrive at Firenze, the station, with your heavy luggage and you find yourself a bit disorientated because your google street map is not working and you're trying to figure out exactly where your hotel is, relax. Don't get a taxi, you'll pay 12 Euros or more. The San Giorgio is in 3 Via S. Atonino, across the road left to the Grand Hotel. About 3 minutes walk, traffic allowing. There's also a market…", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r489573402", "sub_review": {"Sleep Quality": 3, "Rooms": 2, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "The average hotel with decent facilities ", "review": "This hotel, although supposedly a three star rating, is very, very basic.  No thrills at all.  The hotel could do with a but updating.  Rooms had a hairdryer/fridge and TV but could not get any English channels on it.  There is no bar at the hotel.  Breakfast is okay if you like cold.  Only cereals were cornflakes or a very sweet granola, they did not even do toast!  A member of my party asked for a poached egg and was told no they did not cook food, hence no evening meals available, although in Italy I would say that this is not a problem. Staff are extremely friendly and very helpful.  Could not fault them, although on one morning we came down to find a Concierage being shouted at by the owner which is not a good thing to do in front of guests.  The towels and rooms were…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r484360890", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Perfect location for every thing", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r481723619", "sub_review": {"Location": 5, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Disappointing after reading other reviews", "review": "This is a very nice small hotel set on a narrow street off the Piazza dell'Unità Italiana square, and very close to the main Santa Maria Novella train and bus stations. The staff are very friendly and full of information about local happening. Our room was pleasant with a view of the house tops below, unfortunately the bathroom was very small. Continental breakfast is served in a bright cheery room and is ampule, Upon leaving the Hotel turn left and continue down the narrow San Antonino street after about a hundred yards you will see on your left a small restaurant and butchers shop called La Padellaccia. This family owned and run business is the closes you are going to get to traditional Italian home cooking. If you continue to walk on, you will run into the Cathedral di Santa…", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r479542715", "sub_review": {}, "travel_purpose": "", "rating": 2}, {"title": "Excellent Hotel", "review": "Stayed as a family of 3 for 4 nights.  Our daughter was 7 months old.  Our experience was not like some of the other reviews!  I'll start with the Good points, close proximity to the train station, clean, has wifi in rooms.    If you don't want any more than that, stay here.  My husband and I have travelled extensively as a couple and if it were just us with a couple of backpacks, this would have been adequate.  Even though a travel cot was provided, I would not stay here again with a baby.  Hotel itself has a lovely old charm but very scruffy.  Could do with a lot of TLC.  Our room was Bleak -  No pictures on the walls, old worn furniture, a bathroom that desperately needed replacing and a broken wardrobe.  Shower was only ever lukewarm.  No safe in the rooms - you have to use…", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r465503278", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Great stay at a great place", "review": "Near the Train Station Santa Maria Novella, this hotel provides a friendly and helpful services and advices for its customers. I stayed in this hotel for 2 nights. The breakfast was great. The room was spacious with a balcony overlooking the dome of the Duomo as i stayed in a double bed single room. The price is agreeable as well. Internet also worked well. I will return again. ", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r456675360", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Small but clean hotel at a nice location ", "review": "We stayed at San Giorgio for 4 nights and we really enjoyed it. The Hotel itself looks very well maitained and matches the grandeur of the city. Staff were all very helpful and always willing to provide information and breakfast was fresh and sufficient to start your day in a good mood; extra points for the fresh Italian coffee. Location is absolutely fantastic, you can go everywhere on foot as it is only 2-3 minute walk from the Duomo. Definitely recommended and hopefully we visit Florence again.", "date": "January 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r454226067", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Really loved staying here.", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "January 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r453373652", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Family room- ideal for a family of four!!", "review": "Clean and heated rooms, great location, good breakfast, free wifi. The place has a very charming atmosphere and makes you feel at home. We were very happy with this hotel for the price we payed and definitely recommend it to anyone who is visiting Florence.", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r452247728", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Really close to all the sights", "review": "I stayed one nifty at St Gorgeo & Olimpic hotel for one night on our way to Rome from Venice. We found the room very neat and tidy. Reception was good and friendly. We had apeacefull stay. However, we thought the fee for overnight parking was bit too much.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r452128780", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Small but cute...", "review": "Dear Client,  thank you for the kind review and hope we'll have you again as our guest.  Best Regards.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r451384724", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Florence should be good but not so.", "review": "This is a clean central and accessible hotel. It has a good breakfast and good space in the room. Its really close to the train station and market. It was an enjoyable and restful stay. The lounge space is lovely and offers a home from home feel.", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r450926937", "sub_review": {"Value": 2, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Good Hotel; Excellent Location", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r435214216", "sub_review": {"Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great location", "review": "We stayed 4 nights at The San Giorgio e Olimpic Hotel which is in an excellent position. being within approx 5 minute walk to  Stazione SMN & Bus pick-up points . It is also within an easy 20 minute walk to many of the major attractions such as: The Duomo; the Central Markets; The Galleria dell Accademia; The Ponte Vecchio  & central business area to name just a few.   The Desk Managers/concierge were friendly & most helpful treating us like family. Maps, tour bookings & free WiFi was available at the front desk. (We had no trouble using the WiFi in our room). We also liked the guest /waiting room with its comfortable armchairs & decor that looked most inviting whenever we entered the hotel.  A lift is available alongside the stairway. The room was a bit on the small size but…", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r434050483", "sub_review": {"Value": 3, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Don't be fooled by their photos ", "review": "I stayed here for 3 nights while attending a conference within walking distance. It is very well located, close to the train station, and I walked to sites including Uffizi and Galleria dell'Accademia. The rooms were clean and functional, and my particular room was quiet. The breakfast buffet was nice (cereal, breads, cold cuts, cheese, hard boiled eggs, peaches/prunes, other baked goods) and the service was friendly. But I can imagine some of the rooms may be noisy. I think it was a bit expensive for what you get, but this might be due to the prices in Florence. The first day the water in the shower was not quite hot.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r431225781", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "First visit to Florence", "review": "We stayed for 3 nights. True the location is good but that's about all this hotel has going for it.  The problems were many and varied from no tv signal, substandard plumbing..... toilet runs non stop, toilet cistern vibrates LOUDLY during the night ...... shower water stops mid shower ..... surprisingly it has 3 stars???", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r428615169", "sub_review": {"Sleep Quality": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Above average", "review": "We stayed here for four nights.  Hotel is in a great location, few minutes walking distance from Stazione di Santa Maria Novella. Staff were generally very friendly and helpful.  Breakfast was simple. Walking distance to Mercato Cantrale and Duomo.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r425100217", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Tired hotel", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r423391432", "sub_review": {"Value": 2, "Rooms": 1, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "First visit to Florence", "review": "The hotel is in a great location and the staff were generally very friendly and helpful but a renovation is long-overdue./ The bedrooms are poor at best and some woefully inadequate even at 3star level. The website photos flatter. Pity as it could be so good but disappoints.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r415114653", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "One night stay", "review": "Thank you so much to all the staff at San Giorgio, our room was superb, shower good and balcony overlooking Duomo brilliant! We returned daily to a freshly cleaned room, fresh towels and bedding. Water was always hot. Breakfast was ample and enjoyable. Reception staff could not have been more helpful. Location of the hotel was 5 minutes from the station ideal for train to airport and day trips. Given the chance we would return tomorrow!!! Florence is absolutely beautiful and the hotel was the icing on the cake! Thank you for an amazing time.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r411268989", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "One night in Florence", "review": "We had just one night in Florence, so we booked this hotel because it was not very expensive and was very close to the train station. It is an old and tired hotel with a man at the reception who wrote our names in a huge registration book. We were thinking we'd have a retro experience but we didn't get it neither. The breakfast was not the best for sure. Anyway, going to Florence again I would  look for another hotel.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r410168985", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Room 115", "review": "The hotel is located a few steps from the main train station and just less than 10 minutes away from the city center. Many stores and restaurants in the area. Very safe. I was in Italy for work by myself and the room I was assigned was a double with a balcony with view, on the third floor. However there was music coming from the local bar nearby until midnight. The room was clean but not very large. The bathroom was clean but the door of the shower was broken.  Breakfast was good.  All the staff were friendly and nice.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r408374975", "sub_review": {"Value": 3, "Cleanliness": 2, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Did the Job", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r408335790", "sub_review": {"Value": 4, "Sleep Quality": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good hotel at the right place", "review": "This is a basic B&B short stay hotel. Standard rooms over five floors served by one five person capacity lift. Although during our stay the hotel was full you did not get the impression that it was over crowded. Breakfast was continental style and plentiful. Staff members are friendly and helpful with a good command of English. Trips can be booked in reception and city maps are freely available. The hotel is sighted a short walk away from the train and bus station, with the main tourist sights within easy walking distance.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r408015518", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Worst experience", "review": "Nice enough room, excellent location if arriving by train - pretty much across the road, and a 5 min walk to the centre.   Paid less than £70 per night which was very reasonable in August but saw this hotel quite a bit more expensive at many websites. If I had paid £100+ would've rated this hotel lower.  Room was spacious which a good sized bathroom. Colour theme very yellow!  Breakfast average, no hot food although service was good.  Happy to store luggage before check in and after check out.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r401611584", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Noisy", "review": "We had 4 nights here and constantly debated to leave or not. Room 106 was dirty and old. Crome on taps and fonts all worn away. Bed uncomfortable and mattress did not fit base. Breakfast don't bother it is dismal and depressing. Old band aide under the bed, we accidentally spilt soft drink mopped it up floor was not washed for the entire time. Disgusting place. Only good thing is location and near a laundrette nearby. You can do better ", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r400419851", "sub_review": {"Value": 1, "Sleep Quality": 1, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Terrible", "review": "The hotel said it has non-smoking rooms, but during my stay it was the opposite: all rooms were smoking rooms. I had 2 twin bed, but i booked double bed. In addition, the room next to the elevator and stairs allows to know all the movements of the neighbors ...", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r399051738", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Good hotel", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r398993177", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Don't understand why this hotel has 3 stars", "review": "Very good hotel to stay in florence. The staff and the reception men were friendy, the breakfast was good. It has very good location near to the train station, the markets and the dome. we enioyed our stay there and in florence", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r396370124", "sub_review": {"Value": 1, "Sleep Quality": 3, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Enjoyed my stay", "review": "When we checked in the man in the reception wanted to keep our passports for a while for registration. When we protest against that he was laughing and told us that was the normal procedure instead of respect our feelings and doing the registration immediately. In The Netherlands there are a lot of warnings never to give your passport because of identity fraud. Only show it and let them write the number.  Our room (107) was a deception, nothing to do with a 3 star hotel. Except the good bed, everything was old and some things even broken. The door to the badroom was rotten and didn't close well anymore. Some plates of the old ceiling were broken and in the hall of our floor the door of the electrical box was half open, couldn't close anymore, dangerous if you are there with kids…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r392408040", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Loved my Florence experience!", "review": "I have just come back from 3 nights stay, had a wonderful time, hotel perfectly placed and our room (407) was lovely it had a small balcony which looked out over the rooftops with a view of the domes, a small bathroom with a lovely shower which helped cool us down as well as air con. I was staying with my daughter who is a coeliac and she was given gluten free breakfast each morning also the coffee was perfect. The hotel was a short walk from everywhere and we enjoyed wandering the narrow streets discovering the beautiful Florence.....we will return and thank you ", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r389479391", "sub_review": {"Location": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Nice hotel with good location", "review": "I traveled with my adult daughter to Florence, and we stayed 3 nights in the San Giorgio e Olimpic Hotel. The location is great - very close to the S.M.N. train station. The staff was very courteous and helpful. Our room was clean and comfortable. I can definitely recommend this hotel to other travellers!", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r385712962", "sub_review": {"Value": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Typically Italian romance", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r382801507", "sub_review": {"Location": 5, "Rooms": 3, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Location location location!!!", "review": "My husband arranged this holiday for a surprise birthday treat and asked for a room with a view and a balcony.  The staff were extremely friendly and pointed out that they have given us what we had requested.  The room was a little small with ensuite bathroom which was a little small too.  There was one wardrobe to put clothes in and some bedside tables but not drawers to put clothes into.  We were only there for 4 days so we managed, if we had been there longer I think we would have struggled.  We opened the window onto a large balcony with a table and chairs that need a little bit of tlc. Because we were on the 4th floor we had lovely views out into a town area and over to one of the domes and towers so all in all it was a lovely view.  The room was what we asked for, it was…", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r381208252", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 2, "Rooms": 2, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Perfect location", "review": "The hotel is an excellent location to railway station. Easy walking distance to nearby restaurants, piazzas, markets, hop on hop off bus stop and meeting point for day tours. Reception is well organized and helpful with map on your arrival and pointing out places of interest.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r378589921", "sub_review": {"Value": 4, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Well located hotel let down by the poor condition of the bathroom", "review": "Stayed here with my sister for one night in May and it is in the most perfect location. The hotel is quite charming with a pretty old feel to it. The staff were very pleasant and  the room was clean and the breakfast was good. I would stay here again if visiting Florence.", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r377207819", "sub_review": {"Location": 4, "Sleep Quality": 3, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Quaint", "review": "We chose this hotel because it was close to the train station. The room was fine but the bathroom was terrible. There was a putrid smell from the bathroom and the shower screen door was broken. We asked for the door to be fixed and the smell to be dealt with but neither were attended to during our stay despite follow up. Bleach was poured down the drain to mask the smell but this did not solve the issue. It made staying here very unpleasant.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r372960565", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Good location", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r364637650", "sub_review": {"Value": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "The dirtiest hotel", "review": "Very near to station ,just walking distance .All tourist places like domb ,church very near to the location . Very friendly Hotel staff near .Florence is very beautiful city and the hotel is very traditional Italian style .Good property for stay", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r362434094", "sub_review": {"Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Quaint, Good Value", "review": "I was with my family in room 227 on 4&5 April. I must say that this is the most disappointing hotel I ever stayed. The staff is ok. There is no safety box in the room. The carpet in the room was unbelievably dusty and we all got sick by 5th. Bed spreads are very old and bathroom is equipped with very low quality items. Commode sheet is worn out already and  Flusher is not working too. The walking areas are all full of dust and with old carpets. If you open the windows you can see just windows of the other building that are really unpleasant. Breakfast is just ok but not much variety at all. Not toaster nor bread. Wifi is not working in upstairs and you have to be in the old shaggy lobby area to use wifi. Only pros is the location.", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r352182830", "sub_review": {"Sleep Quality": 5, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Hotel with Heart", "review": "The staff were friendly and the free breakfast is wonderful. The location is very close to the train station, which is great for travelers with a tight timeline. The rooms are small but sufficient. My only negative: the wifi is a bit spotty. Overall, would definitely recommend.", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r337190978", "sub_review": {"Location": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great location- with chinese food", "review": "What this property is lacking with modern amenities and new renovations it makes up for and even surpasses with the genuine intention of their staff to make your stay a truly great one. The moment you step into the San Giorgio, you know you are vicariously experiencing a little slice of mid 20th-century European charm, long before the days of the Internet and cheap international travel. From the extremely heavy key to the cozy sitting room and fireplace to the breakfast area and then into the room and bathroom you feel like you've stepped back into time in the nice, nostalgic kind of way. The hotel staff were exceptionally friendly, you really feel like they will do all they can to make your stay in Florence an extremely memorable one. On our first day, I asked about what a…", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r334709182", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very good value for money Hotel", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r331594094", "sub_review": {"Value": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Decent hotel!", "review": "This is a very decently priced hotel a couple of hundred metres away from S Maria Novella train station within walking distance to major sights.  Decent breakfast, very clean rooms and very friendly staff.  Cosy lounge with fireplace.  Look out for Luca the receptionist and Gianpiero at the breakfast room.  I do not have the names of the other staff members but they were all very decent .  This is not the Ritz but you get very much what you are paying for.  This was our second visit and we plan to go again.", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r329027801", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Stayed for 4 nights. Centrally located. Station near by. City attractions and many restaurantswere in walking distance.", "review": "Nice centrally located hotel! Very close to the main railway station that is Santa Maria Novella railway station! Around 5 minutes walk!  We were there for a night ! We were 6 adults and a child and we had 3 rooms. The staff were helpful wherever we needed their help. Breakfast was decent though not many options but then, it was quite ok!  The front desk staff were also helpful and were amenable to our needs! The rooms were a bit small but then they were ok and kept clean!  Overall a good experience!", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r328571083", "sub_review": {"Value": 4, "Location": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Cheap n' cheerful!", "review": "We stayed here for  four nights in the month of  from 21st to 24th October-2015. Very close to the station. Room was ok size. Bathroom was clean and with good fittings.  Buffet breakfast was good. Best part of it it was close to many city attractions and restaurants. Walking distance. The staff was very helpful and courteous. Very comfortable stay. Centrally located. Free wi-fi was available in the room.I we would recommend this hotel to other travellers.", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r324144025", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "That shows you the hotel is a liar.", "review": "I stayed here for 2 nights with my brother while on a train tour of Italy. We needed a cheap and private place (eg not backpackers) to drop our luggage and sleep which was close to the train station. This hotel ticked all the boxes. We had a basic room that was clean and comfortable, the staff were lovely and we were a short walk to the duomo, accademia, and uffizi gallery. No complaints from us!", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r320814041", "sub_review": {"Location": 5, "Cleanliness": 1, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Oh for a good nights sleep", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r319131697", "sub_review": {"Value": 2, "Location": 3, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Adequate", "review": "We stayed for 10 nights , 1 night in Room 108 , 9 in Room 495 . First room had air conditioning that smelt rather badly , but the staff changed our room on our request. Room 495 was better in that we didn't use the air-con , however the window that provided the only fresh air had to be kept closed , curtains too , as the workers on the scaffolding right outside were banging , scraping , smoking ,talking & anything else that builders do from 8am till finish. Not at night though . At night the building fans took over and you couldn't get a decent night sleep for their noise. San Giorgi e Olimpic does not have a bar , which is disappointing as a cuppa , or a beer would be nice after site seeing trips . Going to the room is hardly a good alternative . Well located for trips into…", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r318244031", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Honeymoon visit", "review": "Pros: This hotel is centrally located, a short walk from the train station and the main sights of Florence. The staff are friendly and helpful.   Cons: My single room was so tiny that I could hardly fit my suitcase. It was very shabby,  with an old, stained bedspread, and was generally not up to the standard of cleanliness that I would have liked.  Conclusion: I stayed at the San Georgio hotel for 2 nights and was very busy for the whole time I was in Florence,  so didn't have a lot of time to hang around the hotel. For this reason, the fantastic location was a winner with me and I just put up with the fact that my accommodation was fairly disgusting! However,  if I was visiting Florence again, or wanting a hotel I felt comfortable spending more time in, or was travelling for a…", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r311515287", "sub_review": {"Sleep Quality": 3, "Rooms": 3, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Adequate ", "review": "We stayed here on the 4th stop on our city tour of Italy. Some might describe the decor as 'quaint' - I think compared to the other hotels we stayed in, it was most definitely the most dated, but the service received from the staff was unrivaled.  We did have a couple of problems with the room, but we lived with them - I'm sure if we had reported them to the staff it would have been resolved quickly. The light-bulb in our room blew while we were getting ready for bed (thankfully there were lamps around the room which we could rely on!). The bathroom was adequate, but did not have a shelf or anything to put your shampoo or soap on. The air-conditioning was a little temperamental although worked most of the time.  The most disappointing thing about this hotel was the lack of…", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r310871100", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "3star with 4star service", "review": "Some might call this place quaint. Our room and facilities were adequate, though there was no soap dish or place to put your shampoo in the shower bay. The door to the bathroom badly needed oiling. The air conditioning was good. There was less provided for breakfast than at other hotels we have stayed at. I'm not fussy, but my brioche (Italian type of sweet croissant) didn't taste fresh. The lady serving us was efficient but a smile would have helped.  ", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r309481171", "sub_review": {"Sleep Quality": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Family Vacation Stopover", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r299984913", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Fine for a short stay", "review": "Stayed here for two nights with family and it was a fine hotel. Decent breakfast. Close to train station, all sights, and shops. Had a great room with balcony view of courtyard. AC worked fine which was good in 90+ degree heat. Staff was helpful booking us a reservation for the Academia which you need to do in advance (oops). ", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r299698311", "sub_review": {"Location": 4, "Rooms": 3, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Not that great. Just ok to get by.", "review": "We had a large, comfortable room but the rooms are a bit tired. AC worked fine.  Staff very helpful.  WiFi only really works in foyer.  Very convenient to railway station.  Good breakfast but it seems to take them ages to clear the tables.  You get what you pay for and we enjoyed our stay.", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r299233776", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Shocking", "review": "The hotel stuff were friendly and its close to alot of things like market n trains n laundry n supermarket.  But the room is very old style and the \"free wifi\" dorsnt even work from the room on the 4th floor have to sit next to the elevator stairs to get a solid connection.  And the breakfast was very light food nothing amazing about it.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r298583346", "sub_review": {"Value": 1, "Location": 5, "Service": 1}, "travel_purpose": "Traveled solo", "rating": 1}, {"title": "Old style hotel, great location.", "review": "i didn't enjoy my 2 nights in this hotel. It is certainly convenient to the train station and markets, but honestly there is A lift that takes 2 persons and 2 suitcases, that's it and takes for ever. The breakfast is passable but there is NO smile with the service. The reception is no better.  My room was so small, as was the bathroom but to give credit it would be ideal As 'backpacker' accommodation.  I won't be returning.", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r298431791", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Perfectly situated for exploring", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r296533030", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "AMAZING HOTEL. ", "review": "We stayed here as part of a tour of Italy, we reached Florence by train and the hotel was in a perfect position. We were close to the market which was well worth a visit and 5 minutes from the main attractions Florence has to offer. We found this especially useful as it was so hot when we visited we needed to return to the hotel for a break from the heat. Lovely restaurants and bars nearby.  We didn't stay for breakfast as we couldn't find a table.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r296031169", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good stay ", "review": "This hotel was incredible! It is close to everything in Florence. The rooms are spacious and nice. The breakfast is very very good. And most importantly the people that work there are really really nice! We have traveled all over the world as a family and this is the best service we have ever gotten. Thank You hotel San Giorgio. You really made our trip to Florence memorable.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r293814783", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Fab staff, great location, good breakfast, basic accomodation.", "review": "We only stayed in Florence for one night, and we didn't particularly need any longer, but this hotel was enough for a short stay, it was just very basic, but if you are after cheaper accommodation this'll do. Very close to train station, we could walk with very heavy luggage, and close to some restaurants and shops. Staff were friendly and helpful, and the breakfast was basic (no hot options) but it was still good. ", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r290150815", "sub_review": {"Location": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Very Good Location", "review": "Stayed three nights here following three nights in Venice and travelling to Florence by train. The hotel was close to the train station, the reception staff were really friendly and gave us a good welcome. They were also really helpful booking us excursions and giving us directions - particularly Oliver. The room was quite basic, but air conditioned and clean, comfortable beds. No safe in the room - for passports, extra euros, travel cards etc. We, personally, found Florence too busy and enjoyed our trips out - in particulerly the San Gimignano & Siena with the wine tasting and lunch.", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r290005953", "sub_review": {"Value": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great location but tired hotel", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r288520388", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Good location and reasonably priced", "review": "Fantastic location in the city but this hotel is very tired and in need of refurbishment. The staff were very helpful but the room we were offered was like a monastic cell and the continental breakfast had a very poor choice. Nothing appears to have changed for years.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r287627727", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Near train station, sightseeing, duomo, restaurants and everything!", "review": "We stayed for 5 nights for about EUR445 (excl city tax) including daily breakfast.  The hotel is about 5mins walk from the train station and Central Market so great when you have heavy luggage, plus it has a lift.  Reception staff were very friendly - we had a day tour that departed early one morning and a breakfast bag was organised.  Given the summer heat, the rooms were nice and cool, spacious enough to spread our your things.  We were on the 3/F but alas no wifi, it only worked downstairs on G/F.  Breakfast is very basic and opens from 7:30am which is kind of late.  We were leaving on an 8am train and was downstairs by 7:15am but they were strict with the opening time so suggest during peak season, they consider starting breakfast at 7am.", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r287279099", "sub_review": {"Value": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "So convenient for St. Marks, The Opera and the Alilaguna", "review": "I only stayed two nights at this hotel and it was a good short stay, the reception staff were really nice and helpful when I asked them for some directions and where to buy bus tickets. The hotel infrastructure is old, but the rooms (at least the one I got), bath (big bathroom) and common areas were super clean and kind of cozy. Breakfast was continental, nothing to complain about.  I totally recommend this hotel if you want to stay near the train station (maybe 5-7 min. walking from the station to the hotel) and if you want to discover the city on foot.", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r284660202", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Horrible hotel. The worst I have ever been.", "review": "Fantastic position at a reasonable price. Clean and comfortable room and very helpful desk staff. Perfect for a visit to the St Marco district. Excellent breakfast for vegetarians, too. We would like to go back but next time we will \"do\" a different district.", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r283532431", "sub_review": {"Sleep Quality": 1, "Rooms": 1, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Perfect location !", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r278804698", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Good Location. Friendly Staff", "review": "We stayed here for 5 nights in June , the location is ABSOLUTELY ideal! Literally in the centre of the city ! Surrounded by shops, restaurants , the historic sites and a 3 minute walk from the train station. Can only get wifi on the ground floor of the Hotel , but wasnt a problem for us. The breakfast was well presented , lots of choice...croissants, yoghurt's, fruit etc  (but no hot food)  the staff were friendly and helpful and we found the overall stay very pleasant . The rooms could have done with a lick of paint and new bathroom tiles though ! ", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r275466525", "sub_review": {"Location": 5, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Well located and friendly hotel", "review": "Stayed here for 3 nights.  The room was adequate for our needs, although a little dark.  Nice big bathroom though.  Breakfast was good. Plenty to choose from for a 3 star hotel.  Staff very friendly.  Perfect for our needs.", "date": "January 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r273723760", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Tired hotel", "review": "We had a great experience here.  The hotel is just a few minutes from the main railway station and within easy walking distance of all the main attractions in Firenze.  We were particularly impressed with the young man on the reception desk (it's some time ago now and I don't recall his name).  He helped us considerably with advice an timetables on trains and in booking a tour.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r273394476", "sub_review": {"Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Comfortable stay", "review": "we stayed in this hotel on our second leg of our tour of Italy, it's convenient as its a five minute walk from the train station, but Iam afraid that's were the good news ends. The room we stayed in had two single beds, there was a window that overlooked a very small courtyard from which cooking smells drifted, the bathroom was very small and in a poor condition, and. It very clean and to be honest it was just past its best. The whole room could have done with a deep clean form the carpeted (yes carpets not tiles) floor to the tops of the wardrobe which was caked in dust. We stayed on a bed and breakfast basis but only had the breakfast on the first day as there was little choice, for example there was an orange juice machine that did not produce orange juice and boiled eggs…", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r272932549", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Convenient", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r266630680", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "3 day city break", "review": "The staff was very helpful and nice when it came to getting around.  Walking distance from the train station, which was very convenient.  Museums and Cathedrals were just a short walk away.  The only downfall was it only had wifi, in the main lounge area.  The rooms looked  just like the pictures, and were clean.  It was overall a nice hotel for the 2 days I stayed.", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r265496417", "sub_review": {"Sleep Quality": 3, "Rooms": 2, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "City honeymoon", "review": "Just returned from a 3 night 4 day break  - disappointing hotel - room with no natural light and dismal bathroom that needed renovating.  That said, it was in a great location and was clean .  Florence is about the sights so if you're not too bothered about accommodation it will do!", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r263588092", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Basic but good", "review": "Lovely room with balcony and a complimentary bottle of fizz for our honeymoon. However very limited breakfast. Very close to train station and historic centre, but due to this a very noisy location all night! ", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r263359197", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Friendly and comfortable ", "review": "Basic hotel in the San Lorenzo area, in the city center, Very well located! Basic but good value for money. Pedestrian area. Close to everything and very good restaurants nearby. The covered Market is a must see. Near Santa Maria Novella train station.", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r260828106", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great hotel & very close to Station ", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "February 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r256534154", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "was a really nice place", "review": "This is the second time I've stayed at this hotel because of its great location; walking distance to Firenze SMN station & main sights of Florence. Reasonably priced with 24-hr front desk. Clean room with basic bathroom amenities (only had a small bar of soap, shower cap). The only bad thing was that the wifi in our room wouldn't connecting so we had to go downstairs to the lobby to use the Internet.", "date": "January 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r252632319", "sub_review": {"Value": 5, "Location": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Good staff", "review": "very good quality especially for the price right around the corner from the main florence train station and fairly close to all the other main sites in florence  staff were friendly and helped me with my bags and escorted me to my room  breakfast was decent, a standard continental breakfast and free unlimited wifi", "date": "January 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r250847135", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Wonderful Christmas", "review": "I liked this hotel. Location is the best about the hotel. Our(standard) room was cozy and quiet. Staffs were nice and always keen to help. Sleepers are given and breakfast was fine. There was no fruit served, though.", "date": "December 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r247048791", "sub_review": {"Location": 4, "Sleep Quality": 3, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very old hotel, excellent location", "review": "Old building but nice place inside. Clean rooms with service every day. Satisfied WIFI. Good breakfast. Near the train station Santa Maria Novella.  The staff  are polite and helpful. Value for money hotel. I certainly prefer it again", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r243051729", "sub_review": {"Rooms": 2, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Good hotel", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "November 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r242959334", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Lovely hotel close to everything", "review": "Great central location, close to city attractions and transport networks. The staff are friendly and helpful. The room was comfortable but was in need of maintenance.  The wifi did not work well, we had to sit out in a particular spot in the hallway for it to work adequately. Probably still good value for money.", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r240628145", "sub_review": {"Value": 4, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good for the money", "review": "Arriving by train we found it in about 10 minutes. Good size room, excellent bathroom comfortable Queen size bed.  Staff very helpful advising of good restaurants near by and other attractions.Luckily we talked to them as we were not aware many museums did not open on Mondays. So late Sunday we managed to get in to see the statue of David.  Breakfast fine for our needs. Wifi a bit of a problem in room but fine in foyer lounge.  Thoroughly enjoyed our stay as everything was within close walking distance.  Our room on 2 floor was a bit noisy early in the morning due to street sweepers and garbage collection.  Would definitely stay here again.", "date": "November 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r238727861", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Good Location", "review": "I stayed in that hotel for one night during November. The location is perfect close to the train station (SMN) and the city center, also many restaurants and small bars are around. Hotel was clean, only the carpets could be changed since you could see some stains, but what is the most important for me you didn't fell the smell of cigarets in the room that I really heat. The breakfast was also quite nice, some bared, cheese, ham and sweet staff like croissant and cakes. Staff were friendly and helpful. ", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r235599821", "sub_review": {"Location": 4, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Good location", "review": "I based this hotel on its location to the train station.  Room was of large size as well as the bathroom.  I was in the back of the building so WiFi not as strong, had to go down to lobby for stronger and steady connection.  Enjoyed breakfast daily.  Laundry/Dry Cleaning available at a cost or do it yourself just down the street.  Only issue was the condemned hotel across from the hotel, seemed to be the main urinal for people, very pungent smell when coming from passing by it in route to the hotel entrance. Stayed 2 nights, 8 - 10 Oct.", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r232593359", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good experience", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r232490952", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good location", "review": "Big room with Big bathroom, great location very near to train station,  close to 3 churches one of which was the beautiful Duomo, nearby have many great famous restaurant,  many socket on wall for me to charge electronic gadget, strong wifi at reception, only down side was No wifi on 5th floor..", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r230802611", "sub_review": {"Value": 3, "Location": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Perfect Stay", "review": "We recently stayed 2 nights at this hotel and whilst its location is very good for the railway station and only a few minutes walk from the centre of the city and whilst the staff were very polite, very helpful, sadly the room was in need of redecoration.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r230693626", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "A week in Florence", "review": "This hotel is family run, and a traditional Italian hotel. The staff were friendly and helpful with our stay in Florence! Breakfast was perfect for the start to the day (cold meats, yogurt, fruit, coffee, juice, and crossiants). Air conditioned and not paper thin walls! The hotel was right across the street from the train station (do not taxi it there, its not even a five mint walk!). We were able to walk eveywhere we needed to see while at this hotel, great location, not to mention the all day tours for Tuscany leave at the train station so we woke up, did not rush, and walked to our bus! The place was clean and beds were actually very comfortable!", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r229872430", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Another excellent stay", "review": "7 days at the San Giorgio. A pleasant friendly hotel. Staff were very helpful and breakfast more than adequate. Rooms serviced daily with clean towels etc. Air conditioned throughout. Some commented old fashioned but I would describe as traditional. Not a fan of plastic cloned hotels. Near to station and 10 minutes from most of the main sites. Restaurants within a minutes wal. Would certainly stop here again and recommend to friends.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r227478475", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Comfortable and conveniently located", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r226627676", "sub_review": {"Value": 5, "Rooms": 3, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "allways a good choice", "review": "The hotel is conveniently located very near Florence main station and city centre. Breakfast is good. Although the rooms are a bit outdated, for a short stay one can do with. Rooms are clean. Ideal for a short stay", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r225082011", "sub_review": {"Sleep Quality": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "excellent location but..", "review": "We have stayed here a few times .. most recently we took the morning  Eurostar from Rome for three days two nights in Florence  and this was a perfect location ..our room had a  nice view of the roof tops , Staff was very friendly and one remembered me from a visit two years ago .. they gave us a late check out on the third day as we were taking the Late Train back to Rome .. The Breakfast is always a treat here and we lingered talking to other guest .. We love to visit Florence and have stayed in 5-6 hotels this one we recommend", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r223597465", "sub_review": {"Location": 5, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Excellent location !", "review": "the hotel has an excellent location, only 2-3 minutes walking from the train station and from the main monuments of the city. Unfortunately rooms are not so comfortable and too much old. The price is a bit high if compared to the offer. No complaints for the rich breakfast buffet. Hotel very clean! In general, I can reccomend this hotel to spend few days in Flrence to enjoy the city by day and by night!", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r223326948", "sub_review": {"Value": 4, "Cleanliness": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "reasonable and convenient", "review": "Very convenient location - a short walk from the Santa Maria Novella Station. Very central, and quite close to all modes of transport to move around. The rooms are a bit old, but fairly spacious. En suite toilets are clean. Free wifi. Average breakfast (not too much choice). We stayed 3 nights, and found it a perfect value for money. In a very nice street, full of activity. The beauty of Florence is that you can walk around very conveniently, and this hotel is ideal if you want to stay in a \"happening\" part of town. There are quite a few good restaurants just walking distance from the hotel. The staff was very helpful and spoke perfect English. Excellent choice - will return again for sure.", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r221336411", "sub_review": {"Sleep Quality": 3, "Rooms": 3, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Excellent location", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r221156421", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Five in Florence", "review": "Situated minutes from SMN station the San Giorgio has excellent location especially as the walking tour we were booked on shortly after arrival was also minutes from hotel.  Staff were prepared to assist with any questions we may have and even printed off train timetables for us which was very beneficial as SMN is very busy and quite confusing.  Breakfast was average but again staff were on hand to ensure we had everything we needed.  Rooms were basic, but very clean and adequately furnished.  Would definitely book again.", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r219160804", "sub_review": {"Location": 5, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "budget - good location", "review": "We enjoyed our stay at the San Giorgio.  Location was very close to the train station but as you turned the corner to the hotel you entered a classic narrow Florence street, with nice restaurants and a coin-laundry just steps away.  Just up the street is a busy open market, which my teenage girls enjoyed walking through each day on the way to the sights that are quite close by.  The staff is reserved but warm.  This older, smaller hotel is very charming and comfortable, with a good breakfast and coffee. The wifi only really works in the lobby, which has a cozy sitting area with a couple couchs and several chairs for hanging out. We would love to stay here again.", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r216549024", "sub_review": {"Location": 4, "Rooms": 3, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Most satisfying stay! ", "review": "This hotel is very good located. Walking distance to train station and bus stop and numerous attractions. Go for a walk up and down the narrow streets. Not too much noise. Bathroom needs updating. Value for money.", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r216258476", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Traditional firenze hotel", "review": "Loved it for the location- enough said- it was perfect! Literal 5 minutes from station then 5 minutes to centre of Firenze.  Offers breakfast which is good enough! The entrance is old style but very comfortable. The whole hotel had a cosy, at home feeling. Reception was friendly and welcoming, though we waited a bit for our room to be prepared at 2pm.   The room was spacious enough for three people and air con was really nice for summer. ", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r215053183", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Hotel did the job", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r213744429", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Location good rest average", "review": "Pros: location near tourist sights and train station if planning to ride rails often with florence as home base. Our room was surprisingly a good size, don't know if that's same for all. Breakfast coffee was good. Cons: Bathroom was small and toilet flushing was a challenge. Dragging bags around step filled 5th floor was fun. Getting coffee during breakfast was a mission. Would book again for right price because really only used hotel to sleep. ", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r208799220", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Very good location, nice 3 star hotel", "review": "San Giorgio is 3-4 minutes walk from SMN railway station and is easy to locate.  Room allotted to us on fifth floor was well sized with little terrace. But little worn out in terms of furniture and maintenance. The wardrobe was old. and did not closed properly. The Air-conditioner stopped working in the middle of night. (Not only in our room but also in neighboring room) The steel chairs in terrace were old and with damaged hand rest, etc. However, room and bathroom were clean. Bathroom is very small with tiny shower cubicle and the exhaust fan in my bathroom was not working. You can hear noise from adjacent rooms so privacy is limited.  Out side the rooms we had nice little semi open lounge but sofa springs had given away making you sink in it when you seat.  Breakfast is…", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r207403876", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Excellent Florence Hotel", "review": "We visited Florence and we were recommended to stay at the San Giorgio Hotel. We stayed 3 nights, in a large room with all expected amenities. Received great service from the staff enjoy d the location and the access to so many restaurants. If you want a medium hotel in a central location, this hotel is highly recommended.", "date": "December 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r203003429", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fantastic three day break", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r200783950", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Like Italy, maybe a bit tired but a great place to be.", "review": "The hotel room was very comfortable with a nice big bathroom. Very friendly and helpful staff at the reception.Could not have been better positioned for all the sites and the train station, great for travel out to surrounding areas and/or the airport at Pisa. Breakfast was continental and adequate until you find somewhere for a leisurely lunch ( definitely no shortage of places for that. All in all a great base for seeing this incredible city.", "date": "March 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r198961406", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Our Holiday", "review": "Typical Italian hotel I thought. The location Is fantastic.The staff were very friendly and very helpful. Breakfast was plentiful. If you want a boring, sterile souless hotel go stay in one. If you want a sense of Italy and are on a budget, try this.", "date": "March 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r197924809", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "old hotel", "review": "We stayed at San Giorgio for 5 nights.It is our second visit here.Very friendly staff good location for gettin about.Nice continental breakfast in the morning.Clean and comfortable rooms all u need for your stay in Firenze.", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r197114443", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Clean but needs Updating", "review": "Best thing about this hotel is location, 7min. from main train station, 10min. from the centre and 2min from the place from where you to take buses for local tour. Very old building, small lift and so many stairs on every floor. lobby is nice with Wi-Fi,  breakfast was ok.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r193956768", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 2, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good located hotel", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r190407598", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "very low Budget stay", "review": "Right next to the main railway station, you can literally  pull your luggage from the station to the hotel. The tour buses to the Tuscan countryside also start from just outside the hotel. The Duomo is also a few minutes walking distance. The Santa Maria Novella church is opposite the hotel. The hotel is clean but slightly old. The room size was quite big for a three star.", "date": "January 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r189956001", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "if getting a good price comparatively, book it.", "review": "Run down hotel, we stayed with our teens and were all in one room with a fold out bed, the bathroom was dirty and the bedding (blankets) were about as old as the hotel, the breakfasts were poor , and our room was very noisy hearing all the pedestrians outside (we were on the 2nd flr) recommend for young travellers only not families. ", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r187283763", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Convenient", "review": "Stayed for 2 nights. Hotel is at an ideal location, nice hotel in a category, the staff was very nice and helpful, gave us few good suggestions what to see, where to go and when. The room itself was very big, very outdated interior but, that’s the case we saw with most of the 3* hotels in Italy we have stayed. All in all if you are getting a good price comparatively, book it.", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r187035954", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Budget Florence", "review": "The hotel at a walking distance to the train station, the Duomo, San Lorenzo, Vechhico Palace, River Arno… etc. Has a large number of rooms and lobbies in each floor. There’s no exceptional view per se but you can see how close the main attractions are from the top floors. Food is fine. However, there is only 1 lift. The staff is friendly. You can find a large number of restaurants around.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r184876625", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 3, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Needs a lot of renovations", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r181834421", "sub_review": {"Value": 2, "Location": 4, "Sleep Quality": 3, "Rooms": 2, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Good location but jaded hotel", "review": "The only positive point about this hotel is its location because it is located near Florence main train station as well as some historic and famous buildings. The furniture is outdated but tolerable. The most seriously negative point is that because of old installations and equipment you will probably face terrible problems. We stayed there for two nights and at the first day we could not use warm water to take shower because the installation was out of order and it was really a disaster. Unfortunately the staff just said that \"It is not our fault!\"", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r181456028", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Nice but old hotel", "review": "The best thing about the San Giorgio is its location near Florence's main train station, Santa Maria Novella. Our room had mature furniture in the Tuscan rustic style which is not to my taste. Our room overlooked a small unused courtyard but this made it very quiet at night. The bathroom was small with poor fittings, particularly the shower with no dish to put the soap and shampoo in. No English language TV. Breakfast was OK but no fresh fruit, tough rolls and vanilla flavoured croissant. Perhaps a Tuscany speciality but not too my taste. Tables weren't cleared and they have an odd policy with knives.  They leave spoons and forks for you to collect but you have to wait for the waiter to bring coffee and your knives.  Perhaps its Health & Safety getting in on the act. Short walk…", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r181282780", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 2, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "San Giorgio, a fine family hotel", "review": "I enjoyed my stay in this hotel. The staff was excellent. Breakfast was pretty good. The room had very old furniture but the bathroom and beds were very good. If I go back to Florence I will certainly go back to this hotel.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r180095125", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Most Convenient Location", "review": "Stayed at the San Giorgio 2 nights in September.  It is a fine family-owned hotel with excellent friendly/helpful staff.  The complimentary breakfast was very nice.  We arrove in Firenze via Trenitalia and the location of the hotel was an easy walk with luggage.  Our room was very adequate [typical remodeled/updated older Italian building].  Most all the major sites are within an easy walking distance [Michelangelo's \"David\" & other terrific museum items, Baptistery/Duomo/Campanile Tower, Museum with Ghiberti's golden doors, Piazza della Signoria with it's great sculptures, Ponte Vecchio bridge; even the Michelangelo Piazza across the river is really not too far].  Very pleased with the hotel.", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r178571308", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 2, "Rooms": 3, "Cleanliness": 2, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great place to stay!", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r178384110", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great location", "review": "The San Giorgio is a great place to stay in Florence. It is ideally located near the SMN train station  and had several lovely restaurants nearby. Though the hotel is old, and the rooms are small, the service they provide is invaluable! Wonderful front desk staff who go out of their way to make your stay enjoyable. The breakfast provided is simple, but adequate. Location is ideal as we were able to walk to most of the city attractions without difficulty. You have to remember that it is a 3 star hotel. I would recommend it to anyone who wants plain basic service and an enjoyable experience.", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r177180262", "sub_review": {"Value": 4, "Location": 5, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "centre of it all", "review": "Solo traveller so had small single room which was fine and all i needed. Location is near train station and Piazza San Lorenzo. Breakfast was pretty good and staff front desk staff happy to help. Free wifi in lobby, doesnt work well in rooms. Would stay here again.", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r173091006", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good location. Great staff. Lovely room. Delicious breakfast.", "review": "its a good basic hotel - clean friendly - parking right there laundry - walking to all attractions - breakfast is good - would stay there again - easy check in - wifi only in the front area - was there 3 nights - price was very good for the location etc..", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r172565758", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Old fashioned but OK", "review": "We had trouble finding the hotel after our arrival by train from Rome. But once we found it we were thrilled. The common room, lobby, upon your entrance, was welcoming and cosy with free wifi. The counter staff were helpful and friendly. We were on the first floor (2nd floor for Americans) with our room having one window which opened into an inner courtyard. Florence had been very hot but our room was comfortable with excellent air con. The room was fabulous with a large bed, huge wardrobe, plenty of drawer space and an excellent en-suite. The breakfast was delicious with good quality  fresh foods. A nice selection of breads, yogurts and fruit. Some meat and cheese as well. Juices were fine. Coffee good.", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r172053971", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "fabulous hotel in the very heart of the city", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r171007425", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good location", "review": "this hotel was great value for money in the very heart of Florence - rooms are basic with AC and a mini bar - fresh towels every day and breakfast was plentiful for continental. Also free wifi would book again in a second-fabulous", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r170555581", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great Location", "review": "A very good location near to the train station and to the key attractions in Florence. The room was fairly clean but spacious, there was a poor selection of television programmes. The breakfast was good and the staff were friendly.", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r170341058", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "This is a haven in Florence", "review": "Less than five minute walk from train station.  Within walking distance to the major Florence attractions.  Hotel shows its age but rooms are clean.  Reception staff friendly and helpful.  Breakfast is the typical continental breakfast expected for a hotel at that price range.  Great variety of restaurants and grocery stores just outside your door steps.", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r169944975", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Perfect location. Could be cleaner.", "review": "We had an unplanned stop in Florence (due to illness) and were lucky enough to get a room in the San Giorgio, which is very near the central station.   The room was big, airy (with A/C), quiet and very clean, and so was the bathroom.   However the crowning glory, for us, was the attitude and caring approach of the staff, who could not have been more helpful.  The hotel is excellent value for money, and we're looking forward to returning soon for a longer, planned stay in Florence.", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r166847606", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 2, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "No more please!", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r165748917", "sub_review": {"Value": 1, "Location": 1, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "great location", "review": "This was the worst stay in Italy. 1) Only one good point - location, 5 mins walk. 2) Located next to an empty block, you will have a strange smell before entering the hotel every time.  3) This hotel design is like 80's, renovation is needed, The room, bed, bathroom were like using for years... I feel itchy during my stay... 4) The world heaviest hotel room key was returned to the reception everytime before you're leaving the hotel, however, no identification checking is required, just tell your room number.  Good luck to your belongings in the room. 5) Auto alarm 5:45am - by auto turning off the air condition due to drop of temperature, you will feel hot in the room and wake up. 6) However, breakfast starts 7:30am (noone would mention to you until you came down at 7am for…", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r164214739", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "The best located hotel in Florence and best service", "review": "This is the third time we have stayed at this hotel. The location is terrific. It is close to the train station and to shops, bars and restaurants. The hotel is not incredibly luxurious but the rooms are clean and comfortable. It is also quiet. It is also close to bus stops. The staff here have always been very helpful. The breakfast is excellent value for money and provides a variety of foods. It is close to many historical sites and to the wonderful, bustling maket.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r161167255", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Centrally located hotel", "review": "We stayed for the bank holiday The staff were so helpful polite and accommodating fantastic breakfast rooms were very clean and quiet and the hotel was so central we could walk everywhere This is where y need to stay if u want to go to florence", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r160693942", "sub_review": {"Value": 2, "Location": 4, "Sleep Quality": 3, "Rooms": 2, "Cleanliness": 2, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Wonderful time at the San Giorgio Florence", "review": "This hotel is easy to find, close to center Firenze, but it is worn out hotel, needs renovation. I was there in april 2013 with my wife, we enjoyed the trip, we were a little disappointed with the quality of the hotel. The staff was friendly and helpful, like in other hotels around the World. But for the Price of the rooms and what we got, that didn't add up. The breakfast was ok, it wasn't rich, but edible. Many room turn towards the street and it is so noisy until 11:30pm every day, that is a huge minus. If you want an central placed hotel, with 5 minutes walk to the dome and shopping streets, then this is the place.", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r159642248", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Quiet but close to the transport hubs", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r159629023", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great location, friendly and helpful staff", "review": "We stayed for 3 nights and found the staff extremely polite and helpful. The hotel is wonderfully situated for all the main sights and the central market. We had a room on the 5th floor and walked through the upstairs Sitting Room to get there. The view of the Duomo from there is great.", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r159070133", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "Perfect 2 star hotel for exploring Florence", "review": "Stayed here for four nights before heading off to Pisa. Very friendly and helpful staff who gave us lots of information about things to do and we could also purchase tickets for various excursions from the desk which we took full advantage of. Rooms were clean, slightly run down and old fashioned but clean non the less. Very small bathroom though and found myself twisting around a lot in the shower and I'm an average sized woman so would have been interested in seeing how a 6'2 man would of coped! Non the less it was clean.   Nice little view overlooking the square and could just see the top of the dome in the distance. No tea or coffee making facilities which was disappointing. Very very quiet at night time except for the occasional flushing of toilets from next door (walls…", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r158394305", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Amazing staff", "review": "We've stayed here before and didn't hesitate to stay again for three nights. It is a perfectly adequate hotel at the price. Staff are friendly and helpful. Hotel is clean, functional, en suite and fairly standard buffet breakfast. Perfectly placed in walking distance of the station and for exploring old Florence on foot. Had a TV which was a bit unnnecessary because you dont go here to stay in your room. Dont expect a view other than whats outside. Could have done with a kettle and tea coffee makings. Rooms are no smoking but corridor stank of smoke.Recommended as a budget hotel.", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r158168458", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Good Value For Money", "review": "FIRST. DO NOT CARRY ALL YOUR MONEY WITH YOU IN A BACK PACK. CARRY IT BACK TO FRONT. I.E. YOUR BACK PACK ON YOUR FRONT. BE WARNED. LOST ALL HOLIDAY MONEY.WHAT AN IDIOT. Pick pockets rife In Florence. Hotel staff amazing. Contacted my holiday company citallia. Rep contacted me within two minutes Given lots of help to sort out cash loss. Obtained replacement cash within 12 hours  Hotel right in the centre of Florence 10 minute walk from station. Room not huge but adequate spotless linen and towels excellent beds very clean.room and  shower room very clean. Could do with updating but you only sleep there. Felt safe and very comfortable for a single senior citizen travelling who aught to have known better. Would have given five star if had been more up to date.", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r157171557", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Friendly, but shabby", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r156987841", "sub_review": {"Value": 2, "Location": 3, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Shabby not chic, but a very friendly hotel", "review": "This hotel was far below our expectations. While the staff was very friendly and helpful (hence 2 stars instead of 1), the room was horrible. The best I can say is that it was clean. We had no hot water in the morning, the bed was hard as a rock, and the walls were so thin we could hear everything going on around us all night long. Worst night of sleep on our trip; thankfully we only stayed 1 night. In addition, there were problems with the toilet not flushing correctly (took about 10 tries before it worked). Breakfast was ok, but very crowded and tightly packed, which would have been ok if the staff kept food and plates stocked, but they didn't.   The hotel was on the level of a Motel 6. Would not recommend to anyone.", "date": "March 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r155980420", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 2, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Value for money, safe, homely base in Florence", "review": "The staff here are very friendly and its location is great.  Good places to eat nearby including a vegetarian restaurant called IL Vegetariano (10 min walk) and small friendly place a few doors away called La Padellaccia. At the hotel the breakfast was plentiful, although no fresh fruit. Coffee comes from the kitchen in a jug and is far from perfect!! If you prefer tea with boiling water and a teapot - forget it! Good sized room but not as nice as its photo on their website. Comfy, clean bed. However the carpet in our room was not clean before we arrived but it was hoovered the next day. The wall paper was grubby and coming off the walls in places and one of the sliding wardrobe door handles was missing. People in the next room were smokers and the smell came through the wall…", "date": "March 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r155844439", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "", "rating": 5}, {"title": "A true taste of italian hospitality", "review": "Stayed here with a friend from 24th to 27th March. Informed the hotel that we would be arriving late at night and immediately received a reply from Filippo (at 3 am!) confirming our late check-in.   Upon arrival, we were checked in quickly. The staff is very approachable and efficient. Their lady cook made fresh delicious bread every morning and also served us coffee. Breakfast options were sparse (bread, one type of ham, cheese, cereals), but is enough to get you through half a day if included in your room package. If not, there are lots of options a few doors down from the hotel entrance.  The hotel's location is awesome; it only takes about a 5 minute walk (less if you walk faster or have longer legs) to reach the Firenze Santa Maria Novella Station, and there are subways…", "date": "December 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r152439193", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nice hotel in great location", "review": "Hotel San Giorgio was the highlight of our three days in Florence. My wife got sick and i was impressed by how the entire staff and the owners Cristina and Chiara helped us though doctors and pharmacies. The hotel is so charming full of welcoming vibe and clean. The location couldn't be better with all the historical center within walking distances. We'd definitely recommend hotel San Giorgio  for a pleasant and enjoyable sojourn in belllissima Firenze.", "date": "February 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r151964346", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great Hotel in Florence", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "January 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r150628216", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Old but,service is not but", "review": "We stayed here for three nights in January 2013. The room and bathroom were clean. The room was small was fine. The beds were very comfortable and there was free wi-fi in the rooms. The breakfast was very good and the staff was extremely  helpful. The location was convenient to everything. Would definitely stay here again.", "date": "January 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r148952157", "sub_review": {"Value": 4, "Location": 4, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "", "rating": 3}, {"title": "Cheap hotel with an amazing location", "review": "Station is 5 min by foot. It is good. But, water of shower is so poor. It takes 20min to put water bus tab full. The room is not bad, it cost about €65 per doubul Bed room.  駅からはとての近いですが、バスタブに水を溜めるのに20分ほどかかり、シャワーの水の出も悪いです。お値段は安くてサービスも良いです。 ", "date": "December 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r147686937", "sub_review": {"Location": 5, "Rooms": 3, "Cleanliness": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Beautiful Florence", "review": "This hotel is the standard 3-stars hotel in a big city. Clean, simple and cheap. I had already a similar experience in Florence. San Giorgio is 2 minutes far from the Train Station and 5 minutes far from the Dome of Florence. It's perfect to enjoy the center of this amazing city, especially if you're going to spend your time walking and visiting art gallery and museums. Not far from there, there is even the district of the Market (Borgo San Lorenzo), where we've found many good restaurant. So the location is perfect. The hotel is clean but a little old-fashioned, they should think about some renovations (cracks in the walls, old furniture). I dont want to give \"4 stars\" because we had several problems with the lock of our door, immagine to back from a looong day and to fight…", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r147360433", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Perfect Location", "review": "We were in Florence 6 -11 October 2012. This is not our first trip. Each time choosing a hotel we stay at San Giorgio. Lovely staff, good breakfast, clean rooms. 10 minutes from the center, 3 minutes to the train station. Perfect location for those who like to travel to Italy!", "date": "December 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r147226536", "sub_review": {"Value": 5, "Location": 5, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "just the job", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r146752828", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great location, very helpful staff!", "review": "two minutes from the rail station, perfect for those who fly to pisa and then transfer to florence by rail. clean, friendly, helpful and close by everything you would want to see in this city on a mini break. we were very fond of the old fashioned reception area, it even has a post box for posting cards and a little telephone kiosk, best of all there's always someone around to help you. breakfast a bit basic, but the indoor market is just two minutes away and there's a choice of anything you might like to eat at good prices. we came here in july 2011.", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r146508475", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Super Central VS Super Old", "review": "We stayed at the San Giorgio for four nights in late October, the location was fantastic.  Lucca, at the front desk, spoke very good English and was tremendously helpful.  Our room was small, clean and quaint; we were only there to sleep so we didn't require much more.    The breakfasts each morning were simple but plentiful.  We had a small problem with the shower and reported it when we left in the morning, when we arrived back that night the problem had been resolved.  We couldn't believe the location - it was the best; close to the train station, all points of interest, shops, museums, great restaurants, the Duomo and the starting point for many of our tours.    We would highly recommend this hotel for it's wonderful staff and location!", "date": "January 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r144850062", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Near train station, central location", "review": "We were surprised by the location. Three minutes walk from the train station and a few blocks from Duomo, museums, restaurants and shops. Now, the cons. When we check in, the receptionist was very moody, looked like a psyco-killer or a creepy butler. Staff not friendly at all. I was afraid to ask him later how to turn the old shower on (which, by the way, smells like gas!!). Our room was comfortable and clean, but it's all pretty old. On one day during our stay, just the light of the buiding ended. I think they need a makeover. But in Italy it seems that the older, more pride they have in their facilities ...", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r144632803", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 2, "Rooms": 3, "Cleanliness": 2, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Nice location helpful staff", "review": "The hotel was close to the train station and easy to find. Staff was nice and their breakfast was great. But our room was old, dark and smelled bad we had to have the window open the entire time. Next time I visit Florence I would choose another hotel.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r142966538", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good location", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r142185086", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Great Location", "review": "We received a warm welcome upon arrival and the staff were most personable. The hotel is in a good location for train travellers and close to major attractions. The biggest problem we had was the AC ventilation appeared to circulate cigarette smoke from another room. Not good for a friend with sensitive allergies. Breakfast was basic but enough to get us started for the day.", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r141948229", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Location good but hotel is not great", "review": "The hotel is very close to the train station.  The front desk personnel were very friendly.  Luca spoke English and was very helpful in telling us about tours and restaurants.  The rooms are small but we were only there to sleep and the bed was great.  There was a minibar and a safe in our room.  Although the bathroom was not very large, it was adequate.  I would stay there again.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r141752461", "sub_review": {"Value": 2, "Location": 4, "Sleep Quality": 2, "Rooms": 1, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Good Basic Hotel in Florence", "review": "The location of this hotel was very close to train station. However, it lacks a lot in other areas. The rooms are very small and bathrooms were cramped. If it cooled off below 80* at night,they would turn off air conditioning. This would be ok if they had windows that opened properly. They had no window screens and good air flow was very bad. The staff was polite and rooms were clean but very old and out dated for the price we paid. This hotel needs to be update very badly. We complained about the size of our room and was moved to a larger room within 3 days of our 7 day stay. It was larger but no better in style or bathroom size. LBD50", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r141669207", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "OK & Good location", "review": "We stayed at Hotel San Giorgio in a twin room on bed and breakfast basis. The room was a reasonable size. The twin beds had good mattresses and there were some nice antique pieces of furniture. Room was clean although carpet showed signs of wear. There was a minibar but no safe. There was air conditioning but we didn't use it as not needed.  The bathroom was a good size with hairdryer, sink, bidet, toilet, shower. We had a small sit in bath which was really appreciated at the end of a long day walking.  The hotel is nice, in a good location (5 min from station) and has free wifi. The staff are helpful, providing extra pillows on request. The breakfast is fine.  The only issue was some building noise between 10am-6pm but as we were mainly out it was not a problem.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r141669165", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 3, "Rooms": 2, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Very tired looking hotel", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r141516236", "sub_review": {"Value": 2, "Location": 5, "Sleep Quality": 4, "Rooms": 2, "Cleanliness": 2, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Brilliant", "review": "We stayed here for 2 nights. Our room was very dark and dingy, with a cramped bathroom. We had a view of the back of the hotel which wasn't great! The lift was minute, and the corridor walls were very tatty and a yucky brownish colour which really didn't go well with the green carpet. The whole place could just do with redecorating to give it a lift. The breakfast room was a vile yellow, and breakfast itself wasn't as good as it could have been. The wifi wasn't anything to shout about either - very sporadic. The website also states that hairdryers are provided - we had to ask for one, and received the tiniest hairdryer I have ever seen in my life! The staff weren't exactly overfriendly either. All in all, a place to sleep - not exactly horrendous, but just disappointing really.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r140162943", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Worst hotel ever", "review": "We are very sorry about your staing in our hotel....but as you saw everywhere ,we are restrutioning to fix for fire dept. You did not tell us nothing,and we check wifi in all the building  : it is ok... best regards", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r136763828", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 1}, {"title": "Very bad...", "review": "Four of us stayed for 8 nights.03/09/12 to 11/09/12. The rooms were clean & comfortable and I I cannot understand the comments made by PP & alexanderD71, the only thing they got right was the great position of the hotel. Trains & buses nearby & the main sights within walking distance. Our rooms were cleaned very well each day. The breakfast was very good including the service from the breakfast lady! The great plus for this hotel however was the excellent help we received from reception. A special mention to Luca & Oliver who made are holiday a success by helping us organise our sightseeing days. Well done San Giorgio Hotel I would love to come again!!  Peter F.", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r136701152", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 1, "Rooms": 2, "Cleanliness": 1, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Another super stay", "review": "I spent 3 nights in this nightmare. Only good thing about this hotel is its location. Anything else is substandard. Dirty wallpapers and rooms, mouldy bathroom, disgusting shower head and the free wifi doesn't work. Not even in the lounge. Someone mentioned the dinner lady who serves the breakfast. Yes she does mumble all the time and not nice at all.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r136502539", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good.", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r135840086", "sub_review": {"Value": 4, "Location": 5, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "An Old-World Hotel in a Great Location", "review": "Good value for money.  Excellent location. Three mins walk from the train station.  Comfortable bed. Toilet was clean. Breakfast was good- croissant, tea, coffee, juice, yogurt, cheese, prunes, peaches, and etc.  Free wifi only available in the lounge which can be quite inconvenient.  Free luggage storage after checking out which was very helpful :) Overall quite good :)", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r134069235", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "The smallest bathroom we have had in a hotel.", "review": "My husband and I enjoyed our stay at the San Giorgio.  The room was spacious, the bathroom was large enough--I am tall and had no problem with the location of the toilet next to the shower-- and the armoir was roomy enough for both my clothes and my husband's clothes.  The buffet provided an assortment of goodies--boiled eggs, granola-type cereal, meats and cheese, rolls, croissants, and juices. My husband did enjoy the decaffeinated coffee--some of the best he has ever tasted.    The hotel is in a good location.  It's within walking distance of just about everything one needs to see.  The shopping, though, was really a plus.  There were tons of small restaurants, trattorias, tavola caldas, and cafeterias about.  There is an ATM--Bancomat--right outside of the hotel, and there…", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r133742230", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "I stayed here June 23-25 2012 for my step-daughter's wedding", "review": "Stayed here as my wife stayed here a few years ago when she was single.Conveniently located, walking distance to most landmarks. On check in, staff were helpful and pleasant. Our room was clean, however had the smallest bathroom we had seen. The problem was the glass shower screen. It opened on the corner meaning you almost had to soap yourself up to get in as the opening was not wide enough and I am not a fat person. My wife scolded herself as she turned around, knocking the mixer tap to full hot. Very easy to do due to the lack of space.This shower screen also meant you could not sit on the toilet as your knees bump in to it. I ended up using the bathroom at the end of the corridor. They need to replace the screen with a curtain and all would be fixed. Breakfast was fine, lots…", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r132941058", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Very Disappointing!", "review": "This hotel is conveniently situated very centrally, near the main railway station, but is in a quiet side street. The nearest landmark is the Hotel Baglioni - stand in front of it and look to your left and you will see 2 streets...San Giorgio is at the near end of the left most one. You may even see its projecting sign. It is a very basic hotel, television and phone in room, but no clock or kettle. Air conditioning is just about adequate and not too noisy. Don't expect a view as many of the rooms look onto a little courtyard at the back, but at least you would have no traffic noise. Breakfast is basic, served between 7.30 and 9.30, cereals, whole milk, croissants, hard boiled eggs, ham, flavoured yoghourts, tinned peaches, prunes, tea and coffee etc. I found the front desk very…", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r131659732", "sub_review": {"Value": 2, "Location": 4, "Sleep Quality": 3, "Rooms": 2, "Cleanliness": 3, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "San Giorgio e Olimpic - Dump!", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "March 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r131037604", "sub_review": {"Value": 1, "Location": 1, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Great value for money and brilliant location", "review": "Please, please, do not even attempt to stay at this hotel.  It is a complete and utter dump.  My girlfriend and I checked into this hotel in March of 2012 only to find the room to be completely unacceptable!  Stains on the bedspread, stains on the carpet, mold on the tub and shower curtain which was hanging by a metal clothes hanger (no shower just a curtain around a tub with a hand held shower head), water stains on the ceiling from a leaky roof, water stains on the walls and on the pictures on the walls, brown matter on the rug ( I can only guess what this was!). The halls getting to the rooms were so narrow we had to hold our suitcases sideways to get through. The pictures on line look nice but don't be fooled.  This hotel is something out of the 1940's and hasn't been…", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r130339957", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "EXCELLENT HOTEL AND PRICE", "review": "We have just returned from a week at the Hotel San Giorgio in Florence. This is a spotlessly clean, rather old fashioned and very friendly little hotel perfectly situated for exploring the old city of Florence.  It is located about five minutes walk from the central railway station, perfect if you are flying into /out of Pisa airport. A few minutes walk the other way and we were straight into the historic San Lorenzo district and a brilliant market. The room décor was quite basic and a bit 'tired' but spotless and the room was cleaned and serviced every day while we were out. Breakfasts were the typical continental style you expect in Italy/France/Spain etc with cold meat, cheese, eggs and bread rolls/croissants plus cereals and juice.  There are loads of great little…", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r130113014", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "good for disabled travellers", "review": "OUR  arrive was very friendly and we were given a map and told where everything was without haveing to ask   WEstayed for 4 nights in room 360 which was very clean and bright bathroom also very clean and bright with lots of hot water and the towels and bedding  was lovely and white and soft . breakfast also good tea coffee jucie rolls jams ham cheese eggs friut help yourself so no need to go hungery . .  there also a nice lounge to wait in and they we look after your cases for you  as for postion of this hotel its mins away from bus and rail stations and near most attractions  ladys beaware you have to walk through the market to get to most things and its full of lovely leather handbags and coats turn left out of hotel and left again and you will come to trattoria da guido …", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r129776612", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Excellent hotel and price", "review": "I took my elderly disabled father to Florence and we stayed in this hotel. Most important for me was to get Dad safely around the hotel, his bedroom and bathroom. The disabled room (#107) was on the first floor, serviced by a small lift which was very close to the room. A slight step up to get into the room and then another slight step within the room. All in all it was easy to get my father around in his wheelchair. The bathroom was large and featured an open 'wet room' style shower with seat plus wc with grab bars - very easy to circulate around.  The best aspect about staying here were the staff who were always very helpful to my father and I. For example they always offered to take out a wooden ramp to the front door to help me negotiate the step leading into the hotel  with…", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r129381387", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Florence- The Rennaissance City", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r128899622", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Second stay at the hotel", "review": "Very centrally located. Very close to the Railway station and the historic city. All the main historical sights are within walking distance. The pick up point for the city tour and other day trips is very close. The room was clean  but not very spacious. The corridor leading to the room was very narrow and dark. Breakfast is reasonably good .  The staff at the front desk were courteous and helpful. Our stay in the hotel was  comfortable and we enjoyed our visit to Florence.", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r128569464", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great Location", "review": "I first stayed at San Giorgio Hotel in August, 2011 and was impressed by the staff, location and everything. The hotel is very well located and close to everything from the main train station (Santa Maria Novella), Santa Maria Novella Church, San Lorenzo, the Duomo to the Uffizi Galleria. Staff were very helpful and  tried to help us in anyway they could though we did not speak the same language (the ladies at the breakfast room). Overall, it was another lovely stay and I would recommend it to everyone.", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r127827000", "sub_review": {"Value": 4, "Location": 4, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great location...noisy at night.", "review": "We stayed for five nights and found our room comfortable and clean.  The staff were all very helpful and friendly.  The location is great.  Walking distance to the train station and close to all that Florence has to offer........  sights, good eating places.  Basic but good value.", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r127413351", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "No sleep", "review": "We recently stayed here on our tour through Italy. Front desk staff are helpful and friendly. Elevator moves at the speed of a turtle, and is very small. Breakfast is average at best...get there early or all the tables will be dirty. You are right in the centre of all the attractions...minutes to the duomo and David. Hundreds of restaurants to choose from all within minutes. Our room faced the street and was rather loud at night. We had to keep the windows open as I couldnt figure out the fan/air system. All in all good stay. Hint...(we could have known about this earlier) hand your key into front desk every time you leave! The thing weighs 10 pounds. We found this out on day 3 after lugging it around  everywhere.", "date": "March 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r127317621", "sub_review": {"Value": 2, "Location": 5, "Sleep Quality": 1, "Rooms": 2, "Cleanliness": 1, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Great location", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "March 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r126829343", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good for what it is - wouldn't be my first choice", "review": "This hotel is in a perfect location, right next to the train and bus station and near to all the attractions in Florence.  Although it was close to all amenities it was very quiet at night.  The room was clean and the bed was comfortable.  However, the bedroom furniture had seen better days and had glass tops had sharp edges so be careful.  The staff were all friendly except for the breakfast maid who was slow at refilling empty baskets and asking if you require tea or coffee.  The breakfast was basic but acceptable.  I would recommend this hotel as it is so well located but only if you are staying a couple of nights.  Florence itself is the most romantic city and there is loads to see and do.", "date": "March 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r126471848", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 3, "Rooms": 2, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Good Hotel", "review": "I stayed at San Giorgio e Olimpic in Florence for 4 nights.  It is very close to the train station and very conveniently located in general.  It was clean and the staff was very courteous.  My room was rather small and there was no safe for storing valuables during the day.  One day there was no hot water in the morning at all which was horrible!  However, for the price and the location, it's a safe, decent choice if you are travelling to Florence.  Breakfast was included and it was average.  My favorite amenity was the free WiFi.   Overall, if I had to stay here again, I wouldn't complain but it wouldn't be my first choice.", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r123027023", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very close to the train station, clean, great staff.", "review": "Good place. Warm welcome,  location near train station, near supermarket. room big and comfortable.", "date": "January 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r122968408", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Cosy hotel in a convenient location", "review": "We had a triple room that was very spacious.  Bathroom was clean and large with a tub.  Not the most updated hotel around, but for the price it was excellent.  We were supposed to stay the the Rex Hotel, owned by the same operators, but our room there had a leak in the ceiling so they put us up here.  Location is 1 block from the train station.  Front desk staff was very helpful and pleasant.  Breakfast included was average.  Free wifi.  They held our luggage in a room for 6 hours on our last day there which was great.  Would defintely stay here again. Great value for the price.", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r122210867", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "an ideally located hotel", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "January 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r122115141", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great location", "review": "This Hotel is close to the Florence railway station and at the entrance to old Florence. It is excellently located and has a old charm of the 300 hundred year old hotel (well the clerk says the hotel was built in the 17th century). Its not a grand hotel, but is comfortable and just is really well located. Restaurants and shops are a 2 minute walk away.  The rooms were large enough with good bedding and nice bathrooms. Breakfast is pleasant continental fair but not a wide selection. However Florence is such a beautiful city that you dont spend any time in the hotel. I recommend this hotel, I would stay there again.", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r120396503", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Wonderful old world hotel with all the amenities of the modern.", "review": "Fantastic location , 3 min walk to duomo 2 mins from train station . Probably one of the best standards of accomodation in florence without paying ridiculous amounts of money . Staff lovely .", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r120135109", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice place", "review": "So close to the train station made this a wonderful choice and the fact that it was also right by the hop-on, hop-off bus stop was a bonus.  Easy walk to everything we wanted to see in Florence and safely nestled on a street that was a bit slower than the others nearby.  Boutiques and street fairs close by - loads of restaurants and within walking distance of the meeting points of many tours.  We were delighted by the friendly staff and clean, private room.  Spacious but no wasted room.  Adequate for several days while on holiday.  Good value.", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r120007863", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great location Poor Hotel", "review": "The hotel is quite centrally located and under 10 mins walk from the train station and within walking distance to many of Florence's main \"attractions\". The hotel staff were friendly and helpful. Very courteous, they also helped us decide suitable day to visit PISA which was on our itinerary . We made a day visit to Pisa and were glad that the hotel staff recommended best option to travel instead of opting a tour . They can improve their breakfast spread but honestly by then My husband and I had quite stop complaining about the quality of breakfast being served in France and Italy :)  rooms , they should consider improving/ refurbishing, rest all is good .", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r119251284", "sub_review": {"Value": 2, "Location": 5, "Sleep Quality": 2, "Rooms": 2, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Average hotel but very centrally located", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r118823528", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Convenient and clean", "review": "The main advantages were proximity to the train station and the Duomo and free unlimited wifi.  Other than that the hotel was very average.  It's ok for a short stay 1 to 2 days, it's not very modern and breakfast was not good, breakfast staff were unhelpful.  Still if you're going to be out sightseeing most of the time, it's very centrally located and please do consider it.", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r118783476", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Great location, helpful staff", "review": "This hotel is in a very good location - a few minutes from Santa Maria Novella station and five minutes to the centre of Florence. It's clean and quite comfortable but a little down at heel. Staff were fine and breakfast was satisfactory. Good value generally.", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r118154127", "sub_review": {"Value": 3, "Location": 5, "Rooms": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Fantastic location", "review": "San Georgio And Olympic proved a very good choice for my stay for two nights in Florence this July. The hotel scores on location, price, comfort, breakfast and a friendly and efficient staff. In a city like Florence which has to be experienced on foot, what more does one want? While functionally modern, it also has some quaint features that befit Florence.  The Santa Maria Novella train station is a three-minute walk, the Duomo five minutes away and the cluster of Uffizi Gallery, Ponte Vecchio, Museo Galili as well as Accademia within a radius of 15 to 20 minutes of leisurely walk. Perfect location.  Book in advance and you'll find the price reasonable for Florence where hotel rates are comparatively high.  The entrance is spacious and decorous though fading somewhat. The coffee…", "date": "March 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r117769087", "sub_review": {"Value": 5, "Sleep Quality": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good location, helpful staff, great air-con!", "review": "We booked a cheap 4 day/3 night break with Broadway Travel for £130 each including flights and couldn't have been happier with what we got. The location is fantastic, just 5 minutes from the station and close to all the major attractions. Our room was clean although a little tired in places but the sheets were crisp and white and that counts for a lot with me. The breakfast was a selection of juices, yoghurt, fruit, cereals, rolls, meat and cheese with tea or coffee and was ample to set you up for the day. The staff were friendly and helpful. The only downside was that our room was on the 1st floor at the front and there was a fair bit of noise at night with people walking past shouting and laughing. They offered to move us the very next day as soon as they had a spare room but…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r117279411", "sub_review": {"Value": 4, "Sleep Quality": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great, stylish, perfect location, definatly recommend!", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r116287010", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "fantastic location and value!", "review": "Hotel is in the heart of the city like a small palace! 5 min to the train station.  lovely design in room and in reception area, homey,cosy atmosphere. Great breakfast and the best coffe in all town! clen room and bathroom, comfortable bed. Polite,helpful and caring attitude from staff at the reception. Highly recommend! I just want to come back!", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r115210486", "sub_review": {"Value": 4, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Fairly basic with limited frills", "review": "Dear sirs,                we thank you very much for your nice review.  You will be always welcome in our Hotels.", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r114831747", "sub_review": {"Value": 3, "Sleep Quality": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good location", "review": "myself and my partner stayed at the San Giorgio for 4 nights in July and we had a very enjoyable stay.    First of all the hotel's location is great, under 10 mins walk from the train station and within walking distance to many of Florence's main \"attractions\". The hotel staff were friendly and helpful.   We had to move rooms when we arrived due to noisy building work next door and the staff were happy to move us and did so very quickly.  Our 2nd room was actually bigger so that was a bonus! Our room was basic and in need of a refurb', but it was clean and comfortable.  the hotel breakfast was plentiful with lots of choice.  Overall i would recommend this hotel.   Helpful and friendly staff, great location, clean and comfortable.", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r114743710", "sub_review": {"Value": 3, "Location": 5, "Rooms": 4, "Cleanliness": 3, "Service": 3}, "travel_purpose": "", "rating": 3}, {"title": "Very good location", "review": "Dear sirs,                we thank you very much for your nice review.  You will be always welcome in our Hotels.", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r113473097", "sub_review": {"Value": 4, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Perfect location, nothing fancy, very comfortable", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r113201422", "sub_review": {"Value": 4, "Sleep Quality": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "central location, comfortable stay", "review": "The final stage of our honeymoon was in Florence - where we stayed at the San Giorgio, which is a 5 minute walk from the train station, in a quiet back street. The location is perfect, as you can walk to the Duomo in 5 minutes, and the Ponte Vecchio bridge in 10 minutes.   On arrival we were told that we had been booked in to a twin room but it was no problem at all to transfer us to a double room. For a city hotel on a budget, the room was more than big enough, with a good bathroom and the added bonus of a balcony too.   Breakfast was more than adequate and the staff were always on hand to help if you had a question. Great hotel to relax and enjoy Florence from.", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r112862702", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "It really needs to be refurbished", "review": "Set a 2 minute walk from the station and a 5 min walk from the central attractions this was location perfect.  The hotel generally looks somewhat tired and could do with some upgrading in parts.  Hotel staff were efficient, but not engaging - a complete contrast to our experience in Venice.  We had a family room - it was large and clean and the beds were comfotable, although the windows were very difficult to open without fear of breaking them.  Breakfast was very basic, but plentiful.  In such an expensive city it met our needs.", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r110998733", "sub_review": {"Value": 3, "Sleep Quality": 5, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Don't stay in Room 381", "review": "When my husband and I arrived to the hotel we notice that the décor and furniture of the room looked tired, but we were fine with it because the hotel is very close to the main attractions, the room looked clean and the staff seem friendly. The problem was that when I took a shower, the shower's door didn't close properly and the water went through, making all the floor wet. I told to the person in reception, but he just said to me that he was alone and couldn't leave the reception to come and have a look, so offered to me to go to a closet somewhere close my room and take clean towels and put them on the bathroom floor. The following days, I keep doing it but apart from it, the rest of our  the stay was fine.", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r105174659", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Clean, simple, affordable and excellent location!", "review": "This hotel is near the station and the Duomo which is great when you have had to journey from Pisa Airport.  We were given room 381 which was dirty, smelly with  wall paper hanging off the wall and suspicious stains on the carpet and the oldest TV in Europe.  After complaining we were offered another room which was comfortable and clean with a much better view.  The staff varied enormously some were offhand while others were very helpful- so beware and if the hairdryer in your room does not work they have one behind the reception desk. For a short trip to Florence at a reasonable price it is ok. Just remember to complain if you get room 381.", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r104891971", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "only one star not 3", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "March 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r102315684", "sub_review": {"Value": 1, "Location": 3, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "a fair hotel - you get what you pay for.", "review": "very dissapointing hotel, i got the worst room with no fridge, tiny tv, uncomfortable as i could feel the mattress springs on my back and no heater was working untill the hotel switched it on on certain times,  staff  was unhelpful. The only good thing is the location ..... i wont come back to this hotel!", "date": "March 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r102000540", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good depending on what room you get!", "review": "my wife and i decided on a long weekend to florence and found this hotel on the internet. flew into pisa and took the train on to florence. very well situated from the railway station. on arrival, we found the staff very friendly and welcoming. the room itself was a good size but looking a little dated with a rather boring view onto a roof and tiny courtyard. the breakfast were the usual continental fayre, but the coffee was below standard (in the italian sense). all in all, an acceptable hotel unless you are looking for 4 or 5 star luxury.", "date": "March 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r100750616", "sub_review": {"Value": 3, "Location": 5, "Rooms": 3, "Cleanliness": 3, "Service": 4}, "travel_purpose": "", "rating": 3}, {"title": "Wonderful location, a bit faded but very clean, staff amazingly helpful", "review": "Arrived early March. Very good hotel location and very close to Railway station and connections from Pisa.  First room we had was terrible, White stain on the bed, dirty mirror, old bathroom.  Complained and was shown two other rooms, much better. Lots of reviews on here seem to vary depending on the Rooney and it certainly does vary!  Get a nice room and it's all down to luck, youll be fine, a bad room you will be complaining!  Have fun!", "date": "March 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r100624771", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 1, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Close location to train station", "review": "This hotel could scarcely have been in a better location........ 5 minutes leisurely walk to the Duomo, 10 to the Uffizi and the Ponte Vecchio.  And just around the corner from the wonderful S. Maria Novella church/square and the main railway station. True, the place could benefit from a spruce up.... the wallpaper is peeling off in many places, there are scuff marks on the walls and definite signs of wear on the carpets.  The bedroom furniture is slightly shabby and the televisions are very old fashioned.  The bathrooms have also definitely seen better days,  but everything was scrupulously clean and the down at heel interiors were more than made up for by the pleasant and helpful staff.  I was travelling with an elderly lady who became very ill.  They were extremely…", "date": "June 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r99661535", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Very well positioned!", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "December 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r95637393", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "#1 for location and on a budget", "review": "This was my second stay at San Giorgio Hotel (first stayed in 2005). The hotel has a convenient location at the beginning of a very narrow street, being located walking distance from Duomo (4-5 min) and very close to the Santa Maria Novella train station (2-3 min) and SITA bus station for regional day trips (quite hidden in the courtyard of a building just opposite the train station). Taxi from Peretola airport takes you probably 15-20 minutes at a flat price of EUR 22 + bags charge. Although located close to the train station, there area seemed quite safe as long as you behave properly.  The hotel is an old fashion type building, similar as the almost all other hotels that can be found within the historical center (some of them even looked poorer when saw them from the…", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r92707617", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Lifesaver considering road conditions and cab availability upon our arrival.", "review": "We stayed here in September 2010 only for 1 night.  The hotel was very easy to find, it was a simple 5 minute walk from the train station. The location of the hotel is great. You are only a few minutes walk from anywhere in Florence and the little cobbled streets are like a maze, so you can get lost if you really wanted to.  We got a twin classic room, Room #111. The room was not huge, but still an ok size for a European Hotel. The bathroom was ok for the standard of hotel it is. The light wasn't working, so I told the reception and they sent someone up to replace it - no big issue. I am not too sure if the air conditioning was working as the next morning our room was very hot and stuffy, but we still got a good night sleep. Our room faced the inside of the hotel, so when we…", "date": "December 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r91426217", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Lovely spacious room in this price range", "review": "We arrived in Florence the day after the \"huge\" snowstorm of December 2010. The streets, sidewalks, everything were covered in snow making walking, especially with suitcases, quite difficult. The line at the taxi stand was two blocks long. We were heading in town to a place closer to the sites that had availability. When we crossed the street and saw this hotel, we decided to inquire about rooms. They offered us a double for 65 euros, which seemed like a good price to me.   The hotel was clean and in good condition. Even though we'd already checked out, they let us hang out in lobby after a hard day of sight seeing and soggy cold feet while we waited until dinner. Then, after dinner we came back until we needed to leave to catch our night train to Vienna.   Given the…", "date": "October 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r86707209", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A nice friendly Hotel...", "review": "This was about our 7th Hotel on our whirlwind tour of Europe. By this stage we were really tired and just wanted to unwind.  It was great to have a big King bed in a quiet room at the back of the Hotel. We enjoyed the breakfast here alot, there was a great selection of cereal meats and breads and excellent coffee. For those travelling by Euro Rail this is a top choice as it is so close to the Station and easy walking distance to the Markets, Duomo Cathedral and other famous sights. The free wifi lounge was great and very cozy, a good chance to chat to fellow travellers. A few doors along from the Hotel entrance is a Restaurant Regina and its attached deli, we ate there each day and night the food was so amazing. We would stay here again for sure.", "date": "October 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r84556569", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "If you are a tall person, bathroom won't suit....", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "October 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r84214924", "sub_review": {"Value": 2, "Location": 3, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "A Very good hotel in it's price range", "review": "The paper thin walls let all kinds of sounds transfer between the bathroom of the adjacent room and ours;  the configuration of the bathroom was such that knees touched the shower wall; the carpet was old and we were glad to have had slippers; the room faced a pigeon covered roof and ventilation shaft.  Staff were great, breakfast was more than adequate. Would look for something else next time....", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r81819870", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Beautiful hotel, great staff and excellent location", "review": "We stayed here during mid September 2010 and the staff were very helpful. Breakfasts were good and filling (lousy fruit juice though) balanced by excellent coffee. It is very centrally located but within easy distance to rail and bus terminus, and within walking distance to just about anywhere in Florence. Rooms were clean and serviced daily, the bathroom more than adequate and we highly recommend - we will stay when we visit Florence during October 2011 - well done San Giorgio!", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r79340853", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent location and price", "review": "You won't be disappointed, this is a great hotel.  We had a beautiful room with a balcony overlooking the Arno River.  This hotel is 1/2 block from the Ponte Vecchio bridge in a perfect location.  So easy to walk everywhere in this beautiful, clean, safe city.  The staff was very friendly and helpful and the complementary breakfast was the best we had in any of the hotels in our 2 weeks in Italy.", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r78711437", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Not bad, not great...just way too warm!!!", "review": "This small hotel is very well located in Florence.  It was clean and the staff were very helpful in every way. I would definitely stay there again.  It is close to the train/bus station, so is very easy to get to.", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r76376368", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 2, "Rooms": 3, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Fantastic value for money - and spacious !", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "November 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r73110042", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very decent hotel & great location", "review": "We stayed here in November 2007.  Of all the hotels we stayed at in October and November 2007, this was by far the most spacious, clean by our standards and the location of everything was fantastic ! Unfortunately, I was unable to choose '2007' in the options available for this review - but I really wanted to add our review to this website. After several weeks of travelling, this hotel was our 'respite' and we enjoyed relaxing in our large room.  It seems we may have been lucky because after reading other reviews on this website, it appears the rooms vary considerably.  Anyways, we have booked to stay here in December for 4 nights, and we're hoping we get another great spacious room. Ah, and yes - the room was very quiet !!", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r72532838", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Dirty and falling apart", "review": "We liked the hotel , even  though the rooms were pretty small ( double bed deluxe room ). It is 5 mins walk from florence santa maria novella station. everything is nearby , even Mcdonalds. All the hop on buses are available near the hotel until 11 pm. Staff is very helpful and kind. Breakfast is Ok not much variety. One can stay there definitely if travelling with restricted budget.", "date": "May 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r72401705", "sub_review": {"Value": 2, "Location": 5, "Sleep Quality": 3, "Rooms": 1, "Cleanliness": 2, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "helped organize accomodations= family from 2 continents for my wedding", "review": "The San Giorgio in Florence has a great location close the to main station and close to the inner city. It is an ideal place to explore the city from. WiFi is free in the lounge room at the entrance and the service is okay. But unfortunately, these are the only positive things to say about this hotel.   Their website is completely misleading. Kudos to the photographer who managed to capture it in such a good light. From the the pictures, you might expect simple rooms with antique furniture, but it's just old and worn there. Our room was literally falling apart. The TV didnt work, a desk lamp collapsed, the blankets and the carpet were grey stained. Boards were coming off the doors and the floor. Everything in the room was damaged somehow and was in need of renovation. The room…", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r72395169", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Perfect Location!", "review": "I worked with several employees of the hotel, in particular Olivier, who helped plan accomodations beginning 5 months in advance. wedding planning is confusing and tiring in and of itself but they offered us good prices, comfortable accomodations and flexible arrivals/departure dates and last minute changes...our group was about 25 people!!!", "date": "February 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r71999384", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Hard to beat the convenience", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "May 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r69598306", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Fantastic Base - Fantastic City", "review": "We stayed here two years ago and had no hesitation coming back. The staff were welcoming and helpful; the room suitable for a 3 star hotel and although breakfast was busy the food and service were perfectly adequate. Every dish was refilled regularly. It's important to be patient. The location of this hotel is convenient to trains and buses and to many significant sites that visitors wish to see.", "date": "April 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r62512421", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "San Giorgio brand, unreal experience", "review": "My wife and I visited Florence and stayed at the San Giorgio & Olimpic for 3 days. We took the Terravision bus from Pisa (you should pre-book to avoid the scrum to get on the bus!) and arrived in Florence 80 minutes later.  The San Giorgio is a 5 minute walk from the Santa Maria Novella Train Station (where the bus stops), and the hotel is at the entrance of a side street just off the square.  The hotel was very clean and we were taken to our room (520) which was extremely spacious with 2 beds pushed together and a bed settee. There was a spacious wardrobe, a TV, a cabinet and a mini fridge. The bathroom was very clean and the room was cleaned daily.   Reception duties were split between a few staff and we found Piero the most helpful and friendly, although there were no…", "date": "February 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r58105909", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 4, "Rooms": 2, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled on business", "rating": 2}, {"title": "Convenient location, great value!", "review": "If you think to visit Florence think twice which hotel you want to choose. I have visited Florence by the end of February in a vacation, and stayed only 4 days. I've experienced the lowest temperature inside of a hotel. It is a glace hotel with only a ventilation system, not worming system. It is very well located, quiet, but with limited breakfast variety, no wireless coverage inside the chambers. I am not talking about the price, I am talking about the comfort of a 3 stars hotel. I am sorry, but i will never choose again this hotel. Chris.", "date": "January 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r55472568", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Firenze heart with good rates", "review": "We stayed for a week in this hotel and, although fairly basic, it represented great value for money. Our room was large, quiet, clean and comfortably furnished.  The bathroom was spacious, very clean with bath (shower over), large handbowl, loo and bidet.  Lots of hot water and fresh towels, toiletries and loo rolls were provided daily. The buffet breakfast was more than adequate with a choice of cereals, yogurts, croissant, rolls, biscuits, cheese, hams, jams, basket of dried fruit and walnuts, etc. plus big jars of tinned peach halves and delicious prunes!  Lots of choices of teas or fresh coffee. The staff were very friendly and helpful. The hotel is conveniently located for the rail and bus station and is only a short walk into the centre of Florence.  There are lots of…", "date": "November 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r49275472", "sub_review": {"Value": 5, "Location": 5, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "If you are on a tight budget, go for it!!", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r46976521", "sub_review": {"Value": 2, "Location": 5, "Rooms": 2, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Great Location Friendly Staff", "review": "It's cheap and it's conveniently located near Stazione Santa Maria Novella BUT that's where the good bits end.  The hotel's own website states that, \"A family run hotel the hotel is kept in very good condition and rennovated periodically in order to maintain the high standards it has always set.\"  I don't know when was the last time they renovated the hotel because we felt like we were staying in the Colosseum, i.e. everything was falling apart!  The furniture in the room was old; there was no safe; even some dinning room fittings were broken.  The hotel is not very clean either.  The bed-side tables and drawers in the room were dusty; I guess they didn't bother to clean it regularly and no guests dare to use them.  The first morning when we went into the dinning room, I…", "date": "October 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r46193578", "sub_review": {"Value": 4, "Location": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good Hotel", "review": "I am from Portland, Oregon and my girlfriend is from Munich, Germany. We had a great stay in Florence thanks in part to the hotel San Giorgio. The staff is very helpful and made our stay as pleasant as possible. For the cost the hotel is a great value because of its great location, breakfast included and free wifi throughout the hotels main lobbies on each floor. Florence is close to a river and this results in the area having many mequitos which we encountered in our room as well. The rooms are clean for Italian standards. If the tempature is hot the hotel will turn on the air conditioning at their discreation. Breakfast is served in a nice lounge downstairs with crossiants, cereal, rolls, yogurt,  ham, orange juice and the coffee is great. Would recommend staying here.", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r46026493", "sub_review": {"Location": 5, "Check in / front desk": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great location, friendly helpful staff, very tired-looking bedroom!", "review": "Our triple room was quite,  clean and spacious.  The attached bath was up two stairs,  clean and supplied with fresh towels and toiletries.  The cold buffet breakfast was okay.  The hotel staff was pleasant and helpful.  Its location is great.  Five minutes walking distance from the main railway station and also from the Duomo, Uffizi and other sights.", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r44947294", "sub_review": {"Value": 3, "Location": 5, "Rooms": 2, "Cleanliness": 3, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Comfortable accomodation with helpful & friendly service in excellent location", "review": "Can't fault the staff at the front desk who were very helpful and encouraging when I tried out my dreadful italian! Fortunately they all spoke english far better than I spoke italian.  The main lobby and lounge are nice enough. WiFi is free in the hotel. Strongest signal is in the lounge but I managed to upload photos to facebook from my room on the second floor.  Breakfast was good - it's buffet-style (as seems to be the norm in the parts of Italy I've visited) and pretty good quality....cereals, pastries, bread, meats, cheeses and yoghurts.  Our room left a bit to be desired - the wallpaper was peeling off the walls, the carpet was a bit worn and dirty (more through age than anything else) and the shower-room was pretty basic. It was a quiet room though, facing onto the…", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r44194854", "sub_review": {"Value": 4, "Location": 5, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Mixed reviews...perhaps should check out a few more places!", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "August 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r40748330", "sub_review": {"Value": 2, "Location": 4, "Rooms": 1, "Cleanliness": 1, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "This hotel is the best", "review": "We stayed at the San Giorgio for 3 nights recently and were disappointed.  Our room was only sparingly cleaned and the carpet was worn and dirty (would not walk on carpet without footwear).  I was disappointed that the online photos depicted a quaint little hotel with nice antiques but in reality, I found it to be a hotel  full of worn and tired furniture.  From the pro side, the staff were accommodating to guests and the location of the hotel was excellent. Given my time back, I would have preferred to pay a little more and feel more comfortable from a cleanliness standpoint.", "date": "June 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r33885869", "sub_review": {"Value": 4, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Crappy hotel, nice location", "review": "Home away from home. We bought 2 bottles of chianti around the corner from the hotel and drank it in the loungeroom on our arrival from Parma. The hotel staff were very obliguing providing glasses. The rooms were great, clean and comfy.The hotel has a LIFT!! This is unheard of in budget hotels. The staff are brilliant. The breakfast's amazing and there is a parking station next door. 3 mins to station. Everything is within walking distance. Everyone speaks fluent English. What more could you want? Stay there, you won't be disappointed, the price is great also.", "date": "May 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r30575125", "sub_review": {"Value": 1, "Location": 4, "Rooms": 1, "Cleanliness": 1, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Solid Hotel, close to Train Terminal and Historic Center of Town", "review": "Spent two nights in San Giorgio e Olimpic with my fiance. The location of the hotel is functional, especially for travellers using trains. During check-in, the service in the lobby was friendly, but the room was a big disappoinment, to say the least.   The carpet in the room was dirty and stained and was not vacuumed after previous guests. We also had lots of mold in the bathroom walls and the air was stale. Electrical wires were hanging from the lamps. The window was a bit loose, so every morning we woke up to the sound of window clattering.   Overall, the room was very dirty, uncomfortable and impractical. It would seriously need cleaning from floor to roof. Hotel San Giorgio is inexpensive, but that's no excuse for the overall dirtiness. I've been in many one-star-motels…", "date": "April 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r29321790", "sub_review": {"Value": 4, "Location": 4, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Average hotel.", "review": "We traveled to Florence by train, so being a 5 minute walk from the station was a bonus. It is only a few minute walk to the Duomo, restaurants and shopping.  The Hotel is solid with a friendly staff at the front desk and for breakfast. The front desk also called to book a one day Tuscany Tour for us as well. The room was large including a closet and a tub with shower. Interior worn, but serviceable for a 3 star Hotel. Good Value.", "date": "March 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r28530636", "sub_review": {"Value": 4, "Location": 4, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Great location, basic/ good value", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "March 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r26607753", "sub_review": {"Value": 5, "Location": 5, "Rooms": 2, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Highly recommended", "review": "My wife and I have just spent 3 nights at the San Giorgio for a short break in Florence.  This hotel was just what we were looking for (ie. good price within a short walk of most of the main attractions).  We really enjoyed Florence and within a short time we were able to put the street map away and just wander around.   We saw most of the main attractions and walked for miles around the city - best way to explore. We would happily use this hotel again.", "date": "February 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r24368079", "sub_review": {"Value": 4, "Location": 5, "Check in / front desk": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Ideal location for train travelers", "review": "My wife and I stayed here for three nights and found everything very satisfactory. In particular, the staff were very helpful and pleasant. The breakfast was quite adeequate but would not satisfy someobody looking for the full cholesterol  egg and bacon experience . The room was clean and serviced daily. The lounge is very comfortable. The position of the hotel could hardly be better - very near the station but within a few minutes' walk of the tourist area.. The great Zsa Zsa restaurant is at the end of the road.", "date": "December 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r24165501", "sub_review": {"Value": 4, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "great place to stay", "review": "If you're travelling around by train, dont hesitate in picking up this hotel. Its just a 3 minute walk from the Santa Maria Novella station, which makes difference when you arrive with more 5 people and 6 bags and dont need taxi or anything. Also we constantly went to the station to check prices and timetable for our daytrips to Siena and Pisa, once Florence is a great base but you dont have much to do there in 2 days, you gotta travel around!!  Please notice that the hotel is also very central and easy walking distance to the Duomo and other attractions, including lots of shops, a cheap internet cafe around the corner, cheap supermarket and a mc donalds just half block away.  Breakfast nice, with tones of yorgut, very big rooms, ok bathrooms, and a coomon room with sofas and…", "date": "August 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r20092011", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "a dump", "review": "We stayed in this hotel for 11 days, and everythin was perfect.  First day we were provided with a little bit smaller room, because all another 3bed rooms were ocupated - but just the day after , they asked us if we want to move in a better room - cause it was possible.  They are all so kind and friendly - and the prise was also very good.  I will recomand this hotel to all young people - and the families [--] well...", "date": "May 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r17504298", "sub_review": {"Value": 1, "Location": 2, "Check in / front desk": 3, "Rooms": 1, "Cleanliness": 1, "Service": 3, "Business service (e.g., internet access)": 4}, "travel_purpose": "", "rating": 1}, {"title": "Don't believe their pictures and publicity", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "May 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r16522176", "sub_review": {"Value": 1, "Location": 3, "Check in / front desk": 3, "Rooms": 1, "Cleanliness": 1, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Great Location", "review": "Booked this hotel through an agent who, as it turns out hadn't visited for over a year and thought the hotel had been refurbished. We were disgusted at the first room and contacted the agent who arranged another room. We were given the keys to two rooms. Both slightly better, if you consider that the wall socket was loose, the furniture was damaged and dangerous. the toilet roll holder was hanging off. The wall paper was peeling. The paint  appeared to have been applied by a young child. The general aroma of the hotel was....The room had an ashtray when we expected a non smoking room. The breakfast was mediocre. Three stars, certainly not. Our next hotel in Rome was three star and like a palace by comparison. They both cost exactly the same tariff.  The staff were friendly. The…", "date": "May 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r16422419", "sub_review": {"Value": 3, "Location": 5, "Check in / front desk": 5, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Just Awful. Don't stay here.", "review": "This was a good hotel in a great location.  We walked there from the train station easily, pulling luggage.  Staff was helpful, had an elevator, decent breakfast. etc.  There was an internet cafe and a laundromat very close.  There was construction on a street about 100 yds away, which made the area seem kind of bad, but that was temporary, and the area is fine.", "date": "May 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r15627968", "sub_review": {"Value": 1, "Location": 2, "Check in / front desk": 1, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled on business", "rating": 1}, {"title": "The best stay in Firenze", "review": "We arrived to find the lift out of order and the receptionist moaning about the fact that we didn't have the booking confirmation to hand (it was in my luggage which was being dragged upstairs by some unfortunate porter). He moaned about this on subsequent occasions, including once when we arrived back at the hotel late one night to find him and a number of his cronies clearly drunk. He was obnoxious and the atmosphere was intimidating. The room was dirty, cold and generally in poor condition with  broken furniture and an ancient and noisy aircon system.  \"Breakfast\" was inedible. The hotel is located in a an area of the city which has a somewhat seedy flavour with God knows what  transactions taking place in dark  corners. This is, allegedly, a three star hotel, however, it is…", "date": "April 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r15119075", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 4, "Cleanliness": 4, "Service": 4, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Below expectation", "review": "We were recommended this hotel by an Italian conference organization group (Consultia Umbria) as we were attending a week long conference at the Fortezza di Basso.  The location of this hotel could not be more fantastic.  A 7 minute walk to the train station, minutes from the Duomo, San Lorenzo church, seconds from the world-famous open air market and a lovely walk from the Ponte Vecchio and the Boboli Gardens.  It was a pleasant 10-15 minute walk to our conference center in the morning.  It was safe, secure, and the breakfast was absolutely amazing.  There is a woman who greets you with a \"buongiorno\" and asks if you'd like cafe.  Say yes, and savor the most amazing cafe latte you'll ever have!  The breakfast included orange juice, yogurt, cereals, meats, fresh fruit,…", "date": "July 2005", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r11594799", "sub_review": {"Value": 1, "Location": 4, "Check in / front desk": 2, "Rooms": 1, "Cleanliness": 1, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Good location", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "November 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r10563281", "sub_review": {"Value": 3, "Location": 5, "Check in / front desk": 3, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "", "rating": 3}, {"title": "Good location, bad aura", "review": "Stayed 3 nights in this hotel.  If you travel by train, this hotel is located in an ideal location.  You don't have to drag your luggages too far off from the train station. It's also very near to all the places of interest.  The room is an acceptable size and bathroom, though small but it's acceptable.  Served good breakfast and they are nice to serve us earlier as we have an early train to catch.  Don't expect too much help from the front desk.", "date": "November 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r10438454", "sub_review": {"Value": 2, "Location": 5, "Check in / front desk": 2, "Rooms": 2, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Grest, Except for the staff", "review": "Indeed, a great location. Otherwise, more of a disappointment. We were told that the hotel does not have non-smoking rooms. Our room just reeked. Not much of a view: construction and scaffolding.  Instead of fresh air, you would get the smell of construction. Dingy bathroom.   Our room was at the end of a long corridor that is dark most of the time. Motion sensors are supposed to turn the lights on, but in reality they lag behind if you walk fast. So you better be careful.", "date": "May 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r8032885", "sub_review": {"Value": 4, "Location": 4, "Check in / front desk": 1, "Rooms": 5, "Cleanliness": 5, "Service": 1, "Business service (e.g., internet access)": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "lovely place", "review": "We stayed in San Giorgio e Olimpic for three nights;  the location was very good, close to the train station, very good restaurants and the Mercatto Centrale.  Main attractions in Florence were also at walking distance, like uffizzi, academia, Duomo, etc.  Breakfast was very good, the room was large and clean, with a nice view.  Our only complain is the staff; not friendly at all, the woman serving coffee in the breakfast room looked awfully depressed, and we asked for wake up calls that never happened.  When we asked them for help with bus routes, they seemed to get upset, and told us to walk instead.  Overall, good. ", "date": "March 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r7338209", "sub_review": {"Value": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Loved this hotel", "review": "Great place, wonderful staff.  Clean and spacious room , with a balcony overlooking the duomo. ", "date": "September 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r6759793", "sub_review": {"Value": 5, "Location": 4, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "find somewhere else", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "September 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r6567394", "sub_review": {"Value": 1, "Location": 4, "Check in / front desk": 1, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Greta Location but grotty and dirty", "review": "what a place, very conviently located for all that florence has to offer, we booked a room for 3 (all adults) small dark dingy room, light from a window onto a wall, mouldy bathroom walls (didnt bother having a shower) and the toilet could be viewed from the corridor opposite (in the end we had to leave the light out for any privacy).  breakfast was ok but once it was gone there were not replacements.  on the whole not good. ", "date": "October 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r6013590", "sub_review": {"Value": 1, "Location": 5, "Check in / front desk": 3, "Rooms": 1, "Cleanliness": 1, "Service": 2, "Business service (e.g., internet access)": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Left after the first night", "review": "Just returned from Florence which is fantastic, the only let down was this hotel.  Although the hotel is fantastically located, it is so dirty.  Several cobwebs hung down from the ceiling lamps, the wall paper is dirty, all in all this hotel needs to be redecorated and by no means be 3 star. ", "date": "October 2005", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r5837354", "sub_review": {"Value": 1, "Location": 4, "Check in / front desk": 3, "Rooms": 1, "Cleanliness": 1, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "In just the right place", "review": "My wife and I traveled to Florence for our tenth anniversary.  Having previously enjoyed trips both Rome and Venice, we were really looking forward to a nice stay in Florence.  The hotel is conveniently located very close to the train station in Florence, within an easy walking distance.  It is easy to find.  The entrance was typical for hotels in Florence and elsewhere in Italy.  We checked in just at sundown, and were shown to the room.  When we entered the room, it was musty smelling and dirty.  The furniture and bedspread were covered by dust, the carpet was in need of a good vacuuming.  The bathroom was partially clean, but the tub/shower was infested with mildew.  When I asked for another room, I was informed the hotel was full, but perhaps they could change the room…", "date": "July 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r5623690", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "fabulous florence", "review": "This hotel is in an ideal place, near the station and a stone's throw from the centre of the city. Little shops nearby where you can buy food and drink, good choice of places to eat as well. A pleasant building, nice sitting area downstairs where we often cooled off. Air conditioning in the rooms excellent. Comfy beds as well. Rooms were a good size, we had two which faced  away from the street so it was very quiet, hard to believe we were in the centre of Florence. Hot showers variable, sometimes hot and sometimes not. Room 116 has a nasty damp patch on the bathroom ceiling and you do need to fix this please managment as it smells bad. Staff always courteous, breakfast in a nice room and plenty for our needs. We would stay here again, it was great to just walk out of the door…", "date": "May 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r5287005", "sub_review": {"Value": 3, "Rooms": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "", "rating": 4}, {"title": "Great location", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "May 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r5237249", "sub_review": {"Value": 4, "Rooms": 3, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Wonderful location", "review": "A great centrally located hotel in the heart of Florence and within walking distance to all the major attractions.  If arriving by train the train station is literally across the road and if flying into Florence Airport it takes about 20 minutes in a taxi and costs about 15 Euros.  The rooms were of an average standard and very clean.  The buffet breakfast was okay but nothing special.  The staff were very friendly and spoke very good English.  All in all a very nice hotel and I would recommend this to anyone wishing to go to this amazing city. ", "date": "June 2005", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r4995259", "sub_review": {"Value": 3, "Rooms": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "", "rating": 4}, {"title": "It's close to everything!", "review": "This was one of our favorite hotels during our trip to Italy.  The quad room looked exactly like the picture on their website.  The room and hotel were clean, the room spacious. The desk clerks weren't overly friendly, but I wouldn't call them rude either.  Air-conditioning was a relief after going without in other cities.  It is within walking distance of all the major attractions. ", "date": "November 2004", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r4346358", "sub_review": {"Value": 3, "Rooms": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "", "rating": 3}, {"title": "Standing Up for the Sanny G.", "review": "We stayed at the San Giorgio in late Nov. 2004. It was very convenient with the bus only a few steps away, and just a short walk from the train station. It was average in looks and decor, but there was a light breakfast each morning to get you started. And I agree with the other reviewer that you had to practically beg the front desk staff to give you a map or act friendly. They were sort of \"aloof\".   We had just come from Rome where we stayed at the Hotel Napolean. They had been very friendly at that hotel and greeted us by name every day, so we were somewhat put off by the bland hospitality at the San G.   However they did come to our rescue when we went on to Venice and discovered that we had left our nice digital camera hanging on a chair back in the room. We called them…", "date": "September 2005", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r4043682", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "You can find something better!", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "June 2005", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r3815939", "sub_review": {}, "travel_purpose": "", "rating": 2}, {"title": "Simple but Kind", "review": "Hi! I stayed at the San Giorgio and Olympic Hotel, Florence, this July 2005 with my husband and baby. Its location is good,near places of interest as well as the train station. Breakfast is good. However, ALL RECEPTIONISTS are rather rude and not helpful at all!!!!!!!! You have to literally beg them to give you a map of the city (though they are free!). The hotel has no parking area, so think twice if you'll rent a car because you have to pay 20 euros extra per day!!!! The hotel is in a driving-restricted area, so it took us 3 hours to find the hotel! Overall our stay was not very pleasant at this hotel, I'd stay somewhere else if I visited Florence again in the future. ", "date": "May 2005", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r3599579", "sub_review": {"Value": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "Simply wonderful Location", "review": "San Lorenzo’s lively merchants shout out from behind stalls with an array of products in one of the most traditional neighborhoods in Florence. Different ethnic groups join together in the large outdoor market of San Lorenzo and in the Central Market, a vast multi-floored building. Visitors are bound to fall in love with this area and in particular, with its variety of food, especially those focusing on Florentine dishes as well as international selections. Nobody leaves San Lorenzo without a shopping bag in hand or with an empty stomach.", "date": "November 2004", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r2806025", "sub_review": {"Value": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Disappointing & Dingy", "review": "Great location only a few minutes walk from the main railway station in Florence this hotel is the perfect base from which to enjoy the many sights Florence has to offer. The hotel is very reasonably priced (given the rates some of the other hotels in the area were charging) and the staff are very friendly especially Piero who helped us with suggestions for good restaurants, pubs and general sightseeing information. I will definately be returning here! ", "date": "May 2004", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d237506-r2292712", "sub_review": {}, "travel_purpose": "", "rating": 2}]