[{"title": "Close to everything", "review": "We stayed two nights along the lake and loved our splurge of a junior suite.   The Juliet balcony gave us views of across and down the lake.   We watched the ferries approach and numerous ducks and swans near the shore.  The staff was great and helpful.  The breakfast buffet was varied and included rice and soy milk.     The Grifo Parking and shuttle, set up by the hotel, worked very smoothly.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r714802919", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": " Vacation ", "review": "Been here for 10 days! This place is fantastic. The staff. Service, ambiance, for an appreciation of art you can do no better. There is art everywhere, even in our room. The lake deck has wonderful views of the lake garda and with so many visitors to Sirmione you might as well be miles away. I would without doubt recommend Hotel Flaminia. Not for kids.. oh! The Restaurant,  Marghe, great food. ", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r712007427", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Restuarant Marghe @ Flaminia Hotel", "review": "Lovely restaurant, in quiet Piazza. Very good menu, with staff that really look after the guests. We dined here on several eveneings, enjoying the sunsets. The poached egg & asparagas starter was 'superb'.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r711955034", "sub_review": {"Sleep Quality": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Perfect Location", "review": "The location of this hotel is perfect! Sirmione is a stunning town, filled with beautiful restaurants! The hotel rooms are a little dated but being on the lake more than made up for the dated decor! This was my second visit and I would definitely stay here again!", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r711242326", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Slowest service ever", "review": "Went for dinner one evening. Very quiet restaurant, maybe another 4 tables max. Good food but we were waiting ages for any service or food to come. Not worth the wait for the food. The view was really pretty over the lake.", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r703979414", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "BOOKERS BEWARE! ", "review": "WARNING! Do not be misled by the room pictures on the website. You are sold beautiful bright and airy superior rooms, that the hotel just doesn’t have. One room shown is actually a 4 person suite, the other is a basic room that has a fab view. You’ll end up across the road in an annex, dark dingey and no view whatsoever. Totally not worth the premium for staying at a waters edge hotel. Complained to the hotel and they apologised but just couldn’t provide the room we expected. Spoke about relocating and was threatened that if we leave we would still be charged 50% fee. At the end asked for a discount, flat refusal. MAKE SURE YOU CALL THE HOTEL BEFORE YOU BOOK TO CHECK WHAT YOU ARE GETTING.   Absolute waste of money.   Pictures are what you will get, tired dark and depressing ", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r698874502", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Loved it", "review": "Stayed as part of a stay and cruise.  Loved the hotel, location is perfect.  Ate first night in the associated restaurant, great service, small portions but it’s Italy you can have 5 courses. Breakfast was very good and rooms were spacious clean and tidy.  Staff had no problems with special requests.  Hope to come back.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r685810665", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Wonderful location", "review": "I would have preferred a good option rather than from average to very good as a couple of things were disappointing and hence my score.  Situated within the old town, entering through the castle gates the hotel is well located in the hub of activities.  Modern decor and wheelchair accessible it has a wonderful terrace with sun beds and chairs overlooking the lake and close to the water taxis. Towels are provided.  The room was fine except for an old fashioned type hairdryer on the wall that look ages to dry your hair. Clean with toiletries provided and a good shower over the bath. Buffet breakfast was excellent with good choices including gluten free.  We had a meal one evening but were told they could not vary the menu to offer my aunt French fries instead of vegetables! And…", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r681126887", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Very Friendly", "review": "The Hotel Flaminia is located in the beautiful little town of Sirmione.  The hotel was relatively good value, mid price within the old town.  The staff were all incredibly friendly, as were the people of Sirmione.  Breakfast was standard European fair.  Cold meats, cheese, breads, scrambled eggs etc.  Very well presented and a good start.  The room was a decent size, probably large enough in comparison to other Italian hotels i have stayed in.  Would definitely recommend the hotel, but would also recommend trying to get a lakeview room.  The rooms facing the street suffer from early morning noise.  I get up early, so it wasnt an issue, but my wife was woken at 6am, not a great start for her.  Sirmione itself is really worth seeing.  Worth noting that you will find it hard if not…", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r671787014", "sub_review": {"Location": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely Hotel", "review": "Just got back 30/04/2019 from staying at the Flaminia Hotel, I would recommend this hotel to anyone that wants a central location, the hotel is right on the front of Lake Garda with panoramic views of the Lake, they have decking area in front of the lake where you can sit and just relax, and it’s so central that it’s right near all the restaurants. Flaminia is a hotel with bed and breakfast, the rooms are exceptionally clean and cleaned everyday by housekeeping, the breakfast is mostly continental but they do have hot dishes you can choose from such as scrambled eggs, bacon, omelet, pancakes, cold meats and cheeses different types of bread and choices of tea and coffees, the staff are warm and friendly and go out of their way to help you, and yes when we go back to Lake Garda as…", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r670624594", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great location", "review": "We spent 3 nights at this hotel.  The rooms were spacious, clean and well appointed.  Situated right on the lake in the centre with the ferry terminal at the end of the next street.  Lots of bars and restaurants nearby but it was quiet in this little street that ended at the lake.  Could not have chosen a better location.  We had half board and the food both at breakfast and dinner was good.  All the staff were friendly and helpful.  Would definitely recommend.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r626882235", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice room perfect spot", "review": "I would rather pay for a plain functional Hotel in the heart of the activity then a luxury hotel away from anything to do.  This hotel is clean, comfortable, and perfectly located.  Each room Is a good size with a nice bathroom.  Because of the thickness of the walls they are also quiet.  The breakfast is very good European breakfast and the bar is open 24 hrs.  Everything you want in the town is right out the front door.  The staff is very polite and efficient.  Overall I would definitely stay here next year. ", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r624791907", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Reminds me of good old time.The place has character", "review": "A hotel with its own style in a very beautiful place.Directly on the lake.Great view.Good breakfast.Charming design of the rooms.No complaints.Do not hesitate to book.Actually when we were walking around I did not sea a hotel that I would have preferred to that one", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r619102182", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "No fault found! ", "review": "My boyfriend and I spent 3 nights at the hotel and we can’t find fault. The room was lovely and clean, with a great view of the lake even though it was on the right hand side of the building.  The sun terrace was a lovely little suntrap that we spent a couple of afternoons bathing on. We never struggled for somewhere to sit, may be because of the time of year and a bit quieter.  Make sure you go down for an evening drink and catch the sun setting across the lake. Was beautiful!   Breakfast was lovely. A lot of choice and coffee to order.   Location of the hotel is perfect. Close to the port to catch the boat, but also lots of hotels and bars nearby.   If you’re looking for a relaxing stay in Lake Garda then I would recommend this hotel highly :) ", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r618199882", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great Location", "review": "Brilliant position next to the lake.  Rooms modern and airy.  We stayed here at the start and end of hour holiday.  Hotel arranged parking at Griffoparking for us and then you are taken by golf buggy to the hotel.  Staff excellent, breakfast good ad were the bar prices.  A great spot for a stay in Sirmione ", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r617832111", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Last minute change so didn't know what to expect", "review": "We were changed to this hotel a few weeks before travelling by our booking agent so didn't know what to expect.  However, I'm pleased to say we were so pleased when we arrived.  Check in was smooth and easy and we were taken to our room by a member of staff.  The room is spacious and well equipped and tastefully decorated.  Water is supplied in the room free of charge as is wifi and there is air conditioning.  Towels and sheets were changed every day.  The whole hotel is decorated with taste and spotlessly clean.  It's right in the middle of the old town so handy for shops, restaurants and sights.  All staff we came across were so professional and friendly and couldn't do enough for us.    There is a restaurant/bar attached to the hotel where you can get 10% off when you first…", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r617691811", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good location but let down by the room", "review": "We had booked a twin room with lake view and balcony.  We were given a small double room in the annex across an alleyway overlooking the kitchens.  We were not advised by Booking.com or the hotel that we would be in an annex, this is not acceptable.  We did have a small balcony (no room for any furniture) which we could not use as we were over the alleyway and opposite the kitchens and a side lake view if you hung over the edge of the balcony.  The photographs show the same photographs for each standard of room which is misleading.  The annex is only a 2 star rating at the most.  We booked a twin room but were given a double bed which was comfortable but very high.  The tiles on the bathroom floor were slippery and the bath too narrow which made it difficult to stand in whilst…", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r613225471", "sub_review": {"Value": 3, "Sleep Quality": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great hotel in lovely location", "review": "Lovely hotel but a little noisy in the morning. Take a lake view room to avoid this. The breakfast is superb. You can swim from the jetty. Sun loungers are available but there is little back support. Bar facility good. The whole area is lovely.", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r610886921", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fantastic weekend", "review": "What a fabulous hotel in a perfect place!  Right in the centre of sirmione. When we arrived by cab & went into the castle grounds was like a fairytale. And also being on the edge of the lake was just wonderful. Staff are so helpful & attentive, already planning our next trip as this was a special anniversary treat.", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r608583980", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Second stop on our honeymoon", "review": "This was the second hotel we stayed in on our honeymoon. Other than the room not being as up to date as some and decoration not as stylish, everything else was perfect. We parked in the car park and a golf buggy took us and our luggage to the hotel (and back again when we left). The staff are really friendly and helpful. The breakfast was good and the restaurant is on the terrace on the water (so are the sunbeds) with a beautiful view. Everything was clean and pleasant. The hotel is in perfect location and everything in walking distance (ruins, castle, pebble beach, cafes shops and restaurants, waterfront, shops and places to book boat tours etc). Unless you are looking for a luxury room I would recommend.", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r607074313", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Fantastic hotel in great location", "review": "Hotel Flaminia is a lovely hotel located in the heart of Sirmione and would recommend this hotel for a stay. We had a lake view. The room was a good size with a comfortable bed, air conditioning and bathroom was a good size complete with good shower and a bath. The staff were welcoming and helpful. The breakfast was fantastic with a great selection and the seating area looking out onto the lake. The sundeck protrudes out into the lake and is a good sun baking area in the afternoon with steps down into the lake. The old town is stunning with many restaurants, shops and gelato stores. Visit the grotto at the end of the peninsula , the castle at the entry to the old town or simply wander around the streets.  The ferry pier is close by with lots of good trips to various other towns…", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r606260773", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Location is not enough for 4 stars!", "review": "Small and old room with dysfunctional air conditioning,  No coffee or anything,  Very far parking spot, Great breakfast with a variety of food and great location, Stuff is nice but will not give you an extra key.. Mini TV 3 stars is ok for this hotel. ", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r604403512", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Stunning Stay in Sirmione", "review": "There is nothing to criticise about this breathtakingly beautiful place. Sirmione is incredible - wonderful shops, restaurants, bars etc. The views from the deck at Hotel Flaminia are amazing. The water is crystal clear and lounging on the sunbeds is a great way to spend a week, watching boats sail by whilst sipping Aperol Spritzers.   I treated my parents and husband to this couples trip away, and I can honestly say it was worth every single euro! I was worried that the hotel may be run down, but our rooms were fantastic - so clean, and the air-con worked like a dream. The reception staff and pool staff were professional, yet friendly, and they went out of their way to be helpful throughout. It truly was an incredible holiday, and I am so sad to be saying goodbye.", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r603298805", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Splendid location, great hotel", "review": "We had previously spotted this hotel on an earlier visit to Lake Garda and chose it for our three day stay this time. Our stay was wonderful and the highlight was the enormous window overlooking the lake. Floor to ceiling and almost the width of the room The only downside was having to leave. We shall certainly return", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r601888082", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Beware they cancelled my booking without notice", "review": "Thistle hotel looked absolutely fabulous so I booked a deluxe lake view room for a suprise for my wife after 30 years together.  I booked it through booking.com In October 2017 for a visit in July 2018.  I was en route in Innsbruck the day before I was due to arrive when I received an email stating the room I booked 9 months earlier was no longer available but I could have a partial lake view standard room for 30 euros less.  I sent an email expressing  my disappointment and asked why the room was not available but received no explanation.  In fact I received no reply. I then contacted booking.com who spoke to the hotel but also received no explanation as to why the room was not available. They then tried to source an alternative hotel neither were of an equal standard. After…", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r600812787", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Excellent hotel and location", "review": "Perfect location on the lake.....very impressed overall with the hotel. Beautiful room with various balconies, jacuzzi bath and great hotel service  The only thing that let it down was the attitude of a couple of females working on the bar/ restaurant.  ", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r597880511", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Saved by the sun deck", "review": "Otherwise would have rated a two  Location and sun deck were great  Rooms looked nothing like what was advertised  One room was small and cramped, the other was larger but smelt like a drain when we first entered, thankfully the smell cleared by having the window opened all night  As mentioned, the sun deck and ability to dive straight into the lake redeemed the stay", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r596899339", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Nice hotel", "review": "The hotel was beautiful. Located right on the lake with a large sun deck and lake access. The location , although perfect was a little nerve wracking driving to. You enter the Old Town gate and drive through the narrow, pedestrian filled streets (alleys). The reward is worth it . Had a room with a patio , lake front. The old town was beautiful and well worth a visit. Would definitely return here. Staff valets your auto. Staff was very friendly and helpful. Hotel and its rooms were very clean and well appointed.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r591677967", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Location, Location. Location", "review": "We stayed for 2 nights last week and just loved the location of this hotel on the edge of the lake and in the town centre. Its also just a 5 minute walk to the spa, or to the ferry dock. Nothing beats sitting on the decking with a cocktail watching the world go by. The staff were efficient and quietly looked after us well. The beds were surprisingly comfortable, and everything was clean, particularly the linen and towels. The hotel has no frills, is tired and needs some renovation, but for the price we paid I thought it was good value, hence 5/5. Tip - The road traffic getting to Sirmione can be dreadful at peak times. In fact, when we left mid morning on Sunday, the police had closed the main road into town. Make sure you plan your arrival", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r589076378", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great Location", "review": "Good location. Lovely decking over the lake, great views.  Rooms very clean and practical - no real frills but absolutely nothing wrong with them.  We found staff very friendly and efficient. Good breakfast.  I’d say a very good hotel perfect for a couple of nights. Could be stunning with new investment.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r588438197", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Wonderful being right on the lake AND right in the center of town", "review": "I might in future consider staying farther out on the Sirmione peninsula, where it's quieter, but it was very fun being in the heart of things and still  a bit sheltered in the side street and by the hotel itself. It's a very nice hotel with great breakfasts  (or cocktails) you have overlooking the lake.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r588422482", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Fabulous location", "review": "We stayed here for 3 nights with a side view of the lake and it was brilliant. Good breakfast, comfortable bed and spacious bathroom. The veranda by the dining room was a great place to sit and enjoy the scenery. Peaceful, but only yards away from the daily busy thoroughfare of Sirmione. Would love to return", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r588381436", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Location on the lake..", "review": "Having booked this hotel at the beginning of the year I thought I had booked accommodation at the Flaminia.  We had been travelling all day and were fairly tired when we arrived here. On arrival we were taken out of the Flaminia across the central walkway and up a lift in a building detached from the Flaminia to a very small room overlooking the walkway. This building is at the rear of the Hotel Eden next door which I had not booked!! We struggled to find any decent drawers (there were none) to put our clothing.  I looked everywhere for a safe and eventually found this minute 'safe' inside the top corner of the wardrobe.  There was no key to get into it and a phone call to reception revealed that they had the key so a walk to reception and back and the safe was so small that I…", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r587597048", "sub_review": {"Sleep Quality": 1, "Cleanliness": 4, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Fabulous Hotel", "review": "I can't say enough positive things about this hotel.  The location on the lake front must be one of the best in Sirmione.  We had a full lake facing room and it made all the difference.  You could just sit on the balcony and sip your wine watching the boats go by.  The room decor was modern, stylish and spotlessly clean.  Breakfast was great no complaints plenty of choice and everything fresh. Again views from the breakfast room uninterrupted out to the Lake.  Staff on the whole were very nice.  Parking was a nightmare but that's not the hotel's fault it's a pedestrianised area.  As others have said previously you can park to drop off your luggage but must then drive out again and use the hotels designated parking area which is about a 10 minute walk away for which they charge…", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r585616643", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Wedding Anniversary in Lake Garda Hotel Flaminia", "review": "My wife and I celebrated our wedding anniversary in Hotel Flaminia in Sirmione.  Our room was big enough & clean for our 5 day stay with everything we needed except coffee making facilities.  Our room/balcony looked straight onto lake Garda & the hotels decking area with sun beds looking out to Lake Garda just watching the world go by with a good glass of local white wine.  Staff very welcoming, friendly & helpful.   Breakfast very good serving Juices, cereals, scrambled egg, boiled eggs, small omelettes, bacon, toast & fresh fruit which sets you up touristic day round Sirmione or Lake Garda.  Hotel Flaminia  Great location very close to the main square, castle & lots of very good nice restaurants & close to the ferry terminal which will take you to various locations around Lake…", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r585613039", "sub_review": {"Location": 5, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice hotel in the heart of Sirmione", "review": "This hotel placed very good, in historical part of Sirmione. All sightseeings are near this hotel and it's not noise place because it stays on shore of Lake. Termal springs are also near the hotel. Room was big enough for our family (with kid). Cleanless and staff were good. Breakfast was also good, not rich but enough for start touristic day.", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r583687932", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Excelente ubicación", "review": " My wife and I went to visit sirmione all the way from Mexico. The Flaminia has an amazing location and lots of nice restaurants near by. From the staff we found Silvia in the morning shift to be a little rude, she did note seem in the mood at all. Rooms are a bit small, but it's still a great deal. Christopher from Scotland was great from the staff, he tried to talk his best spanish. Overall we enjoyed our stay very much and will for sure go back.", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r579566960", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice but Not a restful night", "review": "This hotel is lovely and the staff were super helpful. Breakfast was good and the rooms were neat and clean. The problem for me was the heat and noise. The rooms were so hot we struggled to sleep. If we opened the windows to cool down the noise was excessive. A lot of it was noise from the kitchen probably of the hotel, clattering cutlery and crockery. So tired this morning. ", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r571833293", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "A quick 2 nights", "review": "We stayed here in June 2017. Sirmione is a gorgeous wee village (not even sure you can call it a village) Either way it is gorgeous. So quaint, quiet, friendly, easy to get around. We travelled here from Desenzano del Garda train station, a 15  minute bus journey. The check in and out was very quick and easy. The staff were very friendly and helpful. The room was spacious and very comfortable and it had a fantastic bathroom. The outside sun deck was nice too with steps down into the lake. We did not have dinner here but the breakfast included in our stay was absolutely brilliant. Apart from having a good selection choices both hot and cold. The food was delicious. probably the best food we had in Sirmione. Highly recommend.  Robbie,  Ireland", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r555890751", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Personable, welcoming and relaxsd", "review": "Had a excellent stay at the hotel which has a great view of the lake which is perfect for watching the sunset.  The staff are helpful, warm, attentive and friendly which makes for a relaxed and enjoyable stay.  Nice rooms with modern light wood interiors, comfy beds and good heating & a/c  Would certainly stay here again!", "date": "December 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r550635173", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Enjoy the amazing sunsets over Lake Garda", "review": "This is a particularly lovely hotel located right beside the lake.  We were lucky enough to have our own veranda overlooking it which made it a perfect holiday destination in which to celebrate our 48th wedding anniversary.   The sunsets were amazing.  The staff were great even though we didn't have hot water the first night, they were really obliging and it ended up by being a bit of a joke!   the breakfasts were great - the best we have had on the continent.   We loved the varied restaurants within walking distance and the icecreams are to die for.  We counted 101 different flavours in one particular place.  Highly recommended.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r533427132", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Phyl Tyley", "review": "The lakeside location of this hotel with its  veranda overlooking the lake is a perfect holiday destination. Sunsets being particularly spectacular. The staff are friendly and helpful and the breakfasts offer a good choice  I would recommend this hotel to anyone wishing to visit beautiful Sirmione", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r532024488", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "So lovely", "review": "We went here on our last day, just to stay at the front teresse out to the lake. the waitress was busy but she was really amazing. So nice that we were allowed to be there, since we didnt stayed at the hotel. The food was good also.  If we come back to Sirmione we would book this hotel.. So nice that we could jump in the lake and just relax at the sun chairs all day..", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r526902555", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Another great weekend ", "review": "This is our second visit and love this hotel.  Staff are helpful and friendly.  Even coming in late and serving us some late drinks.  We were spoilt and got a lovely lake view room.  Breakfast is just what is needed.  Great location.  Til we meet again  thanks.", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r525565244", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Well situated hotel in Sirmione", "review": "We enjoyed our two night stay at La Flaminia. Excellent location, comfortable room and bathroom, good internet reception, well appointed bathroom and fine breakfast.  Staff were very helpful with parking instructions and there is a good hotel car park about 300m from the hotel.  Recommended as a good base to explore Lake Garda, especially Garda itself and beautiful Lazise.  ", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r525481186", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Superb Location, great management.", "review": "A fantastic welcome from the staff as we arrived. They couldn't be more helpfully with our 10,000 questions we had about the local area.  The hotel really is superbly located. The view of the lake is spectacular and you are also placed close to the bars and shops... but without the noise.  The fantastic restaurant next door I believe to be under the same management  and offer 10% discount for residents. I cannot recommend this restaurant highly enough.   Breakfast it fine. The sun loungers outside offer great views and table service.   We would LOVE to come back and stay here again. ", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r524811945", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Could be better", "review": "We rang the hotel ahead of our stay as we hired a car in Verona and wanted to make sure there was parking. The receptionist reassured us that there is definitely parking and we should drive through the castle gates, park in front of the hotel and she would instruct us from there.   The drive through the gates turned to be an utter disaster as it's so narrow and completely clogged with tourists. After half an hour of the car crawling through, we made it to the hotel, only to be told by the same receptionist that the parking is back outside the gates. We wasted an hour and a half just doing that!   If you're driving, park up before the gate, go in and collect the permit and then drive it to the right spot.  We stayed in room 53, which was comfortable.   Breakfast was good, with…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r520836974", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Location,location, location !", "review": "What a great location on this hotel ! Great sun deck over the water, and ample number of sunbeds...Very nice breakfast buffet, with fresh fruit, and variety of cold cuts, cheese, eggs and juice...The service staff are impeccable! always there with a smile, and kept a friendly atmosphere throughout the hotel. Great standard on the rooms, with a small entre, before entering the room..very smart, and kept the noise from the corridor and air-condition down. Excellent parking service as well. Very well recommended !", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r510685452", "sub_review": {"Location": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Some good, some bad !", "review": "Good view over the lake  but right by the main ferry terminal . Ferries came and went all day so don't expect any peace when sat out on the sun deck which was otherwise was a rather nice place to sit! Our room was in a seperate building across a narrow road. Unattractive  entrance which smelt of food from restaurant next door.   We had room 50 . Superior with lake view and balcony. Balcony miniscule with fake grass on !!!???  Bedroom a bit narrow but ok with good bedding , sockets by the bed, decent wardrobe space. EXCELLENT bathroom with a shower that had glass both sides to give a view of the lake ! Good towels , ok hairdryer on bathroom wall, bathrobes. Good toiletries.   Breakfast poor.  Lunch ( 1 salad and 1 Bolognese)  on the outside decking quite good but very slow…", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r507059256", "sub_review": {"Sleep Quality": 4, "Rooms": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good location", "review": "We made our booking over a year ago for a junior suite with good lake views. I booked specifically with the hotel through email thinking I would get a better service by dealing with them direct. When we arrived they were very friendly, we were early but no problem, come back in a couple of hours and the room would be ready. Fantastic. When we got our room it was not the junior suite I had expected but a small double with lake view. Having seen the beautiful big rooms with huge panoramic windows I knew that there had been a mistake. Went downstairs. Yes the receptionist said they had lost my original email so didn't know what my original request was for so no problem they had a junior suite we could have but we would have to wait a bit longer. Ok fine. Finally we are shown to our…", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r502479545", "sub_review": {"Sleep Quality": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Average hotel - some things do need to change!", "review": "We arrived in the hotel on a Sunday from another city in Italy and were staying for one night. It is located quite centrally, in the hub of restaurants/shops etc so it's a very busy location when you reach the top of the road. I loved the location, everything was basically within a few mins walk and the hustle and bustle of families, couples and visitors was actually quite lovely!  The hotel is located right on the lake, there is a very limited area/sun loungers on the deck, i'd say around 15 and it faces the lake. Views are stunning and it's quite a relaxing atmosphere!   The rooms are quirky, we had one with a balcony facing the lake which was so lovely! It really is worth paying additional or requesting this one! Really added to the experience of our stay. The balcony isn't…", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r502309926", "sub_review": {"Location": 4, "Rooms": 3, "Service": 2}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Beautifully positioned", "review": "Lovely room with View over lake.  Just had bed and breakfast which was fine. Some gluten free choices for breakfast including biscuits, fruit, cheese and yoghurt. Staff at breakfast mostly friendly.  Reception staff very helpful.   Very handy for the centre of Sermione for shopping and for catching the ferry to all the other little towns.", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r501374920", "sub_review": {"Value": 4, "Location": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great views of Lake Garda", "review": "We stayed four nights at this hotel located \"smack dab\" in the middle of Sirmione. The good news is that the hotel has rooms with balconies hanging over the lake (we had one). We could sit on the balcony, and watch the boats and ferries come in and go all day long. It also had a nice deck extending into the lake for baking in the sun with drinks provided on demand. Good A/C  which was really needed as the temp was 100 degrees F in the shade. Breakfast was excellent with lots of choices. Unlike one of the reviewers I found the staff to be friendly and responsive. This is a family-run hotel, and we met Massimo the son. Very nice guy, friendly, open, likable. We arrived at the hotel on Saturday. The crowds were overwhelming, sort of like Venice on steroids. We drove in over the…", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r494756265", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Gruff staff marr otherwise lovely experience", "review": "My husband and I concluded that not only must the hotel have absentee ownership, but also absentee management. With 3 notable exceptions, the staff was uninterested in helping, gruff, even surly. This is an otherwise very nice hotel right in the old historic part of the town. Rooms are small as might be expected but very clean. Breakfast was good. Restaurant has good food unless the waiter takes umbrage at something you ask for and then watch out, you won't get what you ordered", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r492475176", "sub_review": {"Value": 2, "Rooms": 3, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Location, Location, Location!!", "review": "This hotel is in a beautiful location overlooking the lake in the quaint old town of Sirmione.  The hotel is spotlessly clean, the staff were helpful and friendly.  The decked area is the perfect place to relax with a drink and watch the sunset over the lake.  I would highly recommend this hotel.  Great value for money!!", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r489809769", "sub_review": {"Value": 5, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A cozy hotel overlooking the Garda lake", "review": "The location of the hotel inside the old city of Sirmione and directly overlooking the lake   makes it an excellent choice for travelers wishing to enjoy the Lake Garda stay. Located only a few steps away from the ferry boat makes it covenant to visit other places on the lake. Also they can enjoy the walk around the old city enjoying the plenty number of shops and cafes there. The breakfast area has a terrace over the lake and is accessible all day long to hotel guests. The breakfast was satisfactory and the staff where friendly and helpful and spoke good English.  The hotel is  dated and needs some renovation, but the view makes up for  all of that.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r488534242", "sub_review": {"Value": 3, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Short Break", "review": "My husband and I spent a four night break in this lovely little hotel in the beautiful resort of Sirmione. Upgraded to a junior suite which was lovely, spa bath, separate shower and lots of little extra's. Balcony overlooked the lake which is so picturesque. Typical Italian hospitality, staff efficient and friendly working in the background like a well oiled machine. Good breakfast buffet taken in the dining area with floor to ceiling windows overlooking the decking on the lake. Our weather was excellent and it was wonderful to return after a day out and have a drink or coffee on the sunbeds or chairs. Would highly recommend and return. Made the mistake of leaving passports at reception !!  Call made to reception who arranged a taxi to deliver our passports to us at the airport,…", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r487129340", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great Hotel, Great Location", "review": "The hotel is situated in a great lakeside location and staff were really friendly. The room was spacious and clean. We didn't take full board which allowed us to eat at various eateries, which there are a lot of great eating places within easy walking distance from the hotel, especially Cafe Margherita Pizza, attached to the hotel.  I would highly recommend this hotel if you're staying in the old town Sirmione.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r485890535", "sub_review": {"Sleep Quality": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great hotel in beautiful location", "review": "We stayed for 9 days in this beautiful hotel. The private terrace is perfect for lazy sunny days. The rooms are clean and comfortable, the staff friendly and welcoming. The hotel is perfectly located for the ferry so moving around the lake is easy. I would highly recommend this hotel.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r484952316", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "front lake GARDA", "review": "room 36 junior suite very large,spatious bathroom lake view very clean excelent breakfast and prompt service personel very kind position of the hotel in the old city,plazza Flaminia is very well located", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r480392898", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nice location", "review": "Well located in Sirmione and but no easy acces by car. The room are cleaned and great size for the region. The breakfast is very good, lot of choice. The coffee is hummm!. Ask for a room on the lake, just not a view.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r479000199", "sub_review": {"Sleep Quality": 3, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent restaurant!", "review": "At the sea front you can also eat in the Restaurant of this Hotel, even as a no Hotel guest ! And the Food and view is amazing!! very good Food and great Service! Not touristic and nice to sit by the lake!", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r476216784", "sub_review": {"Location": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Perfect location", "review": "We spent one night at Hotel Flaminia. Beautiful, comfortable and clean rooms. Perfect location, very close to the castle. Beautiful view of the lake. Staff was very friendly.  The pistachio chocolates at reception are to die for! ", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r456599949", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Lovely weekend break.", "review": "My wife and I spent the weekend here and I am pleased we did. What a lovely place, a bit dated in place but ideal.  The staff work very hard to make sure that you enjoy your stay.  Breakfast is served in a wonderful room with views across the lake.  Outside the dinning room there is a decked area where you can sit or layout in the afternoon sunshine  They have a well stocked bar and a restaurant right next door.  The resort can get busy at times but this place is just out of the way.  Not all rooms have a view of the lake but who wants to sit in their room all-day when you are in such a great place.  The ferry is just a short walk from the hotel as well.  We loved it and we will be going back again in the spring ", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r432645707", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Interesting experiment", "review": "We have spent many weeks of holidays around the lake but avoided Sirmione sofar as we consider the vilage as far too crowded in summer. However we decided to give it a go towards the end of the season (september/october). This turned out to be a good decision. The hotel is OK. We  booked one of the only four lake view rooms. The views were excellent but the room appeared a little small. They have bigger rooms but then you have to do without the views. Breakfast is OK. The lakeside terras is also quite nice.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r428706376", "sub_review": {"Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Pleasant stay but not a 4 star hotel", "review": "Pros Excellent location overlooking the lake in the centre of historic, beautiful Sirmione Very clean, quality white bedding and fluffy towels changed daily. Light average sized room with large patio type window with juliet balcony - unable to sit outside. Good view of lake on side sea view (however, booked a superior room so assumed a full lake view with balcony) Lovely sun terrace where it was pleasant to watch the swans, ducks and birds along with the coming and going of the ferries. Beautiful sunsets from this spot. Delightful breakfast room over looking the lake Some staff helpful and friendly - Barbara on reception and the breakfast waiter Free bikes available - lovely lakeside bike rides Gluten free biscuits / cakes available, good range of cold breakfast choices and…", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r427158852", "sub_review": {"Location": 5, "Cleanliness": 4, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Disappointing", "review": "The hotel is advertised as four star but you may be disappointed by the expectations this rating promises. For me it was definitely three star, fairly average in most respects and woefully lacking in one key area.  Essentially there is nothing wrong with the hotel itself. The room I had was large, had a comfortable bed and a modern and clean bathroom. I always had a good nights sleep and there was very little noise from outside. The bedding and towels were changed daily and the service staff worked hard. However, look closer, look in the corners and you might find some dust and cobwebs. Perhaps the cleaner simply had too much to do, there did only ever seem to be only one member of staff cleaning, at least on our floor.  There was nothing remarkable about the breakfast and I…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r425496703", "sub_review": {"Value": 1, "Cleanliness": 3, "Service": 1}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "10yr anniversary", "review": "Staff are very friendly, waiting staff are always there to help. The terrace onto the lake is perfect. Feels a very safe and comfortable place to be. Try and opt for one of the rooms overlooking the lake, non were available when we booked. Our room was however lovely clean and spacious just didn't have the view. We will definitely return to this hotel.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r422324800", "sub_review": {"Location": 5, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Sirmione hotel", "review": "This is going to be a difficult one to write and as I am writing, it will become evident.  First, the location is fanatastic. It is close to all the actions and the ferry service takes you to all the towns in Lake Garda - very convenient.  The room we had, a superior faces the lake and the view is amazing. It is advertised as 4 stars with air con and minibar, but it is no more than a 3 star because of the service. The service was not up to par, mainly the staff is over worked and had to multitask. There was one lady at the front desk - she checks you in; checks you out; answers the phone on reservation; serves as the telephone exchange; gets you the taxi and answers any question you may have about the town, the map, ferry schedules....  There are two waitresses serving breakfast…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r422251008", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Superb location, excellent staff", "review": "Stayed 3 nights with another couple  and enjoyed the great location in the old city of Sirmione, with A deck on the water. Good public areas and good breakfast. Rooms and bath were mediocre. If available Ask for a room facing the water when you book. Hotel staff were very nice and very helpful. The hotel has a parking place out of the old city, 500-600 meters walk to the hotel, but on arrival you park closer for 24 hours and your staff is brought to the hotel - very convenient. The Restaurant adjacent to the hotel is good, and you get there 10% if you are  hotel guest. In Total we had A good experience in the hotel,", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r421990995", "sub_review": {"Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Blissful belated honeymoon", "review": "My wife booked this hotel for our 10 year anniversary honeymoon.  We booked for 4 nights from 19-23 September in room 38 the junior suite. We had beautiful panoramic views. The room was clean and huge. Bathroom was spectacular and shower had perfect temp and pressure.   The staff were amazing. The waiting staff were on their feet all the time and were so accommodating. The deck was well looked after and you can dive straight into the clean fresh lake to cool off with the ducks. There's also a shower on the deck to clean off after a swim. The sun loungers have shades attached so you can position perfectly to read without the sun in your eyes.   The hotel is about 2 minutes from the dock to catch the ferry which can take you anywhere on the lake.  It's perfect to explore Sirmione…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r421974100", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Weekend away", "review": "Had a fab time here. Hotel is lovely and in good location. Breakfast was just what you need.  Staff were lovely. We stayed in room 30, nice and spacious maybe needs a bit more of a modern look but it's fine bed was clean. Did notice an empty bottle of coke behind bed been there a while as dust on lid, I left it there and was still there when checked out so shows not cleaned behind sofa.  Very noisy on a Sunday morning with deliveries.  But all very minor things. We had a lovely stay and would definitely stay again.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r419689524", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Honeymoon - perfect location ", "review": "This hotel is in the perfect SPOT! Enter your Large room with lake view and watch the sun down - afterwards take a stroll to get an delicious  ice cream and walk around the \"evening lit \" castle in Old town  Sirmoine.  You won't get a better location or set up than this hotel. The rooms are spacious and bathrooms are roomy and excellent. The deck is wonderful and frequented by beautiful swans.  They did appear to be a short of staff if ordering drinks or food but we were more interested in the location, the view and the comfort factors.   Breakfast had a lot of variety and was perfect to set us up for long walks. Pastries, toast, cheeses, cold meats, cake, eggs, bacon etc. Plenty of choice. Again slightly short staffed. The staff that were on duty are amazing but run off their…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r417556539", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "On the waterfront", "review": "Thoroughly enjoyed 10 days in the hotel Flaminia ...terrific staff making you feel very welcome ...despite the masses of tourists in Sirmione the hotel was surprisingly peaceful . As its situated next to the ferry terminal its ideal for exploring the lake. make sure you also take the local buses to the many nearby towns great fun... we will be back .", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r416078360", "sub_review": {"Value": 4, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Family Holiday", "review": "We stayed at this hotel for one week with our 2 teenage sons.  We had 2 rooms, our room which was a superior room (room 22) had a lake view & was perfect, adequate space especially the bathroom so well worth the extra money.  However our sons room was the standard room (room 9) and this was much smaller, there was a small balcony with only enough room for one person to stand on with no view apart from the street.  The bathroom was really dated and as there was no window felt very claustrophobic, it didn't help that their air conditioning was very poor, especially compared to our room which I had to turn off on occasions as it was so cool!  I know people say that a room is just for sleeping in, however we do like to have an early morning cuppa on the balcony and a last night cap…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r410459428", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Wonderful location, very cool design, great food, wonderful staff.", "review": "The hotel is right in the heart of this very busy town and driving in through the very small and crowded streets initially feels overwhelming and counter-intuitive.  However, once you're in they have somebody park your car in an outer lot and the trauma is over and fun begins.  The hotel is very modern and clean and has a funky Zen ambience.  The rooms are a little small, but quite adequate and cooled nicely.  There is a deck out back where you can sunbath and swim, though it is right near the ferry landing.   We preferred walking up to swim at Jamaica Beach, a very cool natural formation on the tip of the peninsula right under the ruins of a Roman villa,  The staff are all very friendly and helpful.   The food at breakfast and in their attached restaurant was excellent.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r407888446", "sub_review": {"Location": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Almost but not quite", "review": "Room 9 overlooks the service entrances to a number of hotels and restaurants and you are woken up by early morning deliveries. The beds were comfortable and the room was clean and serviced daily, however it needs an update. The location cannot be faulted, right on the lake with a generous sun terrace and only 50m to the ferry terminal and access to the whole lake. The staff were friendly and very helpful, the breakfast varied.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r405703115", "sub_review": {"Value": 4, "Rooms": 3, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice Hotel", "review": "We enjoyed our two day stay at the hotel. It is very nicely located right in the middle of the city but also on the lake., clean and very friendly staff. We had a back room towards the alley but nice and big. Unfortunately almost no internet there.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r405427778", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Hard to leave!", "review": "We stayed at the Flaminia recently for three nights and on the advice of other reviewers booked a lake view room. Absolutely delighted with our room (number 8). The balcony itself is small but the view is amazing by day and by night! Bike hire is free and they are kept just outside the front door of the hotel. We cycled to Garda and caught the Ferry back. If you cycle along the lake side all the way it is completely flat, which makes it so easy. It is an amazing cycle and I recommend you do this. It will take most of the day but a great memory to have. Breakfast is lovely. The sun decking area is fab and for those of us with a fairer complexion the sun chairs have a shade which you can adjust to protect your face. There are plenty of sunbeds. You can get towels from the staff…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r402569053", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent hotel!", "review": "The hotel is in a great, waterfront location - the sundeck at the back of the hotel is a great place to spend the afternoon (or all day); having a swim in the lake, reading, having a coffee or a drink from the bar. The restaurant also serves delicious food and you can get a nice quiet table right next to the lake, rather than out on the street with everyone else. Even the 'standard' rooms are very spacious and modern. And the staff were very helpful and accommodating! The only issue was that the wifi could be a bit temperamental at times. Apart from that - 5 stars. ", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r399197231", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Fabulous location, very friendly staff", "review": "We spent nine nights at the flaminia recently, the hotel location is perfect, the staff were friendly and helpfull, both the breakfast and evening staff worked very hard, always on hand to help guests. We were there with a very small baby and this we found posed no problem. We were on a half board which meant we had the full choice from the menu each night. There was enough on the menu for that amount of nights. I would recommend this hotel to both couples and couples for the location, food and the friendly nests of the staff. Only niggle was some guests put towels on the loungers and never returned for up to six hours, the deck area is small snd the staff need to monitor this more. Overall a great hotel in s beautiful part of lake Garda.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r397531787", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Warm, comfortable hotel at the heart of Sirmione", "review": "You can feel like home when you are in Flaminia Hotel. At the entrance lobby is spacious and connects to breakfast hall towards lake side. After breakfast area, there are sunbeds just next to the lake. You can have sun bath and swim in the lake very comfortably. Hotel provides towels if you need.   I picked basic room and it was very spacious with a great view. Although our room was not facing lake side, we had plenty of lake view. Bed is comfortable. There are couch, small table and chairs in the room. Whole room and bathroom is very clean. Bathroom is also very spacious. Air condition works perfectly well. There is free wi-fi in the hotel and coverage is good throughout the building.  I like location of the hotel very much. If you drive, you can enter within the castle until…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r394457395", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Very Nice location and Friendly Staff", "review": "Second year we came back to this perfectly located Hotel with an own sun deck by The Gardia Lake. You drive to the Hotel and the staff parks your car. Very good service from The friendly staff. The Breakfast is very Nice and extensive. You can also order Food from The restaurant next door. We Will be back ! ", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r391728933", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Perfect location, friendly staff, great experience", "review": "My wife booked this and I believe it was the perfect choice.   Firstly the location is second to none. Your located just down from the ferry stop making it very easy to access and get around the Lake, your position within Sirmione is also perfect as your right in the heart of everything. You can get to all the best restaurants and bars quickly and easily.  The staff couldn't have been any more helpful. From booking our taxis and boat hire, to the 24 hour room service, getting us extra pillows and generally being a pleasure to deal with. All of them made you feel very welcome to the hotel.   I recommend room 24. We had the perfect view of the Lake and the room it's self was very clean, tidy and nicely decorated. it was really spacious as well which helped.   The breakfast that…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r391714239", "sub_review": {"Sleep Quality": 4, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Wonderful Hotel", "review": "My family and I have been staying at the Flaminia for 25 years, the quality has been maintained throughout this time, you always get a warm welcome upon arrival and at check out, you will struggle to get get a better hotel for position in Sirmione. I recommend it to all for a great vacation  ", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r391406917", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lunch on a day trip", "review": "Boiling hot day in Sirmione, after taking the ferry from Toscolano Moderno. The Square immediately off the ferry felt even hotter as it was so frenetic. So, we walked a few minutes and found this restaurant in a quieter part, which offered a canopy (and thus shade) across the front and ceiling fans inside. The menu itself was like a short story book, on expensive paper, but more importantly offered a wide variety of choice. Food was well prepared and presented and very tasty. A pizza, large (prosciutto, provolone, sun dried tomato and leafy) salad, 2 bottles of water, a 1/4 ltr of wine and 2 espresso for €41", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r391025344", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Fantastic Hotel in great location", "review": "I recently spent 3 nights at this hotel with my family.  What a wonderful hotel it was.  Staff were fantastic, breakfast was plentiful and hotel had a really homely feel to it.  Out look over then lake was superb.  We all commented that we felt like we were sitting in our own homes it was that relaxed and comfortable.  Would strongly recommend this hotel and area of Italy.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r390507060", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Beautiful idyllic find", "review": "Stayed in hotel Flaminia for two weeks, very friendly staff, especially the morning breakfast ladies that run around getting trying to make sure we have everything we need!! And the night staff were lovely and greeted you all the time. We had a side bedroom with a little balcony of the side view of the lake so was pleased which we were pleased with, clean sheets and towels every day. Towels were given to you when you wanted to sun-bathe on the terrace/deck, though you would ask at the bar/kitchen area for them which was bizarre as the breakfast staff had enough running around to do without people asking them for towels, they should be left out in the deck area so people can help themselves!!  Swimming in the lake was totally amazing as the lake was so clear on most days, as you…", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r388980921", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent Sirmione base", "review": "We spent 5 nights here and it was wonderful. The staff were extremely helpful and for the first time in a long time I felt the website depicted the hotel! The only 2 issues I had was that the air con was fairly noisy and the restaurant next door to us had a delivery around 7ish every morning which was noisy.   Good points: Location, fabulous terrace that you can walk straight into the lake from, 2 minutes walk from where the ferries depart, surrounded by good quality restaurants and food in their own restaurant is good also. Cocktails here are lovely! Room (25) was a standard but was spacious and clean with a freshly made bed every day, very light and bright with a lovely view over the lake although we were on the side of the building!   All in all a wonderful introduction to…", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r388038044", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A very nice find!", "review": "Hotel Flaminia was a very friendly, family run hotel overlooking Lake Garda in the resort of Sermione on the south of the Lake. Very conveniently based for the water buses. Very clean and rooms were good and maid service every day. Bed, think queen size was so comfortable after busy days out and so were the pillows. Crisp, white linen and fluffy towels all went to make a perfect stay. We wished we'd booked a balcony room overlooking the lake but we did have a view from the juliette balcony on the side. Breakfast was varied from hot buffet to cold meats, cheeses etc and the fruit and pastries were delicious.   Decking with loungers and tables and chairs were an idyllic place to relax after a busy day exploring the lake.   The staff were so helpful and very kind contacting a local…", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r386928043", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Just what I wanted", "review": "I was looking for a character hotel right in the centre of sirmione and this hotel turned out to be perfect. Step outside the door and the old town is at your feet. Surrounded by restaurants and shops and within a stones throw of the thermal spa, historical buildings and lovely walks.  The jetty for the ferry and other boat trips is also very close.  All of the staff were extremely helpful and were very quick to pick up on our likes and dislikes at breakfast.  The afternoon tea was an added bonus.  I could not get enough of the decking area which was never too crowded,  it was lovely just watching the activity on the lake and having a quick dip to cool off every now and then.  The one slight issue was the morning noise on one side of the hotel - we asked to move rooms and the…", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r384029281", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Nice hotel in a great location", "review": "This is a nice place to stay the staff were friendly and the room was a good size and nicely decorated it also had a good sized bathroom. There is a great sit out/sunbathing  area at the front of the hotel with steps straight into the lake and a fresh water shower for when you get out.  The breakfast was fine despite some of the reviews i had read and although not the best there was plenty of variety and it was all fresh. The hotel is right in the midle of the tourist area with lots of nice restaraunts nearby. If you like ice cream sirmione is the place for you they even have great tasting sugar and dairy free selection.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r383426092", "sub_review": {"Value": 4, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Wonderful stay", "review": "We stayed 5 nights in this hotel and everything overall was great. We had booked a lake view and weren't disappointed. The room was spacious and comfortable.  The terrace is a great place to relax and bathe in the lake, not that we ventured in as it was too cold!  The hotel is situated in the old town so everything is super close and easy to reach.  The ferries are on your doorstep so you can explore the other areas surrounding the lake.  It costs around €24 for a lower lake day ticket.  The breakfasts provided by the hotel were excellent and the staff looking after this area were super friendly and efficient.  Everything about our stay was just easy which makes it a great holiday!", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r381636896", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Still great", "review": "Returning after 3 years I still find this hotel greatly located, clean and comfortable. Its terrasse over the lake is not only perfect for sunbathing and swimming but also to enjoy a cocktail. The room offer a good value for money and i loved the decorative tiles in the bathroom. Breakfast is more than satisfactory. ", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r381090718", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely hotel with absolutely stunning terrrace!", "review": "We found this hotel on what should have been our last day in the area. We decided to stay an extra day and moved to this hotel, to be in central Sirmione ad to enjoy the beautiful terrace directly on the lake. Our room ended up being in an adjacent building, but it was recently refurbished and very nice, which made up for being slightly out of the way. The hotel entrance and public areas are very stylish and airy. We ate there twice, and had drinks on the terrace. Service is a bit slow but the terrace is very far from everything and the wait staff were working very hard running back and forth, so a small delay is easily forgiven! The food was pretty decent (excellent burrata, reasonable pizza and pasta, very good mixed drinks/cocktails). All in all I'd be very happy to go back…", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r378531021", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Mille Miglia stay", "review": "Stayed at the hotel with a group visiting the 2016 Mille Miglia last week.  Excellent stay. location, staff, food ambiance all fantastic. The view over the lake from the sun terrace is great. Would fully recommend, Sirmione as a place to visit and just chill out in takes a lot to beat.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r376337324", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Lovely location", "review": "Stayed three nights in the annex to the main hotel. The room was quite dark with a four poster bed and old fashioned wardrobe. The bathroom was clean - containing one of the biggest basins I've seen but the bath was quite narrow which made using the overhead shower a bit tricky. Our room overlooked an alleyway which proved very noisy first thing ever morning when the refuse van arrived. The location of the restaurant, overlooking the lake, was beautiful and the choices for breakfast were very good. There is a restaurant attached to the hotel which covers the evening menu. The main hotel has a pleasant appearance with the reception area containing a selection of sofas, bar and information leaflets for local attractions and ferry services. The staff were also very helpful. The…", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r373951067", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Fabulous Flaminia", "review": "Lovely hotel in a stunning location - couldn't be better placed . Staff always available and so helpful also always  smiling and cheerful - nothing was too much trouble . Would definetly stay here again .", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r373867055", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Wonderful Lake Garda!", "review": "Hotel Flaminia is in the old walled town of Sirmione.  The town has it's own castle and thermal spa and is situated on a peninsula.  It took us about 30 minutes to get there from Verona airport by taxi.  The streets are very narrow, quaint and busy with people.  Taxis are permitted in to drop you at the hotel but it does take a while meandering through the tourists.  Still, it gives you a chance to have a look at the town.  The hotel totally lived up to our expectations.  Good check in; nice staff; very clean; good beds; good wifi; fantastic lake views and great deck area over the lake.  The lake is very clear and clean.  We only had breakfast at the hotel so cannot comment on the hotel restaurant, which is at the side.  The breakfast team were lovely and soon got used to me…", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r372585543", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Wonderful week-end", "review": "The staff of the hotel is really nice,  and perfect location right in the city center. 5 minutes walk to the Public Terme. The hotel has a terrace with a great view of the lake from the restaurant. Good breakfast even if the buffet could be more various being a 4 stars. Clean and quite rooms. ", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r366914660", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Set right there n the lakeside", "review": "Fantastic relaxing hotel. Our room, even though we didn't have a balcony was superb, spacious, tasteful decor and clean. The bonus was the bathroom, separated toilet and bidet and a shower over a jacuzzi bath - perfetto! Breakfast - wonderful - on the terrace overlooking the lake! Staff, helpful and welcoming, however the lady o the reception desk when we first arrived was a bit officious- very matter of fact.", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r361803696", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "great place, elegance, good food, quiet", "review": "It is the perfect place for people who dont want to feel like they are in a tourist trap. The view  on the lake from the terrace is lovely, the people who work there are efficient and kind. The food is good and I really enjoyed the huge btreakfast meant for the German and the non -German way of life. I will definitively go back.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r343263117", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Fantastic Relaxing Hotel", "review": "We spent a fantastic week at this hotel in September. Will start with a couple of very minor negatives, us English like our tea/coffee first thing in the morning but there are no facilities in the room, this I know is common in Europe. Also our room was by the lift & this can be noisy in the mornings.  This is a really top Hotel, staff are very friendly and helpful, location is perfect spot on Lake Garda. Rooms are spacious and very clean. Most have views over the lake. The verranda is perfect place to chill and relax and to watch the activity on the lake and also the amazing sunsets.  Breakfast is good, and the bar is open 24/7, all the staff were friendly and good fun. Would definitely recommend this hotel for a stay on Lake Garda.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r316081991", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Good Base", "review": "Stayed at this hotel for two nights recently on a business trip witj two other people. The hotel is in a great position in one of Europe's little gems. Yes you can park your car at the hotel , you drop it off and tell the reception what time you need it and they deliver your car to the front door . Driving in the town once past the castle is like nothing else , its very narrow but manageable , look out for the traffic light system and be sure you turn your engine off when stopped. All in all fantastic place highly recommended.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r316065589", "sub_review": {"Value": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Great Hotel", "review": "Great hotel based in 2 buildings. Comfortable rooms, Great breakfast buffet. Staff are very nice and helpful. There is a great deck right on the lake with access to swim. Tge location is great only a 2 min walk to the boat.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r312462625", "sub_review": {"Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "chillaxing", "review": "would not recommend driving to hotel as the road was full of pedestrians who where making progress faster than us.Taxi driver was very patient. although we arrived before check in time we could store our cases and when we arrived back said cases were in our rooms.most staff could speak little english but managed to understand what we needed.lovely room cleaned every day with fresh towels in room and beach towels for sunbeds.good breakfast cereal juice ham cheese egg bacon bread cakes tea coffee (ask for capachino or youll get the strong expresso) free tea and cake every afternoon. check out is 11 oclock but they let us keep our room till one without charge", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r311650430", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "best ever", "review": "just came from a 4 day hikking in the dolomaits. find a perfect hotel in a perfect location. the best room ever! large and comfertable and what a view!  great balcony over the lake. the room is clean the staff very friendly and welcome and very rich breakfirst", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r309330645", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fabulous!", "review": "Just returned from a fantastic holiday in Sirmione. I was travelling with my mother and sister. We stayed for 7 nights at Hotel Flaminia. The hotel was fabulous. We had a corner  junior suite over looking Lake Garda with panoramic views ( Room 36). The room and bathroom were very generously sized. We had fresh bedding everyday and the rooms were very clean. The breakfast was excellent with a good selection of food and drink including Prosecco!  The location of the hotel couldn't be any better, very close to all the shops, restaurants, Castle, Church and the jetty. Sirmione is a beautiful part of Lake Garda, very Italian and traditional. Will definitely return and will definitely stay at Hotel Flaminia again!", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r304561580", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Lovable and non pretentious hotel. ", "review": "We visited as a family in April and just loved this place. We were swayed by the beauty of Sirmione itself but just really liked this hotel. It's not fancy, but it's a bit different. The staff are lovely , always beaming smiles on reception. We were half board and although the selection was quite limited (breakfast - then you choose lunch or dinner) with 2 choices each day, what we had was well made and generous portions. One night the pasta starter was so huge that our girls skipped the main! The tiramisu and the creme brûlée are amazing here!  Breakfast is eaten in a 70's style bit at the back of the hotel which has an amazing sun deck and view over the lake. Reasonable choice of hot and cold foods, our girls loved having a pot of hot chocolate bought to the table for them.…", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r303058784", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good, but a couple of niggles.", "review": "Date Submitted: August 23, 2015  Customer rating: 7.0  Comments: We stayed at the Flaminia in August 2015 for eleven nights. The room was called 'superior' but was a little small to be called that in my opinion, although it was still a nice room. It had a lateral lake view of Lake Garda. My biggest gripe with the room was the air conditioning was not very effective. We were quite hot at night, which should not happen in an air conditioned room. I don't know if the other rooms were the same. They did change the control unit as it has a broken button, but the room still didn't get cold, even at the lowest setting. The rooms were cleaned daily, and the maids did a great job.  Food was good.....although, if you are half board, you only get a limited choice of meal....which seems…", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r302487325", "sub_review": {"Sleep Quality": 4, "Rooms": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good with some disappointment", "review": "On our way back from France, we booked 2 doubles rooms for 1 night in this hotel. Since the hotel is in the old town -where normally you cannot enter with car, your booking name is given at the entrance. So can drive your car in the narrow streets with full of people. Quite a challenge!  The hotel is nice, directly on the lake, you can have very good breakfast looking at the lake. The problem was that we booked 2 double rooms and we were put in a family room and we were not informed before. We paid a bit less, of course, but we booked 2 double rooms on purposes. We are a family with almost adult children, so everybody prefera to be apart. So i did not like this, but since it was only for a night, we accepted but not happy", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r300363862", "sub_review": {"Location": 5, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Nice hotel in a great location", "review": "We only stayed for one night, had a great room with a view out to the lake from the top floor. The location of the hotel is excellent and easy to find. Breakfast was good, everything tasted fresh and not mass produced in contrast to some chain hotels. Wish we could have stayed longer. Being able to dip into the lake from the deck was good fun.", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r300358729", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Fantastic hotel", "review": "This hotel is beautiful. Not only does it have an excellent location but it is clean, friendly, has amazing views and a quality breakfast. We had a junior suite with lake view. we had a corner room (well worth requesting) which had panoramic views of the lake through 4 patio doors. The resort is beautiful, very quiet but plenty lovely resturants to choose from. The lake is warm enough to float around in which I wasn't expecting. Very nice!! I would highly recommend this hotel.", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r297479205", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fabulous Flaminia", "review": "We picked this hotel for the location as we had visited the area on a previous holiday and fell in love with it. We were not disappointed with either the location or the hotel itself.  The hotel staff were extremely friendly and welcoming, I particularly loved being able to take the car we had hired to the door of the hotel and the staff took it away to park in the designated area (due to the location, no cars are allowed to be left overnight outside the hotel) Our room was on the top floor which we reached by lift, room 33, it is on the main entrance side of the hotel and although it did not have a balcony, it does have very larger patio doors with a \"Juliette\" balcony and a fantastic view over Lake Garda.  The room was very large and had a TV and a fridge as well as a sofa bed…", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r296609902", "sub_review": {"Value": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fabulous Faminia", "review": "Just returned from a great week in the lovely hotel Flaminia in the centre of the  beautiful Sirmione town near the boat jetty. We had a 'comfort lake view room' which we highly recommend with its little 2 chair balcony looking out over the lake, views are fabulous and the room was a 1st floor corner room (6)  just right size, well decorated and equipped with minibar, tv, and free wifi (no in room tea/coffee maker), with an excellent bathroom with bath and shower over and its own 'patio' doors and little '0 chair' balcony/guard rail overlooking the side street. The public rooms were very pleasant and well decorated and the very good breakfast provided in the lakeside terrace restaurant.bar. The staff from reception, housekeeping and breakfast were outstanding, so cheerful and…", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r296352523", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Recommended", "review": "We stayed for three nights, very efficient welcome and showed to our room which was across a small road, which seemed odd at first but the hotel has an annex, a separate block of rooms.   The rooms for all three of our party werent a disappointment, spacious very clean, beautifully decorated, ours had a lake view even though we hadn't asked specifically for it, one of our party had a suite which she hadn't asked for and that was fab, we called her madam presidente all holiday as a result.  Hotel breakfast was good, plenty of choice even boiled eggs. The previous reviews  complaining about the coffee I can't understand ...it's fine!  We had a problem without hire care and had to have it towed away, the two rceptionists couldn't have been more helpful liaising with the car hire…", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r295514124", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Fabulous Location", "review": "Beautiful hotel in this lovely town. The terrace on the lake is a great place to watch the boats from and to go swimming with the ducks. A little bit annoying that people save sunbeds really early on and then leave them unused for large chunks of the day.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r293736053", "sub_review": {"Value": 4, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Perfect relaxing getaway", "review": "Wonderful week away, really enjoyed our holiday here! Ideal location in the centre of Sirmione minutes from the boat stop, and right on the lakefront with a terrace stretching out onto the water, perfect for sunbathing/jumping in the lake/having drinks in the evening. The staff were friendly and very helpful - we emailed them before we went about the opera and they arranged the whole thing with transfers etc. Our room was lovely, very clean/modern. Overall fantastic value, and very sad to have left!", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r291508812", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A Friendly Hotel", "review": "We really liked this small hotel which we chose mainly for the location. It is right in the centre of this delightful little town so everything is right there. We were with our son and his 16 year old son and we had 2 suites. Well, they were called suites but they were really bigger rooms than the standard ones which were very small. Our son and grandson had there room in the building across from the main hotel and was newer and much more modern than our room which really needed upgrading. Both rooms had lake views which was worth paying the extra for. The staff at the hotel were friendly and helpful and the breakfast buffet was good. I would recommend this hotel.", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r291392669", "sub_review": {"Location": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Perfect place for an Aperol-Spritz", "review": "I don't know about the quality of the hotel, but the bar and restaurant proved perfect in the mid of july, because there are direct access to the water. This resulted in me, my wife and a couple of friends, enjoying a drink on the patio, while watching our kids jump into Largo di Garda - perfect match:-)", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r288301405", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Overlooking Lake", "review": "Booked a junior suite.  Good size room and fantastic views facing Lake Gada on the water's edge.  Price good for position and centre of old town with immediate access to stylish shops and restaurants.  Park outside and the car is taken to a secure car park.  Air conditioning could be better in lobby/restaurant area but it was 35C outside during our stay. Room was very clean but Sirmione ran out of water (due to electricity failure) during last morning of our stay which took the shine off the experience and not really the hotel's fault.  No pool but swimming possible in the Lake direct from the sundeck.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r286859889", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Fabulous room, location and views", "review": "We had a \"comfort\" room overlooking the lake, and thought it was well worth the extra money.  The 3rd floor room was very spacious and had glass on two sides, affording great views over the lake.  The bed, decor and bathroom were faultless.  The staff on reception, bar, breakfast and room cleaning were very friendly and helpful, especially the dark haired lady on reception in the evenings and the young man behind the bar.  However, the morning lady on reception was not so helpful and kept 3 groups of customers waiting for over 15 minutes while she was on her mobile. Breakfast was quite good, with plenty of choice, but it could be greatly improved by (a) better quality coffee and (b) proper fruit juice (it tasted synthetic and too sweet).", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r286718166", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good bed & sleep quality", "review": "Pros: - Very good bed and bathroom quality.  - Nice location in the old town of Sirmione, a bit aside of tourists crowd. Creme de la creme of Sirmione could be reached by a maximum of 10 minutes walk.   Cons: - Beware of awful coffee served during the breakfast there (strange especially for Italy) - Rooms are much nicer than the reception zone, don't be scared - Parking your car means you have to go back outside of Sirmione island and walk back", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r284170092", "sub_review": {"Location": 5, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very good hotel with nice location and reasonable price", "review": "We stay in this hotel each summer, and this year we have notice significant improvement in rooms furnishing and equipment, breakfast has become better. Besides the amicability of staff is still on the highest level. The hotel located in the center of old city but a little bit away from tourists crowds. The hotel can be recommended for anyone traveling with kids or without due to good sound insulation of rooms. Reasonable price level is a very attractive argument in a decision to stay in this hotel.", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r284097939", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Lovely Hotel in a Superb Location", "review": "The hotel is clean and spacious.  We had a lake view from our Hotel Room which was amazing.  The hotel staff were so friendly and courteous they couldn't have been more helpful.  The hotel is in the middle of the old town so is surrounded by bars, restaurants, shops and gelataries so no need to use the car at night time, you can venture out of your hotel and take your pick.  Once back at the hotel you hear no noise at all.  Breakfast is on a covered terrace with views out to the lake. Lots of choice including prosecco!! We are definitely looking to go back and stay again.  One small suggestion is that the wooden furniture is changed as the chest of drawers was difficult to open and made quite a lot of noise on closing which could be heard in other rooms but everything else was…", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r283531300", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Definitely Recommend", "review": "We visited Sirmione for the first time in early May and we decided to stay at the Flaminia Hotel. We were greeted by a very helpful staff member who checked us in quickly and directed us to our room. The inside of the hotel is very clean and modern compared to the exterior of the hotel. Our room was situated on the first floor with a balcony and a view of the lake. It was beautiful! For anyone staying in the hotel, I would strongly recommend getting a view of the lake as it really adds to the experience of staying in the hotel. Our bathroom was clean and we had ample space to store our clothes. The only negative aspect of the room was the fact the walls were quite thin and we could hear the guests next door. Apart from that, the hotel was all that we could have asked for and we…", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r277547098", "sub_review": {"Value": 4, "Sleep Quality": 3, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely Staff, Excellent Customer Service and Great Location", "review": "My partner and I stayed at this hotel for 6 nights. The staff were friendly, helpful and welcoming as soon as we stepped through the doors. They helped us with information regarding local attractions and clearly explained Lake Garda's boat hopping timetable.   We had the lake view room with the balcony and what a view! Truly worth the money.   The breakfast at the hotel was delicious and each day there was a variety of ham, cheese, bread and juices.   The only problem I found with this hotel were the thin walls. Unfortunately we could hear a lot of noise from the room upstairs and next door. I am not someone who gets irritated by noise quickly, however, I found it slightly uncomfortable hearing people argue and also another person vomiting very clearly whilst I try to sleep.  …", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r277536520", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "EXCELLENCE ALL ROUND YOU WILL NOT BE DISAPPOINTED", "review": "Booked this Hotel for a family visit to celebrate a 'big' birthday for my husband. Whole experience was exceptional. Staff could not have been more helpful. Lovely rooms, excellent breakfast, amazing location.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r277175238", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Beautiful town, excellent location!", "review": "We loved the hotel.  The staff were extremely helpful and engaged. Our room was larger with a beautiful lake view.  Even though I had read other reviews I was slightly surprised when I realized the small balcony is really nothing more than a window that opens,  doubt it is a foot wide, perhPs 6 inches? That aside we were very pleased with the hotel.  Choices in the morning breakfast included with the room included lactose free and gluten free options.  We were very pleased with Sirmione and the hotel.  There are beautiful areas to shop and walk right outside the front door of the hotel.  Many dining choices and the boat and ferry dock if you want to explore other areas of the lake. We took the train from Malpensa airport.  Taxi at $35 was a bit more than expected.  This was in…", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r270571485", "sub_review": {"Sleep Quality": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Beautiful Hotel in Sirmione", "review": "We arrived at Sirmione at around 6:30pm on 23rd April. To find the Hotel you need to go right past the Moat and through the streets. This is daunting, but don't worry you are going the right way! After you pass the large Gellato shop on the right hand side under the tunnel and Hotel Flaminia is on the left hand side at the end of the street. On arrival to the hotel the reception staff was very polite and as the ladies headed up to our room the men were shown where the car park was (which is situated out of the streets). This was €8 for the duration of our stay. The room was very big! Really comfortable and had a beautiful bathroom and jacuzzi bath. We also had a lovely view of the Lake. We had a quick freshen up and walked the streets for a while before settling in a restaurant.…", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r268671485", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Relaxing location", "review": "We found Hotel Flaminia friendly, relaxing and comfortable.  In a great location, about two minutes from the water taxi stop.  Friendly and helpful staff.  We had a lake view room which was spotless and comfortable.  Good choice for breakfast with a small selection of hot food.  Choice of coffee and served quickly.  Lovely outlook with sun beds available on the terrace.  We used the bikes available at no extra cost and cycled down the peninsular by the lake, stopping for coffee on the way.  We used the restaurant attached to the hotel and found this to be friendly and reasonably priced.  Sirmione is a busy place but after 4.00pm the tourists go and the town is left to the hotel guests and locals to explore.  Plenty of restaurants and cafe bars.We would recommend this place and…", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r267856475", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Flaminia", "review": "Was a good hotel, needs to be remodel in some places. (Floor in the room) Very good location. The first room they gave me did not luck so the give me a new one immediately. Breakfast for excepcionaly good.", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r264650421", "sub_review": {"Rooms": 3, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Stability in highest level of comfort - is a sign of skill", "review": "We stayed at this hotel for the second time (2013, 2014). Great hotel, very well located in the old town. We recommend a room with lake-view. Breakfast is excellent. Guests can dine out at any restaurant in the neighborhood. The friendly and helpful staff. Although the last time there were problems with the internet, it does not affect negatively on our journey. Thank you very much, we will be back in 2015.", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r260851160", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Nearly sleeping in the Garda!", "review": "The hotel is fantastic with large and comfortable rooms. I felt like I was sleeping in the Garda sea, so close was the sea. Very serviceminded and helpful. They took care of our car, no charge. We had lunch and dinner at the hotel and the food was very delicious. Very good spagetti al vongele. Very tasty breakfast with a fantastic view of the sea. Even if it was in the middle of October, we took a bath in the sea. Very refreshing and nice to swim around the swans.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r237755811", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Birthday trip", "review": "Just visited for a short 4 day trip with 8 of our friends . And had one of the best weekends ever. The hotel was perfect . If you go make sure you get a lake view as it will blow you away .  The only downfall of the hotel was the bar staff , the words laid back is understated ", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r231881687", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Delightful restaurant in a gorgeous location!", "review": "Sirmione is a picturesque location. Cafe Margherita is placed on a cobbled street, leading to the waters edge. The food was lovely. The staff was attentive & allowed you to enjoy your food & your surroundings. A very enjoyable meal!", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r230566457", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Best relaxing holiday I've ever had", "review": "Terrific location, amazingly friendly staff !! Lovely food, wonderful room with balcony looking out to lake Garda and the surrounding hills. Almost pedestrian surroundings eliminating traffic noise and the inevitable screaming scooters. Sunbathed all day on the private relaxing terrace next to the cute ducks and watching the boats idling passed.  Talking boat trips, we took one around the lake on a hydrofoil to a few of the other harbours, towns and ports......was terrific but Sirmione where the hotel flaminia is situated is in my opinion far superior.   Food in the local restaurants is spectacularly good. A little pricey but actually I didn't mind paying because it was of excellent quality and always beautifully presented by the extremely polite and professional Italian…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r229480371", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great hotel", "review": "We had a good stay at flaminia hotel. Service is good and the staff is friendly.  The terras is a great spot to relax and take a swim. Location in the centre of sirmione is very nice. All facilities are close by. ", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r223818390", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Wonderful holiday", "review": "We stayed here with our three small boys in one room. The room had a double bed, a bunk bed ( converted from a lounge) and our four year old slept in a cot which was a good size for him. The floor of the hotel we stayed in had just been renovated which probably influenced our good impression. We found everything modern and clean. The room is not large but we found it fine and you could see the lake from the balcony. The town is charming with cobblestone streets and bustling with people, shops and lots of restaurants. The staff at the hotel were very friendly and the breakfasts in a room overlooking the lake were extensive with lots of choice and excellent coffee and hot chocolate prepared fresh by the staff as required ( rather than a pot of brewed) which we much prefer. We went…", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r217687066", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Total relax", "review": "Nice comfortable rooms, but we did not spend too much time there. The decking is where the views of the lake are, sitting there relaxing with a glass of Spritz (a must try - very refreshing), the staff are very attentative and the food from the Caffe Margarita is superb for a very reasonable cost.", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r212287152", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Sirmione is lovely and so was the Flaminia Hotel", "review": "We arrived in Sirmione one afternoon without a reservation.  We asked at several hotels but none appealed to us. At the Flaminia the receptionist cheerfully showed us a large, attractive room with a view of the lake and the little piazza.  She also gave us the bargain rate of 100 Euros.  We ended up staying two nights.  The breakfast was very ample and we liked sitting  on the deck overlooking the lake and watching the boats.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r210129443", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very nice!", "review": "Very good location in the old town with a deck into Garda lake. The rooms were clean and cosy,  although we had a bad smell in the bathroom that didn't go away even after we complaint. Beside of this incident the staff was very helpful and kind.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r208818009", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "excellent stay", "review": "We stayed in Hotel Flaminia for 3 nights in May 14. Our room was facing the back and had a nice view of the Lake. Very quiet! Big room, especially in italian standards. The reception ladies were very helpful and even helped us finding wineries near by! Breakfast was good, nice selection of fresh fruits. The Hotel location is amazing in the centre of Sirmione, plenty of restaurants to choose close by. The terrace over the Lake is nice for pre dinner drink and watching the sunset! I would definately stay here avain.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r208457307", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Avoid rooms at back of hotel", "review": "We stayed in one of the rooms at the back of the hotel (the opposite side to the entrance) and on all but one morning were woken up by the loading and unloading of supplies for the attached restaurant and nearby establishments between 5.30 and 6 am.  It was also quite noisy up until midnight on some days. We had to have the window doors ajar because the air-conditioning system was so noisy and did not appear to work. The room itself was very clean but quite small. Breakfast was quite reasonable with plenty of fresh fruit but a very limited hot selection such as pancakes or boil your own egg. The location was good as you were only a couple of minutes from where the boats left that went all over the lake.  (Do read the boat timetable carefully as out of season some boats only run…", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r207441926", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 2, "Rooms": 2, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good hotel in a great location", "review": "We stayed 2 nights in Sirmione. If your driving, park at the tourist information centre on the left just before approaching the gate/draw bridge to Sirmione. You will then get a pass to drive into Sirmione with its narrow streets and lots of tourists which is an event in itself. The parking is actually off peninsula so you will have to drive back out. If your not a confident driver, might be better to walk to the hotel and get the car parking pass before. Nice welcoming staff. The hotel has a little bit of a 70's theme but not offensive. Our room was on the 3rd floor, 39, which was at the side of the hotel but still had a great view of the lake. Very spacious and clean room. Breakfast was good but not amazing. Would stop here again if stopping at Sirmione due to the location.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r204904915", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Perfect location in the 'island'", "review": "We were there last week on may. It was our 4'th times our stay in this hotel. What i really like most from this hotel is the location. Normally they have valet service for the car but last time we have to take care of ourself. Quite limitation breakfast...they should do more. Room are clean and nice especially from the main building. Higher are a better view. Like i say, perfect location and with the right rooms......view are breathtaking. Note, not every rooms are having good view. Good value after all.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r204543115", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Perfect location on the lake, and in the centre of Sirmione", "review": "We had a three night stay in a double room in the Annex to Hotel Flaminia, with a side view to Lake Garda from the small balcony.  The hotel location was excellent, right on the lake shore and in the heart of the old town of Sirmione. We arrived on the direct bus from Verona, and the hotel is easy to find on the short walk from the bus stop. The views across the lake from the restaurant and sun deck were really beautiful, especially in the evenings as the sun set across the lake.  Service in the hotel was good - at reception, in showing us to our room, at breakfast and in the bar.  The breakfasts were ample and with a wide range of fresh, hot and cold food.  Our room was fairly compact, and nicely furnished and decorated in a colourful oriental style. The bathroom was a little…", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r204422092", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice hotel", "review": "We have just returned from a weeks stay here in a lake view room which was lovely. Light airy room with a good bathroom and a balcony to sit and watch the activities in the lake. Good location right in the centre of the town which is within the walls of the castle. Breakfast was ample although at times the coffee service was a little slow. We spent our time going from town to town either by boat or by car so didn't really spend much time in site. The only thing missing really is a pool for those times when you just want to chill out and relax, great places to eat in the centre and overall a great garda base  ", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r202173369", "sub_review": {"Value": 4, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Nice hotel on Lake Garda", "review": "We were here in March and it was beautiful 3 days. Hotel is nice and calm. It is located in the old town, near the thermal baths.We arrived by car and even though the hotel is located in the heart of the old town, we were able to park right outside the hotel.", "date": "March 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r200595778", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great view of Lake Garda", "review": "Booked with Bookings.com and specified a lake view. But when I phoned the hotel to ask if they had received my request, they said no, as they do not offer Lake View rooms via 3rd party companies. I asked that if I cancelled with bookings.com and booked a room with a lake view with them, would they do this for the same price? \"Yes\" Room decor is a little strange but hey what a great view!!", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r199832381", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Couldn't be more convenient", "review": "We were delighted with our stay in Hotel Flaminia.  Staff were always helpful, patient and willing to assist with information. They organise parking and have bicycles freely available which was a fun way to see local sights. We had a room overlooking the lake which is quieter than being on the piazza. But even the piazza quietens down around midnight. I am happy to recommend this hotel. ", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r188595862", "sub_review": {"Value": 4, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "Great view from our corner room", "review": "This hotel is located in the old town, where you get by car only if you have the hotel reservation. The hotel takes your car to the garage. We got a very nice room with a great view to the lake and one to the gardens. The room was well decorated, bathroom spacious and very clean. Breakfast was served on the terrace just above the lake - great! Service was friendly, so there was nothing to complain but the weather! The hotel even had big umbrellas, so they did everything to make your stay a good one!", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r185050694", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely location, staff and room.", "review": "Great choice of hotel - the location is amazing.  Lovely view and very convenient for the bus to  Verona and  the train station for  trips to Milan. The staff worked very hard to keep everything clean and running smoothly. Fresh food at breakfast with great service. Lots of restaurants and ice-cream shops on the doorstep. Thanks to all at the hotel.", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r181497636", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good hotel with sun deck by the lake", "review": "The location of this hotel by the lake shore in the old part of Sirmione is great. They have sun beds on a sundeck built on poles in the water, from where stairs lead into the water (although ducks and swans may discourage some people from swimming there) and towels are provided. The restaurant where breakfast was served from 7.30 was adjacent to the sun deck and so we had nice views across the lake at breakfast, which was quite good with bread (especially the rolls with pumpkin seed were very tasty), ham, different types of cheese, yoghurt, cereal, fruit, omelette, tomatos, but the juice was from concentrate and not fresh (a menu showed that fresh juice cost €5 extra). The woman at the reception when we arrived was nice and helpful and spoke English well. We asked her about the…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r179054005", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great rooms, great location", "review": "Stayed here for 5 nights, never had lake view but quality of room superb! Room had settee and lots of space, large jacuzzi style bath and finished to a good standard. Cafe/restaurant attached to hotel served excellent food, even although sirmione is very busy this hotel is peaceful with its own jetty overlooking the lake.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r177277202", "sub_review": {"Value": 4, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Lovely visit to Sirmione", "review": "My partner booked the Flaminia Hotel because he had stayed there some years ago and remembered that he had liked the place. We were only there for a weekend at the end of April so we chose a room in the annex of the hotel that did not have a lake view because we did not expect to spend much time there (apart from at night). The room we were shown into was on the third floor with a large double bed, a whole wall of clothes cupboard, the window faced out toward the small lane outside and the sun shone in during the morning. The bathroom was large, very modern and tiled from floor to roof, very nice! We were very comfortable while we were in the room, slept well and enjoyed the bath with ever facility. Breakfast in the mornings was a buffet in the main hotel building next door with…", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r177225195", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A slight step back in time but lovely.", "review": "Everything you need, a very small road through ancient alleys filled with tourists, (Smart cars a must) they then will park your car for you off the peninsular. There's a pontoon to swim off, really helpful staff, sensible breakfast, a room to iron your trousers in! (Much to the consternation of said staff who may not have seen an English man ironing.) Decor is 60s, almost fashionable again, charming, simple and we enjoyed it. Sirmione is in a similar backwater, some shops selling Chanel some selling copies. Lots of ice-cream parlours and lots of things you might buy and never use or keep out for a while on a mantelpiece until the next spring clean when it will end up in a box. We would come here again and to repeat all the staff were welcoming, helpful and efficient. Suitable…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r171688906", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice family trip", "review": "Second year running at this hotel. Was lucky this year and got a lake view room which was lovely. Great location on the lake with two sun terraces few mins from tons of restaurants. Nice hotel, service is good especially around the pool by the guys out there. Rooms were clean and nice my only criticism was the air con was not up to the job. Literally had to get up and shower in the night and sleep with wet towels so not pleasant however it was 38 degrees so maybe that was just too hot for it. Other than that lovely hotel. Breakfast is nice too.", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r170036244", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 1, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Lock out", "review": "Nice hotel situated by the lake. The rooms are OK but you have to look out for the staff. Our waiter stole a pair of Gucci sunglasses worth 350 euro that was lying on our table . When we ask him to get the sunglasses back he denies there were any sunglasses on the table. We will not stay on this hotel again .", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r169839828", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Beautiful Setting", "review": "Stayed for 2 nights in a nice room in the annexe, across the street from the main hotel. Room was clean and comfortable. Not lake view,  although we could see the lake by opening the windows and leaning round! It's in a great setting in the old part of the town, about a 5 minute walk from the bus stop and about 2 minutes from the ferries to other resorts. We ate in the Margherita Restaurant which is attached to the hotel which was very nice. There are loads of places to eat in the area so you are spoiled for choice. Breakfast was nice although the service wasn't that great and I had to ask for more coffee rather than being offered more. The beautiful location probably puts the price up, and overall this is a very nice hotel.", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r168698990", "sub_review": {"Value": 4, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 5}, {"title": "Perfect hotel", "review": "Perfeft hotel, very nice location in the old city, surrounded by dozens of cafe, pizzeria and etc. Rooms are clean, nice and well decorated. Lovely lake-views. Staff is very friendly and sociable. Reasonable price for a high quality. Hotel is suitable either for couples and for families with kids. We enjoyed staying here and looking forward for coming back soon. ", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r163803454", "sub_review": {"Value": 4, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Nice place", "review": "Hotel Flaminia is at an excellent location in Sirmione. The hotel is in nice condition, beautiful bathroom. It is an ideal place to discover old town. I did not know but you can actually drive up to the hotel to drop your bag and they show you to their reserved parking.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r162808981", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great location, friendly service", "review": "We booked the Flaminia for a family weekend away in late May.  Check in was fast and friendly and staff throughout our stay were smiling and helpful. Rooms were a little dated in style but perfectly comfortable. The buffet breakfast was generous with a large selection of cereals, meats and cheeses etc plus platters of fresh fruit. The breakfast area gave access to the private lake terrace but unfortunately, due to the weather, we weren't able to make full use of this.  The hotel is located in the pedestrianised old town of Sirmione so there is easy access (on foot) to all the cafes, bars and restaurants. Despite its old town position you are allowed car access through the town gate when you first arrive - you can then leave your keys with reception to be parked elsewhere and…", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r162087866", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Worst beds,  wonderful location!", "review": "Booked this hotel after reading good reviews, but nobody mentioned the beds!  Location in ideal, sirmione is a fairy tale village and this hotel is right in the middle, charming place.    Silvia was very helful.  Hotel is a four star,  however I believe this hotel is more like a three! we upgraded to lake view. however the pictures of the rooms in the web site are deceiving the rooms we  were given although spacious, were shabby, the furniture old and dated and the beds were very uncomfortable and worn out, our family suite, had a double, a small uncomfortable sofa bed and a small old camper bed, not adequate for two grown up children and unacceptable in a four star hotel, how do they get away with it?  Must be the views as they are to die for! Regardless this is unacceptable, …", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r144502409", "sub_review": {"Value": 2, "Location": 5, "Sleep Quality": 1, "Rooms": 2, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Nice hotel in an excellent location", "review": "We had always wanted to visit Lake Garda and we decided to stay in Sirmione on the recommendation of friends who had also used the Flaminia Hotel. We opted for a suite which was on the top floor with a large French window that open up and had fantastic panoramic views of the lake and the little port below. The room itself was quite spacious with a very comfortable bed and the room, just like the rest of the hotel, was spotlessly clean. It had a sofa bed for two more guests as well as a small table and two chairs where we sat at night and watched the sun set over the lake. However, remember to close your window when it gets dark as the bugs get attracted to the lights and will fill your room!! There was a fridge as well as plenty of wardrobe space. The bathroom had a shower over…", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r142628844", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great staying", "review": "We were surprised by the location of the hotel since we needed to pass a gate and drive through narrow streets among tourists to be able to reach the hotel. Though a positive surprise. The hotel with it's own pier out in the lake Garda provided very good service and nice rooms. Since we were 4 people (2 adults and 2 teenagers) the hotel provided extra beds to reasonable price even though it was one of the most expensive nights at our Italy trip. Can highly recommend this hotel for more than one night since there are plenty of things to do like shopping, boat trips, bath, old buildings and even walking/running on the island.", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r141557465", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Wonderful hotel on the lake", "review": "Beautiful lake Garda and a simply wonderful hotel. It is important to understand we had a room that overlooked the lake and waking up to that view every morning certainly notches up the overall experience.   In a nutshell:  Room was good View was outstanding  Sirmione beautiful  Lake beautiful   Getting there:  If you arrive by bus walk into the town and look out for hotel sirmione which will be on your left, Flaminia should be 3rd left after that.  Car: You can drive in but will need to follow instruction from police at the entrance to the town or follow the traffic lights. Be aware that the roads are narrow and Sirmione is geared towards the pedestrian. Be patient you will get through albeit slowly.  Hotel:  There are 2 sides to the hotel and we stayed in the annex, the room…", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r136548817", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Stay here!", "review": "Just leaving after 6 wonderful nights at this hotel. We had a lake view room which was fantastic, I recommend it if you can.The decking area is perfect for relaxing for the whole day or an hour or two after a day of sightseeing around the lake.  Sirmione is a busy bustling town but you totally escape it here.  Breakfast is great with lots of choices Staff are extremly friendly and helpful.  We will be coming back!", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r135956663", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Clean, spacious, very good breakfast.", "review": "Room was clean, airy and spacious. Good central location. The floor was not carpeted, so no musty smell in the room. Our room was a standard room (no lake view), it was probably not as well finished or fitted out as some other more superior rooms. It had mini bar and A/C. Bathroom could have been a bit nicer, but it was fine otherwise. Staff were very friendly and helpful. Wonderful selection at breakfast with a great view of the lake.", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r133981457", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "One of the best.................", "review": "Six of us stayed here for a week in June 2012. Location simply fabulous, lake views breathtaking, very friendly and efficient staff - family run - excellent breakfast on the terrace, nothing was too much trouble. Unhesitatingly recommended.", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r133415535", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Paradise", "review": "My family and I have been staying at the Flaminia for many years it remains a wonderful holiday spot, I do not believe you could get a better position anywhere in the world. All of the staff ensure you have everything you need. Make sure you eat at Margharitas next door", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r132831782", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Wonderful", "review": "We stayed in the Flaminia Hotel for part of our honeymoon and found it very relaxing. The location was perfect, right in the middle of Sirmione about a minute walk from the main jetty where you could get the boat to various other towns around the lake. The hotel has its own jetty on the lake filled with sun loungers and umberellas with waiter service and you could swim in the lake off the end of the jetty. The breakfast had a good selection with inside seating but still looking out onto the lake and the hotel also has it's own restaurant which we used at lunch time and found it to be reasonably priced. The bed was very comfortable and the room was very clean. We also used the laundry service as we had done quite a lot of travelling around Italy prior to our stay here and found…", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r132716186", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Max Signori and staff are a delight", "review": "Hotel in the old town inside the castle gates, it's been family run for many years and the staff are a delight, comtemporary setting on the water. We enjoyed our stay.", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r129759691", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Location location location", "review": "This is a \"Sirmione 5 rating\". i.e., don't expect a 5* hotel...  Stayed for 6 nights with a 4 year old (2nd time @ Sirmione). Location is great, in the middle of old town which is a beautiful \"tourist trap\" - being a tourist I'm ok with that :-) Sitting in the small balcony watching the lake and sipping some wine is just great. Going downstairs and being in the \"middle\", is also great. Rooms are a bit on the old side, but are being kept in perfect condition and are very clean. Staff is very friendly and helpful. Offered to change our original reservation of a Jr. Suite into two adjacent rooms to better accommodate our needs free of charge.  I do recommend for families with kids to take two connected rooms preferably with lake view. From our perspective only thing which…", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r127923076", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Lovely hotel and great base", "review": "Recently stayed in Hotel Faminia, it is in a lovely location and the room was very comfortable and spacious.  The breakfast was ok, would have expected a lot more fresh fruit and juices considering its in a fruit growing country.  The breakfast room was lovely however.  The only complaint I have was with the night porter, who was the most unhelpful person I have ever met.  One night he was going to serve us in the bar, and half way throught the order he decided he was not serving any more and just closed the bar leaving some in the group without drink.  We were the only ones in the bar which leads me to believe they didn't want customers.  Overall The location and rooms in Hotel Flaminia are by far the best assets of this hotel", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r119411335", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Wonderful base for wedding", "review": "I recently attended a family wedding in Sirmione and we had chosen the Hotel Flaminia as our base, we were not disappointed. The bride was due to get married from a different hotel however this changed when we saw the space and facilities in the Flaminia. The hotel staff were so accomodating and helpful. Some of our party had rooms 15 & 18 which were facing each other and were bright well air conditioned and spacious we were able to use one as our 'hairdressing room' and the other as a bridal dressing room. From the hotel was a short stroll to the Chapel and back down to the lake to board the boats to take us to the reception. I would definately stay in Hotel Flaminia if I go back to Sirmione. The choice at breakfast was great and it was very relaxing sitting at the lakeside…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r117403350", "sub_review": {"Value": 4, "Sleep Quality": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good hotel, reasonable price", "review": "Stayed here only one night during our road trip, but since this was our third time in Sirmione (and our fourth hotel in the old town) I must rank this one rather high on the list. We had a deluxe room without sea view, the room was huge! The bed very good and the interior (including the WC/shower) was modern, clean and seemed to be newly refurbished.   The hotels private jetty by the sea was a very good place to spend a couple of hours, soaking in the sun with the occasional cooling dip in the sea.   Breakfast not the best but ok. They charged an additional 4 EUR for a small glass of orange juice. Parking was outside the old town which could be a bit of a draw back but the walk to the parking took no more than 10 minutes (free).  Would recommend this hotel.", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r116891467", "sub_review": {"Value": 4, "Sleep Quality": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great wedding location", "review": "Just returned from three nights in this hotel where we stayed for my friend's daughter's wedding.  The reception was at the restaurant next door (part of the hotel).  Our room had a lake view and was fairly spacious with a balcony big enough to sit on and enjoy the wonderful views.  The large bathroom even had a small balcony!  Whilst I would agree that the rooms could do with a bit of up dating, it was perfectly adequate.  The air conditioning worked well, the beds were comfortable but I have to agree with a previous reviewer that the pillows were very hard (the only down side).  I did ask for a softer one, but unfortunately it was still fairly solid.  All the staff were helpful and friendly, especially the reception.  At breakfast there was a good variety of food on offer…", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r114879800", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Fantastic location", "review": "The best part of this hotel is the location, bang on the water and in the heart of town. The rooms are spacious, however, make sure that you get the newly renovated ones. The hotel lobby needs a spruce up and the carpets are old fashioned. However, I would stay here again simply because of the location which is one of the best in Sirmione.", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r114547538", "sub_review": {"Value": 4, "Location": 5, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "", "rating": 4}, {"title": "Good Hotel", "review": "The hotel is located in the old town which is closed to cars due to very narrow \"streets\". However, with a hotel reservation, access will be granted (police check point) in order to drop off guests and baggage. After check-in, the hotel staff will volunteer to park the car outside the old town and return it to the hotel when needed, all free of charge. It takes less time (10 minutes) to walk to the car, than for the hotel to get it and fight the pedestrian traffic. The hotel is clean, but slightly dated. We stayed in the larger rooms which have the size of standard US hotel rooms. The beds were very comfortable, and the bathrooms were well stocked, except that there was no wash cloth were provided. A very large number of TV channels are available from many different countries,…", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r113052573", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Perfect location and lake view", "review": "We stayed here for 4 nights leading up to the Easter weekend. Location wise this was perfect, in the centre of the old town so could walk to lots of restaurants for lunch and dinner. You can either park outside the old town and walk in or if you drive to the hotel, they will then park your car for you and bring it back. We booked a junior suite which was a good sized room at the top of the hotel with patio doors on two sides allowing for lovely uninterrupted views out onto the lake. Breakfast was good, although a little understaffed at times, suggest getting there early. Would stay again.", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r107211960", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Number 1 in Sirmione for us!", "review": "It was all wonderful, from making the reservations directly through the internet, checking in, all the restaurant referrals and directions, and especially their own restaurant next door.  We had lakeview rooms with balconies and they were worth the premium.  The ferry around the lake was almost next door, there was parking, everyone was friendly and spoke easily in English (shame on our Italian).  We relaxed and yet had plenty to do. The breakfast was certainly among the better ones of our 18 day trip.  Thanks to all of you at the Flaminia for a very delightful stay.", "date": "May 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r76116200", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Great small hotel with a perfect location in the old town", "review": "This is a great small hotel in a wonderful location, right on the lake in the old town. It is near the ferry dock but was not the least bit noisy. Staff was wonderful and very helpful.  We stayed in a junior suite located on the top floor and facing the lake. The added space was worth the extra cost. The room was clean and the bathroom was a good size and air conditioning worked well. Wifi was available in the room at no cost.....very much appreciated.  Breakfast was fairly typical and served in a room facing the water.....an added bonus.  One of the best features of the hotel was its 2 decks right on the water. This provided a feeling of spaciousness and always had lounges and umbrellas available. Drinks are served on the deck.  Although the hotel does not have parking on site,…", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r74840062", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A fab weekend at Hotel flaminia sirmione, lake garda", "review": "Absolutely loved my weekend at hotel flaminia, Sirmione.  Perfectly positioned at the foot of the lake in the old town.  The staff were very helpful and the services in the restraunt outside was excellent as was the food.  Buffet breakfast good too.  The only negative I would make, we stayed in room 51, the pillows were as hard as rock and we both had difficulty sleeping on them.  The colours in the room felt too dark for such a small room and it felt a little like sleeping in a coffin.  Would have been much nicer if they were lighter and brighter.  Having said all that the rooms were clean and tidy.  Would it put me off going again.......probably not but I'd take my own pillow.!", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r72472165", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely view", "review": "We stayed in a standard lake view room. It had a (very) small balcony with space (just about) for two chairs.  The view from the balcony was lovely as it more or less hung out over the lake.  The room was fairly basic but was spotlessly clean.  The equally spotless shower room was the bathroom equivalent of a galley kitchen - long and narrow!  We didn't have much need to speak to or contact the Reception staff but when we did they were pleasant and helpful.  Breakfast was good but we did feel sorry for the lady who most days was on her own but who was responsible for topping up the buffet, bringing tea and coffee on request and clearing and setting up tables.  How she coped I do not know.  Lake Garda has become much dearer since our last visit a few years back.  We paid mega…", "date": "June 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r72188797", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "complete rip off, you wont get the room you booked and paid for", "review": "we stayed here for 4 nights last week and would never recommend this shambles of a hotel, upon entering  the room it was apparent that it was not the \"superior double\" that we had booked, we tried to explain this to the hotel but a  sudden, convienient lack of English was apparent. The air conditioning was not suficient and to make matters worse there were ongoing works on some of the rooms below which woke us up each morning by the banging and scraping the floor below. we paid EUR 175.00 per night for this apparent superior room despite as mentioning being given only a standard room, I have since complained to be met with the reponse of \"oh we gave you a complimentary upgrade to a triple room and could have charged you more\"!!!  i will never stay here again, being a veteran of…", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r71605662", "sub_review": {"Value": 1, "Location": 4, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 2, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Great location, basic, clean rooms", "review": "We recently stayed at Hotel Flaminia during a tour of the Italian lakes. The location, right in the heart of the historical town of Sirmione was superb - shops, restaurants & bars right on doorstep and being on the lakeside there are great views and access for swimming from the hotel terrace. We were in a standard room with lake view and the room was basic, but clean. Aircon struggled to keep the room cool but outside  temperature was very hot.  Parking is offered by the hotel but you need to drive through the historical centre to drop off luggage and then take car back to outside the 'castle walls'; This was more an inconvenience than anything else but was not made aware of this on website or hotel staff when booking. If you have a big car (4x4) then whilst the streets are just…", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r71464184", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Fawlty Towers", "review": "I stayed in this hotel for 3 nights last week - we had a meal booked for two of these nights and it was a disaster on both nights.  We ordered drinks at the table and the waitresses insisted that we pay for each piece of the order as she gave it to us so I paid 4 times for our order of 8 drinks.  The waitress was on her own and unable to cope with the group of  40 people efficiently.   Breakfasts were ok.", "date": "October 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r47205832", "sub_review": {"Value": 1, "Location": 5, "Rooms": 2, "Cleanliness": 4, "Service": 1}, "travel_purpose": "", "rating": 3}, {"title": "The best place to stay in Sirmione", "review": "This is our second visit to Lake Garda.   We really can't fault the family run Hotel Flaminia.   Set in the old town on the edge of the lake, entirely peaceful, with very little  background noise.     Our room (23) of medium size, extremely comfortable with a small balcony from which we would watch the coming and going of the ferries, plus other activities on the lake.   The cleanliness was exceptional - fresh towels and pillowcases daily and sheets every other day.   Breakfasts were of good quality continental standard - and eggs, bacon and sausage available most days. The hotel is within reach of many cafes and restaurants.  Our favourite snack bar was Antiche Mura, in the road opposite Flaminia Piazza and served the best bruchette you've ever tasted.  Two restaurants stood…", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r45734665", "sub_review": {"Value": 4, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Bring a torch", "review": "I agree with all the positive things that have been said about this hotel, and my only criticism is the gloomy lighting in the room which makes it impossible to read after dark unless you lay on the bed and tun a reading light on. I even took off the wall light shade to try to lighten things up. It wasn't the end of the world and I didn't mention it to the staff (maybe I should have) and perhaps we were just unlucky with the room.  Anyway, apart from that we had a great time except for the weather, but the hotel supply plentiful umbrellas!", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r44639504", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great Hotel, Excellent Service, Beautiful Location!", "review": "Due to a change in our programme we arrived in Sirmione two days earlier than planned and therefore had no prior booking at this hotel. We arrived at just before midnight and luckily got a room for the night. We were so pleased with our room and the hotel in general that we ended up staying all six nights here while we were in Sirmione. The room was fantastic and the deck area was a great place to sunbathe and take a dip in the beautiful lake Garda. We didn't miss a swimming pool at all. The restuarant served great food and the location of the hotel is perfect.  The lovely ladies of Hotel Flaminia were ever so helpful throughout our stay. The hotel is run by a mother and daughter duo and together with a very helpful and pleasant team of other ladies (and gents) they offered…", "date": "August 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r38270708", "sub_review": {"Value": 4, "Location": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great location, very nice hotel", "review": "Hotel Flaminia turned out to be even better than expected. Its location in Sirmione was better than great. This town is simply gorgeous and so much fun. The hotel is located in the heart of the town, making it so convenient to walk to everything, yet just far enough off the main street to be quiet and offer divine lake views. Definitely book a room with at least a partial view of the lake (see our photos). It's a bit hard to find within the town, which is closed to all traffic except those with reservations. But once you get there through the crowded cobblestone streets, you don't have to take the car out again and will find wonderful shops, restaurants and scenery. Breakfast outside, lakeside, was the best we had in Italy with all sorts of wonderful meats, cheeses, eggs,…", "date": "May 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r34792499", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "nice room - pity about the noise", "review": "We were upgraded on arrival at Hotel Flaminia to a superior room in the annexe because we had paid Bath Travel £50 each for a balcony/lake view.  Great room with 3 piece suite, great big bed and nice decorations.  Unfortunately the kitchens serving the Flaminia restaurant, pub and pizzeria were right below us and the noise was incessant all evening and late into the night.  Add to that 5am deliveries and bin emptying and you can guess how much sleep we got.  Sirmione is deluged with day trippers every day, particularly hordes of Italian school children so it's best to get on a ferry and go somewhere else during the day.", "date": "May 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r30304862", "sub_review": {"Value": 2, "Location": 1, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Excellent find, ten out of ten !", "review": "We have just returned from four lovely days in Lake Garda which was only enhanced by this lovely hotel.  Take a taxi direct from train station Desenzano, they are few and far between but we were very lucky and got one on arrival.  A short taxi drive takes you to the busy streets of Sirmione.   Check in was the quickest we have ever experienced, we were in our room in no time with our bags brought up to the room by the ever obliging hotel staff.  Our room was lovely, on the side of the hotel, perfect size and large bathroom and our room had an amazing view of the lake.  The sun was just setting over the lake as we arrived. The breakfast was generous and service very prompt.  Plenty of hot and cold foods.  Hotel staff were very helpful advising us on trips and tours, also had free…", "date": "August 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r19269660", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great Hotel", "review": "We stayed for 2 weeks at the Hotel Flaminia in May 2008.  We had emailed the hotel on a few ocassions prior to arriving to arrange airport transfers etc and found them to be extremely helpful and prompt with responses.  We were picked up at Brescia airport - right on time.  No problems.    Our room was on the top floor with a huge floor to ceiling window overlooking the lake.  It was gorgeous.  The room was very spacious and had a king size bed, sofa bed, table & chairs, desk, mini fridge and TV.  It has obviously been newly decorated.  We used the restaurant attached to the hotel once.  No problems but there are other much nicer restaurants in Sirmione.  The breakfast was lovely.  Plenty of variety.  A few times they had run out of hot food by the time we got down but you just…", "date": "May 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r18373920", "sub_review": {"Value": 4, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4, "Business service (e.g., internet access)": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Would stay here again", "review": "Had just a week at this lovely little hotel. We were put in the newly decorated \"feng shui\" wing, large bedroom with slightly weird decor and beatifully appointed bathroom but as building is slightly set back does not give a full view of the lake. Returned to the desk clerk who was very helpful and though couldn't move us immediately did so very efficiently the next day to room in older part of the hotel, more traditional but perfectly comfortable and great view with little balcony so we were able to watch all the comings and goings of the ferries. The ferry stop is two minutes walk and a great way of getting to see all the other resorts on the lake. Sirmione is traffic free, lively,and perfect for people watching. Lots of restaurants, the one attached to the hotel pretty good…", "date": "June 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r17920760", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 3}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Ideal location, good service.", "review": "Arriving 20:00 at Desenzano station with the 18:03 train from Mestre, we should \"just take a taxi\" to Sirmione (10 km) with our two heavy suitcases. Standing in line for quite a while, frequently calling the number on the taxi sign, we finally called Flaminia for help.  The answer was \"No problem, me fix\" - and half an hour later their Bellboy the Allrounder came with his brand new hotel car - and swoop - we entered Flaminia, certainly after tacking through old Sirmiones narrow streets (read corridors). Located directly on the waterfront, we had a front room with a small balcony overlooking most of Lake Gardas southwestern \"corner\". Quite frequently passenger boats of varying type and size - including two Mississippi type wheel steamers - came in to the quay just 200 m from…", "date": "August 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r10029388", "sub_review": {"Value": 3, "Location": 5, "Check in / front desk": 4, "Rooms": 3, "Cleanliness": 4, "Service": 5, "Business service (e.g., internet access)": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent", "review": "We stayed at the Flaminia first week in Sept. We had a standard room with side lake view (you can upgrade to a room on the front of the hotel, however you are only 2 minutes away from the sundeck which has the same view) The room was spacious & clean with a good bathroom. The breakfast each morning was great, with a good selection & the added bonus of looking out over the lake while you eat. The location of the Hotel puts you right in the middle of all the action, 5 minutes from the ferry dock and bus station. There are plenty of restaurants & bars all within strolling distance (including the Hotels own restaurant) The staff were all very helpful & friendly. The sundeck was fantastic, you can take a dip in the lake, sunbathe or just check out the sunset. Great Hotel. ", "date": "September 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r8706868", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "quite nice", "review": "We were pleased with this hotel.  Our room was very obviously recently refurbished----modern furnishings are not my favourite style, but it was nicely and thoughtfully done.  The room was very large by European standards; we had plenty of room even for our massive amount of luggage.  The spacious bathroom also was brand-new and very stylish, and included a jacuzzi bathtub.  There was no coffee/tea service in the room, but breakfast in the nice room overlooking the lake is included in the price. ", "date": "May 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r7725958", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 4, "Rooms": 4, "Cleanliness": 5, "Service": 3, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice Surprise", "review": "What a pleasant surprise!  Some of the reviews made me cautious in booking but the hotel is very nice.  The ride in from the Desenzano Rai Station was disheartening as the south part of Lake Garda is overbuilt.  But our spirits lifted as we progressed up the narrow peninsula and got to the minimal auto zone over the moat bridge where we found ourselves in a living monument.  The hotel rooms are done in what I'd call that clean, swiss style.  Nice recent tilework in the bathroom and parquet floors in the room.  Our rooms, 37 and 38, overlooked the lake with a beautiful western view.  One also sees the adjacent ferry.  Decks over the water on the lakeside of the hotel allow sunning and snoozing.  Just inside this deck area, the eating tables are positioned for breakfast with a…", "date": "September 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r6102020", "sub_review": {"Value": 4, "Location": 5, "Check in / front desk": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 3}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Loved it !!", "review": "Hotel Flaminia, Sirmione 4* B & B  Superb location, situated close to the ferries, countless restaurants and bars within yards of the hotel.  The hotel is bright and spacious and immaculately clean, much attention being paid to keep it that way daily.  Be sure to get a room with a full front view of Lake Garda with a balcony, rooms 37 and 38.  Other superior rooms look out onto the ally, or air conditioning units.  Some have partial lake views, others none at all even though they are superior.  Our room was spacious and stylishly furnished, although we could not hear our TV as the volume was permanently on low – perhaps it was set that way so as not to upset adjoining guest rooms.  Our en suite bathroom was adequate, although probably done out in the 70’s judging by the tiles…", "date": "September 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r5931301", "sub_review": {"Value": 4, "Location": 4, "Check in / front desk": 3, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Ideal location", "review": "Because of the location of this hotel amid traffic-free zone (though residential/delivery traffic passes through), on arrival we walked to the hotel from the bus station (about 10 minutes).  The Flaminia is ideally located and from our lakeview balcony we could watch all the comings and goings on the lake, including the ferry station which is only 5 minutes' walk away.  The room was quite small but adequate; the most annoying thing about it was the location of the wardrobe which was so close to the TV and fridge that you couldn't actually open the wardrobe door properly!  Very bad planning!  The bathroom/shower room was clean and relatively new.  As we arrived in a heatwave of 36 plus temperatures, the efficient air-con was very welcome.  The breakfast was good and service…", "date": "June 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r5445078", "sub_review": {"Value": 3, "Rooms": 2, "Cleanliness": 2, "Service": 4}, "travel_purpose": "", "rating": 3}, {"title": "Cancellation Woes", "review": "We never actually made it to the Hotel Flaminia, although we had made reservations well in advance for April 2004.  Unfortunately, we had to cancel our trip and I faxed my cancellation instructions to the hotel TWO WEEKS prior to our trip.  I never heard back from them until I received notice that my credit card had been charged for the room.  I then wrote them a letter, including a copy of my previous fax.  I received no response.  I finally had to take the matter up with my credit card company to get the charge removed.  We have rescheduled our trip for 2005, but we will not be making reservations at the Hotel Flaminia. ", "date": "September 2004", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187842-d238552-r2981848", "sub_review": {}, "travel_purpose": "", "rating": 1}]