[{"title": "Amazing week stay", "review": "Our stay at Hotel Piccolo Mondo was an amazing experience. The staff and owner were lovely to deal with and the facilities were clean and modern. My favourite part of it all was the fantastic Italian cuisine cooked for us by the two chefs in the kitchen. Lovely location and back garden with pool. I'd definitely recommend for a week-long stay but also for a week-end getaway.", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r720722173", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Consider this hotel for your holiday in Lake Garda", "review": "Dear Giorgia, we are happy that your experience has been carried out with satisfaction. The Hotel Piccolo Mondo and the location more generally offer countless proposals for all needs. We hope to see you again", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r716715078", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "A pleasure to stay", "review": "This hotel provided us with high standards of service. The staff were so frendly and helpful especially Camilla at reception and Roberto, Danielle and Alexis who served us with style in the dining room. Food and service was excellent.. On our last day our group had to leave early and a great breakfast was provided. Many thanks as this hotel contributed to a great holiday in Italy", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r713829564", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Thank you Alberto and staff", "review": "Dear, thank you very much for your wonderful words. We are extremely happy to have helped make your stay super. We are waiting for you soon", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r713693956", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Relax, you'll be well looked after at Piccolo Mondo", "review": "We stayed as part of a holiday with Newmarket, so were expecting an adequate and average hotel but the Piccolo Mondo exceeded all expectations.  In particular all the staff were most welcoming, friendly and helpful, even preparing a free bus pas for the region. the food is excellent and varied, and the room spotlessly clean.   We took our own kettle for early morning tea, but breakfast is provided from 7.00 am so no real need.   Situated a short walk from town and local bus stops and with a lovely mountain view from the breakfast area  we would highly recommend this hotel.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r713394908", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Great location, lovely staff, excellent food.", "review": "Stayed for a week and really enjoyed our stay. Staff, particularly the two young ladies at reception, couldn't have been more friendly and helpful. Food was excellent and different menu each night - we were all inclusive. Breakfast buffet first class. Location a short walk from Torbole centre and lake.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r707211980", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Would love to recommend (but only if no coach parties!).", "review": "Dear Jon, great review. Many many many thanks...  We hope to see you soon", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r692325036", "sub_review": {"Value": 3, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Relaxing break", "review": "My wife & I stayed for the last week of June and mostly enjoyed this hotel, but there were a few disappointments. On arrival we were told at reception that we had a 'special' room - which turned out to be a fairly drab family room that included an extra room with two singles. What wasn't special was the room's aspect - overlooking a side-street, with a coach park, bin area and other buildings. Most disappointing considering the hotel's ideal position and the many rooms with a lovely outlook. We requested a change, but were told that there were no other rooms available for the period of our stay. However, once we'd settled we found the room to be clean (towels changed every day) and functional, with the small fridge and safe both being assets. We also heeded previous T.A. users…", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r690429258", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Wonderful Hotel", "review": "Dear Guests, we are sorry for the inconvenience, we hope to be able to accommodate you again in order to make you enjoy the holiday 100%...  See You soon", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r687746230", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lake Garda Holiday", "review": "This is our second time at this lovely family run hotel and we cannot fault it.  We stayed again for 10 nights.  It is in a superb location with easy access to getting around the lake.  All of the staff are simply amazing and they cannot do enough for you.  You are treated to wonderful food and made to feel very comfortable.  The hotel is very clean and we would recommend the Piccolo Mondo to anyone.  We cannot wait to return.   Thank you.  Chris and Debbie White", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r686337351", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Superb hotel", "review": "We stayed at this lovely hotel from 5th - 12th June this year. The initial greeting by Camilla was so welcoming. We were shown to our spacious suite ( lovely surprise as we were expecting a room). All the staff were great. All greeted us, had a chat, and were a credit to the hotel. The food was superb. Can only be positive about this hotel. We had a very short walk down to the lakeside and enjoyed the area so much.  We had a wonderful week at Lake Garda and will return to the gorgeous Piccolo Mondo hotel.  Thank you.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r683354989", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Spot on for torbole and Garda. ", "review": "Dear Rose, We are really happy that you were satisfied and We really like being with our guests.  Look forward to seeing you again soon", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r682934134", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Enjoyable stay at this very nice family run hotel", "review": "I have been staying in torbole and Garda for the last ten years twice a year. Stayed at this place first time as my usual was booked and I had associates staying here who booked for me.   Was pleasantly surprised during my stay. Good rooms with air conditioning as this is a rarity and a must during summers. The bathrooms are super clean and good.   The beds are very comfy.   Breakfast basic like all of italy. Good cold cuts / scrambled eggs and cereal and fruit with excellent coffee.   They have good grounds and two swimming pools including an indoor one. Large hotel. Nice bar and a restaurant that unfortunately I could not try but was told serves some good stuff.   Location top notch as five minute walk to the Garda lake and all the hot spots in torbole.   A must stay and I am…", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r682769448", "sub_review": {"Value": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "A very enjoyable stay", "review": "Dear guest, thank you for highlighting our strengths. Every year we carry out restructuring in order to constantly improve the services offered. We look forward to seeing you again soon", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r681288242", "sub_review": {"Value": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "early summer break in Lake Garda with Travel Department", "review": "It's all been said before: a well run family owned hotel with friendly and helpful staff; good location; lovely food (including gluten free options); clean unadorned rooms with safe and fridge; rear garden with loungers and outdoor pool and mountain views; small garden with tables and chairs at front of hotel near road; bicycles to borrow or hire - quiet ride near river to Arco or busier route by lakeside to Riva del Gardo. Very short walk to centre of village and lake front. Nearby ferry service for other northern lake towns (Limone and Malcescine are a must) or take a bus along the lake to Garda. Two well stocked supermarkets nearby. Would certainly recommend this hotel. The only negative I can think of is there is a certain amount of internal noise from other rooms in the…", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r681010785", "sub_review": {"Location": 5, "Sleep Quality": 3, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Not to be missed", "review": "Family run hotel, good location, the room we stayed in on the second floor had great views towards the mountains. The room was basic but a good standard, clean and the en-suite bathroom a good size, a good supply of toiletries. The housekeeping was of a high standard. There was a small fridge in the bedroom which was great for storing milk and drinks. There was no tea or coffee making facilities so take your own. The staff in all areas were friendly and efficient. We were half board, the food was of a high standard, a varied menu changed each evening. Highly recommended", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r680464834", "sub_review": {"Value": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "First time to Lake Garda", "review": "Thank you very much Tony for the wonderful words, from the whole family.  Thanks also from all the staff.  We look forward to welcoming you again in the future", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r680165753", "sub_review": {"Value": 5, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely family run hotel", "review": "We visited this hotel at the end of May for 1 week with Newmarket Holidays. We arrived early evening and was greeted by a very friendly receptionist Camilla who showed us up to our room. The room was very clean and modern with plenty of hanging space and hangers for our clothes. The bathroom was nice and spacious with a shower over the bath, there was always plenty of hot water. A hairdryer was provided in the bathroom. The balcony was spacious with a wonderful view of the mountains. There was a safe, fridge and television in the room. We had a quick wash and change and went down to dinner, we were shown to our table which we kept for the week. Dinner was four courses each night which could be a little strange at times, would have liked some nice fresh vegetables with the main…", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r675984149", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely stay", "review": "Very kind Linda,  thanks for the amazing feedback. We hope that there are still many other opportunities to be able to host you at the Hotel Piccolo Mondo in Torbole See you soon", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r673241873", "sub_review": {"Location": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Half board 7 day stay", "review": "Stayed here for a week on a Newmarket holiday trip. We were greeted with a friendly receptionist who showed us to our room and said if we were hungry lunch was still being served. The room was lovley and clean with ample hanging space for clothes. Nice modern bathroom. The view from the balcony was good, facing the mountains with snow on the tops. We strolled round the gardens and outdoor pool which on a summers day would be lovely to sit round. The indoor pool was good and my husband tried it twice. Pool towels were provided. The food was really good, in fact too much of it sometimes. Four courses every night. All the staff were very friendly and looked happy to be there , check the wall in the breakfast room and you will see the older gentleman owner there in his cycling gear…", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r672715248", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely Hotel", "review": "This hotel is ideally located close to the lake and overlooked by mountains. There are plenty of things to do apart from the indoor and outdoor swimming pools, bikes can be hired to explore the surrounding  villages, paragliding, snorkeling, fishing, and walking to name a few. I found  the room basic with two single beds , a nice but small bathroom  but it did have a balcony. Towels were changed everyday even if we didn't put them in the bath for exchange. Breakfast consisted of the usual coffee, rolls, cheese,juice, cereal, toast, scrambled and boiled eggs and bacon. Dinner consisted of four courses usually a choice of soup,fish, pasta or meat and a salad bar . We visited the hotel in October and as it was towards the end of the season it was not over busy. From what i can…", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r626646495", "sub_review": {"Location": 4, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Return to this family run hotel", "review": "Dear Guest, thank you for highlighting the characteristic points on which we aim every day. We hope to be able to host you again and again", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r625079298", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "\"Beautiful Clean Hotel\"", "review": "This was our second visit to this hotel, and we still enjoyed it, we only stayed 2 nights as we were touring round the lake.  The family run hotel is lovely, they take great pride in their hotel. It is run very well, the staff are friendly and the gardens and pool area are well kept. We hired bikes to cycle to arco.  Last time we came I said the wi fi was rubbish, well it has improved.  We would definitely return to this hotel.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r618940114", "sub_review": {"Location": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "WOW !! An amazing hotel", "review": "Dear Michael, we are happy that your holiday has been carried out with satisfaction. We hope to have you guests again", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r618153437", "sub_review": {"Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "lovely hotel with a few small issues", "review": "Had a pleasant 7 night stay at this hotel ,Hotel is in a nice quiet area of Lake Garda ,Hotel is very clean rooms were cleaned every day rooms had a balcony but didn't have an have an electric kettle. Breakfast was good with a good choice of cereals ,bread ,cheese and hams .Dinner was OK portions were small for main course  buffet salad for starters was very good .Drinks at bar were expensive 5 euro for large beer .Staff were friendly and helpful .There is a swimming pool but didn't get time to visit it.There is a good supermarket 5 mins from hotel .There are some nice bars and restaurants in the area .", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r617660316", "sub_review": {"Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Friendly hotel with amazing food", "review": "My son and I have just returned from a 7 night stay at this hotel.The staff were friendly and helpful.The four course menu was amazing and we struggled to manage all four courses.It is in a quiet part of Lake Gard a and only a 25 minute walk to Riva. The rooms are simply decorated but nice and clean.I will stay there again. Many thanks to the staff for our super holiday.", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r614390374", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Highly recommend ", "review": "Dear Michelle, we are pleased to have lived up to its expectations. There is nothing left for us to see you again next time Thanks and see you soon", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r607225201", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Family week away", "review": "We have just returned from an 11 night stay here..... What a great place, totally focused on their guests, nothing was too much trouble, the accommodation was superb, the facilities were great, the food was extremely high standard. The free use of the hotel bikes, which were extremely good quality, was brilliant - we used these a lot to get around and see other parts of the lake. Definitely a hotel that I would have no hesitation in recommending and would return to ourselves!", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r604950908", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "SPENT ONE WEEK IN JULY 2018, HALF BOARD", "review": "Dear Amanda, thank you very much for your wonderful words. We are extremely happy to have helped make your stay super. We are waiting for you soon", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r600152873", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Pleasant stay", "review": "Nice family run hotel.  Clean and tidy.  Indoor and outdoor pools both very quiet. Breakfast a bit samey  every day. Evening set menu alright, with good vegetable/ salad choice. Nut allergies well catered for.  Staff very nice. Good base for windsurfers and walkers and bikers (push variety). ", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r598393430", "sub_review": {"Location": 4, "Sleep Quality": 3, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Comfortable unpretentious family-run hotel", "review": "My wife and I spent a very pleasant 10 days here with our 2 children & grandparents.   There's plenty to do in the area: cycling (road and mountain, bring your own or lots of hire opportunities), climbing, canyoning, sailing, hiking.  Piccolo Mondo has a convenient location on the main road through Torbole to Riva, although this does mean there's a bit of traffic noise at the front of the hotel during the day. The rooms are double glazed so are quiet enough with windows closed (and they have aircon so that's not a problem) but rooms round the back should be nice and quiet. Room decor is modern with very comfortable beds and cleaning is of a very high standard.   Good breakfasts in the presence of some nice signed and framed cycling jerseys (Cadel Evans, Moser, Simoni). I even…", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r598106648", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Another lovely holiday!", "review": "Caro Jim, grazie per averci dedicato del tempo. Quest'anno abbiamo anche organizzato uno stage con Davide Cassani al quale hanno partecipato professionisti locali della squadra BMC. Vi aspettiamo presto così potrete fermarvi e gustare anche la cena. A presto ", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r593502525", "sub_review": {"Location": 4, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Piccolo Mondo is really great hotel with friendly owners and staff:)", "review": "A comfortable hotel with all amenities including easy access, indoor and outdoor pools, high quality food (5 course dinners!).   Free bicycle hire: Torbole is a centre for mountain biking and for watersports.  Charming staff and easy access to other local towns by foot, bus or ferry.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r591974480", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Will return to this hotel.", "review": "Dear Alasdair, we are happy that your holiday has been carried out with satisfaction. The Hotel Piccolo Mondo and Torbole more generally offer countless proposals for all needs. We hope to have you guests again", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r587027041", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Exceptional Break at the Piccolo Mondo", "review": "Everything vas perfekt. We spent a few days in juni in this hotel. Owners are professional and friendly, and employees also. During sommer season you will find In the beautiful garden pool which is available for guests. Breakfast and dinner were excelent ;) Rooms are nice clean and spacious.  I do really recommend this hotel :) Bibi", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r585417404", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Lovely holiday", "review": "We three single adults have just returned from a very enjoyable holiday. Our hotel was excellent, the rooms were very bright & clean, the beds very comfortable. The staff were very welcoming & nothing was too much trouble for them. We can particularly recommend the Aperol Spritz made by Alex which we enjoyed each evening before our four course dinner which was some of the best food we have experienced in Italy. The hotel owners were on hand daily overseeing the smooth running of the hotel. On a couple of the days we had rain but even this did not bother us as we were able to use the indoor pool, sauna & steam room, all very relaxing. ALL the staff had smiles on their faces & were eager to please.  Thank you hotel Piccolo Mondo we hope to come back one day.", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r583548270", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Wonderful week at 'il piccolo mondo'", "review": "Dear Brenda, many thanks, your words are very beautiful indeed. We hope to see you soon too...", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r581266750", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A New Home From Home", "review": "We have experienced first class break in Torbole thanks to the services offered at the Torbole hotel. The friendly nature of the owners and staff who couldn't do enough for us. The rooms are beautifully clean as is the whole complex. The meals are top quality with excellent presentation and wonderful staff. The hotel is within walking distance to Torbole and Riva which are beautiful. The indoor and outdoor pool are clean, serviced daily and are readily available. We will be visiting again. Thankyou all for a wonderful break.", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r576243697", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Sept 2017 Italy", "review": "Dear Chiara, many thanks for the nice considerations, we are waiting for you soon...", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r539391398", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A comfortable happy place", "review": "My wife and I had wanted to come to Lake Garda for many years, but didn't really know anyone who had been there to ask advice on where to stay, so we plumped for blind luck - and if this is what blind luck throws up for us, we will use that same policy again.    The Piccolo Mondo Hotel really is a home from home.  I have never felt so welcome, so cared for, so spoilt at a hotel before, and doubt I will again.  From the very first inkling that we were on to a winner (our driver who met us at Verona Airport for the 50 minute drive to Torbole said \"You stay at Piccolo Mondo?  Best hotel for food and welcome\") everything was perfect.  The owners, The Chiesa's, are always there, a truly charming couple, seeing them in the corner of the restaurant each night with their own meals, and…", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r536159863", "sub_review": {"Location": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent food.", "review": "This is a very welcoming hotel. The owners take great pride in providing an excellent service, as do the staff. The food is excellent and the house wine is lovely, we had the white. The beds are comfortable. The pillows, however, were rather flat. I would have given a 5 star rating except for the cleanliness of the bedroom. There were thick cobwebs over the dressing table,  for the duration of our stay. It was also dusty in parts of the room. I expect they have had a busy season and it needs to be  deep cleaned. The shower was rather awkward. It was raised about a foot off the floor, with only a narrow gap to squeeze through, to get in and out. Difficult to manoeuvre for OAP's. The towels were changed each day, even though we had hung them up to save on their laundry. I used the…", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r533576790", "sub_review": {"Sleep Quality": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "a return visit that did not disappoint", "review": "Dear guest, we are happy to read your beautiful feedback. We will look after the cleaning of the rooms in order to improve the service. We look forward to seeing you next year. Many greetings from Hotel Piccolo Mondo ", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r530342546", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Good food, tired hotel", "review": "after an initial stay in Riva on a coach tour of Italy, we visited Torbole in 2016 and stayed at the Piccolo Mondo Hotel We had such a fabulous holiday that we returned this year The hotel is relaxed and comfortable. Our room overlooking the lake was spacious and comfortable, the bathroom also The rooms were cleaned daily to a high standard  as was the rest of the hotel Breakfast was plentiful and varied, served  in a pleasant room adorned  with famous cyclists' jerseys The main dining room is large and uncrowded. Our  plaudits go to  the staff from réception to the bar, from breakfast to dinner,  service is of the highest quality from friendly, courteous ,  professional individuals  The food is superb - four courses every evening with meat and vegetarian options A variety of…", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r527525321", "sub_review": {"Location": 4, "Rooms": 2, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Family Values", "review": "Dear Janet, many thanks for your beautiful words, we hope to see you next year. Have a good days", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r527032143", "sub_review": {"Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very nice", "review": "We chose this hotel for the location and food reviews and in this respect we were not disappointed.  The hotel is very tired looking and in need of an update, our room 225 was very poor, the shower screen did not fit the shower so the bathroom kept flooding, it was also very badly marked with old adhesive. The carpet was badly marked and well worn.  We asked the owner for some heat in the room as it was cold and was given several reasons why it was not available and she suggested I put an extra jumper on and took a glass of schnapps before going to bed.  At this point we laughed and decided not to bother about the state of the room. All this being said the staff were very efficient and friendly.", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r526217158", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "superb hotel , staff and location", "review": "my wife and I spent a week there with our daughter ( 8 months). from the moment we arrived we felt a warm family-like atmosphere from the staff we never experienced this before when going on holiday. the room we received was orientated at the street side of the hotel but we never had problems with noise of traffic. (rooms were very well isolated). but what to say about the food. the breakfast was superb and the lunch and diner as well. we were delighted with the variety of meals offered by the kitchen. Everything tasted superb. and the staff was so gentle and kind to us as if we were family. our daughter was sometimes difficult when we were sitting at the table but the owner and the staff solved this by taking here for a walk so we could eat quietly. this has to be said touched…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r521358462", "sub_review": {"Value": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Fantastic Family Holiday", "review": "Dear Davy, how delightful to receive such a kind review! Here at Piccolo Mondo Hotel we try and make everyone feel part of our great big family: we are very proud to have succeeded with you, your wife and your little girl. Making sure that all our guests are welcome and well cared for is our main goal, and we are glad we met it this time. Thank you so much for your wonderful compliments on our food, our service and our work. We put great passion and effort in it, and we cannot be more proud! We cannot wait for you to visit us again! Kindest regards from all of us!", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r517794944", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Lovely family run hotel", "review": "My husband  and I spent a wonderful week here with our 5 year old daughter. We cannot speak highly enough of the staff of the PiccoloMondo. We had a lovely quiet room which I had asked for and nothing was too much trouble. The hotel is family run and everyone really cares about all guests having a wonderful stay. We hired bikes (free on site) and enjoyed some lovely rides to the next village. The hotel is close to the lake and everything you need but quiet so you feel you are getting away from it all. We are looking forward to returning next year! ", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r516168777", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Superb hotel and location", "review": "Dear Andrea, how delightful to hear from you! We are so glad you and your family enjoyed your stay so much here at Piccolo Mondo Hotel. We try and make everyone feel welcomed and well cared for, and we are so proud to have succeeded with you. Thank you so much for your kind words about our helpfulness, our services and our location. We cannot wait for you to visit us again next year here on Lake Garda! In the meantime, we send you our kindest regards from Torbole.", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r511655411", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent", "review": "The hotel is situated at the edge of the small town of Torbole, perfectly located for a quiet  holiday, yet near the lake & bicycle path.  The hotel has an old world charm but the bedrooms are bright & modern. Breakfast was good & it was lovely to dine each morning looking at the lovely Dolomite mountains.. we had some specific dietary requirements which were met without fuss.  Staff are friendly & are laid back & relaxed and the outdoor pool area provided a much appreciated oasis during high temperatures - this area has facilities for all ages as the pool is zoned into varying depths with the added extra of a second pool with jets... lovely!!  We used the hotel's complimentary bicycles on a daily basis to explore the region where we found beautiful scenery on the lakeshore &…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r511646720", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Lake Garda Trip", "review": "My wife and I spent a week at this hotel in July. The hotel was excellent. A great location in the small town of Torbole. We were on a half-board basis and the food was really great. The staff were always very helpful and the owners really took an interest in their guests. I would definitely recommend this hotel. There is also an outdoor and indoor swimming pool at this hotel. There are bicycles available for guests to use (free of charge).", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r509982670", "sub_review": {"Location": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "What a hidden gem!", "review": "Dear guests, thank you so much for your review of Piccolo Mondo Hotel! Our main goal is to provide the best possible holidays to all who choose to visit us: we are so glad we succeeded in this with you. We are glad you appreciated our location, our services, our food and the helpfulness of staff and owners alike. Letting everyone feel welcomed is very important for us. We hope you will have the chance to come back to Torbole and visit us again! Kind regards from Lake Garda.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r508109108", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Pleasant Return", "review": "Spent 1 week at Piccolo Mondo Hotel with my daughter, loved every moment from the early morning swim in the indoor pool next to our room to the fab food. Staff could not have been better, esp Anna, who we meet whilst out exploring the small town, she even remembered our names. Beautiful area around Lake Garda, so much to do, so little time-will def go back.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r506672608", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Not Disappointed!", "review": "Dear Sharon, how delightful to hear from you! We are so happy you decided to spend your holiday with us, and that  you enjoyed every moment of your stay. We try and make everyone feel welcomed, among friends, and we are glad you and your daughter felt just that. Thank you so much for your kind words about our location, our cuisine and our services. We cannot wait for you to visit us again here at Piccolo Mondo Hotel for another holiday by lake Garda! Hoping to see you again soon, we send you our kindest regards from Torbole!", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r506670382", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A delightful week at the Piccolo Mondo", "review": "We went back to the Piccolo Mondo for this years holiday mainly because we really enjoyed our stay there in July 2015. We were not disappointed, far from it. We were greeted warmly on our arrival and staff were again attentive. Our room was excellent and the maid service was very efficient but not obtrusive. The hotel is ideally situated for site seeing and trips out. The meals were good but for us a little too much (we seem to loose our appetite on holidays). Would recommend highly.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r506648638", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Friendly hotel", "review": "We loved our 10 day stay at this really friendly hotel. Great location, facilities, food and super friendly staff looking after us. The hotel felt a little dated when we first arrived, but it was really clean and a great location for exploring Lake Garda", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r506577377", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Package holiday (this time)", "review": "Dear guest, how lovely to know you spent a nice time with us! Here at Hotel Piccolo Mondo we try and make everyone feel welcomed and well cared for: this is why we put extra effort in making sure everything is up to standards. Thank you for your kind words about our staff, our facilities and our cuisine. We hope our location by the lake made your holiday even better! We hope to see you again in Torbole for another great stay! Kind regards from all of us.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r504463461", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Glorious Torbole", "review": "A high quality hotel in what is now our favourite resort in Italy (and maybe in the world).  The hotel offers high quality accommodation and friendly staff.  The food is well above average, keeping to Italian roots but providing remarkable variety.  The house wine is a good bargain!  The indoor and outdoor pools are of a good standard.  Fridge but not minibar as such.   Torbole has astonishing scenery and activities for all ages (cafes, walking, cycling, mountain biking, mountain climbing, most water sports).    Coach trips mean a lot of time on the bus before you reach anywhere.  However you can go all around the area yourself by bus and boat.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r503751049", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "first visit to lake Garda", "review": "Dear guest, how delightful to receive your review! We are so glad you appreciated your stay at Hotel Piccolo Mondo so much, and we are especially proud to read your kind words about our cuisine. All members of staff work with great passion to provide the best in every possible aspect of our work: they are grateful for your compliments. Torbole is one of the best destinations in Italy, and we are happy you find it as nice and refreshing as all of us residents here. We hope you will stay at our hotel again for your next trip! Waiting for our next holiday, we send you our kindest regards.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r502487890", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Holiday", "review": "On arrival we were checked in quickly and escorted to our room which was a nice. The room was lovely, spacious and had all we needed to make our stay comfortable, and the view of the mountains glorious. From day one to the day we left the staff were superb so friendly and helpful. Breakfast was good a wide choice to suit all tastes, and also served from 9 O'clock to 10 O'clock which i thought was brilliant. On all our previous holidays we have never had evening meals in the hotel, but on reading the reviews before this holiday we thought we would give this one a try and boy am i glad we did, the food was brilliant to say the least, 4 excellent courses each evening, tried things we had never eaten before and each meal so different, so thanks to the brilliant Chef. Torbole itself…", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r493328421", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Lovely stay in a fabulous location", "review": "Just returned from a weeks stay at Piccolo Mondo Hotel.  On arrival, check-in was extremely efficient and quick and we were promptly shown to our rooms by Alexis who is quiet a character (as per other reviews). His English was excellent when running through the features of our room, air con, fridge, safe, TV, bathroom etc. etc.  Our room (107) was on the first floor, was very clean, light and airy. The only negative I could find was that the air conditioning didn't seem very controllable which was a pity as the weather was hot to say the least. The displayed temperature on the AC control just didn't seem to want to move form 25c no matter how many times I altered it. I would lower the temperature to 20c for example but as soon as I stopped pressing the adjustment button it would…", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r491942984", "sub_review": {"Value": 4, "Location": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "R+S Norwich, England", "review": "Dear guests, thank you so much for your review! We are so glad you found Piccolo Mondo hotel of your liking, and that your stay was a lovely one. We try and give our best for all those who decide to spend their holidays with us: we can say that we achieved our goals with you! We will take into account all your comments and we will use them as suggestions for improving our services even more! We hope to see you again soon in Torbole for your next holiday by the lake! Meanwhile, we send you our kindest regards. ", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r488894212", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "WOW !! Not to be missed", "review": "Great hotel, with 4* food, accommodating equally good gluten free options. Staff very friendly, Alex the waiter stands out, and has a good singing voice. The location couldn't have been better with exception views of the dolomite mountains.  , ", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r488091521", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Great hotel in ideal location ", "review": "Dear Rod, how lovely to hear from you! We are so glad you found your stay at Hotel Piccolo Mondo so enjoyable. Thank you so much for your kind words: all staff is really happy to read how welcomed and cared for you felt. Alex in particular is very proud to receive your compliments. We work really hard on every aspect of our job, and knowing it was appreciated is the best reward. We cannot wait for you to come back to Torbole and enjoy our lovely scenery again! Kind regards from the Dolomites.", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r480003981", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Organized bus tour", "review": "Fantastico !! Really genuine, lovely people, who cared about their guests. Food was out of this world, fine dining standard, with a 4 course dinner evey night. Ana, on reception was always smiling. She even researched Il Vittoriale for me, with a view to organising a visit. I intend to stay at this hotel again next year. Can`t praise it highly enough. Well done to the lovely owners and staff. ", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r430711106", "sub_review": {"Location": 4, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "A real find!", "review": "We booked this hotel through Newmarket Holidays.   After looking at the reviews of all of the hotels on offer in the area we decided that this had the best ones; the others had you book your evening meal in advance apparently. We were greeted by the owner, Sergio and his family and made welcome immediately. We had booked a room with a balcony and were given a room on the first floor looking out over the main road, which at times could be heard but as we were not spending a lot of time in the room didn't matter a lot.  The room was clean and well presented, although tea making facilities would have been nice.  The bathroom was well appointed with a hair dryer and with soaps provided, however, as this was a room in the original part of the hotel, the toilet seat was a little close…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r428346502", "sub_review": {"Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Fabulous Holiday", "review": "Dear friends, it’s a pleasure to read your review! We’re very happy to learn that you enjoyed your stay in Torbole and that you liked your room as well as our breakfast buffet. Thank you for complimenting our food – we’ll tell our cook, who will surely be delighted – and for mentioning our free bike service. We hope we’ll have the pleasure to have you as our guest again soon; in the meantime, I send you the best regards from all the staff of Piccolo Mondo Hotel. ", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r428089804", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great place to relax and enjoy", "review": "My wife and I had a weeks holiday at the end of September, beginning of October 2016 and were blessed with lovely warm weather, we had a most fabulous holiday, Torbole is a lovely resort on Lake Garda, which is beautiful. It's easy to visit other resorts on the lake by the regular boat ferries and buses. The Hotel Piccolo Mondo is a family run establishment with excellent, friendly and hard working staff. Nothing is too much trouble for guests. We found the hotel to be well situated with all the amenities of Lake Garda in easy walking distance. The hotel is kept very clean. We really enjoyed the food and the service and believe me you won't go hungry, we also enjoyed the excellent local wine which I thought was reasonably priced. Nice pool and garden area. Our room, was…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r427100662", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "possibly the best hôtel we've stayed at", "review": "Dear guests, we are delighted to read that you thoroughly enjoyed your stay and that you loved our little town of Torbole as much as we do.Thank you for mentioning Hotel Piccolo Mondo's location, our clean and tidy facility, and the food and service of our restaurant. We'd love to have you as our guests again and we hope we'll see you soon; in the meantime, we wish to send you our best regards.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r426569731", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Dining Disaster", "review": "Rooms are clean and nice, people are friendly and well versed, food is good and fresh. We go every year and plan to continue. The bar is fully stocked, the snacks fresh and good, draft beer delicious and the ambiance and furnishings comfortable.  The restaurant bright and  fresh with good food.  The staff are friendly and knowledgeable.  The access  is easy and not far from the Autostrasse, making it a convenient to access when traveling north or south along the route to the Brenner Pass,", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r420032385", "sub_review": {"Sleep Quality": 3, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "A Special Experience!", "review": "This hotel is charming with the personal touch.  The food is beyond excellent - absolutely wonderful. The staff, led by the owner Sergio go out of their way to make everyone feel special. Guests are greeted with a smile at all times of day and no detail is left unattended. The rooms are very clean and comfortable and the facilities excellent.  There are two swimming pools (one heated indoor) .  We have had a delightful week including borrowing hotel bicycles (free of charge) and cycling to the beautiful village of Arco.  The area is magical and the hotel is well situated for exploring.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r418326594", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good service but has its faults ", "review": "Dear Alison, how delightful to read such a nice review! Our best reward is knowing you felt welcome and cared for at Hotel Piccolo Mondo, and that you spent a lovely week with us. Thank you so much for your compliments on our cuisine, our ambience and our services. We try our best to give the best holiday experience to our guests, and allow them to explore the surroundings, as well as relaxing when needed. We hope to welcome you back here in Torbole for your next trip: we cannot wait to see you again! Kind regards from all of us.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r417989623", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely stay", "review": "Lake Garda is beautiful and and a great place for a holiday . The hotel is clean and well presented. Service is excellent all staff are friendly and helpful. However wifi is non existent, food Tailored more to the German guests which are the majority and there was no atmosphere in the bar / gardens in the evenings .the biggest fault was our bathroom smelt and we had to buy an air freshener x", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r414487460", "sub_review": {"Value": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Quality and Service", "review": "Dear Sonia, thank you of your feedback on Hotel Piccolo Mondo. We read all our reviews with great interest, to understand our strengths and weaknesses, and improve our services. We are really glad you appreciated our hotel and that our staff proved our helpfulness and friendliness. We are sorry about the smell in you room: rest assured we will look into it to avoid further inconveniences. Regarding our Wi-Fi, menu and ambience, we will certainly use your notes as suggestion to make ourselves better. We hope to see you again here in Torbole, especially to prove you our future progresses! Kind regards from all of us.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r413681827", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great place to stay", "review": "Staff are friendly and helpful.   Rooms are well equipped, clean and comfortable. Pool lovely and quiet. We stayed half board and the food is exceptional. Wi fi not accessible, but good to,have a break from it. There is a pc that can be used by guests in the reception. We will definetly be going back.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r413111692", "sub_review": {"Value": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Trip along Lago di Garda", "review": "Hotel is situated close to the lake Garda about five minute walk. Obviously nice mountain view from the hotel, however, we had the ground floor, well, a basement rooms from where the view was none. A disappointment for the rate. Would have expected a lower rate. Breakfast was good and the staff were pleasant. Overall a nice stay, however, would rate this hotel 3star just because of the basement rooms. The hotel is on par with the other hotels in the area. ", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r412387639", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Steve & Sue Bell", "review": "Dearest Guest,  we would like for your visit and for your review.We are really sorry to know that the accomodation was not to your liking, we have different kind of room and if you had spoken to us we tried to change it.  We really hope to have a second opportunity ho host you. Kindest regards. ", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r412153269", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Piccolo mondo", "review": "It's difficult to fault this small family run hotel.  It's clean, the restaurant serves superb traditional Italian food, the staff are incredibly helpful and attentive.  For us, it represented fantastic value for money and we will be revisiting it.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r411819240", "sub_review": {"Sleep Quality": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Nice hotel with friendly staff", "review": "Dear Steve and Sue, receiving such a nice review about Hotel Piccolo Mondo is perhaps the best reward for us! Thank you so much for letting us know about your stay, and for writing these kind words about our welcome, our helpfulness and our food too! We work hard to create the best holiday experience for our guest: reading you felt your stay was nice and you want to visit us again, we really achieved our goals. See you soon here in Torbole! Kind regards from Italy.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r401617960", "sub_review": {"Value": 4, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely Hotel", "review": "Stayed here for 6 nights. Lovely hotel - great food. Lovely pool area with free towels, plenty of sun beds, felt really relaxed here. Decor typically Italian which I liked. Not many British guests.  The free wi fi was rubbish, in this day and age you expect better wifi from a 4 star hotel, stayed in 3 star hotels in torbole and their wifi was much better. So this could be improved. The chiesa family were lovely and ran their hotel very well. The one member of staff that stood out was Alixo, he was lovely, very good English and was always very pleasant, they always worked very hard.  I would stay there again.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r387539472", "sub_review": {"Location": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "“We also thought you were all wonderful”", "review": "We have just returned from a weeks holiday at the Piccolo Mondo and felt we had to share feedback  of our brilliant experience!! Mr and Mrs Chiesa and their staff were so friendly, the food was amazing.  Nothing was too much to ask. The room was very clean and comfortable and the views from the hotel were beautiful. Inside and outside pools were lovely. Good position for visiting Riva del Garda or a picturesque boat trip to pretty Limone  etc. We would highly recommend this hotel!", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r387500389", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "How wonderful you all were", "review": "Mr and Mrs Chiesa, together with all the staff here at Piccolo Mondo, would like to thank you for all your kind words and compliments! We are so glad you enjoyed your stay with us and felt like part of our family. We are happy you enjoyed our location near Riva del Garda and the lake, as well as the sight from your room: one should always have a nice view to wake up to! We will consider your advice about the rooms, and we hope to see you again soon in Torbole! Kind regards from Italy.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r386012534", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Ten out of ten in Torbole", "review": "What an amazing and fantastic way to spend my wonderful holiday at Lake Garda, Could not fault the staff and was made to feel special in every way. Rooms were fabulous even though I had a mosquito visit me for the first two nights. My fault as left the door open. Fantastic location and got to have some wonderful walks. Had the owner run after me to give me a kiss goodbye. FABULOUS!", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r385010406", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent Family Run Hotel", "review": "Dear guest, Thank you so much for leaving your feedback on Piccolo Mondo Hotel! We are so glad you enjoyed your stay with us, and are sorry for the inconvenience of the annoying mosquito. Nevertheless, we are happy to hear all the staff was kind and helpful and that all our services and comforts have made your holiday on the lake special. We cannot wait for you to come back here and visit us again! Kindest regards from Torbole.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r376239133", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Fantastic views.", "review": "Piccolo Mondo is an excellent hotel. The family and staff were extremely helpful and welcoming from the minute we arrived to the last minute of our departure. The rooms were comfortable and clean,and facilities were good. Our deal included breakfast and dinner, WOW! Were we lucky, the food was wonderful. Location was great, would thoroughly recommend this hotel.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r375719130", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Excellent Hotel with Fantastic Staff", "review": "I cannot praise this hotel enough, from the cleanliness of the rooms to the excellent food and the friendly staff this is a hotel not to be missed.  We stayed for a week using the Piccolo Mondo as our base and both the continental breakfast and 4 course evening meal was of exceptional standard.  It is a family run hotel and the owner who attended nearly every meal, walking around each table making you feel welcome and showing an interest in you and ensuring everything provided during the evening was of the highest standard.  The rest of the staff also wanted you to enjoy the stay and gave you individual attention.  A special mention to Al, Mat & Josh who helped to make our stay so special - thank you from the group from Wales.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r375111797", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Wonderful hotel.", "review": "Dear Edward, thank you for leaving your feedback! We are glad you and your group enjoyed your stay with us and that you explore the surroundings: it is perhaps the best way to know and live a holiday! All the staff at Piccolo Mondo Hotel would like to thank you for all your kind words, we know how important it is to feel welcome. We put great passion and effort in all our work and we are really proud to know our guest felt had a nice time here. We cannot wait for you to come back to Torbole to enjoy another holiday on the lake! Kind regards. ", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r373747909", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "ALL GOOD", "review": "My daughter and I stayed here for a few days earlier this month.  The staff were very attentive, the food was excellent, the 4*s were well deserved and we would definitely stay here again.  We booked through Citalia.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r373423449", "sub_review": {"Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "excellent and so friendly", "review": "Dear guest, we are glad you found us and that your stay was so good that you decided to leave this nice feedback! Here at Piccolo Mondo we all try and give our best to all customers, and we are more than happy to receive your kind words. We hope to see you again very soon with your daughter or maybe with friends for your next stay on the lake! Kind regards from Torbole.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r372660893", "sub_review": {"Location": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "A Good Memory", "review": "Staff in bar and restaurant very attentive.No problems with anything.Would go back to  beautiful village  any time .Holiday booked with Newmarket Travel ,which proved very good value.This hotel is in a idea spot  the road did not trouble us", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r327629349", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Wonderful food great service", "review": "We paid a bit more for this break because it was highly recommended for it's food  and we were not disappointed the hotel went way beyond what it was obliged to serve for half board and we always had plenty of choice every meal was delicious many thanks to Alex and Patrick and all the restaurant staff.Our room was a good size well equipped as was the bathroom good shower over full size bath lovely toiletries.We used the pool and the spa had the small sauna to ourselves turkish bath and sensor shower very relaxing you can use facilities from 4 pm till 8 pm everything was warmed up by about 5.Hotel is short walk from the lakeside and there are plenty of walks clearly signposted and they will happily give you lots of info at reception.Really enjoyed our stay even the weather was…", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r320101818", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "terrible", "review": "Dear Guest, we’re really happy that you enjoyed so much your stay at the Hotel Piccolo Mondo! It’s a real pleasure that you could appreciate our quality and abundant food, the kindness of our staff and our facilities, such as the dimensions and the comforts of the rooms and the relaxing atmosphere of our spa. As you said, the Hotel Piccolo Mondo is also situated in a good position to make wonderful walks near the lake. We are really grateful for your positive review and for your kind words toward us.. We hope that for your next holiday in Torbole you’ll stay again by our hotel; meantime we thank you for choosing and send you best regards.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r316023761", "sub_review": {"Location": 1, "Sleep Quality": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "A Wonderful Atmosphere", "review": "We booked this hotel because of the write up about the food and the fact it was advertised as lakeside.The food was mediocre and you only had a choice of soup of the day or pasta of the day for your starter. You had to have what you were given for the rest.We were told we could have a choice of fish instead of meat but when we asked for fish we were told there was none.When we complained about the food we were given the cold shoulder from the lady owner and most of the staff for the rest of our holiday. .As for being lakeside you could not even see the lake from the hotel . It was an 8/10 min walk across a busy road to the lake. We paid a premium for this hotel it was not worth it and we would not recommend this hotel to anyone.We were also put in a small room next to the main…", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r315455662", "sub_review": {"Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A lovely family run hotel", "review": "We ended up here as a result of a mistake by our tour operator but we are glad we did.  The resort is very outdoors-y which we are not but the hotel was fab.   Room was OK very clean and serviceable, comfy bed, etc.  But it is the staff who really make this hotel, they worked tirelessly often very long hours, nothing was too much trouble, they really were attentive to their older guests.  We were out and about quite a bit but always got a friendly exit and welcome.  No one grumbled about early breakfasts, or late arrivals for the evening meal, nice little touches like pre-meal drinks on Sunday and a mix i up buffet on our final night.  Well worth a visit.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r315349330", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Celebrating with brother and his wife's 50 wedding anniversary", "review": "Dearest Friends,  we are really happy to read a such beautiful review and we would like to thank you for the nice words addressed to our  Piccolo Mondo Hotel, to the services offered and to the staff. We really hope to host you again and take the occasion to extend our best regards.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r315172150", "sub_review": {"Location": 4, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Exceeded expectations", "review": "We had a week at this hotel in early September 2015.  The family who ran the hotel were friendly and helpful as were all the staff. The hotel was clean and well cared for although our room was a bit \"tired\" with a damaged tap and a dated shower. Our friends room on the first floor was much more attractive with coloured bedcover and cushions and comfy furniture although we had both booked the same standard of room. Food was excellent with good choice for both breakfast and dinner. Drinks reasonably priced. Area ideal for active people with nice walks and bike rides and especially for windsurfers.  The hotel has bikes that can be used free of charge however they have no gears!! Easy to get around on boats and buses.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r312362408", "sub_review": {"Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A well run comfortable  hotel with helpful and pleasant staff.", "review": "Thank you so much for posting your lovely opinion on this important website. We are pleased that you have been guests at the Piccolo Mondo Hotel and that you appreciated our super team, our cuisine and the excellent prices proposed. We regret that the room was not up to your friends one, the staff could definitely find a solution closer to your wishes; in any case, we are glad that you noticed its cleanliness. Finally, we are very glad that even the beautiful Torbole has proved to be the ideal place for interesting trips and you enjoyed the beautiful scenery that the city offers. Therefore with the hope to see you again, we are sending you our kindest regards!", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r312042828", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Lovely honeymoon", "review": "Whilst not actually overlooking the lake this hotel has everything you need  to enjoy a comfortable holiday with very nice food and charming and helpful staff.The swimming pool was lovely and the bed very comfortable.", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r301877588", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely family owned holiday, we will come again", "review": "Thank you so much enjoying the time spent in Torbole! We are happy that the Piccolo Mondo Hotel's guys took care of every detail in a careful manner. We are very pleased, in particular, that the structure has given you all the right comforts to have a lovely holiday! We hope to repeat this adventure soon, kindest regards from us!", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r301484768", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Holiday 2015", "review": "We had a amazing week here on a 10 day honeymoon after 3 days in Venice.  The hotel staff are all very friendly including the owners. They literally can not do enough for you.  Food is good. 4 choices of starter And main each night. Friday is gala night with a 5 course set menu.  We had two wet days one of which we used the free hotel bikes and visited arco and riva. (11 miles total) two lovely towns. The other we got short ferry rides to limone (lovely shops and bistros) and marchesni (great castle over lake).  The other days were spent by the nice pool or even better was to take the short walk to the lake and use the designated swimming areas to swim in the lake itself.  Air con is only adequate but we mentioned it and were given a fan immediately.  Thank you very much for a…", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r299173958", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "beautiful and scenic area", "review": "We arrived very late, they waited for us to arrive and a meal waiting for us. The family and staff were very helpful nothing to much for them. Food was excellent and the pool and juccuzzi were nice. Thank you for a enjoyable time.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r296974465", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "First family holiday in Italy", "review": "Thank you for giving us the opportunity to welcome you! We are pleased that you appreciated the availability and the kindness which we have taken care of your stay with. We are grateful also for mentioning our super cuisine and the beautiful Jacuzzi of the Piccolo Mondo Hotel. We hope to see you again and to give you other special memories of Torbole! A dear greeting from the whole staff.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r293680796", "sub_review": {"Sleep Quality": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Best holiday  ever 2015", "review": "The hotel was well placed close to the lake, and was in a picture postcard looking area. The staff were very helpful and friendly. The food was amazing. The rooms were clean and well kept. There was a very convenient gelato shop across the road and mini golf .", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r293557665", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Perfect Location for a perfect holiday", "review": "Kindest Susie, we are pleased that the wonderful Torbole has particularly fascinated you and we are glad to be confirmed for cleaning, cuisine and staff. We are hapy that your first family vacation has gone perfectly, therefore, come back soon and visit us again! Kindest regards from the Piccolo Mondo Hotel.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r291947115", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Small world...big heart", "review": "The hotel staff and management we exceptionally helpful and look after every need.  The room was spacious with a private garden area.  Fully air conditioned and cleaned daily.  Bikes were available for free but the hotel was situated close to all amenities, crazy golf, beachside,close to boats which travelled to Limone  Italian ice cream parlours etc. etc.              ", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r290594374", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Don't go by first impressiions", "review": "When we arrived the checking in clerk was a bit abrupt  and didn't think he was very friendly or welcoming. Our room was basic but ok, although the bed was very comfy. The shower was very small and not much room to turn and the toilet was very close to the wall. The food was good but some nights it was a case of take it or leave it as there wasn't always a choice of main courses. It didn't bother us as we like most foods. The waiting staff were friendly and chatty, most of them, and were good fun. The staff were helpful and nothing was too much trouble for them. All in all we had a good stay, beautiful area to stay in. The Jacuzzi pool was lovely as was the main pool and always plenty of sun loungers and umbrellas. Would have classed it as a 3+ * hotel and not a 4 * but maybe…", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r287821823", "sub_review": {"Value": 3, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "FIRST TIME IN ITALY  ♡ ", "review": "Decided to try a \" Newmarket Air Holiday \" WELL what  an excellent  choice had an amazing  holiday ...FROM START  to FINISH  ....Holiday was advertised  in local paper .... Eight glorious  days in Italy ....Lake Garda...itinerary  for the week ...completely  up to you if you wanted to go on trips or just relax ... Hotel was excellent  , stayed  at town called Torbole ( North end of Lake Garda ). Great for windsurfing  and cycling  ... Hotel was called PICCOLO MONDO...it was excellent  FOOD WAS AMAZING. .. very clean and staff were very friendly  and helpful  ...couldn't  wish for more ...Would recommend  this HOTEL .... Had a fabulous  eight days and cant wait to go back to ITALY  .....", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r286871715", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Piccolo Mondo Hotel Excellent", "review": "Dearest Marilyn, we are so glad that you spent eight fabulous days of vacation in Italy and that you have let yourself be charmed by the magnificent views of Torbole. Thank you for appreciating our Piccolo Mondo Hotel and have enjoyed its friendly and super nice team. We are delighted to have helped you to leave a beautiful memory of your first time in this amazing country. There would be your favourite destination during your travels in this area, to pamper and spoil you with our best services. With this hope, we wish you a good summer and we send you our kindest regards.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r286028808", "sub_review": {"Value": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Pleasantly surprised", "review": "Hotel in the perfect place Excellent family run hotel the staff are very friendly and helpful and always happy to please  I would definitely go back a big thank you to the hotel for helping make my first trip to the Italian lakes great I would give them 5 stars all the way", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r283418711", "sub_review": {"Location": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "great stay in this hotel.", "review": "Kindest John, first of all, thank you very much for this very kind review. We are happy that you spent a pleasant holiday in Torbole and that you have enjoyed the services offered by the Piccolo Mondo Hotel. We are happy to have won your trust with our friendly and professional character. We would like to help you to make the other future trips as satisfactory as this one. We wish you the best.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r282407031", "sub_review": {"Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good value but not our dish of tea. ", "review": "My partner & I had a four night last minute break at the Piccolo Mondo last week. We received a very warm welcome despite arriving at midnight & they'd laid on a cold supper for us. Our room was bright, clean & well equipped with a pleasant balcony overlooking the grounds.   All the staff were extremely helpful & polite although our problem using the room safe never did get resolved. Beware the head waiter in the restaurant was very assertive when it came to up-selling the wine list!  The hotel is a short walk along quite a busy road from the centre & the lake.  We regretted paying for half board. The food was very nice but there was little or no menu choice which made things a tad difficult for my partner as she doesn't eat red meat. Would have been better to eat at the very…", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r278833984", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Return to the Lakes -but not on Sky!", "review": "Dearest Guys, we regret not having been able to perfectly meet your expectations during your stay in Torbole. However, we read in this valuable feedback that you appreciated some services offered by the Piccolo Mondo Hotel. We are happy that you were impressed by the friendly and warm welcome that our guys have reserved for you  even though it was late at night: for us it is important that our guests always have the best. About that, we are glad that you enjoyed your comfy and tidy room, and we regret that you had problems with your safe. However we are pleased that you have enjoyed the quiet of this amazing place.  We regret that the variety of the food was not enough for you, but we are always willing to make the changes to meet the different tastes of each visitor.  In addition we apologize if you have found the atmosphere a little bit dull and that the style was not modern enough for you.  We would get a second chance to definitively surprise you with our best qualities. Kindest Regards from us all.", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r273001210", "sub_review": {"Sleep Quality": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "beautiful area to have a good hotel", "review": "We have travelled to the Italian Lakes before and had good holidays mostly around Lake Garda, so we decided to try further up the Lake and chose Torbole as our stay whilst visiting for a weeks holiday. We had read that the area had sports activities on the Lake due to the breezes that usually arose about midday and there were plenty of activity whilst we were there. Having said that, we went for the walks and the Italian food and drink that we enjoy with such nice scenery and friendly folk - what more do you need for a weeks break? The Hotel was family run and just as we have experienced before, very friendly, good banter with the Hotel staff and other guests whilst spending some time in the hotel for our half board meals and evening drinks. The roomwe had was comfortable,…", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r271362699", "sub_review": {"Location": 4, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Delightful for Lunch", "review": "Dearest guest, we are pleasantly surprised by the super detailled and accurate feedback you wrote on behalf of the Piccolo Mondo Hotel. We are so happy you have chosen Torbole as holiday destination: it is full of activities and its atmosphere is magical. Many thanks for appreciating our family run service: our friendly and funny staff pays attention in offering professionalism and good manners, to make your experience by us relaxed and happy. We are glad you underlined the comfort, typical of our rooms, spacious, clean and well-equipped. We will try to fix the matter about the Tv channels. Thanks for enjoying our varied and tasty food and the interesting Gala dinner we proposed (our guests are always so excited for this event). To conclude, we want to thank you for the compliments about our cute building and about the welcome in our big family: you will always be welcome. We would like to see you soon, for a new amazing experience with us. All the best!", "date": "December 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r264876056", "sub_review": {"Location": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Excellent place for complete relaxing", "review": "I have just come back from a lovely 7 day holiday in this hotel everything about it was very good The food was excellent and very tasty the staff cannot do enough for you they told me all the lovely places to visit  and everything that they told me was just how they said  it would be If there was  any down side to my holiday!!  was that I was the only person  there who was English  for 5 days then another lady came so I had someone to talk to.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r238250584", "sub_review": {"Location": 4, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Good hotel but needs attention", "review": "Pros Good location Friendly staff Good food Nice reception area and outside pool Good shower Cons Not 4 star more like 3 Food served too fast despite asking them several times to slow down. Rooms basic Mould around shower Sky TV did not work and nobody turned up to sort it out when we complained Waitress served drinks buy holding the rim of the cup", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r237088837", "sub_review": {"Sleep Quality": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Excellent hotel - Torbole", "review": "The hotel is clean and very welcoming in a superb location, with views of the mountains and within easy 5 min walk to the lake.  Staff are really helpful and friendly, nothing is too much trouble.  Helped with suggesting places of  interest to visit locally.  Nice outside pool area with good facilities for all ages. The restaurant and breakfasts were excellent, with plenty of choice. Made use of the complimentary bikes several times to visit other towns by using the brilliant cycle tracks. We would recommend this hotel and intend to go back ourselves very soon.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r232376694", "sub_review": {"Value": 5, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Torbole ... Nice place but good weather a necessity", "review": "Hotel was fine but is a 3* and not 4* by Irish Hotel Standards. It is set in a lovely location surrounded by the Dolomite's. Staff very friendly and helpful. The location in Torbole is excellent at top of the town within 5 min walk of any restaurant or the lakefront. Pool area is nice. Breakfast was good every morning with a great selection to suit all. The town of Torbole is hugely active for Windsurfing or all types of cycling. There are huge number of excellent restaurants which are fabulous value. Weather conditions are key for a good vacation. Everything is geared towards outdoor activity and unfortunately the facilities are lacking when bad rain sets in.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r224388611", "sub_review": {"Sleep Quality": 3, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good hotel to sleep at if your out all day (and get up early...)", "review": "Combined stay at this hotel with a 'blu week' windsurfing package from Surfsegnana. Hotel is located few minutes walk from lakeside and center of Torbole.  Based on the 4 star hotels i visited before i had expected a bit more quality/luxury but perhaps received quality has to do with it being a family hotel.  Pro's: - close to center/close to surfcenters - nice view of mountains from certain rooms  Cons: - noisy! Dont know how this hotel is constructed and exactly how my neighbours behaved, but u can hear kids in upstairs room jumping on floor (nightly exercise before they had to go to bed?), your neighbours talking in room and lots of sound from halway - cleaning staff - im on holiday and like to go out. Do NOT come knocking to do cleaning every morning around 9.30. This was…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r223372421", "sub_review": {"Value": 3, "Sleep Quality": 2, "Service": 3}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Good experience, we would recommend this hotel.", "review": "Very good location, and a beautiful pool area. The rooms were nice, spacious enough, with a balcony. We had a mini-bar which we used as a fridge. It was comfortable. The food was of a high standard, and the staff were friendly. It was quiet at night, the days were busier. The mountains were stunning. We would recommend this hotel.", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r219116702", "sub_review": {"Value": 3, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Fantastic Hotel", "review": "My husband and I stayed 7 nights in June this year.   The family that run it were excellent and always on hand to assist.  The staff were also more than helpful.  We actually booked B&B but having ate their the first night decided to book for the evening meals the rest of the week.  You could not fault the meals at all and would highly recommend staying at this Hotel on a half board basis.  The facilities were again great.  The actual location was perfect for visiting the other places in the area.  Would definitely stay there again.", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r216203570", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent hotel", "review": "My husband and I stayed 7 nights here in June this year.We are both in our seventies but there was a good mix of ages. We stayed on a half board basis.  We arrived very late due to late departure and as we missed dinner we were provided with an excellent salad meal. We have never holidayed in Italy before and found everyone understood and spoke English. The family run hotel and staff were extremely helpful and friendly. They obviously worked very hard to keep the hotel up to the 4* rating.  The location of the hotel was central but quiet and the facilities very good. The room spacious, very comfortable and clean and had a balcony.. The restaurant meals were extremely good and as I don't eat meat I was provided with an alternative when necessary without any problem and wasn't…", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r215484168", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Should be 5*- brillant hotel", "review": "2 of us stayed the 1st week of june and it was brillant. Clean, great helpfull friendly staff, good location, all facilities you need (pools, bikes gym, spa, internet, bar) and & amazing resturant.  Would highly recomend and if ever in that part of the world again will sta there.", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r213021551", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent hotel in great location", "review": "This was our first visit to this region of Italy. We found the hotel and it's location to be a great base to visit this beautiful area. The hotel was spotlessly clean, the room excellent, and the staff were extremely helpful and friendly. It was fortunate that our booking included the evening meal. The restaurant offered excellent 4 course, varied and plentiful local food and drink.", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r209746220", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fantastic Hotel in all aspects", "review": "We have just returned from Torbole and booked the holiday through Newmarket Holidays (review to follow), on an 'allocation on arrival' basis. Having not been to this area before we had no idea where we would be staying and the hotel was allocated at Verona Airport. This is a family owned and run four star hotel and we couldn't fault it. The location was perfect for all facilities in the resort and the staff were friendly, helpful and all spoke very good English. Our room was actually a double and single room together with private facilities, air conditioning and a balcony with a sublime view to the mountains in the north. Rooms were clean and the beds made up daily along with the facilities being serviced. Set on three floors access to the ground floor lobby, dining rooms and…", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r209411382", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Chiesa Family Ownership/Hospitality Fantastic.", "review": "Stayed here with my wife as part of a 30 strong \"Huttons' Special Interest Tours' Group (from N. Ireland) in May 2014. The owner, Mr Chiesa (and family) showed an interest in the entire group from morning to night; couldn't have been more helpful. He even helped load the group's suit-cases into our coach at the end of our week's stay - and shook hands with each guest. When a course on the restaurant menu wasn't suitable for our group an alternative was provided promptly and extras were offered frequently. The food and service in the restaurant were excellent. The hotel itself and its gardens/outdoor pool were spotless and hygiene was of a high standard. It's location was excellent; just a short five minute walk to the centre of Torbole and Lake Garda - and ten minutes to the…", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r208073636", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Fantastic friendly staff", "review": "I stayed hear as part of a large party for 4 nights. The location is brilliant. The staff are extremely friendly and obliging, especially the incomparable young Alessandro who is the best all round waiter and bar tender I've ever had the pleasure of being served by, he s very enthusiastic and his personality shines through with his great sense if humour. Food was good and our forward facing room with very large balcony and terrace finished everything off perfectly. Will definitely hope to re visit again", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r205551876", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Fantastic Hotel", "review": "We have just returned from our holiday in Lake Garda and stayed at the Piccolo Mondo hotel. The service, cleanliness and just the overall feel of the hotel was lovely. All the staff very efficient and helpful, and worked hard to accommodate our dietary needs. The food was excellent and very tasty. It was in a lovely position - about 15 minutes walk from the ferry port in Torbole where the boats ran frequently and gave us access to the whole lake. The hotel was about 5 minutes walk from a very cheap bus service - only about €5.80 to Verona! We didn't actually use the pool but the leisure area looked great, although the outdoor pool was not warm enough to use. There is a lovely garden and outdoor seating area. Our room was at the front of the hotel, where we did hear some traffic…", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r201534912", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great location and lovely rooms", "review": "Easy walking distance to the lake and the town  Hotel room was lovely for 4 star, very clean and tidy, cleaned well.   Nice pool, grounds well maintained, pool bar was tasty!  I would definitely go back!  Only reason for not giving a 5 star was that the staff weren't overly friendly but did a good job regardless! ", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r198305221", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Friendly and quiet hotel", "review": "We stayed at Piccolo Mondo at the end of our Italian holiday. Sergio was a charming and accommodating host and we found all the staff friendly and helpful. The breakfast dining room was a trip down memory lane for cycling enthusiasts as Sergio was chef for the Italian Road Cycling team. The hotel has 2 pools and a gym & sauna, lovely and interesting gardens with beautiful views of the mountains from our room.  We ate dinner in the restaurant and recommend the apple risotto. The wine recommended by the head waiter was excellent. Our stay in Torbole was an enjoyable one. Thank you Sergio and staff for making our stay comfortable and happy.", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r181639191", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great place", "review": "Everyone should visit this hotel, to experinece friendly and calm family atmosphere. Great kitchen, charming staff and very clean environment. If you want to avoid summer crowd and still enjoy warm sunny weather come here beginnig of October. AND drink red or white wines from excelent local wineyard named Pravis, from Lasino.", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r180687429", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A cross between Fawlty Towers and an upmarket care home", "review": "First let's get over the basics. The hotel is extremely clean, well maintained with some lovely gardens and both indoor and outdoor pools. The rooms are well kept and large enough with clean linen and excellent cleansing by chambermaids. The receptionist was helpful and spoke excellent English and despite earlier reviewers saying how miserable the owner's wife is we found her quite smiley. Views from our balcony were of the mountains so very pleasant.  Now the buts.....  1. The restaurant and bar staff are fawningly attentive (like Basil to a phoney lord and lady) but you can't help feeling they don't mean it.  2. We were half-board as was everyone else (I think it's compulsory) so started out eating our evening meals in the nicely appointed, if over lit, restaurant. This is…", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r178802093", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Rooms pleasant and clean food fantastic", "review": "Came here on my own and really enjoyed my stay - that is until the owners tried to make me pay for another whole day of wifi when I had been told that the price I paid would be for the duration of my stay.   The hotel is lovely and clean and within easy reach of everything with some lovely walks into the city.  The food was amazing and I thoroughly enjoyed my stay here ....   Would highly recommend.  Watch out for the drinks, wifi etc you have put on your room though - they do not give you a full account just a final total which I think you have to keep a bit of an eye on.", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r177127950", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Just returned from Garda Lake", "review": "I have just returned from Torbole where I stayed with Piccolo Mondo hotel for three nights and I can only highly recommend this hotel to everyone who seeks perfect location, welcoming and professional service (my most sincere thanks mainly to Veronica, a receptionist, who did not hesitate to address all my requests and answer any questions in perfect English), nice rooms, spacious garden, out-door and in-door swimming pool and a relaxing sitting by the bar. Also let's not forget rich breakfast which is not always the case in Italian hotels. I had not booked the room in advance but called the hotel when driving to Torbole. The hotel has kindly made the reservation over the phone and put me into a nice air-conditioned room (I believe all rooms have air-con) with a little private…", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r176658461", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Comfortable", "review": "Likes:  Small, pretty hotel, with attractive gardens at front and rear.  Efficient, friendly  staff who aim to please -  some have a good command of the English language. Rooms clean and comfortable with ample storage space - beds made up and fluffy white towels were changed daily whilst we were at breakfast.  Breakfast room clean, bright and airy - one part being a conservatory.  Signor Chiesa, owner,  takes great pride in presentation of buffet breakfast which offers above average selection, although no bacon.   Dinner is waiter/waitress served apart from salad starter which is self-service and buffet night when it is all self-service.   Cuisine is traditional and regional  but the menu is sometimes lost in translation e.g. 'tasty veal bites'  means cubes of veal that have…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r175408667", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Delightful Stay", "review": "I couldn't fault anything about my stay at this hotel! The friendliness and helpfulness of the staff was the key that created the wonderful atmosphere. The owner Sergio is extremely hand's-on (often seen in an apron helping with breakfast service and dinner service!) and he is very willing to offer advice and assistance to all the guests. I found each and every one of the staff members very approachable and very helpful. The rooms were sizable and comfortable, with a large en-suite and lovely balcony to catch the evening sun! The outdoor pool was lovely and very suitable for small children due to the shallow waters at one end and there was never a need to rush for a sun-lounger as they provided plenty for everyone. The hotel also provides free bicycle use and it was a great way…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r175161841", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "lovely place to stay!", "review": "My husband and I stayed at the Hotel Piccolo Mondo from 6-13 July.  We thoroughly enjoyed our holiday.  All the staff were great from the moment we arrived and were checked in by a very nice girl at  the reception desk, until the moment we left.   Patrizio, Alexsai,  and Dania were always very friendly and helpful as indeed were all the staff.   Breakfast was always very good with plenty of choice and the 4 course evening meals were great. We especially enjoyed the buffet night and the Gala night.  We enjoyed using the outdoor pool and jacuzzi and never had a problem getting a sunlounger. The hotel is in a very good location with great views of the mountains, close to the shops and yet quiet and peaceful. We would definitely love to stay here again. Many thanks to  Sergio, his…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r168407922", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Exceeded our expectations!", "review": "We thoroughly enjoyed our stay at the Piccolo Mondo.  Our room (116) had a huge balcony with fantastic views and was plenty big enough for the two of us.  The hotel had great facilities; indoor and outdoor pool with whirlpools, sauna and steam room and a gym, all of which we mostly had to ourselves each time we used them.  The staff were very friendly and helpful and the food was superb (four or five courses each night).  We highly recommend this hotel and would definitely stay here if we were to visit the area again.", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r164942093", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "holiday", "review": "My husband and I went on a coach trip from Forres in Scotland to Torbole. We were on the Hull ferry overnight then had a stop over in Germany before arriving at the Hotel Piccolo Mondo the 3rd night. It was a lovely hotel. We had a balcony at the back of the hotel. Lovely view of the mountains etc. Breakfast was lovely with plenty of choices including fruit juice, fruit, cereals, sausages, eggs, a variety of rolls and bread and meats, cheeses and jams. Dinner at night was very good. Not huge helpings but plenty salad etc to help yourself if you were hungry. We found what we got was fine. We had 2 buffet nights - wow! Pretty amazing. The 3 waiters and waitress were fantastic. Very friendly, helpful and all with a great sense of humour. They worked really hard. The rooms were…", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r164642689", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Holiday", "review": "The Piccolo Mondo is an outstanding Hotel, location, staff, food what can a person ask for. My Wife and I had one of the best holiday's ever. The location of the hotel in Torbolle is a dream, every morning waking up to that ‘view’, the Mountain views are spectacular even on a cloudy day. Then more of the same with view’s of the Mountains from the breakfast room, while being looking after by the best team ever. The dream continues in an area which has so much to offer. In the evening the day is followed by a meal which may be simple but excellent, again served by those brilliant staff, they are efficient, funny and always helpful.  Sergio is a wonderful character whose company was a pleasure, with Madam keeping a firm control of operations making sure the team are all doing their…", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r163253872", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely hotel with a few buts...", "review": "The Piccolo Mondo does what it says on the tin...it is five minutes walk from the shores of Lake Garda and is a small family run hotel. The staff were delightful..Marco, Patrizio,Alexsei and Dania to name a few. The food is ok.. the breakfast what you would expect for a buffet and the evening meal tasty and not overful plates which I like. A bit heavy on the salt though. The inside pool was lovely and warm but it was too cold to try the outside one. The bedrooms were spacious and the bathroom was adequate. Here are the buts.... No tea or coffee making facilities in the bedroom. The lighting in the bathroom is inadequate. A bulb wasnt working. I left it in the sink the whole stay. Never replaced. Nobody to answer reception at 6.30am. The greatest but is Signora Isobella the…", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r162768456", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "sheer heaven. Hotel Picolo Mondo Lake Garda Italy", "review": "firstly i have to say Gareth of Manchesters review is not to be beleived under any cicumstances.This hotel is amazing.My 2 friends and I were here for my birthday on may 15 just a week ago.the rooms are large and comfy the A/C works beautifully and the loo has plenty of space for all the necessary activities..all this aside as i say the hotel is loveley and the staff canot do enough for you and every one from the cleaners to the hotel owners are curteous friendly and helpfull.on my birthday i returned to my room with my 2 friends to find a room ful of balloons most of them blown up by various staff.After dinner there was a specially made cake which was made by the chef.This is far beyond anything you would normally expect from a hotel where you are just on holiday,big big…", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r161406816", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Wonderful Hotel", "review": "I have just returned from my holiday in Torbole,Lake Garda and stayed at the Piccolo Mondo.I can not praise this hotel enough,Let me start with the staff.Veronica on reception was always there with a smile and nothing was to much trouble,she arranged for 70 balloons to be put in my friend's room because it was her birthday and she arranged or a cake,Marco was the barman and made a mean cocktail, Patrizio and Alexei were the comedians of the hotel but what lovely guys.Sergio and his wife owned the hotel and Sergio was a mind of information.The food was absolutely delicious and there was plenty of it.I would highly recommend this hotel to anyone and i will certainly be returning", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r161290156", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Enjoyable, relaxing, great food", "review": "We stayed at the Piccolo Mondo half-board for 9 nights in mid-April, 2013. We had two adjacent rooms on the first floor. Due to flight delay we were very late arriving (after midnight) but found the owner waiting up for us, with our keys and a smile. Both rooms were large, one with king-sized bed and one with two ample twin beds. One had a shower, the other a bath with shower over. The rooms were spotless and non-smoking, though in one room the previous tenant or his/her guests had been smoking and it took a couple of days for the smell to dissipate. The hotel sits in modest but attractive grounds. As we were pre-season, the outdoor pool was drained, but our son got a great deal of use out of the indoor pool, which includes a whirlpool 'end'. Mostly we had this facility to…", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r158442807", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great Place to Stay", "review": "I stayed in this hotel in October 2012. first time in Italy what a lovely country. The first time to stay in a family ran hotel. Usually stay in named hotel; but after staying in a family hotel  I would go back again. Everybody was so helpful; everyone took great pride in they work and could not do enough for you. i could not recommend this hotel eough. If you want to stay in a friendly family run hotel try this hotel. The food was really good; great nights sleep just perfect.", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r148741304", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Gem of a family hotel", "review": "Had a wonderful stay at the Piccolo , from the cleaners to the owners all the staff are wonderful. Rooms spotless, food was good and the attention to the guests is from a bygone age. We loved it.  Newmarket Holidays from Inverness , airline was OK no problems (and I was worried after reading write ups)  Transfers fine, on our return journey we had to leave our hotel earlier than expected as road was closed due to marathon and we had expected to spend a long wait at airport, our rep thought of taking us to a shopping centre and we spend a couple of hours looking at lovely shops and having coffee etc. this was a nice surprise as Verona airport is not the largest , well done Newmarket rep.  A lovely autumn break. Thanks you to the Cheisa family. S Townsley", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r142841517", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Interesting Unique and Very Good", "review": "A hotel and mangement team led by the owner who offer an old fashioned service that you don't often see nowadays. The welcome at reception was very warm and the staff were very friendly, the facilities of the hotel were a little lacking and could have been enhanced with an area outdoors to enjoy a drink in the evening. The entertainment was poor and glad to say it only happened twice in a 9 day stay, the food was very good and good qulity wine was avilable t reasonable prices. Could have done with some tea/coffee making facilities in the room but overall impressed and would recommend", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r142278281", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Maire M", "review": "We really enjoyed our stay in this excellent hotel. Service was brilliant. The staff and owner were extremely helpful, courteous and friendly. Accomodation was great and evervthing was spotless. Food was excellent. A great holiday.I would reccomend this hotel highly and would like to  return.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r141934978", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "September holiday September 2012", "review": "The level of service was excellent, all staff very helpful and polite. The owner Mr. Chiesa was always on hand and applied a high level of personal care and attention to each guest to provide a service reminiscent of a bygone era.  Food was excellent!!  The free bikes were a real bonus, making it easy to get around the whole of the Alto Garda, Riva, Arco, Dro etc.  All in all an excellent hotel.  All round a", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r141594207", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "David s", "review": "My Wife and i have just returned From a Newmarket Holiday to Lake Garda staying at Torbole at the hotel Piccolo Monda which was excellant the the food and the service was briliant. Also the friendly staff just couldnt do enough for you  also the hotel was allways spotless The only fault of the holiday was the long coach trip of nearly three hours from Bergan airport why Newmarket Travel dont use Veroa Airport .The organized tours were great and saw lots of lovely places highly reccomend", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r141070295", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Absolutely lovely hotel in the most beautiful location!", "review": "As I had been scouring trip advisor for reviews in the weeks running up to our stay at the Piccolo Mondo Hotel, I thought it was only fair that I offer my own review now that I have returned.  Piccolo Mondo Hotel is a family run, 4 star hotel situated in the northern Lake Garda town of Torbole. Immediately, as soon as we walked through the doors, we were joyfully and warmly welcomed by the receptionist, Monica. Although it was late (about 9.45pm) she quickly checked us in and asked if we wanted to sit down for a meal - which we did.   Now, the food. If I have to be honest I was a little concerned reading some of the previous reviews, particularly concerning choice and portion sizes. But unless you have decided that you are in Italy and therefore must eat a whole pizza every…", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r140569800", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Holiday on Lake Garda.", "review": "My wife and I and two friends have just returned from a holiday on Lake Garda which was organised by Newmarket Travel. We were based at the Piccolo Mondo Hotel and from there visited Venice, Verona and the Dolomites all of which were excellent and very interesting.The only thing that marred our trip was the long coach trip to and from the hotel and I would recommend that anybody doing this trip makes sure that they fly to Verona even though it may be a bit further from your home, as an extra hour spent travelling in the Uk could mean saving three hours in Italy! The hotel was very good with excellent rooms and very pleasant staff at all times.My only criticism was the lack of choice in the evening meals but this could be overcome by requesting an alternative with the waiters.The…", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r139995687", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Piccolo Mondo Hotel", "review": "We had a great holiday in Torbole located at the top of Lake Garda. The scenery was magnificent  and it is easy to visit other towns by ferry or bus. The hotel staff were very friendly especially Patricio who could also be very funny. The food and service were also excellent as was our room.  The area is great for windsurfers, cyclists and walkers. You can walk to Riva del Garda quite easily in an hour. Highly recommended.", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r138310906", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "wonderful holiday", "review": "We had a wonderful holiday here in July. Everything was lovely. We were pleased with our room (even though the view from the balcony wasn't great). The food was excellent and the head waiter, Patricio, was exceptional. He recommended which meals my husband could eat (he can't eat onions or garlic) and went out of his way to give the very best of service! All the staff were very good with the exception of the owner's son when he was on duty. The customer service we had from him was not so good which is a pity because otherwise the rating would have been five stars.Overall, it was a great place to stay and I highly recommend it.", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r138106896", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent family run hotel, super staff, traditional excellent food.", "review": "Had a wonderful week here, beautiful location at the top of the lake, stunning mountains surrounding. Highly recommended. Ideal for families, people looking for relaxation also great for road cyclists. Very popular for cycling. The hotel chef worked for the Italian national cycling team. Beautiful pool both indoor and outdoor.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r136978779", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Very nice meal", "review": "Visited the restaurant at the Piccolo Mondo hotel even though we were not staying there and had a lovely experience. The waiter was very enthusiastic about the food and gave some great recommendations.  Although the restaurant does not have a lake view there is a good atmosphere.  The food was very good- in particular the beef which was marinated in a delicious berry sauce. The puddings were slightly disappointing as the tiramisu had way too much chocolate powder which slightly unbalanced the dish.   Overall it was a very positive experience and would recommend to other diners!", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r135359813", "sub_review": {"Value": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Attention to detail very important at this hotel", "review": "Arriving quite late and tired we were met by friendly ,pleasant and efficient staff.A meal was ready after we checked in and this standard of service was maintained for the duration of our holiday .The family and staff were always available if needed. We were looking forward to the food having read reviews and we were not disappointed.A varied menu ,food beautifully cooked and presented. We would definitely return to this hotel.", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r135224349", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Friendliest hotel staff ever!!", "review": "We arrived at the hotel in a rather comedic fashion. Whilst walking up the stairs by suitcase decided to separate from the handle and bounce down the stairs. I think a lady who might be some relative on the owners laughed and made a few jokes but nothing rude/offensive. Anyway, we got to the desk and greeted by (I imagine the wife/owner) who spoke good English and shown us to our room.  The initial impression was that the room wasn't the biggest, but it had a HUGE bed, dressing table and a table with two chairs. So more than big enough! Bathrooms was clean and well furnished, although one light bulb was blown for our whole stay. tut tut. I have ready complaints about the shower, but it's OK. Just one of those that run off the tap in the bath.  The pool was great, but often empty…", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r135164075", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 3, "Cleanliness": 3, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very welcoming hotel - great service", "review": "We enjoyed our stay in the Piccolo Mondo. We were welcomed by a friendly receptionist (Monica) who spoke excellent English and make us feel at home, with a porter on hand to take our bags to our room.  Our room was in the newer extended part of the hotel and was very spacious, with a good bathroom - it was all kept very clean and well looked after.  Breakfast was very good quality - plenty of choice and even a hot selection of scrambled egg and bacon and occasionally sausage. We were half board and were impressed by the evening meals - while on some nights there was not lots of options to chose from there was a good variety and enough courses and help yourself hors d'oevres that we never left the table hungry (in fact normally the opposite). There was a night of \"local\"…", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r134203292", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Definitely worth a visit .", "review": "This was my second visit to the hotel and my Husbands first . The hotel is in an excellent location for walking , cycling around the northern part of the lake . You can walk along the lakeshore from Torbole to Riva which is about 1.5 miles . Ferry trips to Limone , Malcesine and Riva (all beautiful locations) are so easy to negotiate once you have mastered reading the timetable , you can hop on and off them all day . A ride up the cable car at Malcesine is a must , just try and get there early to avoid queuing . The food at the hotel had improved since my last visit ,portions may be on the small side for big eaters ?  The stairs carpet could do with replacing or cleaning , it did look rather worn or dirty . The rooms are clean but basic which is all you need as who wants to be…", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r132471647", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "An absolute gem", "review": "Just returned from a seven day stay at this hotel and cannot fault it in anyway. Superb staff, fantastic food and great rooms, added to this is the enclosed garden with a great pool. You cannot go wrong it is an absolute gem. We will definitely be returning sometime in the future.", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r132155584", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "absolutely fantastic experience", "review": "We have just come back from our honeymoon staying at The Piccolo Mondo and we couldn't have asked for a better place.  We were welcomed from the moment we stepped off our transfer coach, with a waiter rushing out to help with bags. All the staff went out of their way to make sure everything was perfect, not just for us but for every guest in the hotel. always smiling and asking how you were.  The rooms were comfy and clean, and the balcony had breath taking views of the mountains.  The restaurant served fantastic food, which got better with every course and a different menu every evening.  Indoor and outdoor pool were great, and sitting by the outside pool with views of the mountains all round was something you don't get elsewhere. Position of the hotel was ideal. Not too…", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r131913042", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nice hotel", "review": "Spent 4 days here and enjoyed the experience. The hotel is well located, next to a river and a short walk to Terbole town centre. Our room look out toward the mountains and it was a pleasure to draw the curtains each morning and take in the view. Good location for exploring the top end of Lake Garda. We had a half board package with breakfast and dinner included. The former was always good but dinner varied from good to indifferent. Not a wide choice selection. Room was good, reasonable size with good linen and towels. Bathroom was nothing special but adequate. Public rooms in hotel were good with wi Fi and Internet access. Parking is available if you have a car. Main plus point that boosted our opinion of the place was the almost universal good service from the staff. From…", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r130934385", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "lovely hotel", "review": "Just returned from a week at Piccolo Mondo which means small world. We couldnt fault it , the position of the hotel is special with a river running past and a backdrop of the mountains.Food was excellent very Italian and waiter served which we loved. Very friendly staff. If ther is a negative the showers could do with an upgrade, apart from that wonderful holiday.", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r129898692", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great place to stay at Lake Garda", "review": "Found this hotel by accident as the usual one I stay at was closed for the winter. Very pleased with what I found. The owner and staff were so friendly and helpful. The rooms were excellent and had sky tv which was an added bonus.Only stayed 1 night so did not have a chance to try the indoor pool which I looked at and thought was a good size for a proper swim. Also did not have time for an evening meal but the breakfast was good. Would definately stay again. Not sure if I could afford to stay there in peak season but over the winter the rates were very reasonable.", "date": "December 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r121940816", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Good but basic", "review": "Excellent, clean & friendly. Good food although very small portions.  Ordinary house wine expensive at 20 euro a bottle .  Had to pay for table water at 2.50 euro a bottle . A very small lager  was 4.50 euros and a Bacardi & Coke  6.50 euros .  We soon found the local bars charging 80 % less !", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r119820012", "sub_review": {"Value": 2, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Holiday", "review": "We went for dinner to this Hotel, we. were six (6) of us, I must say that the food was excellent and also the service. The owner Sergio took care of us and with his cooking next to our table he really did a good job and show.", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r119750247", "sub_review": {"Value": 4, "Location": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Good food, friendly staff, worth a visit", "review": "Our 8-night stay was a last-minute booking and we were, to be honest, a bit wary of what sort of hotel we would find in such a popular resort at short notice.  We needn't have worried.  Almost everything about our stay was just right for us.  The room was plenty big enough with a balcony and very clean, although the shower left a lot to be desired (it was perfectly clean but leaked all over the floor, no matter what we did to avoid it).  The food was excellent quality every evening and the hotel rightly prides itself on this.  All the staff were cheerful, helpful and friendly, and did their best to make us feel welcome.  The owner himself worked alongside them in the restaurant and seemed to be around all day, every day.  The hotel is 10 minutes easy walk from the centre of…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r119628023", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "super hotel", "review": "we recently stayed in the piccolo mondo as part of our tour. It is a family run hotel in an ideal situation.The owner was always around working along side the very hard working staff. Mohamed,the barman was indeed a really hard working member of staff with a great sense of humour. We really enjoyed our stay in Torbole & hope to go back.We had a very nice room at the back of the hotel. It was always very clean.The food was excellent & waiting staff were so good.i would recommend a stay in this great hotel", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r119077974", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Fantastic family run hotel", "review": "I stayed at this hotel for 8 nights as part of a coach holiday to Lake Garda. The hotel is a family owned and run business and you can tell they really care about their guests.  Our room was one of the smaller ones, with no sofa but was still a nice size with fine bathroom and balcony. The food was absolutely amazing, way above the normal coach tour standard. The family also own a restaurant in Trento. The owner is always on the go, serving food and chatting to guests, and in actual fact does not look at all like a hotel owner - I spent a few days believing he was a waiter! The serving and bar staff are excellent, polite but very friendly, the bar man is especially funny! The hotel has 2 swimming pools; a heated indoor one and an outdoor one, both with jacuzzi. There is also a…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r118848897", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Lovely Family Run Hotel With Entertaining Staff In A Great Location", "review": "Hotel Piccolo Mondo (Small World) is found in the bustly town of Torbole at the North Eastern tip of Lake Garda and is in a very pleasant spot close to the lake (200 metres or so) and the array of shops and lakeside cafes. Torbole is a wind surfers paradise and also a much loved haunt for cyclists and walkers of all ages. Although surrounded by mountains the road to Riva (2km away) for instance is very flat and can be easily reached by bike or foot.   As for the hotel it’s self the photo’s in the Citalia (our tour operator) brochure do not really do this quaint little hotel justice as the pool and gardens look small and cramped when in fact it is set in a beautiful garden with plenty of sunbeds and parasols in both the pool and garden areas. We had room 104 which despite not…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r116335928", "sub_review": {"Value": 5, "Sleep Quality": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great in May", "review": "The Hotel has 4 stars they are justified the staff are great very pleasant and happy to please. The room we stayed in was at the front of the hotel which is the old part and a bit dated the food is very nice but if you are a big eater there was not a lot of it. And the price of the wine however good was very expensive  26euros for the cheapest even a bottle of water was 2.50 euros but that was the biggest down side of the place, the spa was great steam room the indoor and outdoor  pool and grounds are all very nice etc. it was all a very good standard .The rooms at the front of the Hotel are 35 m away from the main road that goes round the lake and can get very busy at time so opt  for a room in the back of the hotel which are newer and for more up to date and no traffic noises…", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r108899307", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "An extremely friendly hotel", "review": "The two of us stayed in the Hotel Piccolo Mondo as part of a tour group which was made up of a range of ages and personalities.  Not one person complained of the hotel.  This hotel is really it's staff.  They seem to interact  quite easily with the guests and work together as a great team.. They have a very friendly and efficient way.  The owner of the hotel goes out of his way to have a welcome for all.  It is a small family hotel and does not pretend to be out of it's class.  There are no tea making facilities but it is quite possible to have tea, warm milk or coffee of whatever you are having yourself at the bar after evening dinner.  We tested them all.  Good.   The bedrooms were tidied daily. Shower as per in Rome (small) but bathroom well proportioned otherwise, with…", "date": "October 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r83379989", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Lovely hotel", "review": "We stayed there as my brother was getting married near by, we had 4 rooms close together, we were only there 3 nights and felt very pleased with our choice, i have a 6 month old baby so a cot was in the room when we got there, it was a large room with a sofa, the other 3 rooms were good size and had amazing views, nothing was to much for the staff, i am very picky with food and didn't want what was on the menu, i told them what i wanted and they couldn't of been more happy to get it for me. unfortunately the last day was planned to be spent by the pool but it rained so we didn't get the chance but it looked very nice, the beach is only a short walk away and the views are amazing. pricey but worth it very friendly staff and lovely hotel would return there again.", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r76861171", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "very good hotel, great staff - good base for outdoor activities", "review": "excellent hotel for food, went half board and evening meals were very good as was the breakfast. friendly and efficent staff.nice swiming pool, quiet and relaxed. great views and scenery all around the hotel and great base for walks and cycling - free bikes provided for hotel guests. only negative was facilities lacking in room like no tea and coffee making facilities and no iron but seems to be the way with hotels in italy. within walking distance to Riva which is a busier,livelier area", "date": "August 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r48265547", "sub_review": {"Value": 4, "Location": 4, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "What a fantastic hotel", "review": "I travelled to this hotel with my two older cousins - so we were quite a wide age range to accommodate.  We had a fantastic holiday - the hotel was of a good standard comfortable and very freindly.  Please do not take any notice of the comments made by our Irish friends below - we stayed at the hotel at the same time as this group and therefore ate the same food etc.  I have to say the food served in the dining room is probably some of the best food I have eaten in a hotel dining room and it is certainly worth staying in to experience it.  We had plenty of choice - suckling pig/veal/beef/lamb/fish/ and if for any reason you do not like any of the menu choices the staff - who are very friendly and helpful - will ensure that they find you something you do like.  Nothing is too…", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r46299546", "sub_review": {"Value": 4, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "overall a good hotel to stay in", "review": "we went on a joe walsh escorted tour and having just come back from our stay at this hotel all i can say that it is a family run hotel. it is well run and  the owner himself goes out of his way to welcome his guests. i asked for a view of the lake or mountains when i booked but what i got was a view of a building site every morning i looked out of the window. the food was good but i would like more of a variety all that seemed to be on most evenings was pork or fish served with a sauce. some of the sauses i did not care for. i would like if they were served on the side that way if you did not like it you did not have to use it. i would have liked a bit of beef or lamb to be on the menu as a bit of variety. there is one waiter who is exellent and always in good humour and he will…", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r43123640", "sub_review": {"Value": 4, "Location": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Not a Four Star Hotel", "review": "Stayed here for a week with a Joe walsh tour Group. The room I was given was looking out over a building site. It was a small room. The bathroom was tiny and the decor was very dated. There was a small TV  only showing news channels. No tea/coffee facilities were provided. I was expecting 4 star food but was verey disappointed to be offered only one menu choice for s 'gala dinner'. The only choice was pork and as I did not eat pork that ment there was nothing i could have. After remonstrating with the waiters they eventually gave me a dried out piece of trout that was inedible. The waiters were very unhelpful and unfriendly. The next morning when I came down to breakfast they told me as i was with a tour group I could not sit out on the veranda for breakfast i had to eat inside.…", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r40915122", "sub_review": {"Value": 1, "Location": 4, "Rooms": 2, "Cleanliness": 2, "Service": 1}, "travel_purpose": "", "rating": 2}, {"title": "Paradise, wonderful location, fantastic food and attentive staff", "review": "Just  spent the most amazing 10 days at the Piccolo Mondo with 7 friends. Celebrated my 50th which i was not looking forward to!! Everything about the holiday was perfect, The hotel was so clean, the food the best i have tasted  on holidays abroad (lots of choices and variety) and the staff so attentive. There were 8 in our party and all of us take very special memories with us. If you are looking for entertainment and late nights the Piccolo is good for a base but will not give you the night life. The bar shuts around 11.30. There are plenty of sun beds around the pool. No matter what time of day we always were able to get 8 loungers together. Guests tend to go out during the day as there is so much to do. Highlights, Malcesine, Venice and Verona.", "date": "August 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r37691957", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Sooooo Relaxing!", "review": "We have just returned (partner and young daughter) from a weeks stay at the Piccolo Mondo.  It was absolutely fab.  Beautiful scenary and  great food.  The family run hotel is very welcoming, and during the evening the waiters made sure that our very fussy eater 4 year old always had something simple to eat (chips/quiche/pizza etc) whilst we dined on their 4 course a la carte meal.  I agree with one of the other reviews, the hotel swimming pool is a tad on the cold side, however, when you're in 35 degrees, its very welcoming and you get used to it.  It certainly didn't hinder my daughter's enthusiasm who was in and out of it like a fish!    There's also lots of activities to do - the hotel provides free bikes if you would like them (there are some great running and cycle…", "date": "July 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r35248292", "sub_review": {"Value": 5, "Location": 3, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Superb Service and Great Food!!!", "review": "We have just come back from a 5 night stay here.  The most impressive thing about this hotel is the service.  The staff were ALL so friendly, helpful, polite and professional. They really pull out all the stops for you.  The hotel is family run, and the owner makes a point of surveying everything at dinner time, making sure all is ok and asking how you are!  We were half board, and really enjoyed the variety of meals,  The menu was different each night.  It was a 4 course meal, along with any extra salad, rolls etc you may want.  The food was imaginative and very well presented.  The hotel itself is spotless!!!  They even change the mat in the lift each day to remind you what day of the week it is.  The rooms were very spacious, although there was no tea / coffee making…", "date": "July 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r35139521", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Best Hotel Food EVER!", "review": "We spent 10 days at this hotel last June.  The hotel itself  is not really 4 star standard as the rooms are not very large although adequate.  Where this hotel stands FAR above any other hotel we have stayed in Europe is the food.  Breakfast is good average but the evening meals can only be described as superb! Worthy of at least a couple of Michelin stars!  And as for the Friday night Gala dinner words fail me. Five courses of superbly prepared and presented food.", "date": "June 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r23820644", "sub_review": {"Location": 4, "Check in / front desk": 2, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Superb Location & Wonderful Hotel", "review": "We have just returned from a week at the Piccolo Mondo and had a wonderful experience.  The hotel is located on the outskirts of Torbole on the way to Riva with a lovely walk along the lake.  The hotel provides bikes with a lovely cycle track next to the hotel into the town of Arco.  Facilities at the hotel were second to none, the food was fantastic and dinner was a delight each night.  I availed of some treatments at the spa which were heaven and keenly priced.  Sergio, the owner is always on hand and staff cannot do enough for you.  I would have no hesitation in recommending this hotel.", "date": "August 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r19595643", "sub_review": {"Value": 4, "Location": 5, "Check in / front desk": 3, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fantastic place for Lake Garda", "review": "Just came back from a week's stay at this hotel with my wife and 10-year old daughter. Truely fantastic - the hotel and the location. Clearly lived up to its 4-star rating with the standard of service and facilities. It is a spar hotel so offered facilities way beyond that expected of a good place just to sleep and eat! The owner and his staff were always there to help with a professional approach to everything.  The true highlight was the food - 4 course evening meals served to your table (allocated for the week). Really great menus that explored italian dishes throughout a week's stay. We paid for half board and I would recommend this to anyone. The eating experience was a real class restaurant level.  The outdoor pool at the back was secluded, very clean and well appointed.…", "date": "August 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r19493720", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 3, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 3}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Perfect base for your holiday in Lake Garda", "review": "Just returned from our second stay at Piccolo Mondo hotel. We totally enjoyed our stay as we did first time round. The whole experence was terrific. Friendly staff, very good food and very clean and comfortable rooms, lovely gardens with superb swimming pool. The property is close to the centre of Torbole but in a very quiet location.", "date": "August 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r18873580", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fantastic!!", "review": "We have just returned from a weeks holiday at the Piccolo Mondo and, while I have never filled out a review before, I felt I had to share our brilliant experience!!  The staff were so friendly, the food was amazing, and nothing was too much to ask.  The rooms were very comfortable and the views from all over the hotel were beautiful.  I would highly recommend this hotel!", "date": "August 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r18813155", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Good value hotel", "review": "Stayed for 5 nights in June in a reasonably sized room at the rear of the hotel which still had a great view to the mountains and a small balcony.  Food and service was very good with a particularly excellent choice at breakfast with the hotel owners always present making sure everything was running smoothly.  Having an indoor pool and spa in addtion to the outside pool was a bonus when the weather turned rainy.", "date": "June 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r17436301", "sub_review": {"Value": 5, "Location": 4, "Check in / front desk": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Steve & Shirley", "review": "We arrived in Italy to find our five star hotel in Riva was overbooked, we were relocated to the 4* Piccolo Mondo in Torboli owned by Sergio and Isabella and after our initial dissapointment at being downgraded we found the hotel fine the staff well trained and well mannered, the food and wine was as good as anywhere. We only stayed a week and were sad to leave.Nothing was to much trouble . We hope to return  October 2008 for another chance to visit this beautiful area of Italy.", "date": "October 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r17281642", "sub_review": {"Value": 5, "Location": 4, "Check in / front desk": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great Lake", "review": "We were thrilled with this hotel and feel lucky that the agent changed us to this one at the last minute. The rooms were clean, the hotel well maintained and the majority of the staff were very attentive. We could not wait for dinner each night, a four course meal with a very varied and delicious menu. It is well positioned for the town and the outdoor swimming pool is set in a pretty garden with a backdrop of the mountains. Just mind your step in the pool as you may not notice the step - and the tiles are slippery!  Mr Chiesa was always there to keep an eye on the running of the hotel and pleased to deal with any questions.  We  would definitely return and would highly reccommend it.  Mr & Mrs R.", "date": "May 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r16771646", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Nice but would go too a different resort and hotel next time!", "review": "We have just returned from a 3 night stay at the Piccolo Mondo, we booked this 4* hotel for my nan's 70th. We had a very nice time, I cant say the food was particually great and the hotel looks very dated. The health spa it offers in the brochure, well we couldnt find it??  The Bar prices were double that of UK pub prices.  It has a lovely location but the resort doesnt have alot too offer.  The staff are lovely for the first day and then the loose interest if you dont spend money in the bar!  I would love too go back too a different resort on the lake but wouldnt go back too this hotel. It's not 4* standard!", "date": "May 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r16691691", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "So much for the romantic Italians!!!", "review": "My husband and I decided to celebrate our first wedding anniversary at Lake Garda this year. We were both disappointed that this hotel did not acknowledge our first wedding anniversary, even though we told our tour company and informed the hotel staff too. So much for the Italians having the reputation as being romantic! We weren't looking for anything elaborate, a bottle of wine, some flowers or even a basket of fruit would have sufficed! But what did we get? Not as much as a grape!", "date": "October 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r10609965", "sub_review": {"Value": 3, "Location": 3, "Check in / front desk": 2, "Rooms": 2, "Cleanliness": 2, "Service": 2}, "travel_purpose": "", "rating": 3}, {"title": "perfect!!", "review": "An amazing week in Lake Garda. Beautiful scenery. fantastic bike rides in the mountain fresh air visiting lovley typical Italian villages all with their own personality and charm. Sergio runs a very lovley hotel wth attentive staff, fantastic food and the most comfortable bed I have ever slept in. Visited Veronna and Venice which were amazing historical places to visit but lots to see near our hotel. If you fancy a lazy day then can take advantage of the saunas, indoor pool, jacuzzi and relaxation area to chill and read or people watch. We took my mother who also thoroughly enjoyed herself, so something for everyone. If you fancy a relaxing, beautiful holiday with a splash of culture and history thrown in with great food and amazing scenery,fresh air and lovley people around you…", "date": "October 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r10505669", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 3, "Rooms": 4, "Cleanliness": 5, "Service": 4, "Business service (e.g., internet access)": 3}, "travel_purpose": "", "rating": 5}, {"title": "Wonderful jewel on the lake", "review": "We would certainly recommend staying at this wonderful hotel. The location is perfect - close proximity to the town and stunning views of the mountains and lake. The staff are extremley friendly and helpful and work very hard to ensure the guests are enjoying their stay. The food is superb - four courses all cooked to an exceptionally high standard. We are certain to return. ", "date": "April 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r7363295", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Fantastic Hotel and Staff", "review": "My husband, son (nearly 13) and I stayed at the Piccolo Mondo Hotel for 3 nights at the beginning of April. We were very warmly welcomed and had a lovely suite at the back of the hotel overlooking the pool with large corner balconies. Great to have the extra space with a teenager and the lounge area he slept in had a wide sofa bed and a door to our room which helped with privacy (needed with a young teenager in tow!). Also the suite came with robes, slippers, snacks, free minibar and use of a scooter (alhough we had a car so not necessary for us to use). Hotel bicycles are always avaiable too. The staff were really helpful, always anticipating our needs (we asked about a couple of things and were given leaflets in English, suggestions of please to visit, a translation of the…", "date": "April 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r7344732", "sub_review": {"Value": 4, "Location": 4, "Check in / front desk": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Sergio's heaven", "review": "I have just returned from my stay in Piccolo Mondo, Torbole.  It was very enjoyable.  The staff were very nice and if I had to single one for special mention it would have to be Mohammed.  His sense of humour was second to none. The food was excellent.  It is a four star hotel with all the ambience of a family run hotel, with Sergio very much in attendance.  If I had the opportunity to change anything it would be the swimming pools.  I found the indoor one too hot to swim in and the outdoor one too cold to swim in.  On a positive note it was lovely to be in a pool chlorine free.   The gardens were splendidly  arranged.  Bicycles for the use of the clients was a special touch.   Torbole is a magnificent setting.   The lake is breathtaking.  I know I will be back to enjoy…", "date": "September 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r5831257", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Just Loved it!", "review": "Travelled with Joe Walsh Tours and was based at this charming hotel. What a treat it was too. We had a very clean comfortable room at the front of the hotel overlooking the mountains.  The hotel boasts beautiful gardens, great pool area inside and out, gym, beauty salon, fabulous food and wonderful service.  It is a small family hotel and very well run by Sergio and his staff (forgive me Sergio I cannot remember your surname), the staff are excellent and nothing is too much bother for them. The hotel is child friendly too having play areas at the front and rear gardens.  Would definitely recommend this hotel. ", "date": "September 2003", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r5629349", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Fabulous Hotel", "review": "A wonderful hotel.  Large, modern and comfortable rooms.  Peacful and relaxed location 5 minutes walk from lake and restaurants.  Friendly family service.  Great food even though it only served to hotel guests.  Good facilities. ", "date": "January 2005", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194935-d249123-r4463619", "sub_review": {"Value": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}]