[{"title": "need major improvement ", "review": "srated here 4 weeks, this being my last week. My opinion is they need a lot of improvement. I wanted to extend my stay for 8 more weeks but now just want to check out 1. the Wi-Fi is sad, I complaint on multiple occasions and send aims to the manager who helped with my booking but no response ever. 2. yesterday the power just went off in morning and nothing was functioning ..AC, tv, elevator...for about an hour. I mean this is supposed to be a hotel , right? 3. today at 9 pm...there is no water in  the bathroom....so I called the reception, someone came checked and then no response. I called again to enquire....after sometime reception called to say there is a problem with the main line and it will only be fixed tomorrow morning.....wow! and for the night and morning shower i can use the bathroom in the sauna area....i am on 3rd floor and sauna is on -1. The least i would have expected is for them to change my room for the night.   this is one unthinkable place with zero sense of service   there are other improvement such as rh3 furniture is all worn-off , see pictures. Housekeeping will keep knocking your room inspire of Do not disturb sign on. Once they did not bother to pick laundery bag for flat 3 days inspire of me keeping it in the laundery bag, with the form on the bed.   take my advise, stay away from this place. …", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2514740-r523205640", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 1}, {"title": "Work & holiday", "review": " Mood design hotel is great.Rooms are clean.Staff are very kind and hospitabale.Breakfast is amazing(Famous Turkish breakfast).The hotel's location is great and near subway.I strongly suggest this hotel to people   who want to have a great and safe trip in Istanbul.", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2514740-r468222247", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "\"Luxury Hotel\"", "review": "Stayed at this hotel for five days four nights, the whole it experience was amazing from start to finish. The rooms are very clean and luxuries, food is Devine and the staff are absolutely amazing and can't do enough for you to ensure that your stay is as enjoyable as possible. We will definitely be coming back again soon. Tesekkur ederim (thank you)", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2514740-r462568916", "sub_review": {"Sleep Quality": 4, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nice boutique hotel", "review": "Great boutique hotel, located steps away from the metro, 4. Levant, which is very convenient. Also, a short walk away from the local high street that offers a number of restaurants you can dine in.  The rooms are very spacious with large sized beds. The lighting is not so great. The low lighting is part of the design of each room but I would have preferred a lot more light.  Breakfast is what you would expect from a boutique hotel, not lavish but with majority of expected items to hand, such as toast, cereal, selection of croissants and some hot dishes. They serve freshly pressed orange juice that tastes great.  The reception staff are fantastic. They really go out of their way to help and have good local knowledge of where to go and what to do. All the main attractions are within 20 minutes away by metro. I would recommend the tour bus as a large volume of stops are provided but heavy traffic is a big problem.…", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2514740-r462314650", "sub_review": {"Value": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "So so", "review": "I stayed at the Selection Suites for two nights on a business trip in February. The hotel is located in a part of town that is not very attractive for tourists. There is nothing in the area as a point of interest for a tourist, you need to go to other parts of town to have your sightseeing experience. For business purposes, its proximity to the 4. Levent metro is a plus. It is very close and convenient. The hotel is in a narrow side street and rooms have no view just the across apartments on the other side of the street. The street is quite deserted at night but well lit so I had no problem coming back late at night. I think the downside of the location is that it is in a business area and none of the apartment buildings seemed to be accommodated by residents. While walking down the street I thought, if someone grabs my bag, nobody would hear me screaming. I understand that this is not the hotel's problem but I felt a bit insecure as a woman walking down that street, just saying. The room was very spacious and comfortable. The interior design is following a bit of a royalty style with rich colours and elaborate designed furnishings. My couch had a tear on its seat, I don't know what cause it, but I could see the stuffing inside. The bathroom had all the amenities and spacious. Only downside was that the bathtub had black moldy sections at the corners. If you get irritated by those kind of details, this room would make you feel uncomfortable. For me it was ok for two nights. The moldy corners made me think that most probably they used cheap material and it didn't last long.  The staff at the reception and the breakfast room were great. Very thorough, helpful and attentive. I would call it excellent. Breakfast was very nicely laid out with rich ingredients, buffet style. I enjoyed tasting various different kinds of delicious cheeses, olives, jams, hot and cold dishes. The staff at the breakfast area were very helpful and professional, too. They have a ready made coffee machine, no filter coffee. But delicious tea! Overall this has not been my very best stay ever but given a two day trip in Istanbul, it was OK.…", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2514740-r459606893", "sub_review": {"Value": 3, "Cleanliness": 3, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Great Hotel, bad view, not so good location", "review": "I stayed three nights in this hotel and I won't regret it. It was a bit expensive for me but I wanted to be close to some business partners who were staying in this hotel. It was very clean. My room smelled great. The only drawback (which for some people might not be important at all) was the view. The balcony was blocked by a brick wall and there was no other windows. The room was beautiful but since there was no natural light it was a tad gloomy. It won't be fare if I don't mention that this helped me to sleep very well.  The breakfast was excellent.  The reception was super friendly. The location however was not the best. I will stay in this hotel if I go to Istanbul again. ", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2514740-r323523739", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Hidden Turkish Delight", "review": "Nice hotel difficult to find in a side street but not far away from Metro.  Room good. staff helpful-away from main tourist areas but accessible. Recommended but not for families. Pool fine. Sauna small.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2514740-r275088326", "sub_review": {"Value": 4, "Location": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good hotel for a rest", "review": "The hotel is located a little out of the way but there is a train to 4Levent from city centre you can take. On our first day, we missed the small lane where the hotel is located at because there is no sign to inform us (or if there was one, we didn't see it). Overall, the hotel is a good place for a night in. Quiet environment, there are restaurants and groceries shop nearby. The staff is very friendly and polite, the toiletries are replaced everyday without us asking for. I wouldn't mind coming back here again.", "date": "February 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2514740-r269836567", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Nice Hotel. quiet area but not easy commuting to centre", "review": "the hotel is clean and well decorated, but poor breakfast. Located in a quiet area(4 Levent) , around 20 minutes travelling from the main attractions but not direct metro. Good size room and staff really helpful. Decoration arabic style. Will definitely go back to this hotel away from the crowd, noise of Fatih and the sauna is a plus after a day visiting Istanbul.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2514740-r232125655", "sub_review": {"Value": 4, "Location": 3, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Okay for business, not ideal for tourists", "review": "Stayed for 5 nights on holiday with my family and expected a bit better. We booked our stay with a secret hotel offer on lastminute.com, attracted by a 5 star rating, with 'luxury amenities' and 'attentive service.' We had 2 rooms, 1 twin and 1 king bed room. Sadly it didn't live up to expectations.  First, the pros -  Rooms are comfortable, very clean, spotless, have good a/c, free wi-fi which is okay, good power shower, with towels changed and beds made daily. Breakfast is also very good, lots of choice. The front desk staff were always very helpful. Hotel is a 3 minute walk from the metro station, 4 Levent, so easy access to public transport. Close to the Istanbul Sapphire which is recommended, especially around sunset.  Sadly this was all let down by the cons - The hotel is…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2514740-r225353186", "sub_review": {"Location": 2, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "So confortable", "review": "I stayed in this hotel for 2 nights , it was amazing and so clean and so detailed and luxurious though it lies in narrow road and invisible  The receptionist russian girl is amazing and so helpy The swimming pool so cute  Normal breakfast  Not good location  Far from city center", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2514740-r224594023", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Got a great deal. Comfortable room.", "review": "I needed a place to stay for one night before catching an early flight. Selection Suites had a good deal at the time. From the pictures I thought it would be more motel-like than 'designer' but turn off the pink lights in the room and the room is great. No window in the suite I had. Still, the room was comfortable, 5 minute walk from nearest metro station. 15 minute walk to a Kanyon mall and dining.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2514740-r208040197", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Very good stay", "review": "Not a hotel for good views from your window given that it is located in a side road, but otherwise in a good location near to shops, food places, mall and train station. Rooms were of high quality and had a luxury feel to it. I particularly liked the alternative décor which was a refreshing change from most other hotels I have visited.  Staff were friendly and helpful. The pool was excellent.  Overall a pleasant stay and good value for money.", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2514740-r204599252", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Poor location but good service", "review": "We stayed at Selection suites for 3 days in March. First of all I should praise the staff. All guys were ready to help us at any moment (very professional front desk) but still it would be better if waiters in the restaurant knew English or Russian a bit. We appreciated its swimming pool and cheap but really delicious restaurant. Though the hotel has some problems with its ventilation system and it is quite difficult to sleep without fresh air. If you go to Istanbul for the purpose of sightseeing you should take into account hotel's poor location - the hotel is close to metro station but is far from historical centre and you will have to pass three transfer points to reach   Sultanahmet, Still we guess hotel offers one of the best combination of quality and price in Istanbul.", "date": "March 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2514740-r201872557", "sub_review": {"Value": 4, "Location": 2, "Sleep Quality": 3, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Acceptable for Business, not for Tourists", "review": "In this business trip to Istanbul, I stayed in the Selection Suites. The location is good for business purposes despite being located in a small alley. 4. Levent metro station is less than 3 minutes walk. Staff are welcoming. Rooms are well kept but furniture is old. Breakfast is reasonable though not having much variaties.", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2514740-r201516374", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Different Style", "review": "We have stayed at Selection suites for 5 days, our stay is excellent breakfast is good wifi is free also there is a small pool it is also very nice. Very close to metro we go to taksim with in 20 minutes. If you choose this hotel this wont a mistake", "date": "January 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2514740-r196344818", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "5 nights in Selection Suites", "review": "At first, the welcoming at the reception was really friendly (thanks to Eliz). Then, I was really impressed about the room size, very spacious and very good quality for the price. And mostly, the design was amazing. The restaurant's food is delicious, and very cheap. I also have appreciated the swimming pool and sauna, it's a nice place and really relaxing. The location of the hotel is perfect (maybe a little hard to find at first), it's 3 min from the metro station, 5 min to reach different shopping center, and 5 min from the business center of Maslak. I clearly recommend this hotel.", "date": "January 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2514740-r193247186", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Great Convenient Location", "review": "The rooms were a bit flashy for my taste, with black walls, green lights on the ceiling and silver sinks!  Otherwise hotel is good overall, free wifi, courteous staff, is very close to the 4 levent metro which takes you straight to taksim square. Some very nice malls close to the hotel.  Breakfast spread is good, although it does get crowded at the restaurant during the morning hours, especially is there is a group tour leaving from the hotel, so suggest you have a very early or slightly late breakfast to get a seat to sit.  Since the hotel entrance is in a very narrow one way street, you might have to unpack fast from your car to avoid blocking other cars.", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2514740-r184647736", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Interesting boutique hotel", "review": "Quintessential Turkish flavor - our room,  2 single extra firm beds, plenty of room for prayer mats, extra wash basin outside of ensuite bathroom. Mood lighting. Free buffet breakfast every morning in lower level and a convenient restaurant just past lobby. Huge portions of excellent food at every meal. Sauna and indoor lower level swimming pool. All staff willing to practice English. Walking distance to major shopping mall and subway. Meticulously clean hotel.  Free Wi-Fi. Currency exchange at front desk had an excellent rate; no need to exchange at the airport.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2514740-r181749025", "sub_review": {"Value": 5, "Location": 3, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Friendliness and service excellent", "review": "I loved Istanbul and Marvelled at all the sights especially Hagia Sophia.The location of hotel wasn't great and it was a pity that I could only see wall from my window.I would recommend this hotel, whilst it may be a little difficult to locate.I must stress this is not in the heart of The Blue Mosque area etc. but the tube will  soon get you there.The friendliness and attention of staff was superb.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2514740-r176615949", "sub_review": {"Value": 4, "Location": 3, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "A wonderful few days in Istanbul", "review": "Where do I begin, from the moment our group arrived, Vilma could not have been more helpful. We were on a sales conference and the attention to detail from every member of staff was superb! Our few days included using the meeting room, having lunches and drinks around the bar and everywhere was spotlessly clean and again all the staff were very attentive. Berke was on hand 24/7 and was an absolute pleasure to work with, any change in times for our breaks or change in numbers for our lunches was NO PROBLEM!  I would recommend this hotel, whilst it may be a little difficult to locate, once you have discovered this hidden gem, you will not be disappointed. I must stress this is not in the heart of The Blue Mosque area etc. but the tube will soon get you there.", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2514740-r164370961", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Not bad at all", "review": "The location of the hotel just perfect,5minute away from the metro station,30 minutes distance with the (metro-funikuler-tramvai)to Blue Mosque and 40 minutes to the Grand Bazar!The hotel nice,the staff prety nice and helpful (exepting one skiny lady in the reception ),the breakfast ok.They need improvement for the room sevice ( make up the room actualy the bathroom),but in general is a nice hotel.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2514740-r162072153", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "5* Hotel Without Unnecessary Fuss", "review": "Me and my wife stayed at this hotel for 8 days and we loved it. It was perfect, very near to the metro station and bus routes, which provide easy access to all the major tourist attractions and Taksim, the main shopping area. During our stay the hotel staff were very friendly and the breakfast was very good. I look forward to my next visit!", "date": "March 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2514740-r160813128", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Not bad at all", "review": "Neat, clean, and unashamedly kitch. A little tricky to find (we walked and only used public transport - no taxis) but is close to the 4 Levent underground station, and while it is a little out the way (30 minutes to old city using public transport), it makes you see a little of the 'real Istanbul'.   Staff - true to the caricature of Turkish hospitality - eager to please and kindness personified.   We'd stay there again.", "date": "March 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2514740-r159069861", "sub_review": {"Value": 4, "Location": 2, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great Stay", "review": "The Selection Suites are classy, clean and stylish. Decent location next to the metro = easy enough access to the main sites. Nice leisure facilities, friendly staff and good breakfast options (also has a nice cafe)", "date": "February 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2514740-r152382241", "sub_review": {"Value": 5, "Location": 3, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Relaxing, good value", "review": "Stayed 5 nights. Staff were very friendly. Nice, cosy, relaxed atmosphere. Room was spacious, well equipped and very comfy bed. Fantastic location for exploring the city. Would recommend and definitely book here again.", "date": "November 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2514740-r145113660", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Nice and modern", "review": "The hotel was beautiful and luxurios that I wished to stay longer. Its location is perfect for shopping, dining and easy access to everywhere. The room was spacious and modern. Nice decoration. I would recommend it totally.", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2514740-r144498666", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Nice location for shopping", "review": "Very nice hotel in the modern shopping district. Walking distance to metro and shopping malls. Very large rooms, nice design, high speed internet, nice breakfast, swimming pool sauna. The metro station is in the middle of metro line so everything in Istanbul can be reached in max 10 minutes. High value for the price. I would recommend it.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2514740-r144183327", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Puneet Singh, Mumbai 17th Sept 2012", "review": "A good Suite Hotel in a lane off the main street. Rooms are big and spacious. Excellent rooms. No noise of traffic. very close to the Underground and just 2 stops away from the main shopping centers. Recommend this place if u need to stay in style and a little away from the Sultanhamet area, which is too crowded with hundreds of small hotels, touching the tramway. The only drawback of our trip was the night staff 9around 7pm...when we checked in. They were the only ones rude, the day staff more than made up for them. 4 Lavent is an excellent area with the tallest tower as well as the biggest shopping centres in Istanbul.  About 30-40 min drive from the Ataturk Airport.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2514740-r140764602", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Nice interior, very noisy", "review": "I stayed here with my boyfriend. We had booked to stay for 4 nights in total.   Positive: Big room, modern, nice people in the reception.  Negative: Takes about 1 hours in a Taxi to get into the old city, noice from other rooms and the reception (a real problem), big but uncomfortable bed. Sort of a dodgy area. Boring breakfast.  Unfortunately we could hear everything going on in the reception downstairs so we didnt get much sleep. We eventually checked out after day one as they couldnt find another room (and we stayed on the first floor in the corner away from the reception)", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2514740-r134889170", "sub_review": {"Value": 2, "Location": 2, "Sleep Quality": 1, "Rooms": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Excellent Bed and Breakfast in a business Area in Istanbul", "review": "The hotel itself is clean and neat. Rooms are rather large. Bed was very comfortable and breakfast was excellent. Friendly staff. One of the highlights was an indoor swimingpool. However the swimingpool size was small. You are 50 meters from the Levent 4 metro that you can take whenever you want to go to Taqseem. It was also close to the business hub in Levent and Levent 4 and two shopping malls were close: Kanyon and Saphire (where you can see Istanbul Skyline from the top floor). The golf club is not very far away. For those who plan to visit Bugazici University this is a good spot (taxi fair 6 Euro). View from rooms not that beautiful.", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2514740-r133146209", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "A gem in the business district in İstanbul", "review": "We have stayed in The Selection Suites for a weekend trip to Istanbul. First of all, despite being at a rather desolate street, the hotel is very close to metro and the main avenue. We didn't travel by car but we never needed it. It is also close to Kanyon and Saphire shopping malls. From sabiha gokcen airport, it is around 40 minutes depending on the traffic of course by bus.  It is a design hotel, beautifully decorated in every detail.  We stayed in room 52, it is a suite and very spacious. It has blue theme , all the other rooms has a different color theme by the way.  The room was very clean and all furniture is new. It has a nice led Samsung tv on the wall. The lighting in the room is impressive with blue details like the room.  The people were nice and helpful. The guy…", "date": "February 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d2514740-r124733844", "sub_review": {"Value": 5, "Location": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}]