[{"title": "Disappointing", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d258609-r724484172", "sub_review": {"Location": 1, "Rooms": 2, "Service": 1}, "travel_purpose": "", "rating": 2}, {"title": "Just don't go", "review": "Air conditioning not working, fan not working, no safe despite one advertised, it says 24 hr front desk, closed from 12 midnight till 7 am, quite reasonable but don’t advertise 24 hr if it’s not. Asked about air con, was told no it doesn’t work, asked about fan, (it was 28 degrees) was told I was not pressing the right switch, so asked could they show me where it was. He came up, pressed the same switch I had, nothing, glanced across the room and said, you have a window, open it. Asked if the fan could be fixed tomorrow he said yes of course, wasn’t fixed for my entire stay. Next morning I had 23 mosquito bites. Too far out of the centre for the price. One redeeming feature was the fantastic restaurant within walking distance iTemplari, wonderful food and brilliant service a family run Italian restaurant where they are obviously very proud of what they do.…", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d258609-r713933673", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Good value for money", "review": "We felt unsafe here, someone out of the hotel was yelling for 3hours at 2am trying to get in. From 12am to 7am there is absolutely nobody working at the hotel or at the reception. This situation wouldn't have happened if someone was working during the night. The rooms are noisy and the windows pretty old.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d258609-r624647711", "sub_review": {"Location": 3, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Gah!", "review": "Hotel is a little out of town, at least a good 20-30 minute walk from the Santa Maria Novella train station.  So not everyone may want that.  That said, we did not mind and and neighbourhood was rather quiet.  Hotel room was nice and spacious.  People at the reception were always very nice and helpful - good tips for neighbouring restaurants which being a little out of the way actually becomes a bonus.  Great places offering wonderful food and a very reasonable prices - but ask at reception!  Breakfast - continental was Ok for us.  We will certainly take it into consideration for our next visit to Firenze.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d258609-r592800745", "sub_review": {"Value": 3, "Cleanliness": 2, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Budget hotel in a quiet place", "review": "The hotel itself is located outside of downtown Florence, and I would say in the “too far to walk” range. Not a big deal, we normally travel this way for a couple of reasons, one is price and the other is, well, travel. Downtowns never really give you an adequate picture of the people and places you’re visiting. Anyway. This seemed like one of those places that was going to be a gem, but I had reservations. Reviews seemed mixed and sometimes negative reviews can sound harsher than they should be. We’ll start at the beginning, we arrived and were greeted by the one friendly staff person. As is customary, they ask for your keys when you leave. The keys are old fashioned, and the room safe has a cute old fashioned key as well. The hotel lobby is small, the elevator is small and warm and slow. The stairs run through the center of the building and provide a little quicker access for about the same amount of sweat. The room had 3 single beds in it, two were together (pretty standard) but there wasn’t much in the way of “room” other than those three beds. The bathroom was the standard “afterthought” style including the bidet, there is no tub, just a curtain you pull around yourself between the toilet and bidet…. It wasn’t particularly cute, or clean, or charming in any way. There are not a lot of electrical sockets to choose from, so we had to locate some to power phones/computers. Which brings us to internet, it was free and not hard to get on. The area was fairly quiet. The room is stuffy, but that comes with a cost in summertime. With the fresh air of open windows comes the mosquitos, pick your poison. Travelling back and forth to downtown is not a big deal at all. Super easy, take the 17 into town and the 17C coming back.  The bus system can get you anywhere in Florence and we suggest using it. One really cool thing was the market in the morning on the way to the bus stop. Great produce and meats. Breakfast was mediocre, everything was store bought and put on plates. One other item is the coffee is not free outside of breakfast time. Overall I would say pass on this unless you are just looking for a cheap place to lay your head.…", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d258609-r582337302", "sub_review": {"Value": 4, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Good for the budget traveller", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d258609-r572857047", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "good", "review": "Good budget hotel. The room was big and clean with comfortable beds and good shower. Don't bother with the breakfast in the hotel which is poor in choices. Just outside the hotel on the right hand side from the entrance very nice local cafe shop with fantastic coffee and very impressive choice of meats, cheeses and feshly baked pastries and breads. The hotel located in a quiet street. The main train station just a short bus ride from the bus stop around the corner from hotel. Then, all main attraction and sites are within walking distance. So, the hotel location is good. As well as reasonable accommodation price and good friendly service. ", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d258609-r572747127", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "A middle class hotel at fair rate", "review": "a nice Hotel with a great staff, with 1,5€ get the center of the city by bus,i dont have more to say because they have wath we need ad pay, the breakfest was also good. nothing to say abaut.  bus is the 17 the staff say where you can take, but at night is confuse even the bus drivers are lier so when you get at bus in central take the 17 (i dont remember if is B or C) but it say 17 Botito take this they stop at near of the Hotel.", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d258609-r570585707", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "A really nice hotel", "review": "A 3-star hotel in Florens can vary a lot. This hotel is in the middle-upper scale but still very far (and will probably never reach) from 4-stars. The counter staff was helpful to (within a very short time) re-arrange our booking that unfortunately was wrong and we got a 3-bed room althought only a 2-bed room was in their booking. The Hotel situated ca 30 minutes Walking distance from the city centre and about 3 minutes walking distance from the bus-stop where you can catch bus nr 17 to the city centre (ca 10 minutes ride - tickets to buy in any Tobacco shop, 1,20 euros/person or afamily ticket 3 euros) The reception area is small, narrow and bare. The building it self is worn but kept very clean. Also the rooms are very clean. Towels are changed every day. The room has a…", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d258609-r529649837", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Very normal hotel", "review": "From Florence central to the hotel, you need to take around 15mins bus trip. It was okay, there are 2 bus stops that are near the hotel (line 17 and 22, both pass the Firenze S. M. Novella Station).  The staffs, especially the reception that was on stand by in night shift, were really friendly.  We moved to this hotel after experiencing the absolute hell of Florence Experience Hostel.  The room was clean, the bathroom also clean, the breakfast was basic but good enough.  The wifi can use some improvement as I experienced some difficulty, but nothing major as I have NL sim card, so internet is not a problem for me.  ", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d258609-r528457693", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "A little cheap and dirty", "review": "Santa Maria Novella train station welcomes the majority of the people arriving in Florence, which might explain the hectic pace. Commuters and tourists come across the constant hustle and bustle of the station before exiting, taking a few steps and stopping amazed in Piazza di Santa Maria Novella. It is impossible not to admire the the square, housing one of the most charming basilicas in Florence. The area has plenty of local spots to taste Tuscan specialties, but don’t stop in the main streets alone; the narrower side streets always ensure satisfaction. The huge Parco Delle Cascine provides a solution to the need for a green area as well as a historic welcome in the form of a bronze statue of King Vittorio Emanuele II riding a horse.", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187895-d258609-r518276540", "sub_review": {"Location": 3, "Sleep Quality": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}]