[{"title": "avoid!!!!", "review": "i have stayed in many hotels in turkey over the past 20 years and i have to say this is by far the worst hotel i have ever stayed in, im pretty sure i would have had a better holiday if i had stayed with the homeless guy who sleeps in the abandoned car at the back of the hotel.   I travelled as a single traveller knowing full well that this part of Turkey caters mainly for germans and russians, this does not bother me in the slightest , but i have never encountered a more rude and disrespectful staff as i did here.  i arrived in the early hours and after travelling for 12 hours i asked for a glass of wine, i was told the bar was shut but i could have a glass for a price, the guy on reception wanted 50 tl which is not a great amount but you know full well its going in his back pocket.  the rooms were clean enough but the veiw of the shopping centre below from the balcony was hardly appealing.  The food ..now where do i start ..how about absolutely disgusting....on 2 occasions the food left my body quicker than it entered it , to the point i ended up just eating bread and salad,  one night i lifted the lid up to be confronted by fish heads ..yup just heads with their little eyes just looking at me.  chips worse than maccies,  reheated pasta night after night....the snack at 4 consisted of stuff that hadnt been eaten at lunch.   At breakfast i had to get my tea from a machine in reception, take it into the dining room and use the milk they had near the cereals, on my last day i asked for cold milk at about 4 in the afternoon to be told we dont have cold milk only hot (out of the machine)  i asked if i could possibly get some cold milk and was told no..my response was ..you dont like the english very much do you?   the restaurant managers answer was NO!!!  To sum up ..i can honestly say this was the worst holiday i have ever been on, the staff are rude, the food is inedible, location is ok i suppose, the beach is a rip off as you cannot even take a bottle of water with you, basically dont bother ....pontins is better than this place!!!!…", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d2658248-r691333039", "sub_review": {"Location": 2, "Cleanliness": 3, "Service": 1}, "travel_purpose": "Traveled solo", "rating": 1}, {"title": "Not a 4 star hotel", "review": "This is in no way a 4 star hotel. The gym is less than inviting, with old floors and broken mirrors, the pool is small and the food is okay but no way 4 star. There was an ice cream freezer but it was empty when we asked we were told we could get ice cream next week - shame we were not going to be around for it as we only stayed 1 week. The staff are strict but I cannot fault them on that really. Perhaps they can use a softer approach but they are very sharp and immediately chastise people for bad behavior such as drinking too much or making too much noise. In one way this is good and reasurring but in another way it comes accross quite harsh, we saw 2 people being removed from the public bar or restaurant to be told off in the managers office. Both times the guest was drunk. All inclusive here means the bar closes at 11pm and before it closes they also ration the alcohol. so dont think you can for example order 2 drinks before closing, noooo - you can have a new drink once your current drink is finished, and then sometimes the bar closes at 22:55 or the vodka is finished. on our first night we arrived at 22.45 and were taken up to our room, by the time we came back the bar was closed, we could only drink water or fruit juice.  They also ripped us off arranging tickets for a night club and transfer to Side - they charged us 10 euro saying it was for mini bus plus disco entry and a free drink - not bad we thought till you find out a taxi is only 8 euro, the disco entry was free and the drink was a weak cocktail in a shot glass. Total rip off as there were 7 of us who paid 10 euro each when we could have shared taxis at 8 euro per 4 persons.  Also you can get a shuttle to the beach but once their you are hit heavily to buy food and drink, if you dont you can still sit there but you are told exactly where to sit and you cannot take your own food or drink with you. Busses to the beach leave in morning at 9 or 10 and come back at 4 or 5. also when we arrived we were told to pay 50 to 70 euro for a room with a balcony, when we refused we got the room with balcony anyway - im not even sure there are any rooms without a balcony.   Enough said? we had a good holiday loved the place and the people but the hotel, it was okay but now way 4 start.…", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d2658248-r679069963", "sub_review": {"Location": 4, "Rooms": 3, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "\"Ok\"?", "review": "+Good hotel location- old town, the beach, Novo +hotel shuttle to the beach or 25 min walk by the shore +COPPA beach is wider and better than 5* +rooms are good condition and clean. Housekeeping decent, changing towels   -a lot of food but no variety if you’re looking for something to suit your needs. Lack of fresh fruit. You get dill, lettuce, spinach.  Soups are watery, meals get reheated several times and the tableware is not the cleanest   - alcohol in small doses, heavily diluted with ice and cola. The beer is fine  - constant loud noise from the street and nightclub. Might be less noisy on the hotel entrance side", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d2658248-r678314544", "sub_review": {"Value": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Not for the British", "review": "Arrived early hours for week stay , staff welcoming we had 2 rooms booked one double and one family was told family room wasn’t ready so gave us 3 double rooms and would move us by next day, rooms was sorted promptly, had issue with air con not working in one of rooms and again was delt with promptly , can not fault the staff for being polite and helpful. This hotel does not cater for the English (no English flag out side hotel is your first give away) It is German /Russian hotel and the staff fall over themselves to accommodate them, German food , no English breakfast if you took children there is nothing for them to eat , food is below average. I feel totally ripped off as we stayed all inclusive and eat out for breakfast and dinner, as we could not eat what they was serving up. (We did try but apart from it being very poor it was also a health hazard as covered in flys ) The all inclusive drinks are a total pee take basically, one draft beer which never heard of...no efes beer...in a Turkish hotel !?. Vodka was rationed few afternoons staff would tell you no vodka and do the same in the evening, probably to make sure enough for the Russian and would keep offering you whiskey or raki as no one else wanted it, soft drinks and mixers was always flat. Towels was changed twice in a week and second change was only cause I asked for clean ones. Hotel was a let down and wasn’t cheap either, 7th time in turkey but first time in side and will be last , wasn’t really taken with the area not much going on, bit too quite for my liking not the turkey I’m used too.…", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d2658248-r609170462", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "I’m a holiday maker get me out of here", "review": "Well, arrived early morning, greeted with smile, even opened bar, for a price, rooms ok and clean, only change towels twice, that’s the policy, mmmmmm, all inclusive and if you are English it’s not for you, the place is full of Russian and Germans who they fall over backwards for, so one night we put on some chas & Dave , well it’s our holiday as well , so if you’re thinking of booking think twice, we ate out every night, food in hotel below average, the beach is 10 minutes away, very nice, para sailing a must,", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d2658248-r608923218", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Nightmare City Hotel", "review": "Okay, I'll make it short in case you don't want to read on: DO NOT GO TO THIS HOTEL! EVER!!!  So, for anyone still here, let me ask you please to keep reading as this is a genuine review from someone who's stayed in turkey on holiday at least 10 years now so I know the standard of a 3* hotel in Turkey and let me tell you, this hotel isn't even a 2*.  We stayed as a family of 4. 2 adults and two kids ages 14 and 17. Never have I been to a hotel in which I wanted to leave as soon as I got there. I don't know how we managed 2 weeks there.  Only good thing was the beds in the room which were quite comfy.   The rest was awful. Firstly, the hotel is very small and we felt trapped for the whole holiday like prisoners. The food is disgusting. The same things are served every night and…", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d2658248-r606086726", "sub_review": {"Location": 1, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Wonderful week away.", "review": "We have just come back from a week and I have to say we had the most amazing time.  The Holiday Point City Hotel is an intimate little hotel with only 90 odd rooms which made for a relaxing feel.  The hotel is very modern and very clean and without a doubt the nicest rooms I have ever stayed in.  Their air con is also out of this world and you absolutely need this because its BOILING over there right now.  A few things to point out which made the holiday   The pool area was amazing, the warmest pool I've ever used and the slide was a lot of fun.  NB The slide opens around 10am and closes for 2 hours at lunch time and is then on again until 6pm.  VERY fun (thank you all for my round of applause that will serve me right going down head first) ha ha. The loungers were so…", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d2658248-r600102760", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "It was 'OK'", "review": "So I thought I would leave an honest detailed review for this hotel as there are very limited reviews from Brits. We went as a couple and we are 21 and 23 years old, we do ALOT of travelling and stay anywhere between 2* - 5* hotels so have a lot to compare it with.   Pros: - For a smaller and not very popular hotel, the room was probably one of the better quality I have stayed in. I would compare the room to a 4/5* room. Cleaned daily, give you ample toilet rolls/towels etc. Good size balcony, great free air conditioning, lots of wardrobe and storage space. If you are staying at this hotel just as a base to sleep it will be perfect because the rooms are great.  - Not bad sized pool with a slide  - Bar serves enough of a variety of local spirits (vodka / whisky / wine / beer etc)…", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d2658248-r599890618", "sub_review": {"Value": 3, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Perfect week", "review": "Just returned from a week at Holiday City Hotel. Went for a relaxing week with a friend. The transfer was easy and only an hour.  As soon as we arrived we were overwhelmed with our warm welcome from the friendly staff. The hotel is absolutely beautiful and the rooms are spotless!  From the moment we arrived the staff were faultless. We were the only British in the hotel at the time apart from 1 couple. The hotel was perfect for what we wanted, the pool was glorious and the sun loungers comfiest I’ve known.  There’s plenty of shops/bars/restaurants nearby to suit all needs. It’s a lovely area and full of lovely people.  A huge thank you to the reception staff, management and bar staff at Holiday City (especially Osman). They made our week amazing. I will definitely be returning…", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d2658248-r598085268", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Excellent choice", "review": "Friendly, smiling and helpful staff, nice peaceful location, good food and drinks, nice pool, good bed and clean room, transport to beach, multicultural guests, hamami and all the tourist shops close enough", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d2658248-r407538996", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "3*hotel", "review": "So,not really satisfied of this hotel,food was really delicious,but nobody understands english,pool is really very small ,sometimes there was no free lounges,and wi-fi never really works properly.The hotel is full of with Germans and Turkish visitors,and guys working always ask you when you are suntanning if you need spa procedures,they asked me several times,it was really boring.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d2658248-r399083997", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Awful manager", "review": "During our stay, my friend and myself were kicked out of the hotel's night club by the mannager because he had a crush on two German girls who reached our table to chat and drink with us... The saddest of all, I think, is that the best I could to complain is to write this review on TripAdvisor.   The hotel on itself isn't so bad, the rooms are clean and the staff's very kind that's why I'll rate it with two \"stars\" and not one actually.   More I'll not recomend it to people on their twenties because except for us everybody else were old people or parents with young children.   .A part of this Side seafront is very pleasent and turkish people are very nice for the majority.", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d2658248-r295599223", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "NO british at all !!!!", "review": "i dont normally write reviews but i feel i must we went for 2 weeks in august 2 adults 1 child the rooms were nice and we were pleasantly surprised with the space as a child normally gets a camp bed however the room overlooked the square at the front of the hotel were the shops were so you couldn't really sit out on the balcony plus the air con was noisy and hot in our room and stale and cold in the other room. Food was ok and if you were first in then good a little repetitive though after 2 weeks. The pool was nice and staff were ok some were helpful some not they didnt go out of there way to help esp with us being british they were however really friendly with germans/russians  We were the only british in 2 weeks so beware it is not a hotel for british and i will be…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d2658248-r225304183", "sub_review": {"Sleep Quality": 3, "Rooms": 3, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "holiday STRESS,PROBLEM,BORİNG hotel city!", "review": "We did this with my family in a hotel vacation. No, it's torture! They don't even have a beach.Lobby bar drinks they put water in them and of poor quality. Hotel magnate and waitresses rude and vulgar. If you are a tourist, you never do not prefer. Hotel's rude waiter can curse you for you do not know the language! Oh my god! and couldn't believe it. When it comes time for dinner, you should immediately, if they don't give you a meal if you eat. You're hungry!! and there's more ... check out when they fired you hour, yes they're cast. everyone the same behavior. This business doesn't deserve 4 stars.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d2658248-r223374865", "sub_review": {"Rooms": 2, "Cleanliness": 3, "Service": 1}, "travel_purpose": "Traveled solo", "rating": 1}, {"title": "British - They dont want you !!!", "review": "The best bit about the Hotel are the rooms, although the bathrooms could do with a re-vamp.  Now as for the food, i'm all for the Turkish food which i quite like, but the problem you had was that you didn't know what you was eating as nothing was label'd, and some of it was from the night before which could not be eaten.  Also if you wasn't in first you didn't get anything as they did not re fill anything or cook extra.. There was no entertainment at all and no snacks ie cheese toasties etc etc at all through out the day.  There was only one bar which closed at 11:00pm every night and unless you liked, Vodka,Rakki, Whiskey & Beer...which at one point they ran out of beer for several hours, that was it apart from coke, lemon etc.   The Hotel clearly didn't want the British in, as…", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d2658248-r215701390", "sub_review": {"Value": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Another great holiday", "review": "Looked at the reviews after we booked this hotel and then started worrying. We arrived there and the hotel was spotless, the staff were absolutely fantastic, food was great, plenty of choice. The rooms were cleaned every day, again the staff were so helpful and we had a fantastic holiday.", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d2658248-r200887188", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Holiday PROBLEM point", "review": "Not usually a moaner, and never write reviews, but this hotel was so bad i feel i have to warn everyone!  starting off with a plus, the rooms were well decorated and modern. That's where the good news ends! Arrived at 3am after delayed flight and being transferred to the wrong hotel, only to be greeted with no food or any refreshments. Woke up the next morning to a sparse breakfast, nothing was left! If  you don't reach the restaurant at the beginning of meal times, food is completely finished, and not refilled!! Staff are non english speaking, even when they understand you they choose to ignore you if it means the slightest bit more work for them. Rude waiters, everything seems too much trouble for them! Cleaners clean bare minimum. Lack of management, therefore staff are lazy.…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d2658248-r174097797", "sub_review": {"Value": 1, "Location": 1, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 2, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "British/Irish stay away!!!!!!!!!!!!!!!", "review": "Just come back from spending our honeymoon in this hotel and have to say what a shambles this place is .all the staff are rude apart from the spa manager this is because he is trying to rip u off by taking Turkish massages for twice the price they are 100 metres up the road.no welcome on arrival they just stand and stare at you no clue what you are asking them the free minibar is an empty fridge u could cook your dinner in its so warm...the food is ok but that's if u get their first like a stampede every meal time and as for the free drinks if you are German or Russian you get large glasses but more often we were given plastic beakers like children no entertainment their idea of a Turkish nite was to hang out a flag and try to sell you cocktails made from the drink which is…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d2658248-r169601731", "sub_review": {"Value": 2, "Location": 2, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 2, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Good first impression, and that's it.", "review": "The worst thing about this hotel is the russian clients. They act like they own the whole place.  The food is ok, if you manage to actually get some of it. Because it's all taken by the russians in ten minutes, after that it's just veggies and liver left. We had to go to restaurants and eat several times because if this.  The rooms look ok, but the minibar includes only one bottle of water and nothing else, even though signs advertises \"free minibar\". Tv is mostly turkish channels or dubbed turkish or german.  Personnel clearly has lost their soul and faith in human kind because of the russians, so they won't be of ant help.  The gym's most heavy manuals is 9 kg and is therefore a childrens gym.  Rest is okay, but we did leave the hotel a whole lot after a few days.  At check…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d2658248-r167567334", "sub_review": {"Value": 2, "Location": 2, "Rooms": 3, "Cleanliness": 2, "Service": 1}, "travel_purpose": "", "rating": 2}, {"title": "Stay away", "review": "Absoulte nightmare of a hotel.  We were supposed to stay at teh Holiday point Spa it's sister hotel but they sent us here which is a more inferior hotel owned by the same person.  The food is horrendous and you need to be there within 20 minutes of meal times otherwise the food is gone and they wont replenish the food.  They run out of all spirits nightly but beer, Efes is free flowing.  Same drab music on repeat and by a noisy building site.  We ended up eating and drinking out in order to get away from the place which defeats the purpose of all inclusive.  We popped to see the hotel we booked and it was lovely and tranquil and by the beach and they had snack bars and everything.   Please please dont let them transfer you to this hotel.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d2658248-r161427821", "sub_review": {"Value": 1, "Sleep Quality": 1, "Rooms": 2, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Stay Away", "review": "We stayed in this hotel after being brought here by the transfer company.  This was not the hotel we booked, we booked it's sister hotel by the beach  http://www.tripadvisor.co.uk/Hotel_Review-g297968-d623718-Reviews-Holiday_Point_Hotel_Spa-Side_Turkish_Mediterranean_Coast.html  It transpires over a number of days of our stay that they are both owned by the local owner and it seems that they all booked the above hotel but were put here.  It was a blatant con and everyone was in on it.  Do not book either this hotel or the sister hotel.  Now to this hotel, The food is horrendous and never correctly cooked, chicken, beef, livers all raw.  You only get one small bit of chicken to go with the rest of the meal.  You have to continually ask the chef for more whilst he gives you a…", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d2658248-r161319635", "sub_review": {"Value": 1, "Location": 1, "Sleep Quality": 1, "Rooms": 2, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled with friends", "rating": 1}]