[{"title": "Last costumers of season 2019", "review": "We  spent 1 week from 20to27 october in this hotel with forfait breakfast and dinner. +: staff really nice all were really nice with us 🙏 Hotel clean, nice outside smimming pool. Big  room, we had one of the of the hotel fuel of light and beautiful view on the sea.  - hotel from 90's so they need a restyle  (IT'S NOT POSSIBLE TO HAVE A SMIMMING POOL IN THE TOILETTE AFTER THE STORM OF TUESDAY NIGHT) -FOOD:  it's the négative point of our stay!!  Really poor and not good. A lot of food but 0 quality. They propose zero Spanish kitchen. Only food for german people,90% of the guest of the hotel..  We didnt understand something About our stay: They had not ready the room we booked(seaview ) no problem they switch us after one night.  We were  alone in the hotel  than  the 27th october were the cloosing Day of the Hotel, They propose us last 2 nights à dinner really poor, less than all the rest of week.  So our check out not a commercial thing.  In the end if i have the chance maybe i will come back but just for sleep.   …", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r722754311", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Excellent hotel", "review": "Six of us stayed at the start of September for 2 nights all inclusive as our flight was cancelled. Excellent hotel, staff very helpful and accommodating. Cannot fault the place. Lovely pools and loads of sunbeds. Food delicious and plenty of variety. Very clean and maid comes every day. The Manager printed off our boarding cards and helped with transport to the airport. Will definitely return hopefully under more pleasant circumstances . Thank you to the Manager and reception staff for being so kind and helping us out in what was a very stressful situation.  ", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r709962353", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Brillant hotel and staff", "review": "Dear katierc012,  Thanks a lot million for your nice words, I'll pass them to all my staff cause it's really grateful for them.  Hope to see you and your lovely again sonn.  Kindest regards", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r708875230", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Hotel and Staff Brilliant !!!", "review": "We spent two nights at the apartments Sunna Park while waiting for a replacement flight as ours was cancelled. We stayed all inclusive and both the hotel and the staff were outstanding. Excellent food as well. A very very nice experience.", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r692573223", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Family holiday", "review": "Dear Emanuela,  Thanks a lot million for your nice words, I'll pass them to all my staff cause it's really grateful for them.  Hope to see you soon again.  Kindest regards from Paguera ", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r628439902", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "excellent hotel", "review": "Just back from a week at this hotel,could not find any faults it was outstanding.Went with a bit of trepidation after reading some reviews.However i found the hotel staff excellent they could all speak very good English and couldn't do enough to help.This is a family hotel traveled with 4 adults and my 2 year old grandson.The hotel was spotless maid service every day.great pool also nice pool for the kids.Loads of choice in the restaurant something for everyone.Big thank you to The manager Pepe and all his staff", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r618873354", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Not for the British ", "review": "Dear guest,  Thank you very much for sharing your observations with us, they really help us to improve. We are glad you had a nice experience in Seramar Hotel Sunna Park. and we hope you to be our guest again in the near future.  Best regards", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r614188115", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Very relaxing couple of days", "review": "Staff speak very little if any English  Poor entertainment. Lights get turned out and bar closes at midnight Our room looked absolutely nothing like the pictures, would love to know where those rooms are, only 1 America tv channel. Beds were not changed even though we asked, reason i know is because there was a mark from my sun cream on the sheets that never changed. Food was average, dinner stuff was reused for lunch and vice versa, lots of chips and twice we took chicken that was raw in the middle. Hotel advertises snack bar, this is a small hut at the apartments with very very little seating and the person who was serving that day was extremely rude to us and threw a menu at us when we asked for pizza.  Toni and another gentleman at the bar were very friendly probably only…", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r612960478", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely Holiday ", "review": "The rooms were spotless  the hotel staff very nice plenty of space round pool.only let down was the food we are not fussy but food was cold and no choice.The hotel catered for Germans only which wasn't a problem.only in the catering we went as a couple but would be great for families", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r612540384", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Sunna park Paguera", "review": "Dear guest,  Thank you very much for sharing your observations with us, they really help us to improve. We are glad you had a nice experience in Seramar Hotel Sunna Park. and we hope you to be our guest again in the near future.  Best regards", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r611716579", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Second day...impressed", "review": "Having read previous reviews about this hotel I am happy to say that on only the second day here, I have come across some of the most polite and friendly staff ever. They are a credit to the manager ( who has been visible all day from early morning to dinner time) the maintenance men that have been working on the gardens a round the pool, Tony the barman and the gentleman working the main bar ( sorry I can’t see your badge!)  The food is amazing, fresh and local, looking forward to spending the rest of the week here!", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r609253540", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good holiday", "review": "Dear guest,  Thank you very much for sharing your observations with us, they really help us to improve. We are glad you had a nice experience in Seramar Hotel Sunna Park. and we hope you to be our guest again in the near future.  Best regards Pepe Pardo Manager ", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r605202067", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Amazing hotel of island", "review": "Just sat in the airport from my 10 day stay at Sunna park. We stayed from the 1st-10th.   Had an apartment (15) with 2 adults, 1 teenager and a nine year old. Apartment was spacious and clean when me arrived.   All inclusive food was okay, not much to eat for fussy eaters or kids. Snack bar food got us through with burgers, hot dogs, fries ect. Served.  Pools were lovely, no rush for sunbeds. My only problem was the pool was to deep for my liking and it doesn't need to be so deep.  All staff were helpful and always offering a smile. Barman Toni always made am effort to talk to me and engage in a conversation.   My only down point is, last night I nipped to the room to get a few bits but going down the steps from the pool area to the road and hotel, due to poor lighting and…", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r602787516", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nice hotel", "review": "Dear guest,  Thank you very much for sharing your observations with us, they really help us to improve. We are glad you had a nice experience in Seramar Hotel Sunna Park. and we hope you to be our guest again in the near future.  Best regards", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r511216527", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Excellent stay", "review": "Amazing helpful staff , very kind and friendly and polite, very nice restaurant and fresh delicious food and best cocktails, nice preal shop inside hotel, very clean room, and beautiful view of beach, 2-3 mins walk to beach. We had amazing time there :)", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r444322145", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "very best of service", "review": "excellent hotel experience as far as the accommodation, service and food, beach close by miles long shopping street but only a few decent quality shops, mostly Asian rubbish and the biggest surprise was the menus adverts etc. all in German as where all the visitors bar a few like us who did not realise the quantity of Germans visiting this area the staff were very nice and helpful but I guess the situation back in their homeland was making them all look so miserable they did not seem to want to communicate amongst themselves let alone us we did manage to make a few friends and communicate in a humorous fashion but most of the time we spent in our own good company, this is in no way a reflection on the service or hospitality of the sunna park they where always extremely helpful…", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r431495336", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great Hotel, great location", "review": "We arrived at about midnight and was taken to the dining room where there was food and drink for us go help ourselves to.  We were all inclusive and the choice of food was excellent, varying every day.  Drinks were also fine.  Plenty of room around the pool but the pool was just too cold to swim in.  I think I only saw one brave soul, who didn't stay in for long!  Our room was clean and spacious and the location of the hotel is great - very near shops, bars, restaurants and beautiful beaches.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r424101376", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Positives and Negatives", "review": "I will start with the positives. Beautiful hotel white leather furnishings and very modern foyer. Exceptionally clean and very polite staff, especially the waiters/waitresses/bar staff/ and snack bar staff. Some of which overlapped and worked 2 areas in one day but always remained pleasant. Stayed in the apartments at the back of the hotel, which were very spacious. Double bedroom, bathroom with 2 sinks shower and bath, clean towels daily, fully equipped kitchen area and a lounge area with 2 bed settees, a dining room table with  chairs and a balcony. Very quiet and excellent sleep quality. From our floor (4) apt 23 we had a sea view and was overlooking the pools. Both the hotel and the apartments have their own pools. It was difficult to use the hotel pool due to guests…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r411938086", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Bad Holiday Experience.", "review": "Room was old. Lights came on in the corridors at 5.30AM. Pool staff were good and friendly but reception staff were grumpy and not really interested in their customers.  I don't think this Hotel really cares about these reviews anyway!", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r405825794", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Package Holiday", "review": "Tourists putting their towels on sun beds in the morning and then disappearing for half the day. No Free Wifi in the rooms even though I was do some design work for a company while on my holidays ans needed good and free wifi usage. Extras at reception had to be paid for in cash, no credit cards for some reason. Night we arrived 2.20 am, Only person at reception signed us in and then handed us a map on how to locate our apartment 10 minutes away, we were carrying 2 small sleeping children in our arms and had luggage to carry as well. Lights came on in the corridors at 5.30 in the morning and woke me up. Dining always felt rushed as if we were on some sort of a production line, plates were whipped away as soon as you put your knife or fork on it.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r403540607", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Family stay *All Inclusive*", "review": "My family and myself have just stayed at Sunna park for 8 nights and have had an absolutely fantastic stay. We got a taxi transfer to the hotel from Palma airport and it was found easy enough. Just be wary if you have booked in the apartments and not the main hotel as I have heard other guests being taken round in circles trying to find it.  The hotel itself contains of the main hotel part, and the apartments situated at the back. The main hotel is where all the food is served and has a pool with the apartments having its own pool and a snack bar. Both are suited to families very well and both have their advantages over the other. The main hotel part is slightly better for kids as they have slush machines which are not available at the snack hut, however you can get burgers, hot…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r400968192", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great location not a four star", "review": "My mum and I are just back from one weeks stay at this hotel. We both took unwell and were hospitalised for two days. On release we spoke to the hotel management who handled are concerns very professionally and all staff made the rest of our stay as comfortable as possible given our circumstances. All staff including the animation girl and maintenance men where very friendly, polite and helpful. They all work extremely hard to ensure you have a pleasant stay and a nice holiday. However on departure 27th July at approximately 6.20am we were met by the most nasty, ignorant man (Would not give us his name when asked) at reception when we tried to check out. At first as he was so rude (Speaking to us in Spanish we had no idea what he was saying) we thought he wasn't hotel staff but…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r398326734", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Quiet and Family Friendly", "review": "We've just returned from a weeks break and thoroughly recommend it. The hotel is located in 'little Germany' but don't let this put you off. All staff speak English very well. Not a sign of a stag or hen doo and no one hustling you to go in a bar or resteraunt. The hotel is clean and modern. Rooms are relatively large with AC. Food is the normal all inclusive style and the pool, although a little small is quiet and good for the little ones with a main pool and a baby pool. There's also a large bubble pool and mini gym. Entertainment for the kids but nothing too late. Really enjoyed it and it's close to the beach and local nightlife.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r396950303", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Lovely hotel", "review": "Came here for a 4 day break, hotel was great very clean couldn't fault it, not many English people here majority were German guests. Couldn't find an English bar anywhere however great bus service to other local places. Food was lovely lots of choice. Room was cleaned everyday. Beach is great and very close to the hotel. No problem getting a sun bed by the pool. Could have done with music by the pool but that's just my choice others may not like this. Lovely girl doing fitness class by the pool very friendly. Very long transfer from the airport took over 2 hours then took a long time to check in when we arrived! Overall a nice break away. ", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r394540339", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Peaceful break ", "review": "Booked a few days here for some much needed me-time and got exactly what I went for. Nice hotel, vast majority of guests were older German couples or families and I barely heard a word of English in the whole resort. Majorcans assumed I was German which was fine for me as I speak the language but one to note maybe.   Pool area of hotel much smaller than I had expected, no problem getting a spot in the sun but did feel slightly claustrophobic by day 4! All very clean and well maintained though. Room was lovely, modern and clean and spacious with a decent shower and an actual bath which doesn't happen often in my experience!  Top tip, the balcony door does lock automatically so if travelling alone be careful or be prepared for an embarrassing rescue.....oops..... very helpful…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r392133700", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Lovely sunny stay at the Sunna Park Hotel", "review": "Location from the airport- should have taken about 40 mins max in a taxi but took us over 2 hours via coach transfer. Would recommend if you're happy to spend a bit more getting a taxi for around 40-50€ each way.   Staff were friendly enough, everything is super clean and pretty modern. Lots of facilities as promised such as computer room, indoor pool, jacuzzi, sauna, steam room and gym room. It's a German (and family) area of Majorca and so many of the signs / menus reflect this. Everyone was very friendly and the children very well behaved.  Room was perfect, comfortable, clean and modern. Has AC but gave up on it after the first night and just had the door open instead.   Food is what you expect at an all inclusive buffet. Lots of variety and dishes changed daily which was…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r390339573", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great break ", "review": "Stayed in the apartments very spacious and clean. All inclusive food was good lots of fish and a great selection but was getting a bit board of it after a while but great value . 2 pools very nice , quite a German orientated resort on a whole . Great beaches quiet hotel an nice short walk to main shops restaurants and bars .", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r389618912", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Definitly worth staying", "review": "Stayed at the sunna park hotel, the apartments being over the road. It is central for every amenity, good food, excellent staff - the Germans pretty much dominate - they don't put up with rubbish ! All in all a good choice, the only thing to perhaps bear in mind is that i didn't think it's worth upgrading to a sea view - see pictures, but other than that, a lovely stay - thanks guys. ", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r388730678", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice relaxing hotel in a relaxed resort.", "review": "Booked a top floor room (Room 610) with a sea view and balcony which was really nice, air con in room and good standard TV (BBC World News) + other foreign channels. Bed was creaky, but we didn't complain, just mentioned it on the Hotel Feedback. Carpeting on landings, but hardly any noise as the other guests are mainly German and they tend to be a lot quieter than the British who seem to flock to Magaluf or Palmavova. Paguara is very popular with the Germans with nice bars and eating places. Food in hotel is good without being great, Entertainment is minimal (June 16), bar service is good, good selection on All Inc. Nice pool and no problem getting sunbeds as a lot of people go to the beach of which there are two main ones which are a short distance. The hotel is spotless with…", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r387452291", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Average but ok for a weekend ", "review": "We stayed at this hotel for 3 nights and was pleasant enough but wouldn't recommend it for longer mainly because of the food which wasn't hot enough and not a great choice for my 5year old daughter. The hotel is ok but in my opinion not a 4 star I would say a 3 star. The location was fantastic and a very short walk to the beach which was lovely and had lots of things to do for small children,beach play area and a few amusements in the evening. Shops were great and lots of restaurants and bars on the small strip. It's known as little Deutschland but didn't bother us as wasn't rowdy and great for families. Very modern rooms we were in 401 and had a sea and pool view,very clean and had new towels daily no complaints on the room at all! Some parts of the hotel were very modern but…", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r386621362", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Excellent Holiday", "review": "The hotel is well situated, about 5 minutes walk from a compact well appointed beach, close to the main shopping boulevard in a clean and friendly town. We were impressed with the interior reception, lounge and dining areas and an attractive bar leads through to the children's and adult pools.   Adequate loungers and parasols are provided and we had no difficulty in finding a space each day, although we were disappointed to find that pool towels were not provided and had to purchase these in the town at the first opportunity. Our room on the 4th floor had a good sea-view, twin beds configured as a double, was of a good size with ample storage and a large bathroom.   Only complaint here was the bath and hand towels which were not full bath sheet size, were thin and of poor…", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r385033784", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Management did not deal with my accident or apologise", "review": "Until I had an accident that was the fault of the hotel because of a faulty chair on my balcony breaking and causing me to have a bad fall that has left me barely able to walk and in excruciating pain I would have rated this hotel 4 star and said I had a fantastic holiday. However despite my accident being the fault of the hotel and despite my husband bringing it to the attention of reception with 24 photos,  me completing an accident report and complaint form and emailing hotel on my return home I have received no apology or comment from hotel management at all which I have found very disappointing and extremely unprofessional.  I am hopeful that they will be in touch as a result of this review.  However let me leave that to one side and review the hotel. We stayed in the…", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r384734953", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Sunny days at Sunna Park", "review": "On arrival we were late for dinner having missed the evening slot, we were told that a cold dinner was available which was a really nice touch. Room was spacious and spotlessly clean. Location was great and a nice stroll through the town with some nice enough shops. However the food was the thing that let this place down, it was repetitive and the breakfasts were the most disappointing. A special mention should be made to Andreas the young barman who was an absolute pleasure, very polite and good with all guests.", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r371252158", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely holiday", "review": "Just returned from a week all inclusive , Great holiday , rooms clean and spacious, dining and reception staff in particular are very welcoming . Food good and overall a really good place to stay . Location is also very good with a regular bus service into Palma.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r317706931", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Short break", "review": "Dear Guest,  Thank you for taking the time and efforts to share your concerns with us. At Sunna Park, we strive to provide a superior service experience for every customer: therefore your feedback is very important to us. At Sunna Park Hotel our aim is to exceed the expectations of our guests and it is most inspiring for all members of our team, to know that we succeeded in our effort. Questionnaires like yours stimulate us to improve our services every day.   Thank you again and we hope to see you again,   Kind regards, Inmaculada Parra Manager.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r316876878", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Mallorca honeymoon", "review": "Locality - boulevard of the town and two biggest beaches are in 5 minutes walking distance.  Our room was quite large with very nice bathroom (tub, bidet, two basins) and balcony. We had partial seaview - there was one big hotel right in front of us, but around it we saw the sea. Bed was a disappointment. There were two single beds together. But when one wanted to lie between them, the beds went away and made a gap in between. However cleaning was very fine, every dey (except Sunday I think). My wife really disliked bed linen and curtains - they seemed ugly and old-fashioned to her.  Wifi is free of charge for 1 hour per day. You can get coupon on reception.  We had all-inclusive. It consisted of breakfast, lunch, snack, dinner and access to the bar. Everything was buffet-style…", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r313992451", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great find!", "review": "Dear Client,  Thank you for taking the time and efforts to share your concerns with us. At Sunna Park, we strive to provide a superior service experience for every customer: therefore your feedback is very important to us. On behalf of the Staff Sunna Park please accept my sincere apologies for any inconveniences we may have caused you during your recent stay. Our goal is to deliver high-quality hospitality to every guest on every stay, starting from your arrival until your departure. We greatly appreciate your feedback, as it helps us to improve and provide a better experience.    We wish to welcome you back in order to provide you another fun and relaxing time!   Best regards, Inmaculada Parra Manager.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r298664937", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great holiday", "review": "Nine of us visited the Sunna Park in mid July - our ages range from 16 to 60 (near enough)! and not one of us was disappointed.  Having been to all-inclusive hotels before, we didn't really expect too much for the money we paid - but how surprised we were!!  From walking into the cool reception area (fully air-conned) on a boiling hot morning we knew that our expectations had been far exceeded.  The hotel was spotlessly clean, well decorated, comfortable and quiet; lots of really nice touches too numerous to mention.  All the staff were friendly and could speak English - maybe not fluent but very understandable.  Our rooms were ideal, being a large group we had four rooms in total and the fourth room housed three of us, two large double beds and a single bed in a separate…", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r294590459", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Clean hotel", "review": "Dear Gina, First of all we would like to thank you for having taken a few moments of your valuable time to express your satisfaction about the services of our Sunna Park during your recent stay with us.  At Sunna Park our aim is to exceed the expectations of our guests and it is most inspiring  for all members of our team, to know that we succeeded in our effort. We greatly appreciate your feedback, as it helps us to improve and provide a better experience.   We are very happy that you appreciated the service, the facilities and our friendly staff. We wish to welcome you back in order to provide you another fun and relaxing time!   Kind regards, Inmaculada Parra Manager.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r291960706", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Pool Hotel with Horrible Service", "review": "Staff were fantastic and really attentive, especially with kids (Andreas and gran!). Restaurant manager was quite rude however his staff were so good it compensated it. Food was pretty average but always a good choice. Animation for kids was excellent, lucie and hana genuinely loved entertaining the kids. Would definitely go back. ", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r291580666", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Overall good but not great for English", "review": "Me and boyfriend went here for a week last month and we had a great time. We stayed in a one bed apartment and we loved it. The apartments are across the road from the main hotel which wasn't an issue for us as there was a separate pool and pool bar which served burgers, hot dogs, chips, drinks and ice cream! The staff were very friendly and easy to get on with which made the hotel even better. Andres and Tony were very helpful and friendly, they did everything they could to help us with whatever we needed. There was a language barrier which did cause a few problems (more so outside of the hotel than in). However, the food in the main restaurant did let the hotel down as there was little variety and it was hard to make a meal out of what was there. Overall, a lovely hotel!", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r289114192", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Brilliant hotel.......shhh..... don't tell the Brits!!", "review": "Dear Client, Thank you so much for this wonderful feed-back. Our team is delighted to hear that they are doing a great job and that you even remember their names! Andrés and Toni send their warmest greetings!  About the main restaurant we offer a diverse selection of quality food because we think that the food plays a significant part in our guests holiday enjoyment. Every meal we offer a different kind of soup and a wide variety of salads with all kind of vegetables and dressings. In our Show Cooking, you can find a wide variety and excellent quality of meat every day (pork chops, lamb chops, beef steak, chicken, turkey…) and delicious fish (hake, catfish, trout…), they are cooked on the grill. Also we have a hot buffet with meat, fish, vegetables, rices or “pasta”…  Every lunch we offer a different “paella” or “fideua” and a different pizza with different toppings. And during the week there are three theme dinners (Asian, Spanish, Mexican …. ). And finally you can enjoy our fantastic desserts like delicious cakes, jelly, rice pudding, custard, ice-creams and fruit….    In every case, we wish to welcome you back in order to provide you another fun and relaxing time!   Best regards, Inmaculada Parra Manager.    direccion.sunnapark@seramarhotels.com  www.seramarhotels.com • https://www.facebook.com/hotelsunnapark", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r288172635", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Poor hotel", "review": "What a lovely hotel.....  friendly staff, always smiling and helpful.....  food was plentiful and had a great variety, you certainly will not go hungry here!!  Good choice of drinks/alcohol.... we recommend the slushies (especially with Gin or Vodka in them!!)  Pool area is quiet as the beach is close by (2 minute walk) and most guests seem to go there, pool is surprisingly warm so sitting in there for a length of time is actually pleasurable....also there is another pool in the Apartment block behind the hotel that can be used, again quiet and has a snack bar that caters for the usual hot dogs, burgers etc...  room was large and airy, only let down (which may have just been our room) was the dated aircon which didn't seem to cool the room sufficiently, however we were offered…", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r286978106", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Quiet and relaxing", "review": "Dear Client, Thank you for your nice feedback. We are pleased to hear that you enjoyed your stay at Sunna Park and that you appreciated our services.  We are very happy that you appreciated the service, the facilities and our friendly staff. We wish to welcome you back in order to provide you another fun and relaxing time!  Best regards, Inmaculada Parra Manager.    direccion.sunnapark@seramarhotels.com  www.seramarhotels.com • https://www.facebook.com/hotelsunnapark", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r283556315", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "A quiet paradise....", "review": "Upon check in with 2 rooms, we were given rooms in first floor.   We went down to desk and asked to be in higher floor, which we were given at an extra cost.  Everyday we had to have maintenance come to adjust our a/c.  The rooms could never be cooled.  Our son had to sleep on a water raft with towel by the antiquated a/c unit after we paid for a triple room.  Front desk staff were unfriendly and not helpful.   Hotel reminded us of a holiday inn that had not been updated. I'm sure for the price one could do a lot better than this hiotel.  Wi fi was a bit of an ordeal", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r278139813", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "English Beware", "review": "We arrived at the hotel to be greated by a lady on the reception desk, who's English was not brilliant. (we later found out that was because the hotel recieves very few English guests - the staff were even shocked when they found out we were infact English)  She then proceeded to check us in and give us our keys etc. She directed us to the room saying \"Its quite a long walk - \"Across the road up this lift , up another lift and then along and on to another lift! The rooms were not even in the same building as the reception desk and the majority of the rooms.   We were positioned in another block of appartment type rooms, With its own \"snack and drinks bar\" This was CLOSED for the entire duration of the stay! We therefore did not use this pool at all as it meant walking the long…", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r276181605", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Close to beach", "review": "Dear Graham,  First of all, thank you very much for choosing  Sunna Park to spend your holidays.   After reading your comments I would like to some remarks about them, as I am afraid you got the wrong information when you booked in your Travel Agency and your expectations did not match with the holiday you bought.   Sunna Park has two different destinations:  a four-star Hotel, which one is divided in two buildings  (128 rooms)  and three-key Apartment complex, with also two buildings (52 Apts.) Both share  the same reception. In your case, you have booked an Apartment in our Three Keys Apartments and the reception is located at the Hotel, so you had to go to another building. The Apartments were not even in the same building, as the reception desk, because the reception desk is in the Hotel as the majority of the rooms. The distance between the reception and your apartment was less than 100m and the Apartments themselves, are close to the Hotel.   The cleaning service in the Hotel is every single day and in the Apartments is every day except Wednesdays and Sundays.( as per contract)    Regarding  the snacks, is right, we open the Snack Bar from 01.06 till 30.09, but we do offer snacks at the main Restaurant from 26.04 till 31.05 and from 01.10 till 31.10.         We have guests from different countries, although is true that most of them are coming from Germany, the guests are our priority, independently where they come from and all the Staff and myself, we always  try  to do our best in order to give them the best service in all the outlets in Sunna Park.  I apologize for any inconvenience during your stay with us.     We are looking forward to welcoming you again in Sunna Park.  Thank you again,   Best regards  Inmaculada Parra Manager.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r230579103", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Great location close to beach ", "review": "We only stayed here 1 night after our original hotel double booked us.  Clean and tidy with friendly staff.  Typical 4* Spanish hotel.  Close to lovely beach but not much else going on.  Very German orientated.  Room was clean but air con did not work/not sure if we were meant to pay extra for it?! and no fridge.  We would not stay again because of location but nice enough hotel and would recommend it.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r228965912", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Hotel review from British visitors", "review": "My wife and I spent 3 nights at the sunna park for our anniversary. On arrival were allocated room 225 overlooking the pool but the room was very basic and not as shown in the photos online. The staff at reception were helpful and offered us another room (605) on the top floor (6th) with a sea view which was far nicer and obviously these rooms has been refurbished. Even sent a bottle of sparkling wine to our room to help us celebrate our anniversary. We stayed on a B&B basis, hotel is mainly Germans but staff spoke English. Breakfast was decent with good selection and a chef making omelettes etc to your requirements. The hotel isn't signposted like most others in paguera so if have hired a car (as we did) make sure you have directions pre-printed and come off the main road at…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r224548734", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "good clean hotel", "review": "Very good hotel which is has had a lot of refurbishment done to a high standard and will continue into next year in the bar area, which was the only 'tired' place.  We found the staff to be very hospitable and English was never a problem, but not as proficient as in other resorts.a bit of a struggle for some younger staff, but It has a lovely pool area outside the bar and another one across the road where the snack bar and apartments are situated.  Sunna Park, is an excellent location 2 minutes from 3 wonderful clean beaches, and the main strip.  Perguera is certainly a German resort, but that makes it all the better for older couples and families as the main strip is pretty quiet after 12:00, clean and tidy ....   There is one English bar if you need to feel at home or watch…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r221554349", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Quiet and comfy", "review": "I was surprised to read comments from other visitors to the hotel that the corridors were dirty and the air con too old. I found clean and carpeted corridors (great for cutting down noise) and perfectly adequate air con. I also found toiletries in the bathroom and, frankly, the lack of fridge did not bother me. I stood my bottle of water on the air con vents and this kept it cool enough. I can't comment on lunch or evening meal because I stayed on a bed-and-breakfast basis. The breakfast was more than acceptable with freshly made omelettes available - great! My room was very quiet with - mercifully - no noise from surrounding bars. This is because the hotel is set back from the road (which also means that buses on the airport run cannot pull up with engines revving beneath the…", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r217946805", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Definitely not a four stars hotel", "review": "Stayed a week in this hotel (a couple with two kids). The hotel is barely worth 2 stars. We asked for neighbor rooms when booking and the first night we were given one room in each wing of the hotel ! After complaining we were given a new room for the kids next to ours. Corridor were dirty if not disgusting. Rooms were smelly and not clean. Mattresses were too old and \"tired\" had to have ours replaced after three bad nights by a \"less uncomfortable one\". Air con was too weak, we complained about it and after tow days it was replaced (it was then 25° C in the room in the morning !). We came back to our room as the technician was working, he was gone, the new air con was not connected yet and all our belongings were laying on our bed ! The A/C was finally replaced after a 3 hours…", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r217607421", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Enjoyable stay", "review": "We were moved here after our previous hotel turned out to be more Magalluf than Palmanova.  We came to Peguera last year and very much like the area.   The area is called Little Germany and if you are English you will definitely be in the minority, but it does ensure that the quality of the entire resort is far better than you tend to get in the predominently English resorts (a sad but true reflection).  The Sunna Park hotel is a good quality hotel which is very nicely furnished, very clean and close to both the beach and the fabulous shopping strip that Peguera is known for.   However, as stated before, you will if you are any nationality bar German be in the minority.  This is not an issue especially with the Spanish staff if you try and speak their language - they will bend…", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r214665395", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Average", "review": "Stayed there 4 nights - ok air con is too old. No fridge in room lack of toiletries. Head waiter/ manager in restaurant annoying he should chill out a little bit.  On the upside beds are comfy. Balconies are too close for comfort a bit scary", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r214518565", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "very nice", "review": "This was a well maintained and nice hotel, mostly let to Germans, not a problem but just a point, food not the best of selection, but something for everyone.  house wine was very nice, and entertainment non existent , I had three days there and it was lovely, close to town and beach but three days is enough. surprised not even the reception staff did not have good english", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r210024694", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Nice", "review": "We went for a quick weekend for my birthday. The staff was very nice and unexpectedly accommodating. We had a very late check in arriving to the hotel. The staff saved us a plate of antipasto! Wonderful! The dining room was closed, but they set a table for two with soft lighting for us. It was just what we needed to start our vacation.  The staff spoke a little English.  Fortunately for me I live in Germany,  and studied Spanish in college,  so I could functionally communicate. The hotel it perfectly located by the beach, which is the very reason why we came to Mallorca.  ", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r206813660", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Not for us", "review": "We stayed at Sunna Park mid September 2013 for 2 weeks. It was a last minute holiday booking and with hindsight should have done a more thorough assessment of both hotel and resort. Paguera, we found out later, is often called “Little Germany”. Nothing against Germans (I have tried unsuccessfully over the years to get a grasp of the language) but if you can’t speak German be aware that 95% of the guests are German and all the entertainment and most of the literature is in German. The hotel staff all appeared to be fluent in the language with not many holding a good grasp of English. In general there was not a great deal of holiday spirit and atmosphere. The animation “team” consisted of one person who we found out after a few days could speak English enough to be understood.…", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r178597307", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Excellent - would go again!", "review": "My girlfriend and I stayed for a week in an apartment there in the middle of September 2013. It was situated in a good location to explore the amazing coastline along the south west of Mallorca. Cala Fornells and Cala Den Monja are but a few of the beautiful bits of the coast to visit which are well within walking distance of the hotel. The hotel facilities were very good and the staff were very friendly. The only slightly negative points I have are that the restaurant could be bigger so you don't have to wait for a table and that more staff should run the hotel reception. The two massage chairs near to the bar toilets are really good and well worth 2 Euros for 10 mins! I highly recommend a stay.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r177407098", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nice for a short break", "review": "My wife and I are just back from a six day stay at the Sunna Park. We were given a top floor room with sea view, which is what we hoped for. (without paying a surcharge) The room was a good size compared to previous Spanish hotel rooms we have stayed in. Excellent storage in a triple door, built in, mirrored wardrobe. The Hotel is kept very clean and the pool area/sunbeds/tables and chairs are regularly hosed down. No problem getting service at the bar which although only opened from 11.00am to 11.00pm on all inclusive, suited us ok.  The food was of a reasonable quality but I cannot understand how it can leave the kitchen and not be warm, let alone hot.   The staff were all very efficient but a smile now and again would go a long way to give their guests a better experience.…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r173625090", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "More like a 3 star.", "review": "First impressions was that the hotel rooms were very clean and crisp, we had booked an apartment for our family of four and were given a \"family room\" instead, which for us was not suitable. The family room has no fridge, kettle etc and thats exactly why we booked an apartment.  All we was told that they were overbooked and the family room is more expensive!  I don't think so!! Ok so put that aside.. the atmosphere at the hotel is nice and relaxed,  we never had a problem finding sunbeds, the activity programme does need to be adjusted to do more things and the kids mini disco in the evenings was the same thing every night that even the kids looked bored doing it.  We have always done 3 star all inclusive and this hotel does not compare to what we have experienced before. Food…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r172357706", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Unexpected adventure", "review": "We booked this holiday on the Tuesday morning and flew that night, so had absolutely no idea what to expect.  The staff where very friendly and helpful which is always good.   Every thing was very clean and well presented.  The main problem was the food which was atrocious!  I wasn't expecting michelin star, but one evening they had Roast Hound, which was a shocker!  they assured me it was pork and then insisted that Hound was an English word for Pork, which it isn't! (it's a dog).  Even without the typos the food was unbearable, Luckily we hadn't planned on an all inclusive (they upgraded us because it was our honeymoon, which was nice) so we ate out most evenings.  The other problem was they had put us into a twin room, and couldn't see why this was a problem for a…", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r166007739", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Hidden gem", "review": "Booked this hotel only two weeks before departure from browsing various web sites, it looked good value and despite some negative reviews we thought it would be ok.  It turned out to be one of the best breaks we've had for sometime. The hotel was lovely, well situated, close to the beach and well looked after town of Peguera . We were given two lovely rooms overlooking the pool, the hotel itself was well worth it's 4 stars, we particularly liked the elephants in reception and the comfortable seating areas. The bar area had plenty seating as well and the service was good, the restaurant was really nice, a good choice of food and plenty of it. The staff at the hotel were excellent and very friendly, we were there the end of May and had good weather which was a bonus.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r165770501", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "very poor", "review": "went this year in september, we were put in the spill off buildings of the hotel which was dated to be kind , there had been some adverse weather a couple of days before we arrived and the carpets were wet through , in the bar and reception and first floor , to make things worse they had put towels and blankets down to soak the rain up, but after three day the smell was terrible. the bar was dark and unwelcoming and the staff uninterested. this hotel does not deserve four stars", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r141873422", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "AWFUL!", "review": "Rude staff, dated rooms, double bed was slightly larger than a single, double booked us, pool was dirty, strange smell around the place. DO NOT book! Paguera is beautiful and there are plenty of nice hotels elsewhere.", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r118197072", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "very good", "review": "Had great time-no english in hotel & not catered for but we were on holiday in a foreign country so hay ho-food great -head waiter looked after us & he was great-i think he felt sorry for us as no more english guests-room had 2 seperate bedrooms so our son had his own space.if you like getting away from it all i would recommend this hotel but bare in mind-it is a german hotel within a german resort-we met some really nice people from germany & had a great time with them.They do have a kids club but reps only speak german! Food good with plenty to choose from.", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r116714410", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Absolutely Terrible - Would never return!!", "review": "We had arranged a four night stay as we were visiting relatives who were staying elsewhere in the resort.   On our arrival we were informed that there was a problem with the pipes in 10 of the rooms, one being our room and there were no others available so we would need to stay in another hotel for the first night of our stay. Now... we had read the previous review for the this hotel on tripadvisor before we left and didn't think too much of it but when we were told the same excuse it was very obvious that this hotel simply overbooks then offers up the same lame excuse to all of its frustrated guests that are informed they have to stay elsewhere on arrival .  As disappointing as it is to be told that you have to then move to another hotel we were shocked to hear that there was…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r116554603", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Hotel does with guests what they want :-(", "review": "We book our holiday in hotel Sunna park, but after arrival to hotel we were informed, that they have 10 rooms out of order, some problem with water and we have to go for 3 nights somewhere else. Later we find out that it was not truth, cause they were doing this with every guest. Everybody had to stay at least one night in other hotel. Overbooking happens, but this was too much. They were changing the stories as well, sometimes it was problem with water to somebody they said they are overbooked. Overall its nothing special, food could be better quality and the rooms were ok, just the hairdryier could be changed to new one. Also pool should be kept in better condition. What I like was friendlines of animators and people in the bar :-) reception staff was terrible, especialy the…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r115659148", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Germany or Majorca", "review": "Recently returned from a weeks stay at Sunna Park. The hotel was clean but very dated and full of very austere German pensioners, which was not very inviting to 2 16 year old boys. We were the only English family at the hotel and the only ones booked as half board everyone else seemed to be all inclusive. The hotel and the resort was busy but tranquil and totally geared up for the Germans, even the entertainment at the hotel was in German, however all staff spoke some degree of English and were mainly polite and freindly. The journey from and to the airport was very long and frustrating as we were last to be dropped off and first to be picked up. We missed meals due to this, however some food was provided but not edible on our arrival, on our departure we were able to get an…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580307-d272980-r115113499", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}]