[{"title": "Alternative hotel - Rooms lovely", "review": "We visited Palma last week and on arrival to our hotel we found that they had double booked us. We were then asked to spend two night here at the Hotel Serrano. Our other hotel has also upgraded our stay to half board so we got to experience breakfast and evening meal here at the hotel. On arriving late afternoon on our first day we went around the pool and paid 15 euros to use the 4poster bed as they had no sun loungers left. We only used this for a couple of hours which would of been nice if they had let us have it for half the price but not to worry.  The room we stayed in on the 3rd floor was really nice. Lovely big bathroom with double sink and bath. Nice touch with flip flops and robes for our stay. The air conditioning was very good.  We had a room that overlooked the pool and It was nice to sit out on an evening. The food was ok and a nice buffet.  We had an all inclusive stay at the other hotel which I have reviewed and that was a 4* hotel and the food was nice there then at the Serrano. The food did let the stay down. The restaurant was a little dark, no outdoor seating.  The safe were friendly and when we checked in offered us a glass of bubbles and truffle. Lovely touch.  Very German hotel and we didn't come across another English person while staying in this part of the island. The room was the best part of this hotel.  Nice stay but I wouldn't book any package other than just bed and breakfast. Not far to walk to the front and have meals in the nice restaurants we saw while out. We only stayed for 2 nights so didn't get chance to experience any entertainment.…", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r608878577", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Old fashion hotel without any charm.", "review": "Dear Guest,  thank you very much for the positive review. You are right: We are by no means an all-inclusive hotel so things are different than expected. Nevertheless it is nice to read that you enjoyed your short stay with us and appreciated the features of a 5-star room.  Best regards  Colau P. and Juan C.", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r572358529", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Good place, could benefit from a refresh of the rooms", "review": "Surprice with the 5 star raiting at this hotel.  We love to test hotels on the island since we are working with turism. This one was on the list since it was 5 star. Belive our surprice when we found old fashion rooms with uncomfortable beds and pillows. The all include restaurant was a disappointment. The main courses look like they have been there for a while and the chef who cook that evening, over cooked both the lamb and the fish. The staff was really nice and friendly and tried to do their best to make everyone happy.", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r510951348", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Nice hotel but too busy", "review": "Dear guest,  we feel sorry about our Hotel not being the type of hotel you were looking for. The fact that the enormous majority of our guests do no share your opinion does not help much.  Anyway: We thank you for your opinion which will be of great interest for our Chef.  Best regards  The Hotel Management Joan C. and Ines K.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r504763458", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Average ", "review": "Good 5 stars hotel, large rooms and bathrooms. Located 20 m from a crowded small beach ( there is a lovely beach ~700m away after the harbour) Good breakfast buffet, a bit less impressed by the dinner one. Room's furniture is a bit oldish. Would be nice if the floor halls would be air-conditioned as well as it can get stuffy... Very nice and helpful staff.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r502325777", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Celebrated our 35th Wedding Anniversary", "review": "We spent a week there. The weather was beautiful. Totally enjoyed going to the beach Son Moll. Spent our afternoons on the pool. The area is a great location. We had a junior suite wich is very spacious. Two balconies one looked to the beach and the other to the pool. At night when you open the doors is great breeze. The food is excellent there. A great variety for breakfast buffet and also for dinner buffet. Very friendly personnel. Also great for accommodating for your needs. We had a great time. This was our second time there. Some great entertainment to at night after dinner. They come up with so cool ideas if you stay on the pool around lunch time.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r500862963", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Full of German, horrible hassel all the time", "review": "Not a place for calm holiday. It's a place where a massive crowd of German people are fed in a buffet diner, where you have to que all the time. And what was the hotel thinking. We are a family of small children and we were put in a room located right on top of the terrace where the band played until 11:30 pm. Not much sleep for the kids before that.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r500617315", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Superb!", "review": "Dear Guest and Reviewer,  \"Full of German\", \"Full of Italian\", \"Full of British\" ... . It seams like you dislike certain human environments during holidays. You absolutely have the right to do so, but not to blame any resort or hotel for it. Not in modern Europe.  Mediterranean beach hotels in July/August are known to be anything but calm areas of tranquillity and profound relax - with very few exceptions though. We are certainly not a \"party hotel\", but summer customers expect (demand) some entertainment after dinner. It is well known that in Spain 11.30 pm is in summer by no means a normal sleeping hour in holiday areas.  We deeply regret that you and your family where not acquainted with these circumstances while choosing Majorca for your holidays. But blaming our Hotel Serrano Palace for it is certainly not the fairest way to deal with it.  With best regards  The Management ", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r418221430", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Quite good, for Germans only", "review": "The cava and chocolates at check-in is definitely a good start, especially after the lengthy transfer from airport to hotel. We were upgraded from Junior Suite to the Imperial Suite and we were told we would have a present awaiting us in our room, which turned out to be our own private outdoor jacuzzi on our terrace!  Room  The suite had two balconies, as well as a terrace with sofa and chairs and a dining table and chairs and jacuzzi. Very clean, lots of space. Excellent turn-down service. On our first day, a plate of chocolate-covered strawberries was left in our room. Delicious! Tea and coffee facilities in room.  Food Good selection at breakfast and dinner. Italian night was fantastic; ironically, the Spanish night was a little disappointing. Decent selection of wine.  Staff…", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r361751635", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Little Germany", "review": "The main guests are Germans. Even if you are talking to personnel English, you get answers in German which is not so convenient in case you do not speak German. Guests of other nationalities have to be ready that everything in the Hotel is made for German taste: food, entertainment, spa - in sauna in showers all guests are nacked which can be shocking for non-Germans. Overall spa zone is totally new and very nice. Good big rooms. Bathroom fixtures require renovation. The rooms are very clean except for the dust on clothes hangers. WiFi in foyer is very slow. No WiFi in the rooms other than for 15 EUR.  In case of being half board you will get good choice for breakfast and diner. There is a coffee machine at breakfast which makes only espresso. Surprisingly latte can be ordered…", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r323165872", "sub_review": {}, "travel_purpose": "", "rating": 2}, {"title": "5 Star Treatment!", "review": "Everything is superb at the Serrano Palace, from the moment you check in, where a glass of Cava is offered with handmade truffles.  Straightaway you know your stay is going to be a quality experience.  All of the staff went the extra mile.  In particular Alba on Reception and Gabriel in the Dining Room;  nothing was too much trouble for them.  Food is of an exceptionally high standard, as is the entertainment.  Bar Staff always have a smile for you and enjoy bantering with the guests!  Housekeeping is also of a very high standard.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r313619777", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "An amazing hotel", "review": "We had an amazing time at this hotel. On arrival we were met by the managers who offered us Champagne and were very approachable and friendly.  We had booked a suite for 11 days on a half board tariff.  Checking in was easy and the receptionist very helpful  she said there was a surprise for us.  What a surprise.  They had up-graded us to the imperial suite.  This amazing apartment consisted of a massive bed and bedroom area, a sitting area desk and corridor and walk-in wardrobe area. The bathroom was huge and all marble.  It had a Jacuzzi bath and a multiple head walk in shower.  We had two large balconies furnished with chairs and tables but the best part was the roof top terrace, which was massive and overlooked Son Moll beach and the sea.  This had a private swimming pool…", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r312270150", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Amazing", "review": "Every aspect of the hotel was faultless.  Staff couldn't do enough to make our stay perfect,room was spotlessly clean and the view over the bay was amazing, food was delicious and the amount if choice was enormous, pool and spa areas have just been renewed and were beautiful, position of hotel for access to bus stop or walking to local areas was perfect.", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r301357397", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great stay", "review": "We had a great stay in Serrano Palace. Staff is very friendly and helpful. Although, regarding Swiss standards, its overrated with 5 stars, the place is perfect for relaxing and staying a while.  Pool: 5/6 Breakfast buffet: 5/6 Dinner buffet: 4/6 Room: 5/6 Service: 6/6  2-minute walk to sea 80min. drive to PMI 20min. walk to Cala Rajada  I could recommend the hotel and would return.  ", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r297507152", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Nicest room I've ever had", "review": "Dear Guest, hello Tobias,  (although reluctant) we may accept the superiority of swiss standards provided you honour the considerable price gap between both. In view of the swiss fairness embedded in your positive review we are confident you will. Thank you very much for both,  Kind regards Joan C. & Damià R.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r283950717", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Fabulous Hotel", "review": "Had a great stay at this 5 Star Hotel, rooms were spotless, both the pools were excellent, with a Jacuzzi inside the indoor pool and sauna.  Wonderful choice for breakfast buffet with Champagne on ice!  Mostly German guests so did not speak to many people but most seemed friendly.  As you come out of the Hotel the beach is opposite and there is a lovely walk along the sea front with many restaurants and small bars overlooking the sea.", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r230682775", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great Location", "review": "The Serrano is in a great location. Just across the road from a nice beach and a short walk into town. Friendly staff and a fairly good restaurant with a reasonable choice of food. The room was ok, not luxurious but adequate for us. The evening entertainment is laid back and easy going, pleasant enough. There are lots of other bars and restaurant close by and in town, worth trying as well.", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r230496371", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Amazing hotel!!!", "review": "Beautiful hotel, could not fault a thing! We arrived in the middle of the night and when we got there they had prepared some food for us....so thoughtful. We have just come back from our third stay at the hotel!  Love it", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r222396981", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Excellent Location", "review": "Great location, a nice hotel, a little outdated in areas. Large rooms and bathrooms which are very nice and exceptionally clean. Friendly staff. Good buffet food. Would recommend this hotel to anyone looking for a relaxing stay near the beach in a cute town.", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r213430177", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great position", "review": "Could not fault this hotel,Nice staff,good food,comfortable room,cleaning staff working constantly,fantastic position the beach and shopping is on the doorstep.Would defiantly go back.Lovely patisseries in a beautiful sea front location.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r211235089", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great hotel", "review": "Great hotel, wonderful staff and hotel manager that is clearly passionate about ensuring guests have a great stay. Hotel is a 2 hour transfer from airport but worth the journey as surrounding area and beaches are lovely. Food is excellent with plenty of choice and lunch menu is reasonably priced.  All round great holiday would definitely go back!", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r171960574", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great hotel but a few let downs", "review": "This hotel is 2 hours at least from Palma airport. A bit disappointing as we were told it was maximum 1 hour 40 minutes. (Last hotel on the transfer drop!) On arrival we were greeted with a refreshing drink, however, we found one of the receptionist was rather abrupt about regarding dress code in the evening for gentlemen, (no shorts allowed) which was a fair comment, but was the manner she said it in, rather snobbish. Despite that, my son wore three quarter length shorts the whole week without any problems or hesitations from the staff! The start was disappointing, but the rest continued well. The room was spacious with great air conditioning. The food was good but we felt it was gearing towards German tastes particularly  in the mornings. The clientele was mainly German.…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r171521155", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Pity about the noise", "review": "We had a two week break to get some sun and peace and quiet. The hotel has largely German residents but all very pleasant. On the excellent side were the staff and the food. We are quite critical of food but the food in the hotel was excellent. Although mainly buffet, there was always a good choice of fresh food and some cooking while you waited took place at breakfast and dinner. The lounge bars and facilities were very good. The room was very spacious with a large bathroom, all in marble. Lots of space for clothes and cases. Some strong lighting for reading in the evening other than lying on the bed would be helpful. The beds were comfortable but twins. On the 1st floor the view of the sea is limited. Aim for a room on a higher floor. The pool was good but a shortage of…", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r165446071", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Fantastic food and staff", "review": "This hotel is a gem. The food is wonderful, far better than other comparably starred hotels I've stayed in. The choice is amazing. Today, the weather was hot and sunny so by the pool it was busy. Complimentary sangria, chocolate delicacies and great service made the difference.  Last night we were treated to a stunning flamenco show. The only downside is that I would have liked to have taken advantage of a couple of trips but because this resort is primarily for the Germans, it would not have been a good idea as I speak very little German. However, there is a bus nearby!", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r162175225", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Exceptional!", "review": "Just returned from a week at the Serrano Palace. This is one establishment that truly qualifies as five-star. Luxurious rooms, friendly and hard-working staff and a 'hands-on' manager who appears to be everywhere at all hours and possesses an amazing capacity for remembering guests' names! The food and entertainment were wonderful, the poolside brilliant and the rooms spacious and extremely comfortable. We will be back!", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r160864829", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A go there if you can hotel", "review": "Just returned from a weekend break at the Serrano Palace Hotel. Staff are excellent and so helpful. The hotel is spotless and the rooms and amenities second to none. We both had an amazing massage in the Spa, well worth the money. We found the drinks prices very reasonable for a 5 star hotel. Even were offered breakfast at 5.00am when we were  leaving! We had entertainment every evening which was excellent.   Take some time to visit the village and enjoy one of the many local restaurants. All very friendly but, be aware, this is very much a German visited area so many of the places struggled with English and we saw very few English menu's. Do NOT be put off by this as we had great fun with all the guests.  The only downside was the transfer from the airport to the hotel where we…", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r158554327", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Heavenly hotel", "review": "The Serrano Palace Hotel is not only beautiful, befitting a 5 star hotel, the staff are absolutely amazing. Despite arriving after midnight we were greeted with a glass of wine and a meal, and breakfast was laid on when we left at 3am a week later. All staff were warm and friendly, including cleaning staff who did the most wonderful arrangements with the towels each day, which made us smile.The food, the room, balcony with loungers, bathroom and standard of care and cleanliness is superb - nothing, it seemed, was too much trouble. The restaurant staff even kept a meal warm for us when we got lost on our first walk and got back late. The gentle live music sometimes at breakfast was lovely and there was a great array of entertainment in the evening suitable for all - live football…", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r156985494", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "A truly great and worthwhile hotel to stay in", "review": "Just returned from a week's stay at the Serrano Palace with my husband and eldest daughter and her family.  We were treated with such genuine hospitality from the staff.  We have stayed at this hotel several times, the last visit was the same time last year.    The manager, Michel Schilling, remembered us and made us very welcome, as did the lovely ladies in reception, waiters Paco, Toni, Silvia, Rafa and new member Sebastian.  Nothing was too much trouble.  If you love  your food, as we do, I can promise you will not be disappointed.  It was fabulous  .  There was a different theme in the restaurant every night which was something to look forward to.  The entertainment was excellent, especially  Reuben who sang and entertained us.  There was gentle live music in the restaurant…", "date": "March 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r156576660", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "friendly and professional", "review": "We had a lovely week at this hotel.  The staff are warm and friendly, as were the other guests.  The hotel (and resort) caters for german guests so don't expect english telly or bars.  Suited us fine.  Everyone (including the other guests) made real efforts to speak to us in english after assuming that we were german and then realising that we could only make  pathetic efforts in german and spanish. The food was wonderful, the hotel very clean and the room spacious, including a large balcony with two sun loungers and a beautiful marble bathroom.  The beds were fabulous. The nearby beaches were packed out which surprised us for the time of year.  However, if you are a keen walker you can reach more or less deserted beaches. Our only complaint was nothing to do with the hotel. The…", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r142763315", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely Hotel", "review": "Arriving in the early hours of the morning we were kindly offered food and champagne. We were extremely happy with our lovely large room with sea view and balcony and spacious en-suite. The Manager, reception staff, chefs and waiters and cleaning staff were very helpful and friendly. The choice of food was extremely good at both breakfast and evening dinner. To my surprise a table had been especially laid with a red runner and candle for my birthday and to my delight the staff sang 'happy birthday' when presenting me with a birthday cake - making my birthday special. The lunch menu is adequate, the food very good and presented very nicely and well priced. The location of the hotel is perfect - close to the beach, although busy and it was a lovely walk along the promenade to the…", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r139432767", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "no way 5*", "review": "I have just returned from a 4 day break...... arrived at reception to be told mixed up booking they put me in nice room with sea view bit tired looking needs revamp,was told my room would be ready next day, so didnt settle really knowing impeding move next day,flight 3hrs and transfer from airport 31/2 hours ...... not the best of greetings on my arrival,told them i wasnt happy as i was only staying 4 nights .....however to not spoil my holiday i gave up my complaint and moved....well they put me at the back of the hotel view was road and trees no sun on veranda at all ...... Staff were very nice but was told it wasnt there fault......so anyway got a bottle of champange and fruit on sticks as way of apology champange was freely available at breakfast next day same bottle so…", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r136899651", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "5 Star Hotel & Staff, average food", "review": "Just enjoyed 10 days at this lovely hotel.  The location, ambience and staff are superb.  The majority of guests are German.  We were half board and the food was, well, just pretty average.  Hotel flights and transfers arranged through Co-op Travel, but nothing was theirs (ie hotel voucher from Hotels.com, Flight details EasyJet.com and the transfer from some online equivalent).  The transfer took much longer than it needed and was far more expensive than local/direct arrangements.  Hotel and Cala Ratjada \"top right\" of island.  The resort is a compact, pleasant location with a lovely seafront promenade to the Port.  On the northern side of this peninsular are two beaches well worth visiting:- 1.  Directly north of this hotel is a long sandy east-facing beach with heavy waves. …", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r135280424", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "nice hotel, with little \"but\"s...", "review": "We just returned from our 4 day trip to Mallorca and Serrano Palace.  First will start with teh possitive things:  + the hotel personal is very nice. The first thing that happens when you arrive is a glass of sparkling wine :) + the hotel and rooms are spotless clean. The maid are running around all day wrong... I think they even come over 2-3 times a day, since we were finding candies every now and then on our beds :) so I would say very well worth tipping the girls! + the bathroom and room floor are marmor tiled which in summer hotness feels very nicely cold... +the pool and garden area are nice and taken care of. + just accross the street a very nice and clean beach, with amazing water. you can go up to 40 meters and the water is still clear and barely touches the belly.  …", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r133428085", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Lmro", "review": "Have just returned from a 2 week holiday. It was terrific. The hotel is smaller than most 5*s we have stayed in, but the staff were friendly and efficient and the service was excellent. Everywhere was spotless and clean. The rooms were spacious with plenty of cupboards and drawers.  Food remained great for the whole stay and there was a variety available with different themed cuisine nights. Most staff could speak English fluently but a few could only speak German.  The first week there were only 6 British people in the hotel, the remainder being German with a few French and Spanish couples.   Cala Ratjada is a lovely area, although predominantly a German resort, with a great harbour particularly at night when all the bars and restaurants are full of people. The hotel is only…", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r133265234", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Love this hotel", "review": "We love this hotel. Great location, good food, excellent customer service. The staff are very good and really look after you. We hope to return.", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r120964655", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fantastic Hotel to stay and enjoy your vacation everyone there is super nice, spacious rooms, excellent cuisine can not wait to", "review": "Loved being there. Great Hotel to make vacation. Very nice Staff they are all extremely nice. Fantastic Food. The rooms are well kept. It is right Next to the Beach. We had a fantastic view from our balcony (Paradise Feeling). Definitely will go back there!", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r118987201", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Loved this hotel and would go back again.", "review": "My friend and I have just returned from a week's stay at the Serrano Palace on a half board basis.  Must say we were both enormously impressed with the hotel's cleanliness and service.  The food was absolutely fantastic and all of the staff were were first class.  We had our own rooms and they wre absolutely massive and cleaned daily.  Nothing was too much trouble for the staff, they were all lovely.  The Hotel is in a great place, beach opposite, bus stop outside and shops literally around the corner.  A beautiful walkway to the Marina opposite the hotel with restaurants along the way, all with lovely sea views.  A beautiful spot to be honest.  What more could you want.  We seemed to be the only English people in the hotel, the other guests being German.   As we can both 'get…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r118352716", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "great value for money 5 star(ish)", "review": "WE booked direct with hotel and got adjoining rooms and half board for 5 nights in August 2010. Most majorcan hotels are 1 star below equivalent UK hotels so we were pleasantly surprised with the rooms. very large, great marble bathrooms with usual freebees. ok TV with some english channels, nice balcony with patial view of sea.  Check in very easy, no hassle, pool was average size but so refreshing and never busy, most people sleep in loungers all day which were easily available with minimal reservation by early morning lounge baggers! The kids loved the pool and would swim all day long. The indoor pool opened onto outdoor pool so provided shade when required.  Towel system was confusing requiring a deposit to be paid and a slip of paper given to you which you returned with the…", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r98905807", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Don't waste your time or money, go to a new hotel and resort for 5*.", "review": "At best a good 3 star - no way is this hotel, badly needing refurbished, 5 star. The air conditioning hardly works, neither does the room fridge, no coffee making facilities and very average room cleaning. The rooms just feel dirty the whole time. On arrival you are dumped on the main road - no porter in sight - not good with 3 suit cases, a pram and a 2 year old boy. As you toil past the fountain that is now full of dead leaves, finally someone notices you. Great. The \"palace\" feels glum, and looks like a 1960's nuclear bomb shelter. Honestly, unless you love this part of the world go to Mexico, Egypt, or the Dominican Republic. For the same price things are just so much better. And the staff in these countries generally really try. Spain, I am sorry you need to pull up your…", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r80077423", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Serrano Palace, Mallorca", "review": "I chose this hotel to avoid the usual destinations for British tourists in Mallorca - and very happy to have done so. This resort was very quiet with a lovely beach and waterfront. The hotel was right on the beach but also had a lovely pool. Hotel food was lovely - recommend people walk along the waterfront to find numerous restaurants and small bars in the evening. Hotel staff were very friendly and helpful throughout. For those people looking for an english resort, this would not be the place but for those looking for a peaceful, relaxing break then highly recommend.", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r64624740", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "i loved it it was great beautiful infact", "review": "i loved it it was very clean many germans but the pool was beautiful it was the staff that made it great they were very helpful and friendly the food was expuisite.The entertainment was great we had a really nice time the view was lovely and lovely tourist attractions.I have already booked to go back and i cant wait.Not much activity for kids but they still love it.I would say that the only problem was that in the outside pool everyone stares at you.I would say that u should go and see wat u think the pictures dont look great but when u go it is lovely. so yer i loved it it was so much better than five star so yer just go along and see wat u think serrano palace here i come woo hoo go on go its great", "date": "July 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r37769973", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "superb hotel, excellent staff, nothing is too much trouble", "review": "I have stayed at the Serrano Palace for many years and always thought it was a very good hotel.  This year the hotel has just got better than ever.  Since my last visit in 2007, there is a new hotel manager Tony and a new restraunt manager also called Tony, along with a wonderful chef from Italy called Alex who is clearly passionate about the food he delivers to the guests.  New innovations included fresh fruit served to hotel guests at the poolside every afternoon, often by the chef himself.  A welcome drink (free) upon arrival at the restraunt each evening was a really nice touch, this included champagne on Gala night.  Champagne is also served  to guests at check-in, whilst you complete arrival paperwork and pick up your room key.  Check-in at the Serrano Palce is speedy and…", "date": "June 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r32585694", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "a lovely hotel, a lovely relaxing break", "review": "my partner and i booked this hotel and got a great deal, reading reviews it said its was mostly germans and a german/dutch resort.on arriving we were shown to our room and there was alovely basket of fresh fruit for us and a little bottle of wine, we were not honeymooners, nor had we requested this. it was alovely suprise.   hotel was spotless, pool area clean, staff/reception/bar/chambermaids, all very helpfull. food just what you expect, gets a little repetative but nice just the same. resort calm and relaxing, due to it being mostly germans/dutch, even though friendly enough we were left alone and bothered by no-one. would love to return to this resort and hotel.", "date": "May 2004", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r20116205", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "ok but not 5 star", "review": "just come back from 5 days with my 16 year old daughter.  cant quite put my finger on it but not the best hotel we have stayed in.  99.9% germans and not  5 star but clean and food good.  the usual buffet meals.  most of the staff very freindly .  really close to the  crowded but lovely little beach.  after spending 60 euros on a great bbq lunch  by the pool was promply told off for drinking our own bottled water ,  felt  a bit angry as everyone else had water and nothing was said.    very quite, cant really think of a lot else to say.   clean  good food", "date": "August 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r18782462", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Irish Visitors", "review": "Really nice week spent at the Serrano Palace with our six year old. 99% germans staying here, only met two other english speaking guests, but nearly all the staff had pretty good english. Staff very helpful and friendly. Food very good. Nice pool area and beach acroos the road very nice. Cala Rajada resort very clean, beautiful walk along the seafront to the town centre. Plenty of shops and bars, although not really for the late nighters... germans all in bed by eleven.  Not alot for children at the hotel and ours was one of the only children there, but this was probably due to the time of year and she still really enjoyed it, staff very attentive to her and left little gifts on her bed each night. Would recommend this hotel to anyone, except perhaps under twenty fives... would…", "date": "May 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r15635773", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Good value 5 star hotel", "review": "We wanted a five star hotel in Majorca and found the tripadvisor reviews to be really helpful in making our choice as many seemed really expensive and I didn't want to get this wrong. Were therefore prepared for the fact that this hotel is situated in mini-Germany, but what I hadn't considered would be the need to understand enough German to read a restaurant menu as all the boards outside the bars etc were in german, so was a lot of the TV coverage in the hotel.  The hotel itself is in a cracking location directly across the road from a small and busy beach.  There was also a small Spar which meant we could buy water and drinks to take back to the Hotel at a really reasonably price.  They also sell huge fresh baguettes which were really cheap and solved our lunchtime worries. …", "date": "October 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r10048772", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very German Orientated", "review": "I was slightly disappointed with this holiday. The hotel was very clean and the staff on reception was helpful. Food was good nothing special considering its supposed to be 5* . This Hotel/Resort is very German orientated.  Personally I have no desire to return pleasant walks, nice small beaches (could be better maintained) but nothing much else. Noahs Bar and Pasta Pasta on the promenade stretch was the best bars/restaurants.  I am finding it hard to write much more.  I would not recommend this Hotel/Resort to young families or anymore looking for a bit of nightlife.  Unless your into 'Nena' - 99 Red Balloons and  white socks and sandals don't go there!  On a positive note if you are looking for a great 4*Hotel go to Menorca - Cala n Bosch - Valentin Star Hotel you will NOT be…", "date": "September 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r10027105", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Nice hotel, shame about the location.", "review": "This review is in 2 parts. The first is for the hotel itself and the second isf or the town of Cala Rajada.  The hotel is very clean and the rooms are a good size...and yes the bathrooms do look as good as in the pics. That said a good hotel is more than just about bathrooms. The food in the restaurant was very good and the variety sufficient for a week. Where the hotel let itself down badly was on the service. If you arrived late for dinner or breakfast there were never enough tables and the staff (who tried their best) were in short supply. Given the prices the hotel charges for drinks (very much over the top!!) I would have expected much better service.   Dont stay in this hotel out of the summer season. There is no heating, and given the bad weather we experienced, we found…", "date": "September 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r10020732", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Great Holiday", "review": "We stayed at the Serrano Palace for a week from 15th Sept.  All the staff were very friendly and the room was lovely, very clean with a nice sized balcony overlooking the pool area.  The buffet style meals were probably not 5 star but nonetheless tasted very nice especially the chefs specials.  Some reviews have complained that there were too many Germans and that the hotel favoured these guests, I agree that the hotel and the resort is popular with Germans but this did not spoil our holiday and we were treated no differently.  I personally found all the people we met to be very nice with excellent English and also good manners.  It was nice to be able to go around Cala Ratjada and admire the sights etc in peace.  If you want the usual drunken behaviour of the English abroad…", "date": "September 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r10017647", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "never a five star", "review": "having read all the reviews we thought this has got to be good, but no on arrival greeted by manageress very efficient and friendly. Then we found no free parking only available at ten euros per night, no tea/coffee making facilities, yep thats right a further 3 euros per day. then tried to have a shower, no water pressure plumber came said it was fixed still no water. 3 days later had to change rooms, now no english tv channels. a cattle market approach to meals, with the hords of german business men and all female gangs of frauleins. this is NOT a 5* hotel 3+ at most. warning if your not german this is not the place for you. ", "date": "September 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r8724573", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Not 5* At All", "review": "Arrived on 3rd Sept, Hotel looks okay but really not 5*. Meals are all buffet style and restaurant only open for breakfast or evening meal, can have snacks around pool but at extra cost. Rooms are okay, clean and tidy, but no double beds just two singles pushed together. Bathroom is the best, thats why they show it in the brouchure. No evening entertainment manager stated not enough people in the Hotel!!!!!!!!!!!!           But Hotel Fully Booked?????? Cala Ratjada is a resort that caters only for the Germans, there are no English Bars at all in resort.....................All restaurants and bars have menus in German and hardly any have English. Hotel really only wants German Holiday makers and do not make English people welcome. WOULD NOT GO BACK.................WOULD NEVER…", "date": "August 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r8688480", "sub_review": {}, "travel_purpose": "", "rating": 2}, {"title": "Fantastic Hotel, highly recommend", "review": "Myself and my partner recently spent 10 days at the Serrano palace and the hotel was just fantastic. The staff were very friendly, professional and nothing was too much trouble. The rooms were beautiful, marble everywhere and very clean and comfortable. Although fully booked, the hotel never gave the impression of being too busy and the meals were fantastic. We booked on a half board basis and had planned to eat out a few nights but the evening meals at the Serrano were so good, we didn't want to. The resort itself was very busy and our impression was that there were too many hotels/apartments for the area and it was teeming with people. Don't let this put you off from staying at the Serrano though - we had a great stay and would highly recommend. ", "date": "August 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r8418637", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "High quality Hotel", "review": "My wife and stayed at this hotel for a week in august 07 and I must say my overall impressions were that this hotel was excellent, the staff were particularly good especially the reception staff and the restaurant waitress nothing was too much trouble. I normally cannot stand buffet type meals although this hotel as does the town of Cala Rajada cater mainly for the German tourist market the meals were excellent in fact I would say the roast beef was probably the best I have had and there was always several choices, breakfast are usually the meals that let continental hotels down not here they do all the normal fried eggs ,sausage & bacon(why do all hotels use fatty bacon) as well as several other choices normally we eat out at night when away but never once did we as we enjoyed…", "date": "July 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r8401562", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "a fantastic break", "review": "my wife and i stayed at the serrano palace for 5 nights in july/aug 07. as my wife is pregnant, the remit was for a relaxing break, plenty of chill time and loads of sun/good food/nice surroundings. i have to say the serrano palace delivered everything in abbundance! we have stayed in many top hotels around europe and the serrano stood up to them all. as soon as we pulled up into the car park we knew we were on a winner. turquiose sea to the left and the alluring reception area of the hotel to the right (also, the taxi driver who drove us to the resort from the airport told us we were staying in his opinion, the best hotel in the area!) on approaching the trendy reception area, we were greeted by really nice staff who were more than helpfull. our room was fantastic. very…", "date": "July 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r8382687", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent, Perfect, Definatley go back", "review": "This hotel was PERFECT. Always very clean and tidy.  Check in. We arrived early but the room was ready for us anyway. Reception were very nice and helpful. All staff spoke good english and we received a very warm and genuine welcome.  The room. Was amazing. Its had everything we wanted. The bathroom was fantastic, lovely size. VERY clean. The room was very large and had plenty storage. Very nice balcany overlooking garden and pool. Our bath did not work (we could only have a shower) so I queried this (didnt know whether it was us not doing it properly) and within 10 mins there was a maintinance man at our door to fix it. It was fixed in no time and they didnt mind at all.  Pool. Beds were easy to get and pool towels provided. Had all the facilities stated and all were very high…", "date": "July 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r8141484", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Let Down Badly :(", "review": "The Serrano Palace cancelled our Holiday with them 36 hours prior to take off from the UK due to over booking. We were told that this is not unusual for this hotel - it is their policy to overbook by 10% even though we booked only 5 days in advance with lastminute.com. Bags and Baby packed and nowhere to go. Can't tell you how disappointed we were with them. No compensation offered. ", "date": "August 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r6015176", "sub_review": {}, "travel_purpose": "", "rating": 1}, {"title": "Excellent value, service and catering", "review": "High quality facilities in a quiet, but very central ( to the main beach area)position, above average construction. The marble flooring throughout, and the air conditioning helps to make it a very comfortable environment. Very competant service from the reception, waitresses and room maids, prompt, polite and efficient  The quality and variety of the food was exceptioanally good, very wide choice to suit all tastes with plenty of options for children; mixing traditional Majocan fare with continental and English options;l and the self service / buffet style suits very relaxed dining.  The pool and grounds are well maintained and all the facilities are spotlessly clean. The hotel do provide some entertainments but it is all very 'low key' and refined which leads to a very relaxing…", "date": "July 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r5611475", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Serrano Palace - Not harsh but fair.", "review": "We have just returned from a week at this hotel. We got a late deal that included transfers by taxi from the airport and also booked a sea view room before leaving (a good deal at £140 because people who upgraged on arrival paid a lot more). The  staff were efficient but assumed you were German as the hotel and this area of Majorca is German dominated. Although English is not spoken fluently, we got by without any major problems (you are in a foreign country so why expect everyone to speak english?).  The room was large, clean and well appointed (in other words much better than expected)with a balcony that had two sun loungers and a very nice sea view (well worth the extra). We stayed on a half board basis and the food was well cooked but perhaps not as varied as we've…", "date": "July 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r5479869", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "A good allround option", "review": "I stayed at the Serrano Palace with my girlfriend over the long Easter weekend. As several other reviewers have done we purchased our flights, car hire and hotel through a web provider and obtained as far as I was concerned a cost effective package.  We arrived at the hotel during the afternoon of Friday after a good drive from the airport which was about 80km and took just over an hour. I didn't encounter any problems with finding the hotel as long as on entering La Ratjada you follow the signs for Son Moll, (the beach). The hotel is located opposite the beach on one side of a small car park.  On checking in we were taken to our room which was very spacious and spotlessly clean. I agree that this hotel wasn't ultra modern, 5 star luxury but everything was in good working order…", "date": "April 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r5012765", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Relaxation at its best", "review": "We stayed at the Serrano Palace for a week. A summary of our views is: STAFF - very friendly and helpful. ROOMS - the cleanest I've ever seen. Cleaned twice a day and chocolates left on your pillows. Spacious, well decorated, with great balcony and sea view. FACILITIES - great pool (again very clean), plenty of sunbeds, a great spa area & gym, good bar. PRICES - pool bar is expensive so take a quick walk along the front for lunch. LOCATION - amazing. It's a long trip from Palma airport but worth it. The beach is less than a minute away and it's five minutes walk to the centre.  Would highly recommend this hotel. ", "date": "July 2005", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r3910141", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Luxury break", "review": "A last minute holiday without the kids! A great hotel feels very luxurious the minute you set foot inside and walk along marble floors. Room was very spacious and reclinig chairs on balcony very relaxing. Pool area was spotless no need to reserve sunbed as plenty were available even in height of summer. Pool towels available from pool bar on a daily basis. Food was buffet style but remember to take long trousers for evening meal as dress code is strict! Delicious food and a varied menu. Mostly German guests but low key entertainment/activities also in English. Resort itself is refined and an evening stroll along the promenade to Cala Ratjada itself a delight! Would go again tomorrow! ", "date": "August 2005", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r3832822", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Just Chill Out", "review": "Background - 2 adults and 2 children (16 and 14) in adjoining rooms.  Usually quite active on holiday but stressful lives (OK, don't we all) meant that we were quite happy to take a chance to rest.  Didn't think we'd manage more than a day or two before seeking other activities but the hotel lets you take life at a slow pace. Rooms - very clean, well prepared and reasonably well maintained. Food - I'd go along with other reviews that this was the only slight draw back.  Buffet style can often be disappointing and although there was variety it was not quite up to standard.  The heavy German influence was there as well (plenty of English food but also lots of sauerkraut). Pool - excellent! never particularly crowded and bigger than it looks on the website Resort - just right.  We…", "date": "July 2005", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r3781635", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Manager kipping in our room", "review": "We have recently returned from the Serrano Palace and would say that in general it makes for an excellent holiday. The resort is nice, the beach over the road is lovely if a little busy, the hotel rooms are good and the choice and quality of the food is excellent. The only hiccup on our trip was that on arrival, we were given the room keys only to catch the manager with his trousers down kipping in our room (no joke!). However, we actually found it quite amusing and got a room upgrade in the bargain. ", "date": "August 2005", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r3756919", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Not quite a 4 Star", "review": "The Serrano Palace is very clean and very quiet - the entertainment guy had the easiest job in history. We had two rooms ajoining for myself, wife and two children. I can not fault the cleaniness of the Hotel it was spotless. The rooms were reasonably maintained but we did have a few items go wrong in the boys room. We went half board (breakfast and evening meal) which would have been fine if the choices were there - the food was, to be quite frank, awful. I know this is the height of the season but surely this is when hotels should excel. The pool was small by normal standards but the lack of people using it made it like our own personal pool. After the 2nd night we ate out - the resort is nice - very very German and not many English speaking. All menus are in German and…", "date": "August 2005", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r3751155", "sub_review": {}, "travel_purpose": "", "rating": 2}, {"title": "Value for money", "review": "Booked this holiday the week before we travelled via an internet holiday company we have used many times and have never been disappointed.  This was no exception.  The hotel is just about five star.  My only criticism is that our room overlooked a garden at the back of the hotel where there was a german bar opposite with a large screen for viewing sport.  As Germany were playing in a football competition that week it was rather noisy at night until between midnight and 1am.  As we like to sleep with the window open this disturbed us somewhat.  We did request a move to another room but the reception were not very co-operative and kept telling us to ask again tomorrow - and, as you know, tomorrow never comes, especially in Spain! As we were only staying a week we had to 'put up…", "date": "June 2005", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r3635440", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "fab hotel", "review": "After reading some of the other reviews i wanted to share my opinion of the hotel as i think that it must have impoved since some of the older reviews. We found the hotel to be of a very impressive standard. the standards of cleaning in the rooms were great -fab towels, great air con, good bbc channels, beds and bath robes- and choc on pillows at night! and we were lucky enough to get a see view balcony which made all the difference- probably the difference between if you think the hotel is worthy of 5 stars! ( i suggest coming up with a line such as 'need room to be away from reception and roads might mean you also get one at no extra cost!- other wise you can pay for one). the hotel itself was faultless, take some books and chill out by the pool also highly recomend taking a…", "date": "June 2005", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r3621215", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "pure pleasure", "review": "my partner and i booked this holiday on teletext and got a great deal. it was just a pleasure to stay there nothing was a problem for the staff. it was mostly german tourits at the time but we were by no means ignored or treat any different.  the nightlife was mainly german orientated but it also meant you had nobody hasseling you once they knew you were english. hotel rooms were lovely and we were presented on our first morning with a large basket of fruit, plates napkins and champagne. the pool was spacious and there was also a large seating pool area were staff catered to your every need. i would love to return for a really relaxing break.   oh and the hotel still sends a little christmas card reminder each year. ", "date": "May 2002", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r3620594", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "A really lovely stay", "review": "We recently came back from the most wonderful stay at the Serrano Palace.  We didn't know anything about the resort or the hotel and turned up to be really, really suprised - it was fantastic.  The room was immaculate with the most stunning balcony overlooking the pool and the sea.  We were greeted by the most friendly reception staff who bent over backwards to help us.  The only slight drawback was the dining area - don't ge me wrong - the food was fantastic, but it was very, very quiet - you could only hear the sound of cutlery clinking but that was a very small price to pay for a lovely stay and admittedly we went in the low season.  The resort itself is really, really stunning.  We are English, and it is very, very Germanic, so if you want to go somewhere full of Brits or…", "date": "May 2005", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r3457132", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "A detailed review of the Serrano Palace and surroundings.", "review": "Welcome to Majorca! If you want a detailed review, read on amigo...  The Hotel Serrano Palace is located in the resort of Cala Ratjada or Cala Rajada which roughly translates to Bay of Rays.  To get to the hotel from Palma airport, you can get a taxi... It will take you 1 hour 10 mins to get to Cala Ratjada and this will cost you 66 euros exactly. That's quite a lot of money just to be spending on transfers so try to get the transfer included in your holiday booking. If you do, you'll save yourself 132 euros!  The hotel is situated across the road from a little beach called Son Moll. Here there are some bars and restaurants where you can sip a cocktail or have lunch by the sea. I recommend the Malibu bar and restaurant. The food is very nice and the people are really friendly in…", "date": "April 2005", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r3429604", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Loved it", "review": "Me and my husband just came back from Mallorca and stayed in Serrano palace. I was a bit nervous about the food as I have read reviews here to say it was bad. I can only say it was very good dinner. Yes it was buffet style and you do not ge many 5* hotels with this. but It had a good rance of salads, oils, vinegars, cheeses, fruit, puddings, ice-creams. 2 types of cooked (with sauce) meats, 2 fish. 1 type of roast meat, and then a kind of area with a grill where they have either fresh meat or fish every night. veggies, veg option, and poatatoes never chips. Me and my husband thought it was very good and will definetly go back as rooms, and service couldn't be better. We also hired a car for the week and I phoned the hotel b4 and asked about parking facilities and there is an…", "date": "June 2004", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r2506817", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Fantastic Holiday", "review": "I have just returned from a 5 day break at the Serrano palace and have to say it was just fantastic. The holiday is spotlessly clean, the rooms are big and nicely decorated. the holiday has lots of facilities which were all open and were not over crowded. The swimming pool was warm and clean with plenty of sunloungers - yes, the hotel was also full - so this wasn't because the hotel was empty. Staff at the hotel spoke good English and the food was exceptional. I would highly recommend this Hotel and can't wait to go back. Yes, Cala Ratajada is mainly German, but they were very friendly and all the bars in the town catered for the English as well. The town has a nice high street with 2 - 3 nightclubs which were still going strong at 5am! if you are considering the Serrano Palace…", "date": "April 2004", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d272971-r2218178", "sub_review": {}, "travel_purpose": "", "rating": 5}]