[{"title": "Ok", "review": "Plenty of meaningful activities, very clean, and improving their appearance as always for their members. Great place. You can find a class for any age,and interest. The teachers for the classes work hard to teach you. ", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g47729-d281639-r676578486", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Great facilities, great staff", "review": "Had to spend a couple of nights here while attending the US Open. Just a stop away on 7. Staff was fantastic. Booking.com wanted to charge me 30dollars more a night than booking with YMCA directly. Had a single room. Like being in a college dorm, bathrooms down the hall. Had key for bathroom. Was clean. Air conditioning worked fine.  I used bathroom and shower  in the gym pool area rather than the bathroom on my floor. They were cleaner, water pressure better and more private.  I wouldn’t hesitate to stay here again. Not the Ritz but clean, safe spot to rest my head. I’d book with YMCA directly to save money.", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g47729-d281639-r638991326", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Very Convenient to Attending US Open - Not Fancy but a Place to Sleep ", "review": "This is a small, basic room at good price for New York City, located in downtown Flushing near the train and lots of restaurants.  There's a shared bathroom, and you can have use of the pool and athletic facilities, which is a nice plus.  The room was OK ... about what I expected, fairly noisy (thin walls, on a busy street, etc), acceptably clean, nothing great -- but the price and location are good and I'd recommend this place if those are your main priorities.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g47729-d281639-r615792218", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "decent for the price", "review": "The location is not particularly great, but it is in a good neighborhood with lots of Asian restaurants. It is few blocks at the end of the 7 line in Flushing. Unlike the reviews of other Y’s in the city, the front desk staff here is pleasant and helpful. The cleaning staff is even better! I used the gym and pool and that was nice. The room was small and very basic, but it was clean. The noise from outside was a bit too much, but NY is noisy, everywhere... this is a budget choice with shared bathrooms and an array of characters in the other rooms, so don’t have any expectations, other than a basic room for a low price.   ", "date": "November 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g47729-d281639-r574203543", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Great staff, clean rooms", "review": "This is my second time staying at Flushing YMCA. I had no issue both times. The room is small but you get what you pay for. Bathroom is shared is cleaner especially the men's. The improvement is that it was getting clean everyday. Excellent location close to Main subway about 10min walk through Chinatown which provide lots of food selection.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g47729-d281639-r440990565", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Good Price and Excellent Location", "review": "This is a shelter on the fourth floor and, supposedly, tourists on the third floor. The walls are thin, rooms are very small. I m currently staying next to a woman who speaks on the phone until 5 AM. I believe she spends the night awake and sleeps during the day. I complained, inquired whether she was a tourist, they have told me she' s a tourist. This will be my last time at this place. Employees try to be helpful but perhaps this is more a shelter than a hostel.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g47729-d281639-r419609028", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "You get what you pay for", "review": "Stayed for 3 nights.This is the cheap option available in NYC at around $75 per day. well connected with local city buses and metro station.Very good option for those who opt for site seeing by take tours or tour for fun as there buses pick up location is about 600-700 meters far from ymca flushing.Lot of restaurants in nearby area. The only disadvantage was the common bathroom so every time you have to open the lock and go otherwise ok", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g47729-d281639-r415713092", "sub_review": {"Rooms": 1, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled solo", "rating": 2}, {"title": "Best budget accomodation", "review": "The credit card machine doesn't work, so I HAD to pay cash, meaning I had to use their atm machine and getting money from my bank account which is NOT on my plan at all. But since the weather was so cold, I am exhausted and had no energy to look and move to different hotel/hostel, I decided to live with it. I even willing to accept the strange smell in my bedroom, which is still a mystery to me.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g47729-d281639-r374408665", "sub_review": {"Value": 4, "Location": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "good hostel, best budget option in nyc", "review": "Had a single room, nothing fancy but ok. Didn't see any bugs at least. One closet and small fridge, which was nice. Toiset and shower on hallway. Showers were quite taken and dirty at times. Not noisy at nites. ~10 min walk to subway and ~ 30 min ride to Mh.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g47729-d281639-r345219998", "sub_review": {"Location": 3, "Rooms": 2, "Service": 3}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "May 2015", "review": "This place repeatedly accepts reservations, confirms the reservation then when you show up they say they don't have any rooms left. The need an ADULT in charge of the guest-room bookings the kids they have don't know what the hell they're doing!", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g47729-d281639-r338458768", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Booked", "review": "Booked room at the Flushing YMCA in August 2015, paid online and upon arriving  to check in in September of 2015r, saw a chaotic picture. Front desk had mixed papers, food in front of him and was not able to find my reservation. His computer was also  not working. I stayed without booked accommodations.  Next day, despite of the fact that my account showed money transfer to the Flushing YMCA for booked room, manager of the Flushing YMCA refused to process return. Will never come back to the Flushing YMCA.", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g47729-d281639-r325099667", "sub_review": {"Value": 3, "Sleep Quality": 2, "Service": 1}, "travel_purpose": "Traveled solo", "rating": 1}, {"title": "The Flushing YMCA The worst ever experience", "review": "My room was facing the main road ,the lacation was great i got a map of flushing ,places , to go ,eg dinning, subway ,buses ,taxi parks, there was a marcys walking distance and other shopping area, at the subway station there are maps to tell you which train go were eg it was one train from flushing go to time square.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g47729-d281639-r324697343", "sub_review": {"Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "No proper public transport from this place", "review": "YMCA in flushing is on main northern boulevard and about 10-15 min walk from last stop of 7 line subway train (Main Street station on Roosevelt Ave and Main Street).   Staff is helpful. Room just big enough with shared bathroom and toilet. Neat and clean. Bathrooms were clean every time I went there. So all good.  Deli close by and loads of eating places in a china town equivalent hardly 5 min walk away!  Pool and fitness area is amazing.   Internet is free too although Skype call function etc may not work :) restaurant is good too.   ", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g47729-d281639-r316913448", "sub_review": {"Location": 2, "Sleep Quality": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good option in flushing with super pool and fitness area", "review": "I had stayed at this place last year, and had a really pleasant experience! Unfortunately, this time it was the complete opposite. I had the misfortune of arriving here late at night to check in, despite their website saying 24 hour check in. The front desk guy (who didn't even know what day is was...) said they had overbooked and someone came in earlier than me and they gave my room to him. After telling him the reservation is meant to hold my room, he said that they overbooked and there were no more rooms. I told him I had no where else to stay, so he said I can sleep in the reception area. I told him I didn't reserve a room to sleep in reception. He gave me the managers details so I can contact them about the issue (manager's name is Fifi). So I ended up going across the…", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g47729-d281639-r316704839", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Terrible - They don't hold your reservations", "review": "A good compromise...it is a basic guest house for people who look for an accomodation very close to the US Open Tennis venue during early September.   I find it really strategic because it is one stop from Metz Villet Point.   The WIFI did not work well...  Nevertheless, please be aware that you will find a shared bath and a really small room....", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g47729-d281639-r309207801", "sub_review": {"Location": 1, "Rooms": 1, "Service": 1}, "travel_purpose": "Traveled solo", "rating": 1}, {"title": "Basic Guest House", "review": "I was travelling my myself after returning from Miami, on my way to University to Study Abroad for a semester, so I had a lot of luggage. Flushing isn't the safest area in New York, so I felt rather vulnerable. I had heard of YMCA hostels and 4 weeks before arriving, I thought I should reserve a room to ensure I had a place to stay. Upon arrival, I was told by the rude receptionist that my name WAS on the system (I'd paid a booking fee) but the hostel was overbooked, therefore I could not stay. She then rang other hotels across the road, expecting a student to pay $150 dollars a night! I then got very annoyed and she ended up calling her manager who said I could stay in 'someone else's room'. The room itself was clean and tidy, but I swiftly left early the next morning. Would…", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g47729-d281639-r308926360", "sub_review": {"Sleep Quality": 3, "Rooms": 2, "Service": 2}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Affordable and safe ", "review": "I've been very disappointed with the hostel I've booked, the \"Flushing YMCA Hostel\". When I arrived at the place at around 9:30pm, a person greeted me, the let me wait for 20 minutes. Only then he told me,that the place had been overbooked, apparently because of some school kids who had arrived at the place a few days ago. I was disappointed,  obviously, as that certainly shouldn't happen if you've booked the room and have already paid a booking fee! Furthermore, the person at the reception wasn't even able to refund me the money, as he pointed out. All in all, a very disappointing experience and in my view extremly poor service, even for a hostel!", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g47729-d281639-r302579113", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Bad service/organisation at Flushing YMCA Hostel", "review": "We've been to YMCA hostel last year in August and we spent there more or less 10 nights. Room was \"almost clean\", very basic, equipped with AC (not working), TV and frifge; staff was nice. Location is Chinatown, far away from Manhattan (1hr by train), train stop is 10 min walking.  Reception open 24/7, breakfast poor and low quality.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g47729-d281639-r290800129", "sub_review": {"Service": 2}, "travel_purpose": "Traveled solo", "rating": 1}, {"title": "Not bad not good....", "review": "Very friendly employees. You have access to the Y facilities. Clean rooms. Bathroom flooded a couple of days due to leak in shower area. I called downstairs and they mopped it up. Sharing bathroom on floor is troublesome when others don't practice good hygiene. More frequent bath checks definitely needed, especially overnight. I will stay again because I have to travel often and need to be mindful on my budget.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g47729-d281639-r277730273", "sub_review": {"Location": 2, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Good Place to Stay on Shoe String Budget", "review": "Located in an Asian neighborhood with dine-in restaurants, fast food, and a convenient store nearby. 10 min walk away from subway. The room Itself is ok for the price. There is a mini refrigerator and a small tv in the room. Microwave is not in the room but down the hall. Heat and ac work well. Downside is that the restroom / shower is shared and outside the room. I would recommend to anyone on a budget who is going to be out enjoying the city anyway. Felt safe here and would come back. ", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g47729-d281639-r265767881", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 2, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "good value for money", "review": "Booked through hostel world and arrived to find that the room was no longer available. This was during the tennis at queens so get the feeling that they had re-sold the room to make more money. Staff em ember was unhelpful and having contacted the hostel via email to claim back the extra expenses we were forced to incur have found them delaying our complaint and now the emails are bouncing back, I would avoid this hostel if you actually want somewhere to stay for the night.", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g47729-d281639-r240530086", "sub_review": {"Value": 5, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Cancelled with no notice", "review": "I stayed here for 2 nights in late September. I took the subway from Times Square to Flushing, then walked for about 20 minutes to the hostel. Hostel was great. The lady at reception gets 5 stars!! She was friendly and helpful, and as she was helping me people kept coming up to her asking for things (keys, towels, info, etc), and she answered every query with a smile, and helped me out with a smile as well. I would have gone insane in her place! I stayed in a private room on the third floor. The bed was a little hard, but by the second night I got a little used to it. The room had air-con, cable TV, closet, and was clean. They give you two keys that look exactly the same. One key is for the shared bathroom, the second for the room. The keys look identical, so if one doesn't work…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g47729-d281639-r232673738", "sub_review": {"Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Great place!", "review": "We stayed here for a few days as we were moving in NYC and in need of a place to lay our heads down for a few days, if it wasnt for that we would not have stayed at the Flushing YMCA at all. Its a 10 min walk from flushing main street station and a short walk to citi field and the us open if your heading there. Where to start well on the plus side the staff are friendly and do what they can for you.  We had reserved a room with a queen sized bed and were greeted with a room with 2 beds. Not good for a couple. The room itself was clean, the bathroom on the other hand my other half seen ants crawling across the floor in it. She was shocked to see this. The flat screen 27 inch TV that was in our room did not work at all, it turned on but the picture was frozen on every channel.…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g47729-d281639-r226633505", "sub_review": {"Sleep Quality": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Noisey, creaky beds and not that clean not what you would expect from the Y", "review": "My reservations were cancelled without warning. I called the Y to confirm my reservations 9 days before my trip and they said they routinely overbook and cancel reservations without calling the guests. They never called me and said there were 5 other guests who would just be told when they show up to check in. I talked to the supervisor and her manager-> same story. They have a booking problem. Hotels.com shows they have 2 available rooms still, but they say they were overbooked by 6 rooms (for the week before the US Opens in August). Since you cannot be sure you will have a room when you arrive, I would recommend this place to stay.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g47729-d281639-r225896094", "sub_review": {"Location": 3, "Rooms": 1, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Pleasantly Surprised", "review": "I stayed at this YMCA and have to say it was not a bad place to stay for the money. The room was clean and the bathroom was clean. Also the staff was very friendly and within walking distance to the subway. I plan on staying here again when I visit NYC.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g47729-d281639-r211149975", "sub_review": {"Value": 5, "Location": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Great place to stay if you're on a budget.", "review": "For the price, it's very hard to find a cheapest room ! Rooms are basics but clean, equiped with TV and refrigerator and it's shared bathroom (one per level) for everyone. It's located in the Chinatown version of the Queens, approximately 30/35 minutes from Manhattan by metro (line 7). Staff member were very nice during my stay but the breakfast is limited to just a drink (coffee or tea) and one kind of cakes.", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g47729-d281639-r205273638", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Good place for budget travellers", "review": "This was my third stay at a New York Y.  When compared to the YMCAs near Central Park and the U.N., this YMCA is my new favorite -- mostly because of its small size, and community atmosphere. The front desk here is very friendly. There is a sign near the employee timeclock near the elevator that reminds the staff to say \"hello\" and smile to everyone, and the many, many hellos during my stay were genuine and welcoming.  I did not use the indoor pool nor basketball court, sauna, nor gym facilities -- but that stuff is there if you wish, and it's included in the price. The shared washroom near my room was fine. The 3 showers were fine - each curtained for privacy.   There are not hordes of students nor tourists staying here - it's more adult friendly.  And I love the Korean/Asian…", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g47729-d281639-r202757210", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Budget lodging at the YMCA", "review": "This hotel is really cheap for NY so we didn't expected a palace BUT :  We payed for a service and nothing was right : first, the last constumer keep the key (enjoy the security ...) and they promise us to make an other one for us but they never did (they always answer \"it'll be done in a hour\" and then \"we can't do it\"). So we had to wait somebody every time we wanted to go back in the room. The room didn't fit with the picture (there is maybe just one room like this !) It's a commun bathroom and the curtain hide nothing and it's dirty (a toilet was always obstructed). They never clean the room and change the sheet (we stayed 2 nights) The wireless is available just on the first floor and don't works very well (they had to reboot it often) The staff don't speak english very…", "date": "March 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g47729-d281639-r155926819", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Flushing YMCA New York", "review": "I needed a cheap place to stay that wasn't a shared dorm and close to the US Open tennis site. This place was ideal. It was less than a 10-minute walk to the subway #7 line which was then just one stop to the National Tennis Centre (and a straight shot into Manhattan in about 1/2 hour)  The neighbourhood itself is very much like being in Korea with lots of Asian shops/restaurants around but that just meant there were usually people around so felt safe.  The YMCA itself was basic but it was comfortable. TV in the room with an a/c that worked fine. Get a room with a sink in it so you don't have to go down the hall to the bathroom.  It was mostly clean and the staff were mostly friendly. The internet didn't work in the rooms tho and try as I could I couldn't get any signal in the…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g47729-d281639-r122603373", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Ideal for attending the US Open", "review": "Wow.  I have traveled quite a bit, and wow, this place is unbelievable.  The pro is that it is very, very affordable.  The staff do try.  Ok, here is the rest of it.  There is NO parking available.  There is street side parking, which is incredibly difficult in Flushing.  Next, this was for a single room.  In order to get to the room, I had to go through a maze.  The hallways had a musty smell.  There is 1 common bathroom for men for the floor, and 1 common bathroom for women.  The room was a single bed and it was the smallest room I have ever seen.  It might have been 10 feet long and maybe 3-4 feet wide.  There was a bed, a TV on top of a fridge, and a small closet.  The window would not close so we had moths in the room as well as the sound of a loud generator all night. …", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g47729-d281639-r120483831", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "A story to tell people.....", "review": "Stayed at the flushing YMCA for 2 nights whilst in new york. It is just outside queens near Korea town. It was nice to stay here and see a different part of new york with all the Asian restaurants etc and not far from the main st subway. It takes about 20 mins on the number 7 train with the diamond sign/ 40 mins on number 7 train with circle sign on to get to times square.  Rooms were just what we needed with double bed, tv and mini fridge. You get given 2 keys so have good security!  One key for the door for the floor which ur staying on and then a door for the showers and toilet etc. Toilets and showers are shared just down the hall to your room. Staff were very helpful and let us store our backpacks when we arrived early before check out. Overall good experience and would…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g47729-d281639-r118747673", "sub_review": {"Value": 5, "Location": 2, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Ideal for cheap place in New York with helpful staff!!", "review": "Booked in for two nights at this YMCA in Flushing and it was just right.  Good private, double room with shared bathroom facilities.  Spotlessly clean accommodation provided by very good and friendly housekeeping staff and a great on-site cafe. Good, frequent No 7 train direct into Times Square taking around 30-40 mins. Coming out of the station on Main Street, Flushing - walk down Main Street away from the overhead rail bridge and when you get to Northern Boulevard take Right, past the Quaker Meeting House (Large Notice is on the Right) and the YMCA is lit up directly ahead on that right hand side of the road.  Would definitely stay here again.", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g47729-d281639-r118734359", "sub_review": {"Value": 4, "Location": 3, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Depends on what you want!", "review": "I had to stay there for the new years because I couldn’t find a cheaper one that was closer to the subway. Honestly, It was the worst staying experience I had. I don’t know where to start. First of all, it is not a hotel, it is a hostel. I booked it knowing that it was a hostel. The rooms do not have a bathroom. There are 2 restrooms 1 for gentlemen and 1 for ladies on each floor. In the restrooms there are 2 disgusting toilets and 2 beyond disgusting showers. My wife said that ladies room was at least acceptable comparing to mens. The name of the hostel is flushing but its toilets are not flushing at all. The rooms were filthy and as small as possible. There was a 5 inch tv in the room. The blankets were so smelly that I just hid it in the wardrobe. We slept covering the sheets…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g47729-d281639-r116080074", "sub_review": {"Value": 3, "Location": 2, "Rooms": 3, "Cleanliness": 1, "Service": 2}, "travel_purpose": "", "rating": 3}, {"title": "Ever, never never never...Don't flush your money...", "review": "We couldn't find a good and cheap hotel in NY for a while.When entered YMCA official website we finally decided to book a double room in Flushing (price on that site is much lower than on the others). The hostel was located in very interesting and safe area filled with great Korean/Chinese restaurants. It took 30 mins. to get to Manhattan (purple line 7 goes 24/7). Our room was quite big. We had lot's of channels on tv. Staff at reception was very nice:)We could use swimming pool, basketball court, sauna (we just couldn't find time for that).Room service every day. All together-nice place to stay if you are travelling on budget.", "date": "January 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g47729-d281639-r92213872", "sub_review": {"Value": 1, "Location": 2, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Very nice stay!", "review": "Stayed at the YMCA in Flushing for two nights Fri-Sun.  My room was on the third floor above the basketball court which was somewhat of a downside since you can hear the balls bouncing in the morning, If I stay again I would have to be on the fourth or fifth floor.  Room was clean, no bugs, just smelled a little strange but room had an air conditioner which helped.  Front desk staff was fantastic and super friendly, they do have storage to place your items after checkout in case you don't want to haul it while you are out.  They do have internet but it only works on the 1st floor I did not use it during my stay so I don't know how good service was.  They also have a cafe with coffee and snacks on the 1st floor-Cash only.   Easy access to Manhattan 40 min or so.  Overall perfect…", "date": "October 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g47729-d281639-r85071570", "sub_review": {"Value": 3, "Location": 2, "Sleep Quality": 3, "Rooms": 2, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Acceptable and Inexpensive", "review": "It a pretty cheap hotel situated in ChinaTown-Queens. Rooms have a TV and a refrigerator. The only inconvinient is that there is only onre restroom per each level. You can get very easy there...using the 7th line(purple) of metro. From Grand Central it will take exactly 30 minutes by metro. ChinaTown is very quiet and those chinese are very funny and friendly...but if u want to ask something u might have the surprise to get an answer in chinese :) Enjoy!", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g47729-d281639-r81279021", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Budget NYC", "review": "For $72 a night for a private room in New York, we are really only expecting a place to sleep. We book this place simply because this is the cheapest we can find. It's a 40 mins trip to Time Square, but subway comes every 5 mins, we found it quite convenient and cheap too, $2 for a one way trip, $7 for 4 trips. Room is small, half the size from what we saw in others photos, can bearly turn around with our suitcase on the floor. Tower is provided and clean. There's aircon, fridge & TV in the room, we enjoyed all the old TV shows. Free wi-fi in the common room, had fitness room, we didn't have time to use it. I'm ok with the gals bathroom & shower, but my boyfriend says the mens toilet was blocked and shower curtains smell like sweat. Hotel staff were helpful, the guy on night…", "date": "December 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g47729-d281639-r23535921", "sub_review": {"Value": 4, "Location": 2, "Check in / front desk": 4, "Rooms": 3, "Cleanliness": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "OK place for the price", "review": "This hostel is good value BUT DIRTY. $35 per person for a private room. Two of us stayed there. When I got to my room i checked my bed and there were PUBIC HAIRS all over it. I went downstairs and asked the front desk to change the sheets for when I come back. I went out, and to my dismay they were still there. By that time it was too late to have them changed, so I just slept on top of the blanked and wrapped a sheet around my pillow cover as, if they haven't changed the bed sheets they definitely haven't changed the pillow covers.  Its also is pretty far from Manhattan. It takes about 40 mins by the 7 train. MAKE SURE YOUR SHEETS ARE CLEAN FIRST AND DEMAND A CHANGE.", "date": "October 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g47729-d281639-r21557583", "sub_review": {"Value": 5, "Location": 4, "Check in / front desk": 5, "Rooms": 3, "Cleanliness": 3, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Value if you don't mind filth", "review": "The Flushing YMCA is an ok stay. I ened up staying here due to a 23 hour layover on my way to Bermuda.  It wasnt what I was expecting but at least the rooms and bathrooms were clean and the people were EXTREMELY FRIENDLY.   The only thing that really stuck out like a sore thumb to me was the fact that there were shared bathrooms and you needed a key to get in. They supplied you with the key but I would have been much happier had there been a bathroom in my room. But over all if you're working with a small budget  its a decent CLEAN place to stay. ", "date": "April 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g47729-d281639-r15284869", "sub_review": {"Value": 2, "Location": 3, "Check in / front desk": 2, "Rooms": 3, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "ok stay", "review": "I recently stayed here for 7 nights.  Good- very cheap, you get your own room, fridge and tv in room bad- quite a trip about 25mins by subway, need to make sure cleaners vacuum the floor if staying longer than 3 nights  I had a good time, nice friendly staff- where else can you stay for seven nights in new york for just over $400 ", "date": "May 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g47729-d281639-r7696515", "sub_review": {"Value": 3, "Location": 1, "Check in / front desk": 5, "Rooms": 3, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 1}, "travel_purpose": "", "rating": 2}]