[{"title": "Definitely defne", "review": "We arrived late at night and the check in was very quick, and the night receptionist was very helpful and kind. He offered us a drink and as we had missed the evening meal, he told us that food was available in the restaurant if we wanted to go there. The room was comfortable and clean with a small balcony and a large walk in shower, and shower gel and handwash was available and kept topped up throughout our stay. There was also a ceiling fan and the air conditioning seemed efficient. We also got a little souvenir bag each, big enough for a mobile phone, and the room card. Later on they also left a large beach bag, unfortunately this was about 3 days before we left! Rather than leaving guests to decide when they want clean towels, two bath towels and two beach towels per person are provided each week and I thought that this was a good way to care for the environment. Maid service was great, but none on Thursdays. If there was a negative with the rooms I would say that the decor is very tired and needed redoing throughout, but obviously we only saw our room. There was a picture on the wall in plaster of two mermaids which looked like it had been done by a child - really bad. The dining room is massive, and you get allocated a table on the first day, which seemed to work well, and our waiter Ramazan was lovely. The service is good, the waiters and chefs are all really nice, and the food was always really nice and varied. Pancakes every day for breakfast are amazing. Although there is an all inclusive option, we had half board with unlimited drinks, which for us was fine, but there is only one cocktail on the list which is free, all others you have to pay for, which I didn't think was good in a hotel of this size.Service throughout the hotel is generally good, most of the staff are friendly and helpful - obviously there are always one or two who are not so great, but they are in the minority here. The hotel itself consists of a number of different blocks and generally the décor in the public areas is good.  The grounds are very big. The gardens all needed a lot of attention, there didn't appear to be any gardeners around which was strange, because the hotel grounds could look a lot nicer. In the whole two weeks we were here we only once saw the lawn mowed. The pool is lovely, really big, and there were plenty of sunloungers. The hotel has a policy of not allowing reservation of sunloungers by leaving towels, but Germans will be Germans, and this did happen to an extent, but you don't have to be up at stupid o'clock to get a decent place. There was plenty of space on the beach as well. The animation team is good but surprisingly unobtrusive. The absolute standout star of the animation team is Kenny, he really makes that team. Plenty to do if you want to join in. Evening entertainment good as well. There is also a spa and games room, you have to go and find them though, there is no one badgering you to have a Turkish Bath here. Location of the hotel is good, about midway between Kumkoy and Side, where the main shops are, either is in walking distance (it is a nice walk along the beach to Side in the evening). Or you can get a dolmus or a taxi. Very busy road outside, and there are bars and shops just opposite the hotel.  Would recommend to take Euros at the moment because the exchange rate for the Lira is not good. What seems to have happened is that the prices in the shops are in Euros and if you want to pay Turkish Lira, they work that out for you from Euros so you don't get a good deal. Only one drawback on our last day, we had a night flight and had to leave our rooms by midday which is normal. We originally asked to keep our room on til later, quite happy to pay, but were asked to come back after breakfast on our last day. When we did we were told the hotel was full (don't believe it was) and we couldn't. Would have been happy to accept this if the daytime receptionist's attitude was better, he wasn't particularly nice about it, or helpful. Ended up using the shower in the spa.  I have stayed in a lot of the hotels in this part of Side, and this hotel generally is a good one. Is it my favourite? - No. Would I stay here again? Yes, definitely…", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d304606-r615417164", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "\"Where the holidays begin\"", "review": "That´s the slogan of the Defne Star Hotel - true enough. The hotel has been given a facelift lately, the rooms are spacious and nicely furbished. They are very clean, the room service is good. We were a bit annoyed, however, by the fact that the rooms are not cleaned on Thursdays. Coming into our room we felt made really welcome, there were toiletleries, four large sun towels, a bag, two caps and two souvenir cups. The food was good ( buffet ), the waiters very friendly. If you are prepared to tip them nicely you will be seated at a table outside on the terrace. The dining-room is not very inviting. The gardens are wonderful , you can always find a place in the shade. The atmosphere in the grounds is relaxed, the situation at the beach is not as not only the guests of the Defne Star come there, there are three hotels of that chain, and all their guests want to find a deck chair at the beach. The hotel is a favourite with Germans, Austrians and Swiss people, so English speaking guests may find thingsof the  a bit difficult. Only the night receptionist was really kind and helpful, the ladies on day shift seemed to think that they are superior kind.…", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d304606-r249674420", "sub_review": {"Location": 5, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "They used to be better", "review": "Few years back they were much better - now in order to save costs they have amateur chefs thus the food is mediocre.  Like all all-inclusive hotels in Turkey, the beer is watered. For internet (WiFi) one needs to go to the reception area and the conenctions is rather slow.  The only positive thing is that the staff is friendly and the cleaning lady a treasure.", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d304606-r232009609", "sub_review": {"Sleep Quality": 3, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "turkey hotel", "review": "The hotel has recently been refurbished. It has been done to a high standard and is very clean. The staff are very friendly although they are not to use to english holidaymakers. 95% of the guests were german so the entertainment is mostly geared towards the germans. You should hire a car if you can because places are quite spread out, the busses are good and you can get then from outside the hotel every 10 mins, they go to places near by but if you want to venture out you will need a car. The food was lovely, always hot, plenty of choice, and as much as you want because it is buffet style, The hotel grounds are nice and has its own access to the beach which is clean, there are also toilets on the beach, You can walk 5 mins to gundogdu which has loads of shops full of snide gear. You can use english,euro,or turkish money, they take them all. The busses are paid in turkish leira…", "date": "March 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d304606-r127434728", "sub_review": {"Value": 5, "Location": 3, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}]