[{"title": "Nice hotel but in a middle of a busy tourist area", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d307674-r671531374", "sub_review": {"Sleep Quality": 5, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "New Year's vacation", "review": "The double room we stayed on the second floor was very clean, the bathroom was also modern and clean, and the hotel staff (who also runs the bar below) was nice. (There is no official reception at this hotel. You need to go into the bar for check-in and check-out.) The only problems we had were that this hotel is in the center of tourist trap in Istanbul and that the street was loud. You'll need to walk at least 10 minutes to find a restaurant that serves food at a local price (since all the restaurants around the hotel had prices double or triple the normal prices,) and the street was loud from early in the morning to late at night. If you are looking to party and hang out with fellow travellers, this will be a good place to stay, but if you want more authentic, local experiences, this is a place to avoid.…", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d307674-r648352881", "sub_review": {"Value": 5, "Location": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice Hotel", "review": "Small but cozy, very clean, friendly staff. We stayed there for 5 days, it's at a very central place, behind Ayassofia, from where you can visit easily all the hot spots in the old city. Although it's very central, it is really quiet. There's an Irish pub, Rounders, on the ground floor, with great local (and imported) beers and good music. I would rather like it more if it had an elevator.", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d307674-r547857227", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}]