[{"title": "disgusting", "review": "filthy rooms , bugs in room, under the beds not cleaned, raw chicken, cold food, absolutely disgusting tempted to ask for a refund , sooo disappointed , would bot recomend at all, ruined the holiday for me , turned my stomach!", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r629658606", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "We always come back", "review": "This hotel is a family hotel we It’s very etiquette nice and clean room good brekfast We are coming every year and get the same room every one now us every year R they improve th hotel  the place is very clean", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r554527366", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Good location, very good breakfast and friendly staff.", "review": "Very clean room, friendly staff and a very good variety of food offered in the breakfast.  The wifi is horrible because it is only accessible in the reception area, so no wifi from your room.    During breakfast we noticed that there were reserved tables for those who book on a half board basis.  We got the impression that those who book on a half board basis are given a better service than those who are on a bed and breakfast only.  This was unacceptable, in fact we got the worst seats in the breakfast because the best ones were reserved for those who are on a half board basis.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r505254563", "sub_review": {"Location": 4, "Rooms": 4, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "AC not functioning.", "review": "AC was not functioning so we could not sleep because of the heat Which ruined it a lot. The location was good though and only a 10 min walk to the center. Feels old and need of a renovation. Should install new ac ....", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r503618944", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Just magic", "review": "We found this a very good hotel. Plenty of tasty choices. Great pool though 1.7m depth throughout means it suits good swimmers. We loved this busy, some have said basic hotel. Ignore the negative reviews. Judge it yourself, the location and views alone are worth it. Easy access and yet off the main road. Plenty of parking. A very good kids playground and all a short walk to the centre of Garda. Just magic.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r497731481", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "BASIC 3 star", "review": "The sign of the hotel only lights half way. Great welcome.. the sofas in the reception look old. Hotel is fairly clean however i wonder whether the domestic staff bothered cleaning the shower shelf or whether she wiped the shower floor. Toilets were also far from spotless. The table cloths were never changed. The towels are paper thin and worse still I was once given a towel with a huge hole in it. All they supply you with is one bath and hand towel. Forget about coming out of the shower on a carpet.   Air conditioning was fine in the bedroom. Other than that it felt non existent especially in the restaurant which leads me to my food analysis. Breakfast surpassed my expectations. Nothing much to complain about other than the mediocre juices and relatively stale bread. Quite a…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r410771363", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Excellent ", "review": "Here for my husbands 40th. Food great so forget other people posts. Hot fresh and warm. Also known as Palmer hotel next door. Rooms fine and you are out all day so just a stop of point . Breakfast continental but also fresh eggs bacon if you wish. Service lovely and everyone very friendly ", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r408858677", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Dissappointed", "review": "It was very very hot and air condition in the restaurant area did not work . In the room the air condition worked poorly .Lack of privacy, you can hear people talking from the room next to you . Food tasted okay.The pool was the best thing about the hotel not even free wifi was present .", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r400546472", "sub_review": {"Sleep Quality": 2, "Rooms": 2, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Very disappointed", "review": "Overall the building and grounds are in bad need of repair. The block paving paths at the entrance and pool area are very dangerously uneven and a trip hazard. The breakfast is ok if you like a continental breakfast. Evening meal is a disaster!! Thank goodness there was always salad on the menu which we got into the habit of eating   as our evening meal knowing that that was probably all that would be palatable from the very limited choice of dishes and so had our main meal at lunchtime elsewhere (thank goodness we were not full board). Meat was cheap, invariably overcooked and one evening beef in red wine sauce was our menu choice and we were served veal!! Sweets were the same every evening Apple strudel (soggy and doughy), fresh fruit salad (mostly apple), ice cream (which had…", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r384257668", "sub_review": {"Location": 5, "Sleep Quality": 1, "Service": 1}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Spring brake", "review": "Room was average. Balcony overlooking residential area. Could hear birds singing. Swimming pool icy cold. meals were adequate but salad buffet same every day . Bread not fresh. Friendly staff. Nice bar area.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r380385835", "sub_review": {"Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Relaxing break", "review": "Hotel ideally situated close to all amenities and not too far to travel to other highlights in Italy. The staff are very friendly and helpful. We were there for 2 weeks and booked half board. Food was very good and well presented. The rooms were clean and adequate. We travelled quite a lot on the bus which enabled us to go to other towns around the lake, the 5 day bus pass is worth considering.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r321648026", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Could watch beautiful sunset from 3rd floor rooms", "review": "Area location is great, it is walking distance from the waters edge where several restaurants and shops are open till late (in September at least). Hotel room is relatively comfortable for a 3 star. Bed spread had odd stains but bed sheets were changed regularly.  Pool is great.  The best rooms are in 3rd floor as you'll be able to see the magnificent sunset behind the mountains!  We were only bb so didn't have suppers there... breakfast was ok too. Although at times things would run out from the display and took a bit long to replenish,  otherwise recommend. ", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r311711431", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "end of summer getaway", "review": "Hotel is situated in a quiet area enjoying scenery of hills surrounding Lake Garda yet minutes away on foot from bus terminus and Lake Garda itself. It is clean and rooms are   equipped as should. Pool is fabulous also. Yet the cherry on the cake are the working staff especially the waiting team at the restaurant managed by Fabio. They are very attentive to all the client`s needs as in even if client has any food intolerance. Well done all!", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r311269832", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nice place", "review": "Stayed here for ten days in early September 2015. The hotel is pleasant and comfortable. The staff are very attentive and helpful. The rooms are comfortable and cleaned everyday. All in all we thoroughly enjoyed our stay at the Royal. Fabio ( I think he is the manager) was an absolute star.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r311020214", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "In need of refurbishment", "review": "We stayed at this hotel last July for one week. Location is very good, few minutes walk to the lake. Pool is very nice for a swim and staff is all very friendly and helpful. The rooms and hotel in general need a good refurbishment.  The hotel is old and in desperate need of an upgrade.  Air conditioning wasn't good at all. In fact it was very hot and couldn't sleep at night. Food was average. I would suggest more variety for breakfast and dinner buffet. Pasta dishes were always very good. Meat/fish dishes were average, at times very salty and  poor selection.  Wifi access is with a charge, which is fine but useless since it can only be accessed from reception area. It would be a good hotel only if it invests in upgrading rooms, varies food selection and fixes the air…", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r305968064", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Aircondition does not work properly", "review": "+ The staff at the hotel are very helpful and the hotel is situated very near the lake (about not more than 10 minutes by walk).  - The air condition does not work at all.  If you happen to be in a room facing the sunset, the room will be very hot.  We had our room changed but still the air-condition could not be felt.  We had some visits from tiger mosquitoes too.  The beds are in a very poor condition, especially if you need a 4th one.    The pool is not suitable for young children.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r293638281", "sub_review": {"Location": 4, "Rooms": 1, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "No good at all room 3226", "review": "Just initiated our holiday yesterday at this hotel and its a complete disaster. Our room number 3226 has an ac that does not work at all and to add insult to injury we did found cocroaches at our room. We reported to the reception. Tempreture in our room is unberable. Hope managment take some sort of immedaite action cos they are ruining our holiday!!!", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r288735860", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Shame", "review": "We had booking on this hotel for one night. We arrived and they told us that hotel is full and they have alternative with same stars pool etc. We were tired of traveling so we agreed. We have to go to the 2 km far Hotel Panorama which was dirty and ugly.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r286638138", "sub_review": {"Sleep Quality": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Not worth the money", "review": "Having spent 7 days between Rome and Florence we were looking forward to lake garda. Our first family room for 3 adults and a 16 yr old was a joke. 2 single beds, a camp bed and fold out bed. Moved next day to à family room which was more suitable but only 1 socket worked and no air con. Complained for 3 days each day the engineer sorted it! Eventually we were given 2 seperate rooms when my husband reminded them how much we were chsrged for the 7 night holiday. Air con in last 2 rooms was ok but not very cool. Breakfast was ok but thankfully were didnt book half board.  Would not recommend this hotel as pool had weeds under sunbeds and tide mark in pool. Hotel was every run down and in need of repair.", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r219378694", "sub_review": {"Value": 1, "Location": 4, "Rooms": 2, "Cleanliness": 3, "Service": 3}, "travel_purpose": "", "rating": 1}, {"title": "hotel 1 of 3 on a Newmarket tour", "review": "Dear Sirs, we are sorry you didn't enjoy your stay in our hotel but sincerely you had a family room from the beginning and after your complaint we give you another family room bigger; about the air condiitoning as soon as knew it was not so easy to repair it we offered to you 2 rooms instead of 1 you booked. We think we did all our efforts to satisfy you as we do with all our clients.", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r213290297", "sub_review": {"Value": 4, "Location": 2, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Needs lots of improvement", "review": "Where to start.. The rooms are old, the fixtures in the shower fell out of the wall, the AC could not cope with the warmth, the food was terrible, the waiters did not understand english that much.   The pool was ok, but needed to be cleaned more regularly.", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r211967034", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "We loved this hotel", "review": "Dear Sirs, we are sorry that you didn't enjoy their stay in our hotel but it looks like you were in a different hotel. The rooms are not new but they are good for the standard category; the air condition work properly; about the food we have almost 250 pax every dinner and no one complained about it. In any case we would like to thank you for your review.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r206886505", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "disappointment", "review": "I have just returned from holiday at the La Palme Hotel in Garda. I went with a friend and we had single rooms.The rooms were quite spacious and had walk out terraces. we had clean towels daily, also the rooms were cleaned every day. The staff were really helpful and the lounge areas very pleasant . We had a very good buffet breakfast with hot and cold food. The evening dinner was 4 courses with plenty of choice with the main course,  We never had to wait between courses.The hotel was fairly old but many hotels are and it certainly wasn't neglected.The position of the hotel was very near the bus station and a short walk to the lake front. we felt we got very good value all round and would recommend staying at this hotel", "date": "November 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r185193725", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 2}, {"title": "HAPPY HOLLIDAY IN RELAXING HOTEL", "review": "Too expensive for what it has to offer. everything is old, from the furniture to the artificial flowers everywhere. poor wi-fi signal in the reception and no signal at all in the room. the only good thing about it was the breakfast.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r179749937", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "worst hotel ever", "review": "We spent a week here 15-22 Sept 2013 and loved it, the hotel needed up dating and the walls were thin  but it was clean, the beds were comfy and bedding changed mid week, the food was good and plenty of it both at breakfast and  evening dinner. the reception staff were very ready to help and assist us with any question or help we needed. The bar man, waiters and waitresses were polite and friendly and ready to help at all meal times.  We enjoyed our stay and looking forward to go back next year.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r179558411", "sub_review": {"Value": 1, "Location": 4, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Night mare @ royal hotel in Garda Italy", "review": "would not recommend royal hotel in garda Italy, staff @ reception has attaiude, theres a fee to use the room safe of 2 euros per night, 8 euros per to use the internet ( what a joke and rip off ) bar fridge was working, tv was fusy, I think most of all other reviews regarding the royal are very much spot on,  my stay was just night mare,", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r179083448", "sub_review": {"Value": 2, "Location": 4, "Sleep Quality": 1, "Rooms": 2, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled solo", "rating": 1}, {"title": "Royal only in name", "review": "Mixed  feelings about this hotel. Rooms very tacky, with a very uncomfortable mattress and  an ineffective aircon. The towels  provided, were more like table cloths. Walls must be paper thin as they offer no sound insulation; noises from adjoining rooms often caused disrupted sleep. No wifi in the rooms! Breakfast was good but dinner did not meet expectations. Salads and pasta were ok but the main course was invariably hopeless. To make things worse, some of the waiters were arrogant aand haughty. This was compensated with the gentleness and politeness  of the two waitresses, the room cleaners and one of the receptioinsts. In general there is a sense of neglect about this hotel.This is most visible in the common areas, with the restaurant ceiling dripping water, dirty lift,…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r175517398", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Nice hotel great location", "review": "The hotel is in need of a refurbishment as it has a 70 style going on that is true but this is a 3 star hotel not a 4 or 5 star.  Saying that though the pool is huge and really nice and the food is fair too.  Yes it is mostly the same things at breakfast and the juice is not freshly squeezed but it is all fresh.  We ate there every night and you do have to place your order the day before but you get a choice of starter and main and a buffet for antipasto and dessert.  The staff are fantastic really friendly and helpful and I cannot complain with regards to the cleanliness the only thing I would say is the towels need changing the are more like tea towels.", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r174854578", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Shame on the Management of the Palme Hotel Garda", "review": "Hotel Palme, Garda  I believe it is reasonable to expect a good night’s sleep in a hotel. I also expect that when a hotel states that Air-Conditioning  is provided in July and August, it will be provided.  So Problem Number One:  Last year we stayed at the same hotel. We complained several times about the  intermittent AirCon. The response was always the same = “we’ll report it to the  Engineer” This year – Temperatures day and night were high, sometimes reaching 30+ degrees Centigrade. Good Air-Conditioning was again much needed. For the first five nights it worked very intermittently, and we had poor and very disturbed nights’ sleep. We complained at Reception and were told each time “We’ll tell the Engineer” On the sixth night we arrived late back at the hotel, and as we…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r173397422", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 1, "Rooms": 4, "Cleanliness": 4, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Nice place", "review": "Nice hotel but dated. Beds need to be replaced. Nice pool. Very friendly staff at breakfast. A refurbishment of reception and lounge would lift the overall impression. Close to go down to the Garda lake.", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r169840844", "sub_review": {"Value": 2, "Location": 3, "Sleep Quality": 2, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "lovely hotel great location", "review": "we stayed there for a weak in july it is a lovely hotel in a great location only few minutes to the lake.very helpfull and friendly staff it has a large pool and the food is good too.if it will have a refrigerator it could be much better", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r150960590", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Need improvements", "review": "Regarding food and pool this hotel is quite good but they need to improve the A.C system, specially in the restaurant, it is also a shame that there are no wifi and internet in the hotel, The entire hotel need also a refurbishment because it is a 70's style.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r146357083", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Great location and swimming pool but terrible food and rooms", "review": "The location was very great because it was about 10 minute walk to the lake. Also the swimming pool was great but also had a defect. It was all the same height(I think it was all 1.60metres)The area around the pool needs a big refurbishment due to having grass growing all around the tiles.The rooms were rubbish because when we went there some of the lights were not working and the air-conditioning was not giving enough cold as the tempreture around the room. The worst thing was the food.In the breakfast there was always the same type of food and the supposed orange juice was water mixed with orange flavouring.The cleaning staff was bad also. We even had our underwear thrown away and one time one of our friends room was left open when it was cleaned. i do not really recommend…", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r144401807", "sub_review": {"Value": 1, "Location": 4, "Sleep Quality": 2, "Rooms": 1, "Cleanliness": 2, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Average hotel but good value", "review": "We have just returned from a weeks stay at Palme Royal in Garda.  We booked through Expedia and got B&B with flights for 7 days for £390.00 which was great value.  The hotel was basic but clean.  Tips for a more enjoyable stay are:-  take your own towel (hotels are like tea towels!), take own coffee/tea making facilities are there are non in room.  We booked B&B which I would recommend as we saved about £100 each on half board and never paid over 35 Euros for two main courses and wine each evening on the lake front.  The only downside to this hotel was it was a long way up the hill and the entrance was quite lonely.  I have stayed in the Palme and Palme suite (sister hotels which are connected) and these are better lite at night etc.  Saying that all three hotels had their own…", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r141225881", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Royal Hotel", "review": "Stayed here for a week and it's not that bad. Our room was cleaned everyday with clean towels and the beds were made, but don't leave anything on the bedside table because they will throw it away. Breakfast was ok but dinner in the evenings,you have choose from the day before what you want to eat and there isn't much of a choice either. Nice reception area and pool area. In all it was a good holiday", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r141036295", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Great location but standard hotel", "review": "This hotel has the perfect location to enjoy the evening nights at Garda.  Very few minutes away from the lake where you can find loads of restaurants and entertainment. Also very close to a bar which offers free wifi and yummy coffee :)    The hotel needs a little bit of refurbishment and I suggest that you take with you a towel.  Not sure if they changed them recently but our towels were more useful as a bath rugs.  The breakfast and dinner were okay.  Food was simple but very good although you have to choose your food from a day before which I found it a bit weird.  But at least it was good :)", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r129094088", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Excellent value for money", "review": "The Royal Hotel in Garda provides excellent value for money.  It is a three star hotel at the cost of a two star hotel.  In some cases, it is better than a three star, in the sense that it has a full sized pool and gardens which one would associate with a four star hotel.  The restaurant food lives up to the standards of a three star hotel, and I would say that it is very good.  The rooms are beautiful, spacious, and all of them with good views.  The only minus is the airconditioner, which simply needs to be changed.   In conclusion, if you want better standards, you would need to pay for a four star hotel.  But if you are on a budget, this hotel will positively surprise you, because it gives you much much more than what you are paying for.  The service was good, and everything…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r123173703", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Practical and well located ... but without setting any houses on fire.", "review": "Good location (5 to 7 mins walk to the centre and Lungomare). Spacious rooms but need refurbishment. The balcony door of our room had the lock busted and didn't close and lock (room balconies are in reality 1 balcony for the whole wing but separated with shaped brick walls some 1.5mts high, therefore it's easy to to climb over to and from the other rooms) - told receptionist about it and we had the handyman in our room to fix it in 15 mins - great service there. Hotel mainly caters for group tours and has a lovely swimming pool, which I availed of only twice as we had no free time to use it (our fault :) ). Staff is generally friendly with very few exceptions - a female receptionist ignored me for 5 full mins and I had to ask the bar attendant for help, then told her about me.,…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r118011572", "sub_review": {"Value": 3, "Sleep Quality": 5, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "A Nightmare of Midsummer!!", "review": "The worst hotel in wich I ever stayed!! The rooms are old and decrepits, reception is not able to solve any problem, forniture of the rooms are almost 40 years y.o. and they feel all the weight of time! Walls are peeling and spiders web are everywhere. Breakfast was tragic (even if it was included in mad fare payed of 171 euros!!! for two adults and 1 child 8 y.o., could not we have breakfast for lack of quality of food offered and rudeness of staff). There are no words to explane our disappointment to describe this experience!", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r117014848", "sub_review": {"Value": 1, "Location": 1, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "", "rating": 1}, {"title": "Decor locked in 70s", "review": "Great staff ..food very average..and décor a blast from the the past The only reason It has a 3 star rating is that it has a lovely pool..for adults ..so don't bring the  kids or you will be very disappointed. It takes about 13/14 mins walk to edge of lake..this is fine when going down, but not so great when walking back up, as its a hill nearly all the way..so not suitable for elderly or anyone with walking difficulties. Apartments could do with a facelift and please replace the horrible honeycomb towels in bathroom ..they will take the skin off your back..worst ever seen The air-conditioning is another big problem..we stayed a week and still couldn't figure out if it was on or off..........and last......cmon guys this is 20011..and no internet ??..I brought my laptop all the…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r116932478", "sub_review": {"Value": 2, "Sleep Quality": 3, "Cleanliness": 3, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Not what we were expecting", "review": "We stayed at the hotel Royal. Granted we got a late deal and allocation on arrival, but when we arrived we got such a shock at the state of this hotel, they say it's 3* no way 1* at the most, the staff very friendly but we were  supposed to have either adjoining rooms or adjacent rooms as we were traveling with three children, leading up to the rooms the corridors are in need of major refurbishment curtains hanging of rail, holes in walls lift very dated. When finally got to the rooms They were appalling the cot for my daughter had a big brown mark running down the side the bed settee had stains all over it, there were disgusting sticky marks on the walls, there was dust in the air conditioning vents, the list could go on, when we complained the rep came and looked at room and…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r115869686", "sub_review": {"Value": 1, "Sleep Quality": 1, "Cleanliness": 1, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "dated hotel", "review": "GOOD POINTS- Hotel staff are polite and friendly.Breakfast is continental and ok. BAD POINTS- Hotel is dated and in need of upgrading. Room is small and furniture is chipped and dirty. Our room had only one power socket working and the bathroom air vent didnt work. We reported this on our first day but it was never attended to. Breakfast closed at 9.30 prompt. The air conditioning was switched off at 10.00 until 4.00 pm (not good if you want to have a rest in the afternoon) NOT WHEELCHAIR FRIENDLY. The pool as 1.7 metres deep all round not good for children and no attendant on duty. Room could benefit with a fridge. Would not recommend this hotel. there are better hotels in the area with better facilities. This hotel is geared up mainly for dutch and german patrons.", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r115851751", "sub_review": {"Value": 2, "Sleep Quality": 3, "Cleanliness": 2, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "The Nightmare come true...Stay away...", "review": "I often travel for bussiness and  I was lately to Hotel Royal in Garda described as a 3 star hotel is worth of a 1 star hotel or lower category if possible. I've found a very unfrendly atmosphere at the check in. The girl at the reception didn't even takaea glance to anyone of us and was very bitter with everybody. The second surprise was in the room... Very old furniture (of the 70s or 80s and in 2011 I've discovered the first hotel in my life without frigobar. I thought this was a joke, but when coming back after work (sometimes late in the night) there was no possibility of drinking any glas of water or juice as even the bar was closed. The room are then very noisy. I heard all the night long peolple snoring and coughing and it was terrible. The wall are of paper and the next…", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r103685591", "sub_review": {"Value": 1, "Location": 1, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 2, "Service": 1}, "travel_purpose": "Traveled on business", "rating": 1}, {"title": "Garda and location is wonderful, but sadly Hotel Palme and Suites are not!", "review": "Beware. There are three related hotels: Royal, Palme and Suites. We cannot comment on the Royal. Palme and Suites share facilities and reception and neither are 3 star standard. Two star possibly. Our toilet did not flush and the extractor was pathetic. One of the twin beds smelled of urine and it took intervention by the Tour operator rep to get room changed next day! No apology from management. It's rather tired and needs refurbishment. Service patchy. Good waiters and maid excellent in new room. Reception very poor. We booked thru LastMinute whom we've used very successfully before with allocation on arrival. Also Inghams, Tour Operator, who have previously been accurate in hotel ratings. Lake Garda and Garda itself is a wonderful destination. Despite the hotel we had a great…", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r81568917", "sub_review": {"Value": 2, "Location": 4, "Sleep Quality": 2, "Rooms": 2, "Cleanliness": 2, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Italian Style? Me think NOT!", "review": "This was my first trip to Italy- beautiful country, but won't return to this hotel! As many other 'reviewers', we booked this family holiday as a last minute deal for the half-term hols. It was a \"guaranteed 3* allocated on arrival\" offer. We thought in Garda, 3* would mean 3*. This is a 2* at a push! The complex consists of three sister hotels- the Suites, Palme and Royal. Upon arrival, we were greeted with a friendly member of the reception team, who half-escorted us to our room. When we got there, the room was not what we requested- a double room. We were given a twin room that was like an oven when we walked into it. We rang reception straight away and asked if we could swap rooms in the morning. This wasn't a problem... It was late, and with a sleepy 7 year old, we were ok…", "date": "June 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r80733098", "sub_review": {"Value": 2, "Location": 3, "Sleep Quality": 3, "Rooms": 1, "Cleanliness": 2, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Thankful didn't pay the Full Price !!!", "review": "Booked an allocation on arrival holiday at a very reasonable price, ended up at the Hotel Royal in Garda.   First impressions were good until we arrived at our room. Although it was very clean, the decor was in desperate need fto be updated, but saying that, tolerable.  What wasn't tolerable was when the neighbours arrived back to their room.  You could hear everything they said, did, whispered, coughed, snored ..... need I go on?  The noise was unbearable.  Good job I sleep with ear plugs (although I could still hear next door).   Then came time to dine! Evening meal.  Arrived in the very clean well presented restaurant (albeit basic) to find that we had been seated with another couple.  I was very unhappy to be forced to sit with people I didn't know and be told that this was…", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r80491515", "sub_review": {"Location": 3, "Rooms": 1, "Cleanliness": 4, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Not the best but ok.", "review": "The reviews on this site are mostly correct.  It is neglected, old fashioned and the air con/boiler is noisy but on the plus side the staff are nice, the pool clean, the food good and it's not too far out of town (10min walk uphill) a All in we found the hotel and holiday good value as we only paid £270 for a week half board and we wouldn't hesitate in returning as we had a fantastic time but please Do Not expect 4* luxury as you may be disappointed.", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r80198294", "sub_review": {"Value": 5, "Location": 3, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "clean and friendly hotel", "review": "very clean and friendly hotel, pool was nice. we went half board and i didn't go much on the food and had to share a table with another couple for dinner all week. the air conditioning was a little noisy late at night.", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r79682992", "sub_review": {"Value": 3, "Location": 2, "Sleep Quality": 2, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "oh my god !!!", "review": "bad service in hotel ! i needed to change my room because it was all humidity and next to a boiler room it took two days to change me the room, and take towels with you because they gave them to us all wet even when the try to change them for us !!!", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r77536699", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 1, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "", "rating": 3}, {"title": "Stay away, not worth the money", "review": "From the beginning: the address is wrong or they have moved it ... it is not on the address stated, it is in a nearby sidestreet and the signs pointing there are quite invisible so arriving shortly before midning was real fun ... Nightstaff at the reception spoke very bad English, was really not helpful and at times really rude, somehow could not grasp the concept of a lady with one kid arriving ahead of a husband with another kid and refusing to accomodate them first with others arriving afterward. Hotel itself is of a \"block of flats\" style with many narrow corridors, looks better and more spatious in the night.  Rooms ... acceptable, only the room switchboard was emitting hum so we had a fair choice between electricity and AC during the night plus the buzzing or silence and…", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r73698140", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 3, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Certainly not a 3 *", "review": "Like all the other British people in the hotel, I booked this as a last minute, allocate on arrival at the airport deal. For what I paid, it was value for money. But, that isn't really the point. It was advertised as a 3* and I bought the holiday on that basis. It looked as though it was built in the '60s or '70s and had no money spent on it since then. I took a brochure with me so I could see what was advertised in the brochure for this hotel. It said air con was switched on from 1 July. That may be true, but it simply didn't work for most of the holiday and was ineffectual for the remainder. The staff did their best. They were good natured, polite and helpful. The place was spotless. But this did not hide the fact that this was not 3*. The hotel is part of a chain, can't…", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r72104488", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Good Value.  Lovely Holiday", "review": "Just arrived back form a lastminute booking with Inghams.  Although allocated on arrival we knew that the Royal could possibly be one of the hotels we would be staying and after reading the latest review were a bit wary in booking, but for the £350.00 for half board, thought why not.  We had a lovely holiday, yes the waiters were rushed off their feet and we would often have to wait a while before being served, but they were really friendly and curteous.  I have coeliac disease (intolerance to gluten), and therefore have to follow a strict gluten free diet otherwise will become very ill.  On arrival for my first meal I gave my translated dietry card to the waiter, and from then on was well looked after i.e. had separate special meals cooked for me rather than given a salad or…", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r71827736", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Its a 50/50 place!!", "review": "Booked through inghams on a hotel on arrival and got the hotel royal. The staff are 50/ 50. some really helpful and others terrible (cant remember the name of one of them but she was really helpful and friendly). Rooms were a good size but very noisy and in need of an update. can hear everything (people snoring, showers ect.) The food in the hotel is deadful. Didn't even take dinner in the hotel it looked that bad and as they couldn't even get breakfast right wasn't worth it.   The A/C was terrible. even set at 10c you can't feel it.   The location was good. only a 10 min walk to garda centre and about 15 mins back as its a bit up hill but nothing too major.   The pool was good but could have done with a shallow end.  For the price we paid it was a good deal but wouldn't spend…", "date": "June 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r69582939", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 1, "Rooms": 2, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Utterly dreadful", "review": "We landed after a delay to be shown to the hotel fortunately it was dark  The night reception who could not speak english sent us to the wrong room we had to go back to the reception and swop rooms with a lovely couple who then got the room ,all this at 12 30 am !! The room was small no pictures dark decor broken curtan rail and holes in the curtain .The balcony which was communal was littered with cigarette butts .The settee was broken and could not be used the shower if you could get in it had a mind of its own with the tap head spinning round if you put the water pressure too high .The food was basic with staff who always had a train to catch !! Needless to say we moved out but kept touch with some great people we had met on arrival thanks Douggie Eileen Robbie and June for…", "date": "June 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r66575642", "sub_review": {"Value": 1, "Location": 3, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Truly enjoyed our stay", "review": "Very surprised to read the many bad reviews this place recieves. Yes the hotel is somewhat oldfashioned and tired, but given its location close to Lake Garda and in beautiful Garda we enjoyed our holiday a lot and spent very little time in the hotel room.   The rooms are of an O.K. size and every room has a balcony which was very nice. Rooms are clean and kept clean every day, towels and other amenities are supplied every day. The pool area is very nice with a rather big pool, plenty of sun loungers and a quiet and relaxing atmosphere and it is possible to find a cool and shady place too. Other guest were quiet, relaxed and polite and seemed to enjoy their holiday.   The hotel is very conveniently located across from a nice park with play facilities for children, just a short…", "date": "July 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r58107341", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "very little space in rooms and very expensive", "review": "we found very little space in the rooms, not suitable for families with small children. Be careful if booking with more than 2 children as you will be charged full price for any extra children that you have. Manager not at all helpful when we tried to settle our bill and were even told that we were stupid for booking the hotel the way we did. It was booked for us as we were part of a large group and were not aware that the third child would be full price.", "date": "July 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r37822878", "sub_review": {"Value": 2, "Location": 3, "Rooms": 1, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "HOTEL ROYAL: BIG DISASTER: REALLY SAD", "review": "We are from Malta and we were with a group Tour. We stayed from the 8-15 August 2009. The room was ok,you only have to give the reception a 5 euros deposit for an adaptor to charge mob or cameras.The bar was a bit poor,i asked for a blue caracoa and the barman told me that he never heard about it. No nuts or anything with drinks were given.The buffet breakfast was horrible, only bread which sometimes was very hard,cheap orange juices and cereals,boiled eggs,cheese,salami,ham and some cakes.Only on our first and last day there was croissants.The big disaster was the dinner, the buffet consists of 1 type of pasta which finally they admit that the leftovers of the pasta from the last dinner they bake it and use it for the buffet for the next day!! They only do 2 dishes and if it…", "date": "August 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r37794531", "sub_review": {"Value": 2, "Location": 3, "Rooms": 4, "Cleanliness": 3, "Service": 2}, "travel_purpose": "", "rating": 2}, {"title": "Good value for money,excellent service", "review": "You get what  you expect from a 3 star hotel.I can rate the food as 5 star,the sevice as well,the area is great ,only a few minutes from the center,My only complaint was the beds and pillows,too soft,Otherwise I really recommend it", "date": "August 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r37351562", "sub_review": {"Value": 5, "Location": 5, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "great location and great facilities and great staff", "review": "we got our trip on lastminute.com with inghams so didn't actually know where we were staying until we landed in verona.  my husband had never been on a package deal before so was suitably nervous but the hotel was lovely.  it had a nice big bar area with outside terrace, a good sized pool with plenty of loungers, lift and slopes for wheelchair users too.  there was a private balcony and air-con in our very clean room.  decoration was basic but it was big, comfortable and had everything you need - tv, hairdryer, free safe and loads of space for clothes.  it also had a sofa/extra bed.  we stayed on a half-board basis where you have to share a table for the duration with another couple, some people coupled up under this arrangement whereas we bonded with our table partners by…", "date": "August 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r37219650", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Poor worn out hotel - 2 star hotels better - staff pleasant.", "review": "My sister and I booked our holiday lastminute at a very good price.  We have travelled a lot and been to Lake Garda before and just wanted a restful break knowing how lovely it is there.  We did not expect a high quality hotel or food at theprice we paid.  We did however expect it to be of the usual italian quality (looked after with pride, clean, fresh smelling and .. you would have thought.. real coffee at breakfast).  We are also not that fussy but had never experience a hotel as poor as this in Italy before (and we have both youth hostelled around the country).  We have stayed in 1, 2 and no star hotels before.  The Hotel Royal and Suite is very poor in comparison.  We felt the only reason for its star rating was that it had a pool.  The building itself is very ugly concrete…", "date": "September 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r21623205", "sub_review": {"Value": 1, "Location": 2, "Check in / front desk": 3, "Rooms": 1, "Cleanliness": 1, "Service": 2}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "A most relaxing holiday.", "review": "We have just returned from a 10 day stay in the Hotel Royal, Garda. We booked through Crystal Holidays and the rep (Wayne) was friendly and helpful. The location is great, not too close to the main road, and a short walk into Garda itself. The staff were great, building a good raport with the guests.  The room was a good size, comfortable beds, cleaned daily and had a balcony with a great view over the hills. The carpet, however, had probably seen better days. Showers had high water pressure (adjustable) and plenty of hot water. Meals were plentiful. There was no way we were gonna starve on this visit. The meat course could be a little variable (went from merely OK to really nice according to my partner). Being a vegitarian, I can sometimes have trouble finding something to eat,…", "date": "September 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r20269101", "sub_review": {"Value": 4, "Location": 5, "Check in / front desk": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Go to this hotel if you want to lose weight!!!!", "review": "We booked this as a last minute deal and didn't expect it to be anything fantastic, but we did expect a 3 star standard. What we got was a 2 star at most.  THE ROOM Very shabby and worn.  Air con only on few hours a day at managers discretion, but even when it was it was no use what so ever. It seemed to circulate only warm air and as it was 34 + degrees it was unbearable! It was also incredibly noisy and in the end we slept with the doors and windows open. We wouldn't have been able to if we were not on the top floor.  Towels look like large thin tea towels. However rooms are a fair size and are very clean. However the walls are paper thin and we were woken early every morning by either the cleaners shouting to each other from room to room or by next door using the loo, opening…", "date": "August 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r18551547", "sub_review": {}, "travel_purpose": "", "rating": 2}, {"title": "Nothing wrong with this Hotel", "review": "This Hotel is now known as The Royal,we booked a last minute deal through Thompson Lakes and Mountains,it is a very good Hotel,friendly staff,good food,good location. I would class it as a 2star not a 3 as advertised never the less we had a great week.Try some of the local places to eat,come out of the Hotel straight down the road to Garda on the roundabout,El Graspo this is run by a big  jolly bearded bloke and the food is excellent, if you then turn left and go to the supermarket about 100 yards there is a nice little trattoria called Niccolla again the food is very good.Why not catch the boat to Bardolino and walk back to Garda along the lake path about 45 minutes. Some of the comments left by people that have stayed here i would take with a pinch of salt as there…", "date": "June 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r17277917", "sub_review": {"Value": 3, "Location": 4, "Check in / front desk": 4, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lake garda holiday", "review": "Garda Town  Out of the many resorts around Lake garda, my family and i satyed for a week in Garda town. It has a beautiful setting,old cobbled streets, close knit shops and ice cream parlours and a wonderful promenade where you can watch the sun rise and set.  Travel and accomodation  We Booked through First choice, the rep we got was amazing and very helpfull. She and her collegue helped us to plan out week in garda. To me it was a Trip of a lifetime and a week was not enough time to spend there. We stayed in the Hotel Palme, it is one of a trio of hotels situated together. The rooms were basic, but believe me you wont want to stay in your hotel room because there is just so much to see and do! The staff at the hotel were very friendly and tried their best to speek english,…", "date": "September 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r14958418", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Lovely Position but poor service", "review": "The hotel is situated in a lovely position away from the hustle and bussle of the town . Only a 10 minute walk to bus station and town which is fantastic . Most hotel staff ok but some are downright rude and could do with a course on manners and customer service . Food ok except the way it was served . You had to choose your meal the previous evening and meal time was 6.30 or 8.30 and woe betide you if you were a bit late . A buffet style salad was first which you rarely had time to eat because the starter was shoved in front you . If you said you were not yet ready the look from the waiter was one of total disgust . When you were ready the food was slopped onto your plate and invariably some ended up on the floor or worse your clothing . Quite frankly this sort of service is…", "date": "August 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r8680149", "sub_review": {"Value": 2, "Location": 4, "Check in / front desk": 3, "Rooms": 3, "Cleanliness": 3, "Service": 2, "Business service (e.g., internet access)": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Go to Lake Garda, Avoid the Hotel Royal aka Fawlty Towers", "review": "My wife and I returned today from Lake Garda, fantastic destination for a honeymoon particlularly if you want to relax, with your new spouse and enjoy a romantic atmosphere, good food & wine, fantastic location.  Now then for the hotel - Hotel Royal in Garda. What a mare' of a hotel. Fawlty Towers looked like it was run like the Plaza in comparison to this place, with the staff to boot!!!  This hotel looks like it did good business in the 70's and 80's and has not been updated since. Although the room size was decent - it was very, very basic. Within 15 mins of arriving there - we knew it was a case of - if we're going to enjoy this holiday we need to make this happen for ourselves and away from here.  The Room. Spacious, very basic, cleaned daily to a low standard. Carperted…", "date": "August 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r8431246", "sub_review": {"Value": 1, "Location": 3, "Check in / front desk": 2, "Rooms": 1, "Cleanliness": 2, "Service": 1, "Business service (e.g., internet access)": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Give this Hotel a miss", "review": "We just got back from Lake Garda last night. The place itself is stunning and I definitely would go back but would DEF not stay at this hotel. We stayed in the HOTEL ROYAL which is just over the road to the HOTEL PALME section of it. First of all it has been 34 degrees when we have been there, sweltering heat but HOTEL ROYAL would not use their air conditioning and because it all centrally controlled you could not have it on in your room either. We had to sleep at night with the patio doors open which you were advised not to due to recent burglaries in the area. There are code operated safety deposit boxes in each room and this worked fine for the first 4 days then it just would not open and was beeping constantly. We had been out to Malcensie for the day so had missed buffet…", "date": "July 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r8185503", "sub_review": {"Value": 2, "Location": 4, "Check in / front desk": 1, "Rooms": 2, "Cleanliness": 3, "Service": 1, "Business service (e.g., internet access)": 1}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "lovely break at garda", "review": "had a lovely break at lake garda went with hubby son and his girlfriend hotel is about a 3star staff were lovely and helpful evening meals were very good breakfast was ok bedroom spacious and clean had everything you need for your basic comforts we were out every day as we went by ledger coach so we were out everyday so only slept in there balcony gave beautiful views to the mountains really enjoyed our stay you get what you pay for ", "date": "May 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r7630216", "sub_review": {"Value": 3, "Location": 3, "Check in / front desk": 3, "Rooms": 2, "Cleanliness": 3, "Service": 3, "Business service (e.g., internet access)": 1}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Very dissapointing", "review": "Myself & my husband stayed in the Royal Hotel in Garda in September 2006. First impressions were dissapointing (I actually cried!!), and unfortunately the hotel lived up to this. This hotel needs major refurbishment; carpets in hallways are grubby and worn and the overall appearance of the hotel is dated. There was no shallow end to the pool. The air conditioning was timed centrally, so you had limited control over it. As with most hotels in the area, we were on a half board basis, but we ate out most nights as the food left alot to be desired. My jacket went missing from my room, and after several visits to reception it was eventually recovered, having been \"mistakenly\" taken by the laundry staff. I certainly wouldn't recommend this hotel to anyone ", "date": "March 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r7012926", "sub_review": {"Value": 1, "Location": 2, "Check in / front desk": 2, "Rooms": 1, "Cleanliness": 1, "Service": 2, "Business service (e.g., internet access)": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Excellent value for money", "review": "We stayed in the Royal for a week at the beginning of August and found it to be a great experience. The room was large with balcony –request one of the upper floors – we had a room at the back of the hotel so had a view of the surrounding mountains. Room came with free air-con and a safe and very kept clean by the staff. Food was very good. Excellent selection at the buffet breakfast, dinner was in two sittings 6:30pm and 8:00pm. Each night you choose from a selection of options for the next night. Dinner consisted of buffet salad – again good selection, pasta course or soup, followed either by fish or meat and a choice of sweet.   The staff were very friendly and willing to help. The hotel location is excellent with a short walk down to the town centre and a supermarket just…", "date": "August 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r5802513", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Don't Go For The Food!", "review": "This is a basic hotel, clean with good sized, air conditioned rooms and pleasant gardens/surroundings, however the Dining Room seemed to be operating on another planet...    Food was dreadful, small portions, no vegetables (one scalloped potatoe on most nights).  Pudding was a choice of chocolate/strawberry blamanche or ice cream (seriously!) apart from a couple of nights when a slice of cake was available.  The worst aspect of it was that dining couples were unable to have a table for themselves and made to share a four seater table with another couple of complete strangers !! Loose floor stones around pool area and no cushions provided on the hard plastic sun loungers my back was broken!   Enjoyed Garda and the lake and have booked a proper hotel for next year. ", "date": "July 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r5544575", "sub_review": {}, "travel_purpose": "", "rating": 2}, {"title": "Brilliant holiday at the Hotel Palme Royal in Lake Garda", "review": "Although outward appearance of hotel not outstanding, pool and communal areas excellent. Room spacious and well equipped with free air conditioning and safe to store valuables. All staff at the hotel were extremely obliging and nothing was too much trouble. Food was of a reasonable standard for the 3* class, We ate there every night and no menu was repeated within the 11 nights stay we had.   Lake Garda is an area of outstanding beauty. Take a trip on the lake to the north and experience the spectacular scenery. Ferry trips to various places along the Lake, which we will be visiting next time we go.   We will definitely be returning to this beautiful place and hotel. Would reccomend it to those who are looking for a relaxing yet fulfilling holiday, not for the 'night-clubbers' ! ", "date": "July 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r5463522", "sub_review": {"Value": 5, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Palme good, Lake Garda, superb", "review": "Hotel Palme is admittedly nothing spectacular but the staff are friendly and the rooms comfortable. Good location, only 5 mins from the lakeside, bus depot is just around the corner and shops just down the road.   Seemed to be a decent level of entertainment (not to my personal taste but cant fault the effort) , we went out at 8pm and they had a italian crooner belting his lungs out to the german/english guests......strolling back in at 12midnight the guy was still going, looked like he hadn't taken a break!   All the TV channels are in German but with so much to see in Lake Garda, TV should be the least of your worries. Everything clean, good little shower, nice big bed! Breakfast is continental and I was relieved to find you can get a nice cup of tea!!  Weather was superb,…", "date": "April 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r5038874", "sub_review": {"Value": 5, "Rooms": 3, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 5}, {"title": "Food awful", "review": "We totally agree with the review from Belfast member July 18th  We have travelled all over Europe and consider our selves to be seasoned travellers.   This hotel is need of a refurbishment, They need to sort the lighting in the reception area and the waiters need to go on a training course in manners.  I have never seen any meals as poor as these and any one who thinks they are acceptable are crazy  We eat 1 evening meal and 1 breakfast in 1 week in this hotel and would not waste a trip to Italy hoping that it got better.  The walls of these rooms must be made of papier mache as you can hear the next door residents snoring, every bit of running water, the keys turning in the locks and the wardrobe doors sliding. If you are unlucky you will get a ground floor room and then you…", "date": "September 2005", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r3947722", "sub_review": {"Value": 1, "Rooms": 1, "Cleanliness": 3, "Service": 1}, "travel_purpose": "", "rating": 1}, {"title": "food", "review": "I got sick from this Food there. And the waiters tried to get a date with me!!! ", "date": "July 2005", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r3792137", "sub_review": {"Value": 3, "Rooms": 3, "Cleanliness": 3, "Service": 5}, "travel_purpose": "", "rating": 3}, {"title": "Great holiday!", "review": "Just returned from a 2 week stay at the Royal. Very hot - well into the 30s (where do brochures find their average maximum temperatures?) except for 2 nights when we had fantastic lightning storms. Hotel is what you would expect from 3*. Rooms reasonable size, air conditioning struggled a bit to cope with temperatures. 2 power cuts did not prevent dinner service. Pool is good size but uniformly 1.74m deep. You will be allocated to a table in the restaurant for the duration of your stay. Dinner menu starts with salad (help yourself from the table). Next course will be choice of 2 pasta dishes or soup. Main course is a choice of fish or meat. usually served just with potato. There is a choice of desserts/fruit which is the same each night. You have to order on the menu on your…", "date": "July 2005", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r3736885", "sub_review": {"Value": 4, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Great food", "review": "My family and I have just come back from Hotel Palme Royal in Garda ,from 5thSept to 12th, and all I can say is that it was fabulous.We loved every minute of it there.We had a very spacious room for the four of us.The food was great.The staff were so friendly and helpful.Lake Garda is such a lovely place,with tiny villages spread around the lake and very easily reached with our hired car.Gardaland is just 25minutes away and my boys just loved it.The shows there were great. Caneva world is just 5 minutes away from gardaland .It is a waterpark full of all kind of water shutes.We spent a whole day there,swimming and enjoying the sandy beaches.Verona is a town not to be missed.I just fell in love with it.We also visited venice and Innsbruck by car. We had such a memorable holiday. ", "date": "August 2004", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194771-d314116-r2571583", "sub_review": {}, "travel_purpose": "", "rating": 5}]