[{"title": "A nice comfortable hotel for relaxing stay", "review": "I had a nice experience in a 5 days stay in Gardesana Hotel. Its so comfortable and close to Riva Del Garda lake beach and around 1 Km from city center. Very clean and staff was helpful through all the trip. ", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r598761035", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Enjoyable experience", "review": "Having just returned from staying at Gardesana hotel Riva del Garda I wish to inform anyone who has read the bad reviews about this hotel , it was completely the opposite in my experience. The staff were friendly, the rooms clean, the breakfast selection was assorted for any dietary needs ( except a full cooked English breakfast - but who goes to Italy for that!)  If you want a 4 - 5 star hotel then pay for it, don’t moan when you pay for a 3 star hotel and get it. The real plus for this hotel was its pool and garden and the location close to many good restaurants.", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r596316886", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Pleasantly Surprised", "review": "After reading such quite poor reviews on this hotel my friend and I were thinking we should have booked somewhere else, but we have just come back from a week staying at this hotel and have had a wonderful holiday.  The hotel is basic but very clean and our room was cleaned every day and fresh towels replaced. The swimming pool is lovely, much nicer then in some other hotels we thought , it has a lovely garden area alongside it to relax in as well.  The views were wonderful from our room.  We found the reception staff helpful and friendly and there was plenty of variety at breakfast, continental breakfast with plenty of rolls , crossants , fruit , scrambled eggs and more ....help yourself to tea and you are served coffee if required.  We were B & B there so we ate out every night, plenty of lovely restaurants in the area, lovely walks by the lake, beautiful area, A big Thank you to Helen and Ivana our Newmarket reps who were wonderful, Helen was our rep on trips to Venice and around the Lake , wonderful lady.  All in all we had a lovely holiday. I don't normally post reviews but after reading some of these on here felt I had to post one.…", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r594848834", "sub_review": {"Value": 3, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "The worst hotel I have ever stayed in", "review": "Room (single) was like a prison cell. The food was very bad. Apart from the female who operated reception and bar the staff incredibly unhelpful. The hotel is a good 20 minutes walk from main town. Cannot think of one positive thing to say. Very rarely post a review but really would not anyone else to experience this place.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r558260613", "sub_review": {"Sleep Quality": 2, "Rooms": 1, "Service": 1}, "travel_purpose": "Traveled solo", "rating": 1}, {"title": "Not for the Solo Traveller", "review": "Let's start with the positives , it is clean and I found the bed very comfortable. Lovely 45 min walk to Tibole, 30 mins into Riva,  close to the port.  The kebabs were delicious.  The manager was very helpful.  As a solo traveller I find the dinning room experience very stressful.  This was antagonised by unfriendly staff who ignored me and half way into my holiday moved me to a very small table in a corner were I had to be asked to be served.  Receptionist did so many other jobs that it was difficult to get advice.   Lake Garda has been my favourite destination but this has made me think again.", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r528135050", "sub_review": {}, "travel_purpose": "", "rating": 1}, {"title": "Don't stay here", "review": "Dreadful hotel with miserable staff . The food was undercooked/ over cooked/ cold, tiny portions and little veg or Mediterranean vegetables in sight. This is in a land renowned for its wonderful quisine! Nasty rooms with tiny beds. My room looked out at the kitchen door and open bins.  In its favour, the hotel was clean. I wasn't expecting a top rate hotel but on holiday I do expect a friendly smile, a decent bed, a comfy seat and some decent food. None of these criteria were met. The fact that it was three star has little to do with it. It costs nothing to smile and I've stayed in three star hotels around the world many times before. I also noted a review about the downstairs cafe and first floor dinning room. Please note there were no such facilities at this hotel. There has…", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r527736143", "sub_review": {"Value": 1, "Cleanliness": 4, "Service": 1}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "What can I say ? Enjoy yourself.", "review": "Just how do you describe a surprise special birthday holiday ? Fantastic, great , wonderful, especially in the beautiful Riva. Organised through a very reputable large Belfast company , What could possibly go wrong???  The Hotel Del Gardesana is situated about 15 minute beautiful walk along the banks of the lake into Riva, or along the main road - All flat and an easy walk.  Our holiday in Hotel Del Gardesana was different to say the least, we laugh about it now but if I described it as Fawlty Towers you may get the picture a bit clearer! What have we to complain about you may ask - the hotel was spotless, our room which was in an annex beside our friends was great, spacious,beside the pool and very comfortable. Compared to others in our party it was a castle! Many complained…", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r527613773", "sub_review": {"Value": 3, "Sleep Quality": 5, "Service": 2}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Disappointing experience", "review": "Spent a weeks holidays at Hotel Gardesana never would return to it. Hotel itself was spotlessly clean and although rooms were very clean they were very basic. Small balcony with one dodgy chair and table overlooking a beautiful pool which was always clean. The food in this hotel was atrocious, breakfasts was sufficient but evening meals were shocking altogether. No potatoes served a small portion of meat or fish and a spoonful of vegetables. (You had to pick your menu the night before for the next night). The salad bar kept us going. Staff was disorganised and not interested in the needs of the guests.  We traveled with a group from N. Ireland and most of the group felt the same way regarding this hotel.", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r527187204", "sub_review": {"Cleanliness": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "So disappointed", "review": "Room was a box not much more to be said. Balcony small table with one chair which you couldn't sit on. Complained to a female member of staff who said all rooms same size so nothing they could do. Eventually a manager came over and took us to a different room which was massive compared to original. Hotel itself clean but food absolutely dreadful. Not just my opinion but majority of guests said the same. People complained continually got chips once with dinner about six chips in all. No potatoes or vegetables. Breakfast was the best. No tea or coffee at dinner and no butter for bread rolls. No tea facilities in rooms. Staff at times friendly but overall very disappointed with our stay in this hotel after reading such good reviews. Never again would I stay there", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r527037287", "sub_review": {"Location": 3, "Cleanliness": 4, "Service": 2}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Hot, airless rooms, grumpy staff", "review": "The Gardesana is very clean and has a lovely pool. It is conveniently located for walking into Riva and for using public transport. On arrival, we were met at reception by a  young lady who responded to our questions with one word answers before slamming the keys on the counter. When I asked where the lift was, she said simply, “There” and gestured. Not exactly the welcome normally given in Italian hotels. We had booked two single rooms. They were both small, as were the beds. One room was especially small. This room had only one window and as the air con was controlled by the management, it was impossible to reduce the temperature to a comfortable level for sleeping. The next morning, tired after a hot sleepless night, my friend asked if the air con could be altered. The same…", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r524046674", "sub_review": {"Sleep Quality": 1, "Cleanliness": 5, "Service": 2}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Lovely", "review": "Stayed here for one night nice and clean lovely big room nice bathroom with very powerful shower breakfast was lovely plenty of choice good location also nice pool area will definitely come back and would recommend ", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r521595049", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "After a day trip to Venezia, the best way to end the day...", "review": "Excellent restaurant, very nice location on the port of Torri del Benaco. Professional and very kind staff. The port and its square is animated by live music almost every evening. The hotel has also a terrasse on the square. The location is outstanding with a view on the three \"Torri\". ", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r508272882", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "More travel tips", "review": "Forgot to add on my last review of this fantastic hotel.On my previous visits have always gone with Thompson but this time with Inghams.Firstly as they only have a handful of hotels got a small well airconditioned coach from airport.With Thompson late coach with no a.c. not good as took eternity to get everybody on.In hindsight Thompson were good but just too big.Inghams rep Evie was fab, straight round when I thought had mobile stolen and also when I didn't feel well.ALSO YOU GET 23 KILO AND 10 KILO CARRY ON.THOMPSON YOU GET 15 AND 5.NOT GOOD. Inghams win hands down.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r501158706", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Good and a bit bad!!", "review": "Newly refurbished, no complaints about the hotel. However the manager/owner (not sure of his position) appeared rather surly. I asked to use the internet, as most hotels now have provision for that, and he just answered 'no'!! He then added maybe later... but should have made it plain that the internet was not available for guests. I went with Newmarket, who I understand just started using the hotel again after refurbishment. I am a solo traveller, and could not detect any other English people, so I asked the very helpful waitress, and she pointed out one couple who were the only other English people in the hotel, all the other guests were German. I felt it would have been a nice gesture to give me a table near to the other English guests so I could have someone to talk to. I…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r423446845", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Good Value for your money", "review": "I stayed at the Hotel Gardesana recently for a week.  I found the hotel to be fresh and modern in decor.  The rooms, though smallish, were spotlessly clean and attended to daily by the staff.  The dining area was bright and welcoming, the same waiter and waitress were present each evening at dinner, I have to say that the hotel is very fortunate to have two such pleasant and helpful staff, nothing was too much effort for them.  The food menu came as more than a surprise to me, the antipasti, primi piatti  and secondi piatti were of excellent variety and freshness, and represented what was best of local ingredients, not to mention the excellent deserts.  Breakfast was of typical continental style, but freshly made coffee was served by the waiter.  The manager was more than…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r409452028", "sub_review": {"Location": 4, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Fantastic Hotel, Location and Staff", "review": "We've just returned from a tour of Europe and what a fantastic hotel we found in Riva del Garda - the Hotel Gardesana.  A modern, clean and friendly hotel where customer focus shines through from the moment you enter reception to the time you have to leave.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r402099672", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "a dip in the hotel pool or a dip in the lake?", "review": "A perfect location , just over the road and a short path takes you to the stunning lake and park. On entering this delightful refurbished hotel ,there is evidence of care from front of house to the immaculately maintained pool and garden.              The manager is very attentive ,and Jessica always takes an interest in your daily activities. We had a smaller room as a couple however fine for our needs .      The restaurant we found the food very good, pre ordering each evening for the following sitting with initial buffet salad and a total of five courses. Breakfast as buffet style ,ham cheese rolls  and bacon scrambled egg or some days sausage, brans and fresh fruits, rolls and delicious cakes and tarts. This is a smallish hotel ,therefore do not expect entertainment ,there…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r389801567", "sub_review": {"Value": 4, "Location": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent value for money", "review": "I am Lactose intolerant and the waiting staff and chef went out of their way to prepare food that I could eat,even baking 2 pastries for my consumption only. The food was very tasty and varied.  The staff even bought drinks for our group of 3 and everyone was so friendly.  The room was basic but very clean with very comfortable beds. We intend to return next year.   A 2-3 minute walk from the lake a and handy for restaurants to eat in at lunch time.  We will definitely return next year.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r376206257", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Nice enough", "review": "....but a good 15 minute walk into town.  Basic, but clean. Friendly efficient staff but no real bar in the evening. Head into town and go to Marilyn's Irish Bar, or their sister  hotel up the road.  Food is nice enough, and varied, though helpings aren't huge...", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r318762345", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Disappointing", "review": "For a 3 star hotel it was reasonable. Room  was clean and adequate although pillows were not plump and reception were not helpful in providing an extra pillow - domestic staff were more helpful and we got an extra pillow on the 3rd day. Food was fine - only 2 choices but adequate.  The hotel is about a 20 minute walk to the centre of the town but you can walk along by the lake or cycle. The main criticism was the attitude of the reception staff and the waitresses who were sullen and indifferent towards guests - a friendly smile and a greeting  would have made a big difference", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r317850538", "sub_review": {"Value": 3, "Rooms": 3, "Service": 2}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Chain type hotel, certainly NOT", "review": "There are few so dramatic landscapes in Europe as those around northern Lake Garda and Riva is particularly stunning in its beauty, nature being particularly kind to it and the local area! Gardesana is really close to the lake and some of its spectacular views, this surely then being one of the advantages of staying in this interesting hotel. Rooms are quite basic with no fridge or tea/coffee making facilities. Room 119 has a small veranda with fine mountain views and is fit for purpose. The shower is new and functional and room service is unobtrusive and quite good. The old style roof fan, tried and tested, is probably more effective than the now more fashionable air conditioning that some insist upon. The swimming pool area is quite quaint and really quiet and enjoyable at all…", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r302514869", "sub_review": {"Location": 5, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent hotel for the price (with some minor reservations !)", "review": "We only stayed here for 1 night during a very hot July.  For what we paid this was super.  The location was good on two counts - easy to find with the car (Enough free Parking) and a few minutes walk to the lake. Admittedly its a 10 min stroll to the middle of town - but its a very pleasant walk along the edge of the lake.  The receptionist was very friendly and helpful speaking excellent English.    The room is basic - bit of a throwback to the 70s or 80s.  But clean and everything worked very well.  The free wifi was excellent. Shower etc etc worked fine.  Our main reservation was that without AirCon (I know we didn't pay for Air Con and so it seems unfair to criticise it's absence !) the room's ceiling fan really doesn't cut the mustard when it comes to keeping one cool…", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r286425380", "sub_review": {"Location": 4, "Rooms": 3, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great Location", "review": "Travelled with the travel Department. The location is great for walks along the Northern Lake Garda with great views which was only a short walk away from the hotel. We had a double room at the rear of the hotel which had a very small balcony which was not practicable to use. The food although basic was sufficient if you are happy with pasta for starter. The evening meals were ordered at breakfast which ensured the food was prepared daily. The restaurant does need cooling as guests could not wait to leave due to the heat. The garden and pool are excellent.", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r286141529", "sub_review": {"Value": 4, "Sleep Quality": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Very good and affordable hotel", "review": "I stayed in this hotel for about 4 days. I found the staff to be very helpful and courteous. The food was good and the place was well within my budget. This was my first time visiting Italy and Riva Del Garda. Overall the experience was really nice. I would definitely recommend this place.", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r284079177", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Lovely hotael, great food!!", "review": "Stayed here for a week, travelling with Travel Department.  Hotel is clean, and comfortable, we were in room 204 overlooking the front, hardly any noise from traffic or anything else.  Nice balcony too. Breakfast was continental, nice selection.  Evening meals were excellent! great choice, unusual combinations, really made a nice change, all food very well cooked and presented. The restaurant manager runs a tight ship - has a great sense of humour too. The Gala Dinner was really good, four courses.  The entertainment that night was good fun - cheesy stuff, but we had a giggle - and a conga through the reception :) It's only a 5 min stroll to the lake, or 15 mins to the town of Riva. Also a lovely swimming pool - nice comfortable sun beds and plenty of room with trees to shade…", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r273948552", "sub_review": {"Value": 4, "Location": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Not good for vegetarians", "review": "This hotel was very clean and towels were changed daily. The room was very small, we had to squeeze past each other on the way to the bathroom and the balcony was only big enough for one chair. The pool was lovely but the entertainment which was only on one night was unbelievably cheezy. A guy with a keyboard playing everything from songs my grandmother knew to Strauss waltzes!   As a vegetarian I thought there would always be a veggie option in Italy but I was wrong! On the first night I spoke to the restaurant manager and he offered me a cheese omelette. I accepted this as our party arrived late but was disappointed to be offered this again the next time there was nothing veggie on the menu. I asked for spaghetti in olive oil and garlic, thinking this would be easy enough for…", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r272626703", "sub_review": {"Location": 5, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Not so good", "review": "Breakfast is not so goód, Check-out is at 10 oclock and it is not very commen! The crew is friendly´, there is a free parking place in front of the hotel, the city center is about 5 km away and you need a car or bike otherwise only by walking.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r272577755", "sub_review": {"Value": 2, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "A great place to stay.", "review": "We stayed here in April 2015 having booked through Travel Department. The hotel is about 10 or 15 minutes walk from the centre of the town, but it’s a relaxing walk along the lakeside (with stops to feed the ducks). The room was perhaps a little dated, but was spotlessly clean and kept this way throughout our stay. All the staff were very helpful. The receptionists were helpful and friendly and the restaurant manager, who has a dry sense of humour,  was friendly and attentive while keeping everything running smoothly,  The choice of breakfast and evening meals was very good with something for every taste. The quality of the food was excellent , with a number of choices for every meal.  The Travel Department rep Claudia was extremely knowledgeable and friendly. She was also very…", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r269867834", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Spotlessly Clean", "review": "Very clean hotel, hot water constantly, nice towels, clean towels every day and even a daily clean pillowcase!  Staff very pleasant and helpful. Food was very nice.  A quiet, restful hotel, a good base for seeing Lake Garda, Venice, Verona. Room size OK, shared with a friend.  Fan, no air conditioning, all right at this time of year (9th april to 16th april)  Springtime, beautiful weather, blossoms out.  Lovely leather bags, Venice masks were delightful, Limoncello! fantastic. Hired bikes on one of free days off, cycled to Arco along river. Loads of cycle paths everywhere.  A brilliant holiday with Travel Department, a good mix of excursions and free time. Very nice guide, Anna Lisa.", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r266378374", "sub_review": {"Location": 5, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "great holiday", "review": "i stayed with a friend and we had single rooms, they were a good size with decent bathroom, particularly for single rooms, The breakfast was continental but good, no hot food. Dinner is chosen at breakfast from the choise menu, if you do not like anything on it, they will accommodate you with an alternative.. It is a 20-25 lovely walk through the park to the ferry point, a must to Limone & Malchesne, You can walk to torbole in half hour. not a massive shopping centre but pleasant, and a great ice cream cafe on the lake  half way to the ferry point to while away an afternoon", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r260389921", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Good hotel", "review": "Spent 8 days here and the rooms were comfortable and spotlessly clean food was excellent with a good choice at dinner. Good selection of dishes on the menu. Outdoor swimming pool, a bit cool in October.", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r234150362", "sub_review": {"Sleep Quality": 4, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Not brilliant but good value", "review": "When we first arrived I was disappointed,the exterior looks very dated and could do with a coat of paint. The reception is nicely furnished although not very welcoming, especially if you want to take coffee after dinner, space could be put to much better use. Our bedroom was very small but clean, housekeeping was very good fresh towels every day toiletries replenished when necessary. (Pillows are awful lumpy and hard) Food was fair, only one meal we didn't eat. Lovely pool area if you visit in summer. On the whole it is very good value for the area. Must mention our tour guide Martin he was superb, very knowledgable and friendly the tours went without a hitch thanks to his organisation.", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r234069098", "sub_review": {"Location": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Hotel with A View", "review": "This Hotel is very Central to everywhere in Riva Del Garda.A bus stop across the road that will take you to most of the costal villages near by .The main square in Riva where the shops and restaurants are about 20 minutes walk away,and if you want a boat ride to other villages can be got just close by to the main square near the info  centre.The Hotel itself is not a modern building with no lift but is basic and reasonable depending the time of year you visit,We had a room on the second floor with a balcony and had a great view of the mountains and lake.The breakfast itself was ok with no hot food served.The room itself was clean and the beds comfortable.The Receptionists were very helpful and spoke good English.The breakfast staff  we found not to be too friendly .On and all…", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r233261029", "sub_review": {"Value": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very cheap stay", "review": "Great views and location, breakfast was good (continental) room was clean. Staff very helpful, including the waitress that some reviewers had mentioned.  Receptionist was very good Restaurants very close by and lake shoreline only 5 mins walk away My room was basic but for the price I couldn't complain £65 for 2 nights Great walks  Hotel has a garage for motorbike storage  I only stayed 2 nights but would return", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r232082811", "sub_review": {"Sleep Quality": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "A very pleasant place to stay.", "review": "We travelled to Riva in late August 2014 for 8 days and 7 nights. We found the staff extremely pleasant and helpful. Our room was on the second floor and faced the lake which was about 150 metres away and not visible from the room. The balcony easily accommodated two chairs and a table and we spent some considerable time there looking at the mountain views after returning from our almost daily excursions. The room was spotlessly clean and the towels were changed every day. The downside was the evening noise from the busy adjoining hotels but what can you expect from a busy resort on a thin strip of level ground in mountainous country. We found the food to be excellent with a wide choice for both breakfast and evening meal. One of our table companions requested an item not on the…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r226950015", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "The only room with a vieuw! Loved it!", "review": "It was our first time at lake Garda , and a short vacation of 5 days . Hotel Gardesana provided us a clean room , basic and it was the only room with a nice view on the lake. We loved it. The staff was really friendly and helpful. Most of them also spoke English. They immediately told us on a map where to find the lake and the shops. The lake was a 5minute walk!  Breakfast and diner were also basic but good.  Riva del Garda was awesome. A Beautiful town, a lot to do and to enjoy and absolutely affordable.  We will definitely return! John and Salina", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r223089230", "sub_review": {"Rooms": 2, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Below par ", "review": "Travelled to Lake garda with the Travel Department and we could not praise them enough, The guides were excellent full of great information and useful tips and very friendly.  Lake Garda is a fantastic place to spend a holiday it has lots of great restaurants and has no shortage of things to do around the lake we will most probably be back.  Now to the hotel.  The rooms are very small especially the ones with a pool view they have a balcony which can only hold one chair the room furniture is very dated and scuffed. The ensuite is small but to be fair is kept very clean as is the room. The bed is very hard and has only one pillow each, we requested more and got them. There is no air conditioning just a ceiling fan.  The food in the restaurant was below average. Breakfast…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r222222110", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Could have been 4 star", "review": "We have just returned after a week at the Hotel Gardesana in Riva del Garda with Holiday Department. The public areas i.e. reception, restaurant, bar, pool were all fine very good in fact. As mentioned in other reviews the restaurant  manager at first appeared fixated on were we sat but it became obvious that by controlling the seating he was able to efficiently produce the pre - ordered meals (ordered after breakfast.) in the evening. We found the food to be excellent with a choice of 3 for all three courses on each night. On one occasion my wife's starter was changed when she had a change of mind and when she asked for turkey without a sauce she was offered and received a delicious grilled turkey steak as an alternative neither was a problem. The staff we found to be friendly,…", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r219300003", "sub_review": {"Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "A super week in Gardesana!", "review": "Just returned from a brilliant week at the Gardesana. Hospitality, service and pool area were excellent. Rooms a bit tired and small but spotless with nice bathrooms. Meals were lovely and varied and restaurant staff very attentive and eager to please. Will definitely be back!", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r216977727", "sub_review": {"Value": 4, "Location": 4, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Travel Department holiday", "review": "We stayed at the Gardesana last week on a Travel Department holiday.The hotel is in a good location only about three minutes walk across the road to the lakeside. Riva Del Garda is a beautiful little town.  The food was very good.  Davide and the two lovely young waitresses were very efficient and friendly. The hotel is spotless, the  pool area and gardens beautiful. Our towels were changed every day. Although there is no safe in the room, one can be rented from the reception for one Euro a day. Our trips included in our package were a day in Venice and  Verona and a drive round the lake stopping at two places. Our guide Annalisa was extremely knowledgeable and friendly. She was also very caring towards the people in her charge, always making sure that everyone was very clear…", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r214084705", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Pleasant hotel", "review": "We stayed here for a week with a Travel Department package which included an evening meal. As with all three star establishments one has to accept a number of factors. The room was small but spotless and with a tiny balcony overlooking a pretty little pool area. There was no room safe for valuables. There was a large ceiling fan to provide air flow on muggy nights. There was no lift. The staff was helpful and friendly. The dining room staff was efficient. Breakfast was continental but with plenty of everything -lovely fresh rolls and breads and the coffee was good. Dinner was restricted to 3 choices for starters and main course. There was no choice for dessert. In seven days no dish was repeated. The hotel was at the eastern end of the town - about a 20 minute stroll to the…", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r213415149", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A disappointment!", "review": "After reading many great reviews about this hotel we were sadly disappointed at the final result. We had a nice balcony but it only overlooked the back of the hotel in front. There was no air conditioning so we had to sleep with the balcony doors open which resulted in much noise from the street below. We were not told of the amenities the hotel had to offer so it wasn't until after we left that we found out that there was a swimming pool and gardens. We should have been told this either at reception or in our room. Not that we used it but the television only had four channels! The breakfast was fine except there was a sad lack of fresh food. The fruit salad was out of a can and we just couldn't stomach the coffee they provided...hence a queue to the expresso machine by the…", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r212587820", "sub_review": {"Value": 2, "Location": 4, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 4, "Service": 2}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Good value for Riva del Garda", "review": "The hotel is good value, reception staff helpful, bedrooms clean and tidy. Beds are a bit low and furniture is a bit cheap.  But the bed was comfortable.  We stayed just bed and breakfast and found nice places to eat close by. Breakfast was good lots of choice, cheese, ham, breads, cakes, cereals, yoghurt and hard boiled eggs.  The restaurant staff we found were more keen on patroling the dining room and ensuring people didn't sit in the wrong place than welcoming us with a good morning. It is not in the centre of Riva del Garda but that was good for us.  Very close to the lake. Car parking space - essential for us and our photo group.  Would stay there again. Riva is a good location with nice scenery. The lower half of the lake is a bit flat but the north where Riva is has a…", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r209937510", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "What Else DoYou Need", "review": "We stayed in Hotel Gardesana for 7 nights w/b 20/5/2014. Booked through Travel Department and flight was from  Edinburgh. We had a lovely time, hotel clean and towels changed every day. Food excellent - continental breakfast and 3 course evening meal - Gala Dinner was 5 course and lovely. Staff were lovely and helpful. Lake Garda minutes away and numerous bars and co-op a few minutes walk. Plenty to do and see. Our travel guide was Claudia who was brilliant and Mario our driver. Included in our holiday was a trip to Venice, Verona and a day trip round Lake Garda. Would recommend this hotel and Travel Department.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r207708873", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Irish Couple-wonderful experience in Gardesna", "review": "We just spent a week in lake Garda with the travel department and stayed in the Hotel Gardesna. The staff were extremely pleasant, food was lovely and the hotel was spotless. The location was excellent. Just 1 minutes walk to the lake side and we could go to Riva or Torpole along the lake front. This was an extremely pleasant walk. There was an excellent cycle track on both sides of the hotel along the lake front. Will certainly re-visit this hotel. We would highly recommend it.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r205759272", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Friendly hotel with great cuisine", "review": "Had a wonderful holiday here, just returned on 6/5/14. Restaurant manager was funny & couldn't do enough to make dinner a good experience. Meals were all enjoyable & the hotel even had a Gala night with live music, dancing & a special meal for everyone 2 nights before coming home. Towels were clean every day and toilet was kept spotless, so that is all you need when you are going out on trips every day. Didn't even feel like coming home and could easily have enjoyed another week there, which is unusual for me as I usually look forward to coming home but area was delightful.", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r204597987", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "A great little hotel.", "review": "We stayed in this hotel in April 2014 having booked through Travel Department. All I can really do with this review is reiterating what others have written. The hotel is about 10 or 15 minutes walk from the centre, but it’s a relaxing stroll along the lakeside with stops to feed the ducks.  Our room (201) is at the front of the building and we didn’t hear any road noise whatsoever. The room was perhaps a little dated, but was spotlessly clean and kept this way throughout our stay. The staff were very helpful and the restaurant manager certainly runs a tight, but relaxed, ship. The choice of breakfast and evening meals was good with something for every taste. The quality of the food was excellent, a big thanks to the chef. The Travel Department rep Annalisa was absolutely great –…", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r202595511", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good little hotel", "review": "We are staying here for four nights and are very impressed. Only booked last week and staying in Room 103 , a little dated but immaculately clean, small room and bathroom but efficient shower and no shortage of hot water, decent sized towels too, unusual for small hotels.  Very good sized terrace overlooking road so a little noisy from traffic but sunny and bright most of day.  Staff are excellent, receptionists and David in restaurant deserve special mention.  Breakfast buffet very good and especially like the fresh garden flowers on tables.  Lovely garden with pool would be great in summer.  Fifteen minutes walk into town, either on lakeside path or main road.  Very good value for money.", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r201636366", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Marvelous Family Hotel", "review": "This small family hotel is ideal for solo travellers offering single rooms with no supplement. Arriving on April 5th with  the  Travel Department group for one week, I used it as a base to  to visit Lake Garda popular sites, walking to Torbole and Arco, then group trips to Venice and Verona and the Italian Alps. The bedroom is small and the bed smaller but the bathroom is better both fine for a short stay. No air conditioner but a large ceiling fan ,neither needed in April . The decor is dated, my room a strange orange melamine  wardrobe and desk  and a safety deposit in the room, important for solo travellers. Everything  clean and the food varied and staff could not do enough for us. Most rooms have a tiny balcony but not mine overlooking the pool. A very happy visit", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r201109676", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Wonderful hotel", "review": "Hotel with outside pool about a 10 minute walk from centre of Riva (walkway alongside the beautiful Lake Garda is recommended)  Room were on the small side but more than adequate with a good sized bathroom.  Food was excellent throughout the week and Davide & restaurant staff were great. Buffet breakfast had plenty of choice and was excellent. Reception staff were very efficient and always most helpful. Really enjoyed our stay here.", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r200596259", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Give them another star!", "review": "We stayed here during a Travel Department holiday. I checked Tripadvisor before we went and found they scored well on (a) cleanliness (b) food and (c) pleasant staff. All this turned out to be true! it left me wondering if Hotel Gardesana could be given another star! They especially excelled in the attitude of all the staff we met. Well done", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r200467762", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "perfect place and the staff were excellent", "review": "All is so perfect here the staff, the view and the scenery If you want to get here cheaper than transfers then catch the 162/163 bus (cost euros 5.80)from puerto nouvo station to hotel brione then walk back about 5 mins it is on your left and you pay only 5.80 euros from the bus station to gardesana. from the airport catch the bus to the bus station for about 6 euros |(20 mins)", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r182470217", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "A true Gem", "review": "Good afternoon,  thanks a lot for your stay and your rewiew !! I really  hope you will like to come back again with us in the future !  Thanks", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r181837329", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great hotel & location", "review": "My wife and I were transferred to the Gardesana when our other choice was full. A very friendly reception awaited.  Although the room was small it was spotlessly clean.  Everyday was the same.  The food was excellent and being able to order at breakfast meant we were served quickly at dinner. All the staff were very helpful and couldn't do enough for you.  Although we don't normally return to te same place, if we wanted to we would again book this hotel. Don't expect four star from a three star but it not far short.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r179796302", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very Friendly Staff & a lovely hotel!", "review": "Good evening,  thanks a lot !!  I am really happy that you enjoyed your stay with us and hope to see you in  the future  Thanks a lot", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r178381715", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "A little Jewel", "review": "A nice compact little hotel.   Bedroom good with nice facilities and veranda.  Nice diningroom with good breakfast and great evening meal!  Nice swimming pool out back.  The staff were very helpful and friendly during our 1 week stay.  The only downside was - no lift!", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r178334704", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Value for money", "review": "Good afternoon,  thanks a lot for your stay ! Appreciate a lot your review and your good score !  We don't have lift but we remember that Guest can ask for low floor rooms if they have problem going with stairs  Thanks a lot", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r178276079", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good three star hotel", "review": "My wife and I have just returned from a week in the Hotel Gardesana. The trip was booked through the Travel Department. We had a choice of staying in a 4 star hotel in the centre of Riva Del Garda or the 3 star Gardesana, with a 15 minutes walk into Riva. The location was ideal, with a leisurely stroll along the lakeside taking you into Riva. Let me first get the negatives out of the way, there is no aircon and the bedrooms rooms are a bit on the small side. Now the positives - The bed was comfortable, the sheets were changed midway through our stay, the towels were change every day and the rooms were cleaned on a daily basis. The staff were polite and helpful. The breakfast buffet was pretty standard, with the usual selection of breads, cold meats and cheese etc but plentiful.…", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r178018768", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 2, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Lovely stay", "review": "Good afternoon,  thanks a lot for your stay and your review ! Will pass the message to all Staff and the kitchen Chef !  We are thinking to put for next year some ceiling fans, for the summer period and I am sure will be a good improvement  Thanks a lot", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r175161162", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Go somewhere else for dinner!", "review": "I spent a week at the hotel, travelling with the Travel Department.  In most respects this hotel does what it says on the tin.  The rooms are not luxurious, but they are pleasantly comfortable and clean - I was particularly impressed with the standard of cleanliness.  While not exactly 'cordon bleu', the food is good, varied and plentiful.  The staff are friendly, efficient and helpful, although having only one person to handle reception and the bar can result in delays in service at one or the other. The main drawback in this hotel is its lack of air conditioning.  When we arrived, the temperature was pushing 30 degrees and the absence of air con meant that sleeping was quite difficult given the high temperatures.  This same deficiency resulted in the dining room being…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r175069230", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 1, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 2}, {"title": "Great experience for half board", "review": "My husband and myself stayed in the hotel late July and it was very hot however you can rent a fan at reception for €1per night - I would strongly recommend. First impression was that the hotel was basic but quite adequate. However my first impression changed to delight due to the excellent service we received from Davide the manager who is so efficient (seeing is believing) and the excellent food we enjoyed throughout our stay especially Gala night. I would highly recommend the hotel for location, food and service and would like to say a special thanks to Davide for giving us a table for 2 which I requested on the first night. I would love to know why he changed us to a different table on a few occasions though!!!!", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r172505432", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Gardesana - Riva del Garda", "review": "Good afternoon,  thanks a lot for your comment ! I will give your message to Staff and Davide, they will be 100% happy to read it !  I really don't know why he changed  the table, but you can email hotel and ask him directly : )  Thanks a million", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r172408128", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "very good 3star-hotel", "review": "Spent a week in the Hotel Gardesana with two others, twin room is compact with small balcony with enough room for about two chairs, bathroom was also on the small side but clean and towels changed and room cleaned daily.  I was there the first week in August and it was unusually hot weather, there are fans available to hire from reception but no air conditioning which would be the only gripe I'd have.  As an extremely fussy eater, I was expecting to go hungry for most of the holiday but I can't praise the dining room staff enough, especially Davide, who arranged alternative meals if there was nothing on the menu I liked, so don't be afraid to speak up if there is nothing on the menu for you.  Lovely pool and garden to the rear for the days you just want to take it easy.  Just a…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r170834441", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "David, take a bow!", "review": "Good afternoon and thanks a lot !  Happy to read  that you enjoyed your holiday in our hotel, Riva del Garda and near us !  We are waiting you for another relaxing moment !  Thanks", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r170684018", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "What a wonderful holiday", "review": "Unfortunately, I staid here for only two nights - I wished it was longer! The staff was very nice and a had a lovely time during my stay in Riva del Garda. The hotel is easy to find by car and its got free parking, free wifi and a lovely pool in the garden. It's not located in the town center, but this gives you the opportunity to enjoy a beautiful walk (approx. 15 minutes) along the lake when getting to the town! And another advantage; at this area, the esplanade is less crowded than in the center! I was in a tiny but super-clean single room without aircondition (I don't know whether the other rooms have aircon), but it totally fit my needs. As I always went out for dinner, I can't say much about the menue but the breakfast was allright! I would definitely recommend this hotel…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r166214527", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "basic rooms but friendly staff m.", "review": "my husband ,daughter and myself recently stayed here, [  it was a last minute booking].we would normally stay in a  4 star hotel or better so didn't know what to expect but we were pleaseantly  surprised. The hotel rooms were basic but extremely clean [they were cleaned every day].we had a triple room which was very large . The food was good . A few days my daughter didn't like what was offered for dinner and the maitre'd went out of his way to get here food she liked .we stayed in 4 and 5 star hotels and they never offered anything more than what was on the menu .Any request I had was dealt with there and then and always willingly. Only downside is their is no air conditioning.A well run hotel that with a little updating could easily gain  another star.", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r164587042", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Good value at Garda", "review": "Good evening,  thanks a lot for your review, really appreciated !  We always give our best to our Guest, specially for the food, that is something very personal, so if someone don't like the menu, we will give another choice until we don't find what you are looking for.  Hope to see you again in our hotel or our town ! Thanks", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r160153988", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "A lovely little  hotel located a few minutes walk from Lake Garda, scenery spectacular as Riva located in northern area of Lake ", "review": "My wife, a friend and I stayed at the Hotel Gardesana on a trip with the Travel Department. We had originally intended to stay at its four star sister hotel nearby, the Liberty, but, as our friend was paying a single supplement, we opted for the Gardesana (3 star) instead. We are very glad we did. This is a lovely, family run hotel. Ok, the rooms are a bit small, but on a touring holiday this is not a huge problem. The food in the dining room ( breakfast and dinner) was very good, with plenty of variety, and the staff are good humoured and friendly. The towels were changed daily, and the bed linen was changed once during our week there. There is a fine pool at the rear of the hotel, although due to our timetable I only got to swim in it once. The hotel is across the road from…", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r147636516", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Very Average Hotel", "review": "Good afternoon,  thanks a lot for your wonderful review !  I will give your message to all staff regarding rooms, dining room and kitchen ! We have fixed our problem with wi-fi system, it is always free from lounge and all rooms, but there was a problem during that week.  Thanks a lot and see you again", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r147221969", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 2, "Rooms": 3, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good value for money", "review": "I spent a wonderful week at Hotel Gardesana with Travel Department, I was a solo traveller & there was no extra supplement which was great! My room 115 located on 1 st floor overlooked the pool & was very comfortable, (the single rooms size do vary in size)  a nice bright bathroom & was quiet airy, did rent fans which was approx €1 a day & well worth it! Pool area was lovely & no problem in getting sun beds, on half board, couldn't fault the service/ food, the staff were wonderful & enjoyed some lovely evenings just sitting outside enjoying a glass or two with Irish/ Scottish travellers with Travel Department! Enjoyed a few trips locally, took local bus to Malcesine which I would highly recommend, beautiful town, then took cable car up to Monte Baldo! Sound Of Music country! The…", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r144077853", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Extremely good hotel for price paid", "review": "ecently retuned from a weeks stay at this hotel, travelling with The Travel Deparment.  Arriving late in the evening, the staff had waited on to provide us with an evening meal. The rooms are small however, they are very clean, with sheets and towels being renewed regularly. I was a bit scared that I would not like the food, but I can honestly say every meal was fantastic.  We were given a menu evey morning at breakfast, where we selected from a choice of three starters, three main dishes and three deserts.  Breakfast is continental, no problem there, as there is sufficient to select from.  The staff at the hotel are really friendly.  The walk into Riva along the Lake Shore is wonderful, and Riva itself is a beautiful town.  We would highly recommend this hotel to anyone.", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r143253406", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Friendly & Helpful", "review": "Good evening and thanks !  Wonderful to read that you are happy with us at all ! We give italian food menu and always improve our quality, this year we didn't receive a negative for restaurant quality and all our staff ! Very good and we can see it from all reviews !  Thanks again and don't forget to return very soon :)", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r143074192", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "great location", "review": "For the price I cannot fault this hotel! cosy room, great shower, TV & Free WiFi (In your room), single bed was a little small, but not uncomfortable. Staff were very helpful and even printed me off an assortment of maps and bus timetables for the area. Would definitely stay here again ~ recommended!", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r138406520", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "VERY FRIENDLY HOTEL", "review": "Good evening and thanks a lot for the review !  Really nice to read that you appreciate our services and that you will definetely come back with us ! I am sure you will also reccomend our hotel with friends :)  Thanks again and see you soon", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r136086886", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good hotel", "review": "across the road from the lake. fab pool & gardens. great friendly staff.no air con but i got a fan.food was ok but that was because some guests complained & wanted \"english food\" well hello if you want that..stay at home!!!!...overall it was great & the Travel Dept are fantastic to travel with. so professional.I will be back to riva del garde next year with the travel dept.I was a \"solo\" traveller & they couldnt do enough for me.  Eimear", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r135953367", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "trina' nightmare in hotel gardesana", "review": "Hi have just returned from a weeks package holiday with the Travel Department at the Hotel Gardesana we arrived about 10pm and had no evening meal which was exceptable as it was late, checked into a single room very small more like a corrrador than a room but clean no air com so very hot and stuffy only small window. Had a reasonable nights sleep, went for breakfast next morning early enough but food was of a good quality which is more than I can say for the evening meal, breakfast was the same every morning. After about the 3rd day I asked the girl on receiption if it was possible to change to a double room she said yes but there would be a charge of €30 per night which was fine. The next day The group went on tour to Venice and when we got back all my luggage was shifted to…", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r133522957", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 3, "Rooms": 2, "Cleanliness": 1, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Only drawback", "review": "Good afternoon and thanks for your review  I am really sorry about the Ants problem, sometime when it rains and comes back very hot, could happen but I will check better the room and fix the problem.  Thanks a lot Alessandro", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r132998709", "sub_review": {"Value": 5, "Location": 3, "Sleep Quality": 5, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Fair enough", "review": "This is a small friendly fantastic hotel with excellent food, excellent service and oh so friendly.  The cleanliness of the hotel is exemplary, with clean towels every day.  The rooms are adequate but quite small and if you like to spend a lot of time on the balcony there is just enough room for two very close chairs.  Don't be put off by this.  The swimming pool is at the back of hotel and again it is fab.  In September by late afternoon it got quite cold but great up till then.  You are only five minutes across a busy road to the beach and walkway.   The views are breathtaking and every bend had another most amazing view. I would recommend this hotel at the top of the lake and it only takes about 15 minutes to leisurely walk into riva.   will definitely go back here.", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r132254027", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Small hotel, big on customer service", "review": "Good afternoon and thanks !!!  I am really happy that you enjoied your stay with us and I really hope to see you again next time here :)  Thanks a lot also from all the Staff Have a nice summer  Alessandro", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r130648410", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "...great value and a great location", "review": "In general the hotel was ok, quiet and clean, equipped also with a feasible pool.   Breakfast was nothing to phone home about. The coffee and juices were terrible, no (sparkling) water.   Decoration of the restaurant was a bit tacky to me with plastic flowers and atmosphere that had kind of German or Alpine feel to it. I would have appreciated more Italian and/or Trentino style.   Service by the staff was fair but I dropped my points because I included the breakfast in that part.  All in all, this was a definitive budget choice.", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r129076259", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "3* Hotel - ticks  all the boxes", "review": "Conveniently situated 10 minutes walk along the shore of Lake Garda to the town centre. 100 metres from an excellent pizzeria (used by the locals). Complimentary parking - (may be a bit limited in high season but there is a big carpark over the main road) and complimentary wi fi. Clean basic room with balcony. Very helpful staff. Breakfast buffet of a standard expected from a hotel of this grade.", "date": "March 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r127077092", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great value hotel with a fab location!", "review": "Good afternoon and thanks a lot for your review !  I wish you an Happy Easter and really hope to see you again in the near future ! Thanks again  Alessandro", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r117496306", "sub_review": {"Value": 5, "Sleep Quality": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Hotel was fine....it was the balcony and view that made it for us!!!", "review": "We stayed at the Hotel Gardesana this august for the 2nd time and we wern't dissapointed. It offers a great location, clean accommodation, friendly and helpful staff as well as a yummy restaurant! The hotel is located 5 minutes walk from the lake and 10 minutes walk from the main shopping area.  There is always someone at reception who is more than willing to help with any problems you may have. The only down side is the room have no air condition but we solved this wen we got fans from reception.  Otherwise I recommend this hotel if your looking for a good value, well located hotel in Riva del Garda.   Thanks to the staff for making our visit a very enjoyable one.  Looking forward to our next visit!", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r115118195", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Thoroughly enjoyable stay", "review": "Good afternoon and thanks a lot for your review !  We really appreciate your 2nd visit and looking forward to see you the 3rd time ! We say that there is no 2 without 3 :) We suggest you to visit us in middle September so the temperature is cooler than august :) Thanks a lot again  Alessandro", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r114905162", "sub_review": {"Value": 5, "Sleep Quality": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very Good - but let down by idiot night porter", "review": "We drove here on our travels around Italy, and it was great because it had a car park. It also has a lovely pool to cool off after the long drive in a car that didnt have aircon!! Pool is very cold however....so was a shame that I couldnt swim in it - just dip!!  The hotel was very small downstairs, but the rooms were spacious. They did seem slightly like hostel rooms, very bland and boxy, but with lots of room and a breathtaking view from the balcony of the mountains and lake (view in pik!!) you really cant complain!  The breakfast was basic but all included so no complaints, and its right at the top of the lake so you have access to everything :-) the road that the hotel is on leads to the centre bit and you can take a ferry to the other villages accross the lake. Its got a…", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r107122580", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "Nice 3 star hotel & good value.", "review": "Pluses:  - The Gardesana was clean with a friendly atmosphere - The food was better than expected with good, varied choices.  - Hard working staff. - Room cleaned daily with clean towels. - Cheery sing-a-long on the Monday night in the lounge.   General  - Our room was smallish but adequate.  - No requirement by us for air-con due to time of year of our stay.  - Not as noisy as reported by other reviewers however, I should add that our room was at the rear. - We timed our coastal path walk from hotel to ferry pier at Riva to be just over 15min. - Short thunder storms can be expected during the day however they pass over quickly. - We booked through The Travel Department who provided excellent tours with superb guides.  Minuses:  - No lift however, the stairs were an easy climb…", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r107008503", "sub_review": {"Value": 5, "Location": 3, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Basic, good value clean friendly hotel with perfectly good food.", "review": "Went with Travel Department for a romantic break with my  wife on a cheap package deal for one week. Lovely lot of older but active tourists. For the money we paid this hotel was spot on. Room was clean and had a funny, slightly impractical layout but must have been repainted and the bathroom refurbished that season. I would move the furniture around and put the telly in a sensible position, but it was ok for a week.  We asked for a room at the back as we'd read about road noise. See attached photos. We slept most nights with the windows shut but we could see how, in a hot summer with no aircon, it could be sticky and windows would have to be open. To be honest, I wouldn't like to be there during a 40 degree heatwave like this summer's which we heard about from the guide. My…", "date": "October 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r90738986", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 5, "Rooms": 3, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great holiday", "review": "We had a great holiday here with friends. The rooms were clean and comfortable, staff were friendly, polite and spoke good english. Food was good, hot, with a choice of 3 dishes per course (3 courses). We would definitely go back to this hotel.", "date": "October 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r82582841", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "An enjoyable stay in a better than average 3 star hotel.", "review": "We stayed at this hotel in September last year and enjoyed Riva del Garda so much that we repeated the experience this year and stayed at the same hotel. Before we left home this year we read some of the poor reviews and wondered, \"Was this the same Gardesana?\"  Last year and this we found reception and dining room staff very friendly and helpful.  The meals were always tasty, varied, nicely presented and never, as one reviewer complained, cold or undercooked.  Yes, the rooms are not spacious but you are not living there.  There is adequate room, two large single beds, in our case shoved together, clean white linen and towels seemingly changed every day and plenty clothes hangers.  Our room had a tiny balcony with a table and two chairs and had a partial view of the lake and…", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r82057622", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "DONT DO IT!!!!!", "review": "When the best you can saw about a hotel, is that its clean, you know you're in trouble. The single rooms were smaller then a prison cell, there were zero facilities, no lifts and considering I was travelling with a group where most were over 50, it was highly inconvenient. Service was appalling and the food was cold, undercooked and very limited. Dont stay here....there are too many hotels around to be stuck in this dump!!!!!!!", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r80278961", "sub_review": {"Value": 2, "Location": 3, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 4, "Service": 2}, "travel_purpose": "", "rating": 2}, {"title": "Brilliant holiday", "review": "I have just returned from a trip to Lake Garda, Venice and Verona with the Travel Department.  It was one of the best holidays I have been on in a long time thanks to a great bunch of people, lovely hotel staff,  and a really lovely and helpful guide Annalise. The hotel is 20 mins from centre of Riva along the most beautiful scenery you could imagine.  Trips to Venice and Verona, around the lake and an optional mountain trip. So what if the food is not the best,  its a three star hotel, if you want cordon bleu then dont go on a package holiday. I would have no hesitation to recommend this trip", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r79677154", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "expect very little and you wont be disappointed", "review": "hotel gardesena isa basic hotel a good 20 mins walk from Riva. The single rooms are tiny, doubles not much better, ok for couples but not for friends sharing.  No air con and two euro a night charge for fan. Road noise goes on all night especially motorbikes.Rude unhelpful receptionist. No lift. Nice pool and garden.", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r77848248", "sub_review": {"Value": 1, "Location": 1, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 4, "Service": 2}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "gardesana budget hotel", "review": "the gardesana is a budget hotel in riva del garda. the hotel is located a good 25 minute walk from the centre of riva. this can be a problem as the area is subject to heavy and frequent thunderstorms in summer evenings, due to the proximity to the dolomite alps. the hotel has no air conditioning(a problem in Italy in august), though a fan can be rented at a cost. the hotel has no lift either. the food is of indifferent quality, usually consisting of a choice of fish or pork with a third choice. we ate out a number of times during the week and riva has plenty of good quality pizzerias. the staff are friendly and helpful though their local knowledge can be suspect. we asked about where we could hire bikes and were told the nearest one was in the centre of riva. Though it…", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r76275022", "sub_review": {"Value": 3, "Location": 2, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "very friendly, helpful staff, basic accomodation, basic food.", "review": "Our family have just come back from a trip with the travel dept. We stayed in hotel gardesana for 7 nights.  We found the staff to be very friendly and helpful.  The rooms were very clean but were basic with beds being very small and quite uncomfortable. We were situated to the front of the hotel where the traffic was very loud when trying to get to sleep.  The evening meal was included in the overall price, we weren't overly impressed with the food.  Our experience of eating out at lunchtime made for a more pleasant mealtime and a chance to experience good Italian cuisine.  The pool area was lovely,  lots of beds to choose from and shaded area under the trees too.", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r75685622", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 1, "Rooms": 2, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "cant believe the negative views", "review": "my sister and i stayed here for 1 week in june. we thought the hotel was spotlessley clean, staff very friendly and efficient. the hotel had the most friendly feel about it. as for the location, 20mins by a beautiful lakeside walk into riva. i honestly wonder what some people moan about. the pool area was ab fab, in peaceful beautifully kept gardens. we met some lovely people and would not hesitate to stay here again. In fact i wish i was there now.", "date": "June 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r75242580", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Don't go there.", "review": "The walls in the hotel are so thin you can hear the people next door use the toilet.  The food was really poor quality.  There was a choice each evening which consisted of pork or fish both tasted like they had been frozen.  The hotel is a long walk from the centre of the town and the pavements are a nightmare with bikes using them to avoid the busy road.  Crossing on the marked crossings is seriously dangerous.  The long transfer to this resort was not worth it.", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r74901880", "sub_review": {"Value": 1, "Location": 1, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 2, "Service": 3}, "travel_purpose": "", "rating": 1}, {"title": "Great Holiday", "review": "Just returned from Lake Garda. Beautiful place to holiday, good mix of people & stunning scenery. We found the hotel quite basic but spotless clean, good food & friendle staff. Couldn't ask for more. Would definately go back but would prefer the room to be a little bigger. Really enjoyd the Gala Evening. Good Craic.", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r74618656", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Underwhelmed !!!!", "review": "Good points - Nice pool and gardens + friendly staff.  Not so good points - No air con, Poor food verging on inedible, very small room next to a noisy road.", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r74461565", "sub_review": {"Value": 2, "Location": 2, "Sleep Quality": 1, "Rooms": 2, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Excellent in every way", "review": "I have just returned from my second stay in the Hotel Gardesana and I have nothing but praise for the accommodation and the staff. I stayed  there 3 years ago and enjoyed myself so much I was somewhat afraid that standards might not meet my expectations. I need not have worried. The accommodation is very simple but spotlessly clean and the rooms were serviced daily. The reception, kitchen and bar staff went friendly, courteous and went out of their way to be helpful to us at all times. We are vegetarian and the quality of our food was excellent throughout the week. I was surprised to read some comments that the food was poor as this certainly was not my experience. It almost seems churlish to mention that the rooms do not have air conditioning and that there is no lift but these…", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r73906993", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Friendly, simple hotel but needs an update", "review": "We stayed for 5 nights at Hotel Gardesana. We've never been to Lake Garda and had a wonderful stay in Riva.   The hotel was clean and the staff friendly and helpful. We nearly always had the pool to ourselves and the garden area was lovely and shaded by olive trees. The room and bathroom were adequately sized and clean.   The hotel was a 20-30 minute walk out of Riva but very close to the beach.   Our main reservation about this hotel is the lack of air-conditioning in the rooms. It was very hot and we paid to hire a fan and had to keep the windows open. Riva could get very noisy at night. One night we were kept awake until around 4am by load music from a bar.  The only other problem we noticed was the lack of security. Although we didn't feel at all unsafe in Riva we were a…", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r72462578", "sub_review": {"Value": 4, "Location": 2, "Sleep Quality": 1, "Rooms": 3, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "No Air Conditioning", "review": "I have just returned from a trip with the Travel Department & this was the hotel I stayed at. While this is a very clean hotel the nights were unbearable due to lack of air conditioning.If you are planning a trip with the Travel Department use the Liberty Grand you will pay a bit more but you will get a nights sleep. The Hotel Gardesana would possibily be perfect in the cooler months. The hotel is very clean,has a beautiful pool & garden area.I had a single room with a single bed, word of warning the room is small but ok if as you are not spending a lot of time in it. The website says all rooms have balconies, this is not true.As the previous reviewer said you can hire a fan, the one I got was noisy & no substitute for air conditioning.You can hire a safe, also very small you…", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r72444531", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Family run hotel where you felt part of their family", "review": "I have just returned from Hotel Gardesana in Riva del Garda with the Travel Department. I found the hotel which was about 20 minutes walk from te twn was very well positioned half way between two towns, Riva and Torbole. The lake side path to either town is just one minute from the gate of the hotel.  The hotel is cosy and very personal. Each member of staff is very welcoming and nothing that yo asked of them was a bother or a challenge to them. The outdoor is exellent for all ages, children to older adults and is maintained daily. As we were with the Travel Department, we were given menu's in the morning to select our dinner choices, where was a choice from 3 starters and 3 mains, which were all well presented and nutritious. The only downside is that there is no air…", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r71861553", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Fabulous staff", "review": "Everything for the staff in this hotel is \"No problem\"! - these are the words that I heard at anything I asked for during my stay! Possibly the nicest staff anywhere I have ever met. There aim is to keep you as happy as possible it seems! The day staff speak excellent English and a very homely feeling I would have to say!  To give examples, I was staying in Riva del Garda for a few days for work. The first morning, I slept it in for breakfast and when I asked for a coffee, the guy at the front desk offered to give me some food  as well - I didnt expect the breakfast i got to be free of charge though! Aswell as that, I had my laptop with me on my trip but it seemed to shut done wireless when I was in Italy (also in other hotels) - the guy at the front desk must have spent at…", "date": "June 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r69679099", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Rooms noisy at front..evening meal unsatisfactory", "review": "we stayed at gardesana. we had a front room with a balcony.  It was like trying to sleep on the motorway all night.  The noise from the road was un believable.  Were it not for ear plugs i would not have slept at all.  My partner could not wear ear plugs so they did not get a decent sleep all week.  The evening meal was totally unforgettable.  If travelling there do not book half or full board.  There are lots of good restaurants close by where you will get very satisfactory food at reasonable prices.  The only redeeming factors for this hotel are the waiting staff and its gardens and pool area.  The staff generally are very friendly, but the waiters really are excellent and very kind and friendly.  It has a lovely garden and pool area it is a shame the food in the evening is so…", "date": "June 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r69364752", "sub_review": {"Value": 1, "Location": 2, "Sleep Quality": 1, "Rooms": 2, "Cleanliness": 5, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Perfect Hotel", "review": "I have stayed several times in this lovely, family run hotel in Riva del Garda.  I travel alone and always choose this hotel for that reason.  The service is excellent, most efficient and friendly, the rooms are spotlessly clean, the seating areas very attractive and comfortable and it has a beautiful, private garden with a very well maintained pool.  The food is always a delight in the very pleasant restaurant and the staff very courteous and they will certainly remember you if you make a second visit.  The centre of Riva is just 15 minutes stroll along the lakeside or on the road which even though it is busy doesn't produce any intrusive noise, it really is a very quiet and peaceful location.  I really do consider the family to be friends now and I so look forward to the…", "date": "May 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r66016512", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "If you want somewhere to chill out - this place is it", "review": "My husband and I stayed in the Gardesana hotel last August on a 7 night holiday booked with The Travel Department.  I had stayed in this hotel before, and would recommend it to anyone.  The staff are very friendly and accommodating (I use a wheelchair but was given a room on the ground floor and helped up and down the steps every time I either entered or left the hotel), the food is lovely (I'm not a sea-food person, but everything else was gorgeous), they serve some of the nicest coffee I've ever had the pleasure to drink, and they are more than willing to recommend other places to try for food or leisure.  My personal favourites are the Al Porto pizzeria next door to the hotel, and the Hotel Sole on the lake front.  They are always willing to offer advice on what to do around…", "date": "August 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r65904405", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "excellent staff but bring your own food", "review": "this is a beautiful part of italy,all the hotel bedrooms are very small,after all the walking around and touring it would be lovely to have a bath,but only showers available.the dinners are not nice,the portions are small,a lot of the food is cooked from frozen,the first day our 7pm dinner started at 7.30pm. last night our special 7.15 gala dinner started at 8pm.", "date": "May 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r65275956", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "", "rating": 2}, {"title": "Excellent service and food, very enjoyable stay", "review": "We have just returned from a weeks holiday with the Travel Department in Riva Del Garda and staying at the Hotel Gardesana.  We were very impressed with the speed of the check in and the staff were very friendly.  We were in a side room on the first floor which was very clean but fairly basic.  If you would like a pool view you would need to ask for a room at the rear of the hotel as the view from our room was not too good.  The food was excellent with a choice of starters, mains and desserts all of which were superb.  The starters were as big as the main course and were very filling!!  The bar man in the evening, named Alio, was very good company and always had a smile on his face.  Nothing was too much trouble.  The walk to Riva is approximately 20 minutes walk but you can…", "date": "May 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r65102310", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Enjoyable stay in Lake Garda", "review": "We have recently returned from holiday in Lake Garda. We stayed at the Hotel Gardesana. We travelled with the Travel Department and thought the holiday was extremely good value for money, especially as it included trips to Venice , Verona, and a triparound the lake. We were delayed on our return journey by the ash cloud but were well looked after by the tour company and spent two extra nights in Lake Como which was a nice unexpected add on to our holiday!  The rooms  at the Hotel Gardesana although not large or luxurious were perfectly adequate and very clean. The staff were  very helpful and always pleasant. The food was plentiful and there was plenty of choice.The hotel is situated  just outside Riva but easily within walking distance and there is a lovely path along  the side…", "date": "April 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r63954875", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "", "rating": 3}, {"title": "basic accomadation. food outstanding.warm friendly atsmophere", "review": "The size of the room we where in was small and basic ,very clean, very noisy from the throng of traffic  at the side of the hotel at all times day and night. Food was excellent beautifully presented and piping hot. Staff were warm and friendly. Entertainment on the Monday night was very good it was a way of guests getting together for a sing song shame it was on for only one night in the week. As our holiday was a split one we preferred Hotel Gardesana to the one at Lake Como even though it was larger and much grander.Hotel Gardesana had overall a more welcoming atsmophere.", "date": "May 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r63877614", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 1, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "3 nights in horrific accommodation", "review": "Travelled to Lake Garda with the Travel Department on 7th April for 7 nights. On arrival our group of 4 were ushered to our accommodation which was towards the back of the hotel. The two rooms we were allocated were in a very tired condition and badly in need of updating. On reflection this area of the hotel looked like it hadn't been used in ages. On our second  night we noticed ants in the bathroom and the next morning informed the manager, who said the place would be sprayed while we were out that day. However, on returning to our rooms that night we were horrified to find the bathrooms infested with ants, crawling all up the walls and shelves. We had to emply and shake all our toiletries and even throw some away as ants were all over them. We also spotted some in the…", "date": "April 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r61890098", "sub_review": {"Value": 1, "Location": 4, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 2, "Service": 2}, "travel_purpose": "", "rating": 2}, {"title": "First class", "review": "Good afternoon, we normally don’t reply to costumer review, because of course everyone Have his own opinion about holiday, hotel, service and food.  In this case sorry I want to reply because I think your opinion is too much outside the true.  We allocate you in a ground floor room, because on the room request was written :  Both rooms large, nice and lowdown. Really important as ****** has asthma. We decided to allocate you on 2 triple rooms, larger that all the other rooms in the hotel. We understand that the hotel is not new, but we use always these rooms, for people asking ground floor room, family room or bigger rooms than normal, we was thinking of making something nice to you. You also never reported that to us, maybe we can try to move you before of the problem of the ants. We are sure that we made apologize of the problem when happened, and we do our best to move you to upper floor when the problem was not resolved.   We want to say also that the hotel is very clean, and could happen in a spring weather that some ants are coming in the room, maybe for some juice, maybe for something to eat that was in the rooms. But not for other reason. It could happen also in private houses to find ants,maybe you are not used to this in your country, but sorry here could happen.  We are surprised to read about the meal, because I remember that someone of your group told me that apart of the ants problem, the food was good. All the group was happy about the food, we didn’t get any complain and weare also surprised that you wait to go back home to report this. Yes some ingredient could be frozen at origin, more safer and clean for not having any problem with Guest, but not all the food, and anyway is not cooked from frozen.  We are really sorry for your holiday, but we always try to do our best for our Guest, we think that you can see other review before yours. Thanks a lot The management", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r45614784", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Great value for money - especially the food.", "review": "I arrived home yesterday after a 7 day stay at the Hotel Gardesana in Riva arranged through the Travel Department. I am amazed at the negative comments here about this hotel and feel that they may have been made about a similarly named place elsewhere (there are two hotels named Gardesana on Lake Garda that I am aware of). I found the hotel to be of the highest standard with accommodation,  facilities, service from and friendliness of staff - a special mention of Gabriella in the restaurant and the reception staff -and food all excellent. a most enjoyable stay and I will most certainly be back and would not hesitate to recommend it.  I was a solo traveller but with a large group who also booked through the Travel Department and all of my fellow travellers were of the same…", "date": "July 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r36868626", "sub_review": {"Value": 5, "Location": 4, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A great stay at the Gardesana", "review": "We stayed here for one week travelling the tour company \"The Travel Department\".  The food was really excellent for a three-star hotel.  Didn't have a bad meal - and I am difficult to please as I don't eat meat.  Rooms were quite small but had everything we needed (except a kettle).  Cleaning standards are very high.  Our room was at the side - we had a nice view of the mountains from the balcony but we did get some traffic noise.  Rooms at the back overlooking the pool were quiter but had smaller balconies.  The hotel has a decent-sized pool and a lovely big garden - mature pine and olive trees for shade.  The Travel Department are a good company  - we had several trips included (Verona, Venice) and the optional trip to the Dolomites was excellent.", "date": "July 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r36614328", "sub_review": {"Value": 5, "Location": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "A little jewel in Riva del Garda's crown", "review": "I stayed at the Hotel Gardesana recently with my husband and son during a holiday booked with The Travel Department. The hotel is in a good location slightly away from the centre of Riva del Garda but easily reached on foot. The nicest way is to cross the road opposite the hotel entrance and follow the footpath to the lake, then follow the lakeside path to the town centre. It takes 15 to 20 minutes and is breathtakingly beautiful. You can walk on the main road and it is slightly faster but we never bothered.  The hotel itself is mainly good value for money but a little tired in some respects. It is a modern block design with a traditional lobby and reception. We stayed in the summer and the guest rooms were in desperate need of air conditioning. There are a variety of rooms and…", "date": "July 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r36252784", "sub_review": {"Value": 5, "Location": 3, "Rooms": 2, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great location, friendly staff", "review": "This hotel is in a great location for Lake Garda the staff are all very helpful and friendly, the downsides are the fact that there are no lifts and no air conditioning, our first few days were good as it was pleasantly warm but it was quite uncomfortable when the temperature rose.   This is probably why the hotel is a three star, because the evening meals were definitely four star, well done chef.", "date": "July 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r34844447", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great welcome and tasty food", "review": "Went with friend on 29 April 09 as part of The Travel Department group. Very efficient hotel. Staff very friendly with good english. Lunch was specially provided after our long journey. The coach trip taking almost 3 hours was a bit tiresome. Rooms at rear tend to be small - as in most 3 star hotels in italy. Ours was fine. Towels changed daily, beds changed midweek. Travel Department should take a bow for organisation and the lovely Maria Pia who was our guide for the week.", "date": "May 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r29590157", "sub_review": {"Value": 4, "Location": 4, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "The most relaxing holiday we have been on", "review": "We picked the Hotel Gardesana based on the good reviews it had on this site. We had the most relaxing holiday ever. The food and service was excellent. Our room had plenty of space and was kept spotless by the staff. I think the hotel should have a higher star rating. The town near by was beautiful, with a lovely lakeside walk available. We were on a Traveldepartment tour and the tours were very well organised. We will return next year again for a holiday to Hotel Gardesana.", "date": "May 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r19495209", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 4}, "travel_purpose": "", "rating": 5}, {"title": "Wonderful holiday", "review": "Thanks to all the Monaci family  (and I do mean all) our stay in thier hotel was a most rewarding and worthwhile experience. The Gardesana was spotlessly clean and well maintained. The food was excellent. The bruschetta made with tomato,olive oil, garlic and oregano by John and Peter are excellent, but made by Carolina are most excellent. The hotel was basic and small as discribed by other reviewers, but it was more than adequate. My wife and I stayed for two weeks and found it not long enough. WE WILL RETURN, that is a promise. I could go on writting this for a long time,but I think thats enough for now Once more many thanks to you all. My fondest to Moma and Popa Regards Rod and Margaret", "date": "July 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r19229675", "sub_review": {"Value": 5, "Location": 4, "Check in / front desk": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "fantastic hotel", "review": "This was an excellent hotel to spend seven nights in. I booked it through the Travel Department and it was my first time booking a trip with them. It was a super experience. The hotel itself is immaculate, the food was second to none. The dinner menu changes every night, but you have to make your decision at breakfast time. There were a number of trips organized by the Travel Department and they were all excellent. The tour guides were very friendly and helpful. The hotel has a bar near reception and the staff especially the dining room staff were most welcoming and helpful. The particular group of people staying in the hotel and part of the travel department entourage were magnificent, everyone got on brilliantly. There is no lift as already pointed out by previous guest's ,…", "date": "June 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r19141529", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "", "rating": 5}, {"title": "Stunning Location", "review": "After a four hour drive from Milan Linate Airport (stopping for lunch for 45 mins) we arrived at Hotel Gardesana where we were received our room keys quickly and efficently.    Unfortunately, there is no lift so as it was part of a coach tour everyone regardless of age carried their own bag up. I'm sure we could have asked but after four hours from the airport we were just relieved to have arrived.  However, our bags were carried down on the morning we were leaving.  The room we had was spacious and clean with 3 single beds and still plenty of room to walk around.   The bathroom is well laid out but the shower is on the small side but not a major problem.    There is a small balcony with a table and two chairs as we were on the second floor overlooking the front of the hotel. …", "date": "May 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r17194661", "sub_review": {"Value": 4, "Location": 5, "Check in / front desk": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "", "rating": 4}, {"title": "Great value", "review": "After a rather long trip from Malpensa airport which is to the west of Milan it took about 2 hours 30 minutes our bus arrived at hotel at 12.40am.    We were keen to get to bed.      The room was small but very clean and very adequate.   We have been in smaller on our travels.   The bed was comfortable and allowed for a very refreshing sleep.       We were located to the front of the hotel with surperb views.          The meals were most enjoyable and as my wife is a veggie she was well catered for by very competet staff who were most hospitable and friendly as were the various members of the family who run the 'Gardesana'        We had no problems with noise.   The hotel is just a 3 minute walk from the lakeside or about 10 minutes into Riva del Garda.     Overall our stay was…", "date": "October 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r10793454", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Good hotel but Noisy..", "review": "We just returned from our first holiday to Lake Garda and stayed here for 4nights.  The hotel is in a good location, about 15/20mins walk from the main town of Riva Del Garda and about 2mins walk from the public beach.  The hotel itself was clean and tidy, breakfast was very nice and the staff were very helpful and polite.  We did find that due to the hotel being close to the main road and our room facing onto the road that it was very noisy, due to the amount of traffic that passes in and out of Riva. This was constant through the day and into the night. ", "date": "August 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r8664914", "sub_review": {"Value": 3, "Location": 4, "Check in / front desk": 3, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "", "rating": 2}, {"title": "Great time here", "review": "We have just returned from 7 days in Riva where we stayed in the Gardesana. I found the hotel to be basic but very clean and staff were friendly and helpful. We shared a twin room and although very small it was sufficient and was spotless. The balcony was also small  with enough room for one chair basically but the pleasant views of the garden and the mountains in the distance more than made up for this. There is so much to do and see in the area that it is unlikely you would spend much time there anyway. Something worth pointing out is that there is no lift in this hotel and it would not suit someone with impaired mobility as all rooms are situated upstairs. This was also a bit inconvenient where luggage was concerned but that is a very minor point and although no one offered…", "date": "July 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r8100702", "sub_review": {"Value": 4, "Location": 3, "Check in / front desk": 5, "Rooms": 3, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Nice hotel", "review": "I would agree with the previous reviewers however I did not find it noisy like the contributor from Cork, I was at the side of the hotel, so perhaps that makes a difference.  It is a small, comfortable, clean hotel with friendly staff and I loved the food.  Not suitable for people with mobility problems as there are no lifts. ", "date": "September 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r5835158", "sub_review": {"Value": 4, "Location": 4, "Check in / front desk": 4, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "", "rating": 3}, {"title": "Noisy", "review": "I though the hotel was very clean and location was excellent, especially if you had a car as parking was provided. Two problems I had with the hotel was the lack of air conditioning and the noise from the road and the noise from the people in the room next door to us. I would not stay in this hotel again. ", "date": "September 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r5812471", "sub_review": {"Value": 3, "Location": 4, "Check in / front desk": 3, "Rooms": 3, "Cleanliness": 4, "Service": 1, "Business service (e.g., internet access)": 1}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Lovely little hotel", "review": "Stayed for a week at the end of July. Situated with the majority of hotels about 20 minutes walk from the centre of Riva. Great value, really clean and the staff were very friendly. Nice pool and garden at the back of the hotel which is very quiet and relaxing. Only a couple of hundred metres from the Lake, where a path takes you to Riva alongside the lake and through lovely gardens. Riva itself is a fantastic town, large enough to contain a variery of excellent restaurants and shops - with a bit of culture thrown in. We had a room at the side of the hotel - if we stayed again, we would ask for a room at the back overlooking the garden - much quieter although the noise from the road wasn't too bad. Breakfasts above average for Italian hotels, evening meal OK too. Special mention…", "date": "July 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r5528383", "sub_review": {"Value": 5, "Location": 4, "Check in / front desk": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Perfect", "review": "I've just returned from two weeks at the Gardesana and have to say that, for a single traveller, I was very content there.  The hotel caters well for the single traveller, having single rooms at no supplement.  The rooms are adequate in size and comfortable.  The hotel itself is very clean and the food is a good standard, breakfast being pretty much the same each morning with a choice of cold meats and cheese, yoghurts, toast, bread rolls and plenty of jams, honey, etc to choose from.  I stayed on a Half Board basis and found the evening meals to be very good.  There are three choices for starter, main course and pudding - something for everyone I think.  My previous experiences of Italian hotels meant that Veal would be on the menu every night in some shape or form, but not at…", "date": "June 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r5444399", "sub_review": {"Value": 3, "Rooms": 3, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Good value and very clean", "review": "We stayed at the Gardesana in Riva during 6-13th August 2005, after reading reviews of hotels in Riva. The hotel is a few yards from the main road, so you do not hear the traffic and is only a couple of minutes' walk to the Lake on the other side of the road.I can thoroughly recommend the Gardesana, especially if you are looking for single rooms. We had a twin and our son had a single, both nice and clean and pleasant. Both rooms overlooked the neat garden with clean swimming pool, which was a bit cold as not heated. Food is good and varied(we didn't see one Pizza in the hotel all week!) although portions are quite small. The staff are friendly and all speak English in varying degrees, although they are not very flexible, so don't ask for something not on the menu! Breakfast is…", "date": "August 2005", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r3760984", "sub_review": {"Value": 4, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "", "rating": 4}, {"title": "one of the best value on the lake", "review": "stayed utilising 2 single rooms, find this hotel excellent if looking for single rooms, they are wonderfully clean and bigger than others we have stayed in. the food is well presented and very good, always bearing in mind the italian way of presenting food, always chose a substantial starter, the second course is good but not large, have found this to be the case in all italian hotels, there is a choice of three at each course, however the head waiter is very accomodating and they will prepare something else if nothing appeals, the staff are extremely friendly, and although most guests disappear around eleven, one can be served all night by the night porter, it is a pleasant walk to the main town along the lake and a little quicker along the main road, also a 20 min walk to…", "date": "July 2004", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314199-r3346158", "sub_review": {}, "travel_purpose": "", "rating": 4}]