[{"title": "Very basic", "review": "This is your basic hotel. Not all the rooms have AC so confirm before you go. We had only a fan. Expect to hear traffic if the room is facing the street. Swimming pool is good size and not occupied most of the time. There is a cafe downstairs. Breakfast is buffet style, coffee is automatic machine made so not the best quality. The staff is very helpful and nice. The lake is only 5 minutes away.", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r701115053", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "We were in the Coach travellers part!", "review": "We arrived on our coach tour to a clean, welcoming reception. We had a meal, of sorts, in the very white restaurant but then... the rooms. These were dross to say the least. Dark, probably 1960 last time it saw up date. Low and very hard bed. Odd couple of chairs, tv table, wardrobe and in the shower room, can’t call it a bathroom, had the green accumulation on taps etc. Is it age, dirt? Pictures attached. No English tv channels but chose not to use tv anyway as aerial fitting looked broken. No tea, coffee facilities. Breakfast was ok. Can’t go far wrong with my choice of cereal, some fruit and toast or bread. Juice, water and hot drinks machine. There always seems to be cakes   and biscuits at breakfast??? Evening meals were maybe typical offerings to coach tour quests. Soup, cooked meats, skinny fries with everything. One main meal consisted of two slices of pork with skinny fries!!!…", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r673363487", "sub_review": {"Value": 2, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Good location and nicely renovated room.", "review": "The location of the hotel is great, close to the beach - and walking distance from the old town.  Premiunm Room was very spacious and recently renewed with good taste and quality. Swimming pool is big enough. Staff was very helpful and Service was good. Breakfast could have contained more fresh vegetables and fruits - but selection was still quite good.  Plenty of parking space available.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r621286536", "sub_review": {"Value": 4, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "\"Nice Bar For Drinks and People Watching\"", "review": "We came here daily for afternoon drinks.  The outside area is nice for people watching and the drinks are fairly priced.  It was convenient for us as our hotel was across the street.  They make a good aperol spritz!", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r615491710", "sub_review": {"Location": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Coach holiday hotel", "review": "Well located hotel...the reception area is modern and welcoming. The staff were friendly, professional and welcoming. The room we were in was on top floor..it was quite small but did the job...shiwer wascacwet room with wc situated within the shower area. The floor took some time to dry out but we could live with this. The rooms were cleaned daily and to a good standard. No tea or coffee facilities in room. The swimming pool was clean but a bit chilly as didn't get a lot of sun  but this was September! Restaurant...excellent breakfasts..evening meals a bit hit and miss. Bar was reasonably priced, comparable to home..bar staff friendly and helpful as were all the hotel staff.", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r524171215", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "First visit to lakes", "review": "What a amazing hotel this is we loved it staff lovely Renata sorry if I misspelled name she was lovely to all the guests also a big shout to the young lady on  reception who sorted out  our upgraded room was not hotels fault or Thompson was another travel company anyway it was swiftly sorted no problem at all the food in hotel is also really nice thou I can't eat that much food but please do try it . Better than orther restraunts near by   location is also perfect close to a bus station and a few mins walk  from the lake itself I know it's going for a upgrade soon but still give this hotel a visit me and my husband were very very impressed thanks to all who work there also pool lady she was really nice anyway good luck for the future  Mr & Mrs DORNAN ", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r495909694", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Worst of all", "review": "Horrible rooms, discourteous staff, no internet in rooms, extremely bad service! Bathrooms are so small that you can relieve yourself and shower at the same time. The shower is exactly on top of the toilet seat with no space to move. The rooms are small and dingy. The owners are too old and don't give a damn. The staff is least bothered. No air conditioning, no tea/ coffee in room, chargeable otherwise, no mini bar and no drinking water in room. Dont stay here.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r492508639", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 1}, {"title": "Far from the best", "review": "We have just got back from lake garda and stayed at the la perla .we did not get the beast start as i did not book the la perla in riva but the la perla in garda so be carfull you get the right one when booking (Tomas Cook). the one in garda has a great review the other not so good and i can see now why.  I think the food was poor little portions so fill up on starters.  Rooms are clean but the bed is like concrete no give in the matres at all reminded me of my army days. And watch out for the shower its a small wet room and gets very slippy, if you fell there is no grab rail and you would hit the toilet bowl. other things like the TV which is to small and has only sky news in English tiny balcony may not bother some people.  We went in September and at no time did the sun hit…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r426896531", "sub_review": {"Location": 5, "Sleep Quality": 2, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Average, avarage and average", "review": "Nothing stands out as excellent and nothing stand out as horribel. Wifi was not available in my room due to bad reception, but I could change room and get Wifi reception after one days stay. Dinner was ok, but not more. The breakfast lack hot food and vegetables. The food was a bit booring overall. The bar is nice and the hotel staff is nice and welcoming. The rooms are small and the toilett and shower are sharing the same space.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r426169872", "sub_review": {"Sleep Quality": 2, "Rooms": 2, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Actonboyo", "review": "Room ok but no fridge. Staff friendly. Good location for the beach. Small bathroom. Evening meal terrible better eating at the restaurant next door. Locál bus service stops a few metres up the V. Roberto. ", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r415105208", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Very disappointing hotel to end our Leger Holiday", "review": "Stayed 2 nights at this hotel as part of the Leger holiday. If I was paying privately I would have left and found a better hotel. Pleasant dinning room with good staff, evening meal was adequate, breakfast good. The rooms are very tatty and basic, the pillows were extremely old and floppy. The shutter on the doors onto the balcony did not close and would not stay up just stayed half way up they were mended but had to ask for them to be fixed. Then we come the to bathroom. Very small supposed to be a \"wet room\" but was far to small, there was a curtain for the shower area but water spread over the whole floor making it slippy and very dangerous, if slipped would have fallen against toilet or wash basin. Would not recommend this hotel will be informing Leger of my concerns,", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r380528692", "sub_review": {"Value": 1, "Rooms": 1, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Diappionting end to Leger coach trip", "review": "Room in attics very shabby & dark , bed very old and worn room had a persistent odour , with very little light  Bathroom can only be decribed  as dangerous very slippery floor , shower over toilet ! More of a wet room I was terrified of falling as no carpets   No Wfi in rooms only  in reception it was hit & miss , food average", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r380325850", "sub_review": {"Location": 1, "Sleep Quality": 1, "Service": 1}, "travel_purpose": "Traveled solo", "rating": 2}, {"title": "Great place to stay", "review": "This hotel is ideally situated for sightseeing at Lake Garda in a nice location. The staff were good and the food, after eating in many Italian hotels, was very good and plentiful both for the evening meal and breakfast. The room was clean and we had three nights good sleep. Would love to go back to Lake Garda and would stay again at this hotel.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r375063741", "sub_review": {"Sleep Quality": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Disappointing ", "review": "Being a frequent traveler .. This hotel was a major letdown in my experience book  No wifi in room can be termed as the biggest flaw  Inadequate lighting in room next  Small rooms small bathrooms make the list further gloomy  I would run out of hot water if I were unlucky to have a bath second in number  Repetitive breakfast (for gods sake I'm not living in jail) 5 consecutive breakfast with scrambled egg is not my kinda thing  On the positive side the hotel and rooms were clean always    There are very good hotels nearby for slightly more prices .... I wouldn't mind spending the extra buck and staying somewhere else next time   No personal offense ... Courteous staff ..... Just not my kind of hotel I would recommend ", "date": "January 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r342517652", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 2}, {"title": "Lovely stay", "review": "On arrival, we could see the outside and reception looked like it had been recently refurbished, all clean and shiny which followed on throughout the hotel. Well maintained and cleaned daily.  We were given a front room on the 1st floor, lovely room but didn't get a wink of sleep, because of noisy main road. Asked to be moved to a room at the back of hotel overlooking the pool, which was immediately given, room 113. Great we thought until breakfast time, we were directly above the dining room!! So if you want a lie in ask for a room on an upper floor out the back. The room itself was clean and new, you could have twin beds or made up as a double. Plenty of storage and plug sockets. Old style TV up quite high on wall, which only received Skynews in English. In room safe FREE, yes…", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r315107158", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Average Hotel", "review": "We travelled with Italian getaways who promoted the Hotel as a \"flagship hotel\". This stretches credulity and pretty well sums up the standards expected of this travel firm. The Hotel is clean and the staff friendly. Our room was basic but had all the required amenities if a little soulless. The food was of varying quality but speedily served. The pool was surprisingly cold but kept very clean. Overall a very average hotel not up to the standard promoted by Italian getaways.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r314613589", "sub_review": {"Sleep Quality": 2, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "No view but close to the Lake.", "review": "From some other people's reviews I don't recognise this hotel.  We were in a refurbished room on the first floor overlooking the pool to the rear and facing the annex.  Scrupulously clean tiled floor and light coloured walls - perhaps summarised as 'monochromatic art deco' with 'hammered metal' effect doors to the rooms. Double bed was comfortable and whilst not spacious the room size was adequate, given that it was a bedroom not a daily living room.   On the downside there is no air-conditioning but a very quiet ceiling fan kept us cool.  Leaving the door open to the small balcony at night was not an option - mosquitoes.   The en-suite was entered via a sliding door. A wet-room with wc, bidet and inset wash hand basin.  The shower area was protected by a curtain and drained…", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r314384423", "sub_review": {"Sleep Quality": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Hotel La Perla, visit the ice cream parlour opposite the hotel", "review": "Some of the comments about this hotel have been a bit extreme. We stayed on the first floor with balcony, the room was quite spacious, clean and well decorated. The swimming pool was cleaned every day. The public areas were well appointed. Main complaint was the food which was dull, breakfast there was no fresh fruit, which, in Italy, was a shame. The restaurant manager did not handle pressure too well, at one point shouting at German visitors who sat the wrong table! Brilliant location, 5 minutes from the lakeside.  ", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r310425155", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Very basic hotel", "review": "This hotel was part of a National Holidays coach trip.  The rooms were very, very basic and had hardly any amenities.  For instance there was no tea or coffee making facilities, the television only had Italian channels.  The worst part of the room was the bathroom as it had no bath only a shower but there was no shower stall, there was a drain in the floor for the water to drain away but this was not very effective and everything would get soaked every time you had a shower, this made the floor incredibly slippery. There was no air conditioning in the bedroom, just a fan on a light fitting which was incredibly noisy so could not be left on at night but the room was so hot that it had to be left on all the time whenever we were in the room.  The common areas such as the…", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r307782725", "sub_review": {"Value": 2, "Sleep Quality": 2, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "First stay in Italy", "review": "Stayed 3 nights as part of a Leger coach tour. Room was adequate for 2 of us- a twin with a double and single bed. No air con!!! Noisy at night due to bar entertainment- music. which if you have to be up early means early nights are a mission, as no air con, so shutters have to be down all night to stop mossies, Food was good. Hotel has a pool for use at all times- which was lovely. Is positioned near the Lake where the locals swim in the evenings.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r307159504", "sub_review": {"Location": 4, "Sleep Quality": 2, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Very basic", "review": "I have just returned from a National holidays trip where we stayed at this hotel with my wife and two kids. The trip itself was fantastic, a lot of travelling but we knew that when we booked it. I must admit the drivers Michael and Barry where fantastic very knowledgeable and accommodating. The hotel we stayed at on the outbound and return journey in Metz was amazing the technopole in Metz. We knew it must be too good to be true to get a hotel of the same calibre in Lake Garda. We were right! The previous reviews on the food on here are correct, but what I would add is that there is very little to offer in the way of kids meals, on our first night we had no choice and were given what they had as we'd arrived late. The subsequent nights we had a choice of two starters mains and…", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r299626471", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Shame on you National Holidays", "review": "I would not class this as a hotel suitable under any circumstance. Room booked as a twin found to be a double,was told place was full and given sheets (single)to separate beds ourselves.Room allocated was filthy,shower curtain mouldy and corners of tiling never seen cleaning.Air con unit was placed on a chair I kid you not. At meal time the coach party was segregated from diners who had covered table and chairs whereas we had you guessed old wobbly chairs. Food offered (pre ordered)was worse that a roadside butty van,one main course was Ham Stew!!!! the whole party sent back majority offered. Photos have been taken of this awful place . Enough said nearly £700 for this", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r298668186", "sub_review": {"Value": 1, "Location": 2, "Service": 1}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Nice Stay", "review": "We have just spent 4 days here as part of the national holidays Lake Garda trip and was a little disappointed as the description in their brochure does not match the actual hotel.National holidays rate this as 3 star but althougth the public areas and the pool may warrant this rating the rooms certainly do not.On arrival we were allocated a room in the annexe part of the hotel which was totaly inadequate for persons of our age or size, the bedroom housed a large bed which the door hit when you walked in and the en suite was very small once in it was difficult to turn around and if you sat on the toilet your feet would be in the shower area consequently when showering the toilet could not be used , however when i complained we were moved with very little fuss and all the staff…", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r294847846", "sub_review": {"Value": 3, "Rooms": 2, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "One to avoid!", "review": "Spent 4 nights at this hotel as part of a National Holiday tour. First impression very poor! The main part of the hotel and the communal areas are ok but the rooms themselves are extremely tired and stuck in a time warp from the 70's!! Avoid the annexe rooms to the rear of the main hotel. They are minute, very dark and shabby and more like cells!! The room I was allocated was damp and the walls were partially carpeted to try and disguise the damp marks on the walls. No good if you suffer with chest problems or asthma!! Management should consider a full refurbishment of all bedrooms as not acceptable standard in our joint opinion. We were staying on a Dinner bed and breakfast basis. Choice at breakfast was very limited  however the dinners offered were awful and on a couple of…", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r273089766", "sub_review": {"Sleep Quality": 2, "Rooms": 1, "Service": 2}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Little Gem", "review": "Travelled to Riva for a friends wedding - Great hotel! So cheap and in the perfect location! Never ate an evening meal here but did have plenty of drinks! Not badly priced. Breakfast was included and it was lovely - Fresh continental and plentiful. Staff extremely nice and helpful. Your very close to the Lake. The rooms were very clean albiet a bit small but you get what you pay for IMO.  A good budget option for people who are not fussy and dont plan on spending their entire holiday in the room and then moan about it!", "date": "March 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r253957231", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Great staff nothing too much trouble", "review": "Nicely situated a short stroll from the lake.  Lovely bar area to the front of the hotel.  We were bed &  breakfast so cannot comment on the evening meal but breakfast is good as long as you don't expect bacon and eggs.  the lovely ladies on reception were very helpful as always so was the drinks waiter Michael.  Thank you to all concerned for helping us to enjoy our holiday", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r230712324", "sub_review": {"Sleep Quality": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "disappointed", "review": "On arrival at hotel first impression good, nice looking and clean. noticed two people booking in and were directed to the lift. We then booked in but were not directed to this lift, just asked if we were with new market travel and pointed to outside hotel. We followed limited instructions and walked over a ramp passed the swimming pool into the annexe. Found the grotty lift and went up 3rd floor to an unlit landing and found the room we had been allocated. .What a disappointment when we opened the door, two small hard beds that looked like camp beds a sort of desk and chair, wardrobe and a couple of shelves, so dreary more like a one star room than three star. The bath room was no better, tiny but everything crowded in shower, sink, toilet and bidet very little lighting and…", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r227745998", "sub_review": {"Value": 2, "Sleep Quality": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Ok but could be so much better", "review": "We have just spent 6 nights at this hotel, it was ok but it could be so much better, the entrance to this hotel is impressive, and  great to sit In the evening and people watch, the location is great across the road to the lake. The staff are great, reception and restaurant and the cleaners. Breakfast disappointed me with powdered fruit juices which were weak, evening meals - the salad bar was like a school canteen with the German coach trips cleaning it out after 5 minutes, so a lot of dishes were empty when we got down. The meals were ok though, lovely pasta dishes for starters.  We didn't use the pool, as it is mostly shaded by the other hotels. Wifi is charged €4 an hour which is ridiculous.so we didn't use it. The little waitress in the dining room worked very hard.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r226063108", "sub_review": {"Sleep Quality": 3, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Good but could be better", "review": "The hotel is located handily for the lake front at Riva.  We went for half board and the food (three courses plus basic salad) in the evenings was of a very high standard. Tap water is not available as an accompanying option, which is pretty much tight 19th century era thinking by the management. Its not available even if you by alcohol so its not just me being tight :) Breakfast is a cold buffet with enough options. BTW, you should try an ice cream across the road at Flora, to visit Riva and not do that?? Our twin room was very basic with lots of space and an assortment of mismatched furniture. It sufficed. The efficient chambermaid kept it spotless. We had rear facing (overlooking the pool) and so avoided any street noise (which does die down overnight anyway). The…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r222726967", "sub_review": {"Value": 3, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Hotel La Perla", "review": "On reading the reviews before I left, thought I had made a mistake about staying in this hotel with NewMarket Holidays.  This was not the case.  The hotel is in a good location, the rooms clean with plenty storage, and the food was ok.  Breakfast had a good selection and you could have something different every day.  Dinners always has salad, with a choice of 1st and 2nd courses.  Dessert had no choice, but my friend didn't like a couple of them and was served ice cream instead. A couple of negative things as the shower which did not enough water pressure and trickled out very slowly and was a hindrance. The other thing was that I could not get our UK adaptor to work in any of the power points so we had always to use the bathroom one for charging phones etc.  all in all this…", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r213955836", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "great stay", "review": "had a great stay here for four nights handy for Garda Town and surrounding areas  walk round the lake , you can walk and get the ferry into limone and malcesine which are both beautiful places, the staff are good but only speak in broken English but you can manage and mostly understand what they are saying", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r210583383", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 3, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Superb.", "review": "Having read some of the reviews before travelling I was a little concerned about what to expect.  The holiday had been booked as a birthday gift from my mother (86 years of age) for mother and daughter to celebrate my 50th birthday.  I wanted everything to be right!  What a true treasure Hotel La a Perla turned out to be.  We arrived mid evening and were quickly checked in.  Our room although small had plenty of storage space and a lovely balcony overlooking the pool.  The restaurant stayed open for us to enjoy dinner.  Breakfast was always a joy croissants fresh from the bakers to die for.  Everywhere was spotlessly clean.  All staff extremely helpful, happy to deal with any of our requests.  The bar was nice for a pre dinner Bellini.  Location wise - only 100 metres from the…", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r208294101", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "clean and tidy, small rooms", "review": "Stayed here on a Newmarket holidays tour late september. The reception area was smart and tidy the staff were welcoming and friendly. The room allocated was small but clean and tidy a small balcony looking over the main street. We were on a half board basis the buffet breakfast was nice , dinner was served at allocated tables, disappointing very plain and bland, poor service. The  hotel is short walk along the lake to Riva, we enjoyed the town, bright and lively full of nice bars and restaurants we wished we had booked b&b.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r189108404", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 3, "Rooms": 2, "Cleanliness": 4, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Disappointing, not recommended", "review": "Stayed at la Perla 6-13 October, and was very disappointed. Attractive reception area but that was it. Bar area very brightly lit with plastic chairs and a very small corner lounge area that could sit 3 guests. Very small bedrooms, no place to sit except the bed. Do not stay in the annex -dark and dingy. Bathroom even smaller and had to play musical chairs to ensure towels and toiletries did not get wet. shower did not work from day 1 and though maintenance came 3 times, they could not fix it, So had to use both hands to turn shower off and on. Unlucky with weather as it rained non stop for 5 days and rooms got chilly in the evening. Asked for heating to be turned on and were informed heating did not come on till October 15th,when the hotel shuts down.It was only when Newmarket…", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r182344629", "sub_review": {"Value": 2, "Location": 3, "Sleep Quality": 3, "Rooms": 1, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 2}, {"title": "our perfect week in Riva", "review": "We wanted a perfect hotel to celebrate our golden wedding anniversary and this was recommended by Newmarket Travel. We weren't disappointed as it was well situated, very clean, food excellent and the staff couldn't have been more helpful.  Yes, the bathroom was small and there should be more drawer space for clothes but if you want luxury go to a more expensive hotel. We stayed for 7 days. What was annoying was the coach parties who came into the dining room and expected to be served straightaway, couldn't make up their minds and spent ages talking then complained their food was cold. The waiter was pushed to the limit but kept his cool.  He was amazing.  Will definitely recommend la Perla and return in the future.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r178446774", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "La Perla Hotel", "review": "We have just returned from La Perla Hotel, Riva del Garda, after reading so many negative reports we were worried about where we had booked, absolutely no need - the hotel was spotlessly clean, the staff were lovely, we were in room 210 which was huge, three double patio doors and a side door onto the balcony!!!  We could not complain about the food, the breakfast was the same each morning but enough variety to change what you chose, the evening meal was three courses served by smiling staff.  I think the negative comments may come from people who book a 3 star hotel based on the price and expect 5 star facilities.  This hotel is located close to the lake with lovely walks and a stroll into the centre of Riva del Garda with all the shops, harbour, boat trips etc.   We travelled…", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r178421766", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "We won't be returning", "review": "The hotel was described as a top rated hotel by the holiday company Italian Getaways. Our first room & bathroom were so small we asked to be moved & were given a bigger room but still had a problem in that the bathroom floor was soaked after each shower & we couldn't get our feet dried in the bathroom. The decor in the bedrooms & bathrooms does not appear to have been updated since the 1970's. The food was very poor - breakfast was the same each day & was edible but the food was not great - processed cheese, not very fresh rolls & tinned fruit. Dinner was mostly quite awful and as well as poor quality, the portions were small, plates were cold and there was little or no choice. We had not gone on a coach tour but were expected to sit with people we travelled from the airport…", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r178051777", "sub_review": {"Value": 2, "Location": 5, "Sleep Quality": 3, "Rooms": 2, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "OK", "review": "We were put in this hotel under protest by Italian Getaways when we arrived at Lake Garda. We had booked Malcesine so were not well pleased. V clean hotel. We thought food was a bit boring so ate out except for breakfast. Hotel was noisy; we were disturbed by bogus telephone calls at 3am asking us to go to reception. In the morning they denied all knowledge at reception so how do they get to phone your room and disturb you? The hotel is near the lake but it is a fair walk into the centre of Riva. The Italian Getaways rep did not provide info on the resort; not even a map and the photocopy maps of Venice provided on the trip were illegible.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r178047877", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 2, "Rooms": 3, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Clean but basic hotel", "review": "Went with an open mind after reading reviews.  Hotel spotlessly clean but room (326) was incredibly hot with only a fan not air conditioning. Small bathroom but adequate. Think rooms in block behind pool are better.  Breakfast okay - exactly the same every day.  Dinner variable but as included by Italian Getaways you can eat out.  Have to chose at breakfast for evening and would recommend going to dinner early to guarantee your choice.  Fish dishes were quite good.  Staff all helpful and polite.  Very nice pool. Fifteen minute pleasant walk along the lake side to Riva centre but shops and cafes also very close. . Went with Italian Getaways on last minute offer - they were excellent and we have no criticism of them at all.  Local guide Ambrish was brilliant. Would stay at…", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r177769959", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 2, "Rooms": 3, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "ok for the price", "review": "We stayed here last minute. There were many complaints about the rooms and food from other guests. Our room was fine. What I expect in a 3* hotel in Italy. Did not eat dinner in the hotel, as a seasoned traveller around the world we have found all hotel food crap. We found staff helpful and polite. A lovely swimming pool very clean. I would say, we got it for £1241, which was good value for money.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r177663795", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Not what it said in the brochure", "review": "We should have checked the facilities and comments on Trip Advisor before booking instead of accepting what it said on the holiday company's web site We specifically selected this hotel as it was said to have air conditioning as we knew it would be warm and humid at night. None in evidence in any of the rooms of such a facility but we did have a noisy free standing fan. Food was at best average with inadequate staffing and poor quality service although the staff tried very hard. We won't be using the hotel again - it is primarily geared up for short stay coach holidays.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r177008204", "sub_review": {"Value": 2, "Location": 4, "Sleep Quality": 1, "Rooms": 3, "Cleanliness": 4, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Hotel La Perla Lake Garda", "review": "Brilliant location, just returned from a week at this hotel, easy short walk to the beautiful Lake Garda.  Rooms very basic but very clean, clean towels every day, always request a room overlooking the pool, we were lucky to be allocated one as its rather noisy is you have a room at the front of the hotel.  Food was okay, when we booked we got free half board upgrade so had nothing to complain about except portions were small, good help yourself continental brekkie.  Overall loved the gorgeous Lake Garda and Ambrish Ullal who was our guide on the tours, EXCELLENT.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r177004051", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 3, "Rooms": 2, "Cleanliness": 4, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Pleasantly surprised!", "review": "Having read a lot of negative reviews on Trip Advisor, we were preparing ourselves for the worst, but it turns out we didn't need to as we were very happy with the hotel. We got the August deal with Italian Getaways (company based on the isle of wight) and with them we got a free upgrade to half board. We decided that if the food was as bad as it sounded on here we'd eat out instead, because that's what we had budgeted for anyway; in the end we ate in the hotel 5 out of the 7 nights we were there.  The meals consisted of three courses, with at least two different choices for the starter and main. The starter was usually something like pasta, soup or risotto and the main would be meat or fish with vegetables and potatoes. There was also a salad buffet and fresh bread available,…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r176095974", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Could have been so much better", "review": "We made the mistake of booking this hotel with Italian Getaways and were told the trip from Malpensa would be 90 minutes - almost 5 hours later we arrived \"very tired\" so not the best start to the holiday. Don't travel here from any Milan airport during the busy season the traffic around the lake is awful and because of drop offs they use the lake road rather than the motorway.  We were then given two of the smallest rooms I have stayed in  - at least you could walk round the two beds that were next to each other on both sides and the bathroom you could shower sitting on the loo if you had wanted to as it was directly in front of it. It is a wet room so is flooded if you use it.  Room 317 the door does not shut unless you lock it and if the cleaner leaves it open your room is…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r175141311", "sub_review": {"Value": 2, "Location": 5, "Sleep Quality": 2, "Rooms": 1, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "A memorable stay", "review": "When we book we were a little concerned based on some of the reviews posted here. However, we were very pleasantly surprised. The hotel is spotlessly clean and the staff very polite and helpful. The location is ideal, no more that 100 metres from the lake. There are things we could criticise - lack of drawers, air conditioning etc, but this is the same as every hotel. This is a 3* hotel and some of the 4* hotels we have stayed in around the world have been far worse. The food was very good - varied, well-prepared and well-presented. The portions are adequate and we never left our table wishing that we had more. I can only imagine that those who have criticised the food are the kind of people we see often in buffet style hotels who pile up their plates only to waste much of what…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r173879875", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Food Attrocious", "review": "Riva is one if the most beautiful places on earth, however La Perla is one of the poorest hotels in the area.  The hotel is very basic, small rooms, basic wet room that you can hardly move in (however good shower).  The room had two small bedside tables that were too small to use. A wardrobe that smelt musty, so unable to put clothes in.   However the worst things about this hotel are the surly receptionist who forgot to smile for the whole week, and the absolutely awful food.  On our arrival night we were offered cream of chicken soup and beef stew, no other options were available.  We walked out.  We also tried another night but the food was inedible and very english.  Did we travel all the way to Italy to eat english food that resembled something I might have been offered at…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r172924125", "sub_review": {"Value": 2, "Location": 5, "Sleep Quality": 3, "Rooms": 1, "Cleanliness": 5, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "See for yourself", "review": "I know there are widely differing reviews on here so i will be honest. It appears that the hotel owner doesnt really want to spend money improving the food portions or quality here. Breakfast is fine...same each morning and something for everyone- boiled eggs, bread for toasting, choice of cereal, croissants and other italian breads.The hotel is clean and rooms are basic but also cleaned daily. Air conditioning would help, as ceiling fans dont really keep rooms cool in heatwaves, especially when you dont want to open windows if over pool area as biting insects come in. Evening meals; we were lucky enough not to have paid as we received a free half board upgrade(although i did only eat 3 times). Very little in the way of vegetarian option. Small portions, often…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r170254219", "sub_review": {"Value": 2, "Location": 5, "Rooms": 3, "Cleanliness": 4, "Service": 1}, "travel_purpose": "", "rating": 3}, {"title": "Great Location", "review": "Just returned after 7day stay, we really enjoyed the great location and amenities the hotel offered...pool, sunloungers, internet, table tennis, tv lounge, bar and a mini lift was a novelty too. Close to the Lake, supermarket, shops and restaurants and 10min walk to more shops, bank, post office etc.  The breakfast was great; continental choice including hot boiled eggs, selection of fruits, yogurt, crackers, breads, sweet cakes, tea and coffee.  The room was clean and tidy, with a balcony and bidget which was a nice surprise, safe, hairdryer with selection of soaps and shampoo. Maybe not quite a 3* but not far off..more travel inn. The location certainly made up for it. It would of been nice extra for a mini fridge, tea & coffee and air con, but you would pay more per night.…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r170191285", "sub_review": {"Value": 4, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "THANK YOU LA PERLA, EVERYTHING WONDERFUL", "review": "Just finishing a weeks holiday here.  Beautiful scenery all around.  Beautiful lake. Beautiful mountains.  Fifty metres from beach.  Shops and cafes and bars all around.  Hotel rooms spotlessly clean.  Pool lovely and clean.  For and service everything that could be expected of a 3 star hotel.  We were also invited on two free trips, one to Venice and one to Verona.  They were both wonderful with interesting guides.  Venice was one of the most breathtaking places I have ever been to.  It is a must if you get the chance to go.  We would definitely go back to Lake Garda and back to La Perla.", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r168196575", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Give it a miss!", "review": "Lake Garda was stunning but La Perla Hotel was very basic, no air conditioning in room or tea/coffee facility. No drawer space in our room just a small table which doubled up as dressing table. Breakfast was adequate but same every day, evening meals were dreadful very small portions, instant mash potato or fried potatoes every night, dry and unimaginative meals, very few vegetables and what we did have was really overcooked.  The restaurant staff worked hard but could not cope with the volume of guests so we were often kept waiting long time between courses.Visiting coach parties semed to get preference being served over regular clients. The week we were there the hotel was overrun with very noisy school kids who comandeered the swimming pool.  Would not recommend or re-visit.", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r167931165", "sub_review": {"Value": 1, "Location": 5, "Sleep Quality": 1, "Rooms": 2, "Cleanliness": 3, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Nothing to recommend but location.", "review": "La Perla is a five minute walk from Lake Garda and spectacular views but otherwise I cannot recommend it. As a solo traveller on an escorted tour my room was inferior with virtually no daylight. As a vegetarian I found the food dreadful, for example I was served three slices of courgette when meat eaters were given a chunk of chicken. The waiters tried to be helpful however - mean kitchen economy is not their fault I think. It is just as well that I visited Italy for the sights and history and not the hotel.", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r166475791", "sub_review": {"Value": 2, "Location": 4, "Sleep Quality": 2, "Rooms": 2, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Very good hotel", "review": "This was a last minute booking, as due to illness I had to get approval from my hospital consultant.  When we were reading the reviews for the hotel we were really worried that it was not going to be up to standard as they made very poor reading.  These reviews could not have been more wrong as far as we are concerned. the hotel was very clean, the staff polite and the food was a very good standard and varied. I can only assume that anyone complaining about the food obviously don't like Italian food. If thats the case don't go to Italy. Would go back tomorrow", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r166302575", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very poor food", "review": "I have to say food was awful! More like hostel food than a 3star hotel!!Salad bar was so basic just lettuce-carrot-beetroot-sweetcorn,Meals you had to order night before,Choice of 2 starters 2main an sweet,Main meals were meat or fish potatoe an 1 veg,\" 2 evenings that veg was tinned garden peas!!!!!!!!!!The hotel was in a very good location,But apart from that this hotel sould be down graded,The reps knew all about the food but were unable to get us somewere else!!Did offer us £50 each to eat out,How was £50 going to feed us for 6 nights!!!All we wanted was some decent food,Do think newmarket travel sould take this hotel to task!!!!!", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r163849669", "sub_review": {"Value": 1, "Location": 5, "Sleep Quality": 3, "Rooms": 2, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Great location", "review": "This hotel is in a great location, just a short walk straight ahead to the sunning lakes. The hotel was spotless, the room was small but only to sleep in, (very comfortable bed). Would of been nice if there was a mini fridge and tea and coffee facilities. The bar and dinning staff were very nice, although there could of been more waiting staff to help out the others. The food was good, but it was like having ration's  with not much choice, (also had to wait a long time because of the lack of staff).  Overall the hotel was good, would stay here again.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r163337960", "sub_review": {"Location": 5, "Sleep Quality": 5, "Rooms": 3, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Not good enough for 3 Star", "review": "Returned from Hotel la Perla after one weeks stay, what a disappointment .This hotel falls well short of its 3 Star rating.A complete refurbishment and upgrading seriously required if to be allowed to keep current grade.The first room (No.255)we were offered was very depressing with worn out and dated MFI furniture,the en-suite was so small if you sat on the toilet it was possible to take a shower at the same time.On refusing this room we looked at room No.101 slightly larger but similar type furniture with a plastic patio chair up to the dressing table,the balcony was poorly located partly behind a sheer brick wall consequently room was permanently in the shade and was always cold.No heating on in the room or in the hotel but was kindly offered a blanket to walk around in to…", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r163268577", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Very poor hotel", "review": "Just returned from 7 days at la perla food terrible meals very small no vegetables just tasteless . Rooms very small and very dated bathrooms to small no room to move ,only room for 1 person at a time ,balcony overlooking a dirty swimming pool and patio area .hotel freezing cold asked to put some heating on and where offered a blanket .we spent most of our time at the next door hotel where it was pleasant and warm ,will never return there again", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r162705701", "sub_review": {"Value": 1, "Location": 3, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 3, "Service": 1}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "What a let down!!!", "review": "Just returned from 7 cities of Rome tour and stayed 3 nights here, dinner bed and breakfast. The hotel is nicely situated and very clean, however the rooms are tiny. The bathroom was tiny with the toilet and shower being separated only by the shower curtain. The service in the dining room was woeful, the food was very basic, and the staff were surly and unhelpful . The best part of my stay was when we checked out in the certain knowledge that the next hotel couldn't be any worse.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r162086569", "sub_review": {"Value": 1, "Location": 5, "Sleep Quality": 3, "Rooms": 1, "Cleanliness": 5, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Comfortable and clean but Average", "review": "Just returned from 7 cities of Rome tour and stayed 3 nights here, dinner bed and breakfast. Good position and clean, room comfortable. Food was average nothing special Staff were helpful and polite however not too welcoming on arrival at midnight, no hot drink available on arrival after long travel.", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r160952510", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Avoid", "review": "Just returned from 7 cities of Rome tour and stayed 3 nights here, dinner bed and breakfast.   Good position and clean.  However the food was dreadful and the service even worse.  We had to ask for our meal every evening despite being with a large party.  It was as if we were invisible.   One of our party asked for a slice of sweet pastry that was on the menu for dessert, not realising that because she had not actually ordered it she deprived another person of dessert, it was all measured so precisely.   They were short staffed with staff running round in circles working hard but not coping, and this was low season!  The rooms are very basic with nowhere to sit comfortably to relax and only the bar downstairs to sit in upright  chairs.  No lounge.", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r160267632", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Disappointed", "review": "This is ok for b & b only.  We stayed here whilst on a package touring holiday.  Dining room a complete shambles.  Of the 3 nights we stayed here we had to ask for our meal to be served  on 2 evenings despite waiting patiently for over 1/2 hour for a member of staff to approach our table.   We felt as though we were invisible. Evening meals v poor standard but breakfasts acceptable. Disappointed.   Good position and very easy walk into Riva del Garda which is lovely. Rooms clean but basic.", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r159718736", "sub_review": {"Value": 1, "Location": 4, "Sleep Quality": 3, "Rooms": 2, "Cleanliness": 4, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "hotel mix up", "review": "Everything was awful at the hotel perla, riva del garda.- Do not get this hotel mixed up with la perla garda which is very different. The food choice was very basic. The salad bar was a joke. We had an ant infestation in our bedroom which got into our suitcases and all over the table. We were half board but ate out at the nearby Savoy hotel as many others did.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r151036208", "sub_review": {"Value": 1, "Location": 4, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Nice Hotel", "review": "I am living in this hotel from last 10 years and it is very good... The room are good and also the breakfast is good. The bar is open till 12 in the night and the best part is that you will find everything in the near by such as restaurant, shopping, supermarket...", "date": "January 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r150003886", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Terrible room and shockingly bad breakfast", "review": "I'm a bit late reviewing this hotel but as I'm reviewing some recent stay hotels thought I'd add this one as it was so bad!  The room was atrocious, really basic, poor beds, really small, felt like I was in a hostel not a hotel.  I stayed here as I was attending a wedding and I needed to iron/steam my bridesmaid dress.  Not a chance.  No iron or steamer available, no in-hotel service to do it for me, and no help to send it out.  Finally, luckily, I asked in the five star other guests were staying and they had it done for me, at a price but that was not the issue.  Fact is if you need an iron you will need to pack one!!!  The worst thing about this hotel, apart from the terrible service, is the breakfast.  Just the worst breakfast I think I have ever come across in any hotel I've…", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r145653878", "sub_review": {"Value": 1, "Location": 3, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 3, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "ignore adverse comments", "review": "We stayed here mid September and enjoyed it greatly. The position was ideal, the staff very friendly and the room pristine .The food was fine,it is Italy and if you expect roast and two veg then stay at home. The pasta was the best I have eaten and the main course was perfectly adequate.Yes the hotel is on the road but they all are even the 5 star. Everyone used to enjoy watching the assortment of vehicles that went past. There is no way the hotel deserves such adverse reviews. After reading them we were very apprehensive about going to the point of cancelling the holiday. If we had of done we would have missed a very enjoyable week.  We would have no hesitation in recomending this hotel to any one and would certainly return if holidaying in the region again", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r143221983", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice comfortable Hotel", "review": "We booked this hotel after our cruise on Queen Victoria was cancelled due to propulsion problems. We booked through Italian Getaways of the Isle of Wight and recieved first class service. My brother had a wheelchair and we were assisted both at Gatwick and Milan and in the hotel.We were looked after by The Italian Travel Company who transfered us to and from the hotel and arranged our trips. We had free day trips to Venice and Verono. Superb. The hotel was welcoming. The staff pleasant and efficient. We had large accomodation at the front of the hotel with no problem with noise [ don't know what other reviewers have moaned about] the hotel was light and airy and comfortable and positioned just across the road from the lake...Breakfast was plentiful with good choice. Dinner with…", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r142962934", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent holiday with a great hotel", "review": "A great location , 1 minute from the lake and about 5 mins from the town centre. Good reception area with bar and outside seating area. All staff from our arrival until leaving were nothing but wonderful with extra marks for head waiter. All the food was good , a lot better than expected after reading some reviews, I don't know what people expect for the price but this was certainly good value for money and always very nice. We had a front facing bedroom with a balcony and fantastic views, good room with comfortable bed and great shower, always kept beautifully clean. All in all a great holiday helped by a great hotel. Would certainly go again and recommend it to any one. 3 star hotel , 2 star prices. Enjoy .", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r142840684", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great Location Go Out and Stay Out", "review": "Traveled and stayed here as tour group lovely location so close to lake and pectacular scenery shame about the hotel hotel check in was is organised and location of room hard to find.  rooms out dated to point of being dangerous. The food was orange not matter what it was, and the guests were made to feel a burden to the staff for mearly being there. we witness guest being  made to feel gulity for food allergies and special requirements", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r142511817", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 2, "Rooms": 2, "Cleanliness": 3, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Average is right", "review": "We found the reception staff to be helpfull although we were miss directed to the lake.  Having arrived at night we did not realise that walking across the road and down the street opposite took us to the lake in 4 minutes.   Our room was at the front of the hotel overlooking the road.  This was noisy at times and we were woken at 5 .30 one morning with heavy traffic passing.  We were allocated a family room which meant the two of us had plenty of space.  The bathroom was newly  tiled and the shower efficient and hot.  We also had a dressing room with an additional basin and a fridge--very useful.  The bed was barely comfortable.  The matress laid on a wooden board!  A tv is available but shows only italian programmes. Food at the hotel was adequate.  I am wheat intolerant so…", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r142072478", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 2, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Service? What service?", "review": "This was part of a tour package. After travelling the length of the beautiful lake with the commanding Dolomites, we arrived at the hotel, which looked good. However, the reception staff including the owner, were almost hostile. The room was small and dark. Very basic but very clean. The restaurant was full of guests but only 2 members of staff were there to serve us all. They were most courteous and polite and eager to please. I felt sorry for them. I quite enjoyed the basic food and never left the table hungry. I would never have any desire to return to this hotel and would not in any way recommend it. My only concern would be that the two waiters in the restaurant could be made redundant!", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r141269708", "sub_review": {"Value": 1, "Location": 4, "Sleep Quality": 3, "Rooms": 2, "Cleanliness": 4, "Service": 1}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "OMG!!! where do i start", "review": "This was a package holiday and we were met by miserable reception staff. Then my mum was put in the building opposite on the other side of the pool on her own in a tiny dark room with a public toilet and shower on each side of her room so she ended up stayed in the same room as myself and hubby for the rest of the duration luckily we had 3 beds. The pillows were like rocks an just as heavy. The waiters were friendly but very understaffed as there was only 2 to serve the whole dining hall, so for a very small portioned 3 course meal from start to finish  was just over two and three quarter hours, the meals were extremely salty with potatoes and greenbeans, so we ended up going out to eat.  The reception staff only speak and understand english when it suits them, if you ask…", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r141144996", "sub_review": {"Value": 1, "Location": 5, "Sleep Quality": 2, "Rooms": 2, "Cleanliness": 4, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Does Not Deserve Even One Star", "review": "I cannot believe that some people can give this hotel 4 or 5 stars!   Did they stay at the same place as I did?   The service and food are appalling.   The rooms are dismal.   We were told that there was satellite TV but there was only Italian.  (One day it poured with rain and we were unable to leave the hotel so we would have liked some diversion).   The swimming pool was not heated as advertised and was not maintained (I took photos of the debris).   I was not made to feel welcome at all.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r140740759", "sub_review": {"Value": 1, "Location": 1, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 3, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Do not stay here", "review": "On the positive side this hotel looks good and is clean. The negatives however outweigh the positives. Upon arrival we were told we had to move to another hotel. Then were told it was ok we could stay there. The room we had was tiny, the furniture cheap, the bathroom small and cramped, the curtain torn and the ouside shutter jammed at head height. The pillows were rock hard and had to wait 2 days until a second one arrived. the waiter on the first night spilled a pint of beer over my partner, no compensation was offered and we had to ask that the clothes be cleaned. The food was the worst I've ever had in a hotel. On our final night there the fish was so bad that those of us on my table who had it could not eat it and it was sent back, we were offered cheese instead which we…", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r140575881", "sub_review": {"Value": 1, "Location": 4, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 3, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "La Perla @ Riva  Hotel is the PITS!!", "review": "I have just endured a miserable five days in this hotel. They only show the new rooms in their photos, mine was not just shabby but was dilapitated. Cheap very old plywood furniture that had lost it varnish, wardrobe door had no handle just a hole to put your finger in to open the door, bed was grey metal camp bed with folding legs, shower room was dingey chipped and cracked floor tiles that had been filled with cheap filler which was dirty. The food was absolutely disgusting! Reconsituted meat tinned peas and carrots raw  veg all served cold. We had to wait for over an hour to be served our dinner, I had to eat out at lunch time because I just couldn't stomach the foul slop that was being served up on a daily basis.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r140468904", "sub_review": {"Value": 1, "Location": 4, "Sleep Quality": 2, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "la perla   more staff please", "review": "the staff were hard working and nice but shortstaffed so the service in dining room was slow.         the food was poor tinned vegtables. swimming pool  freezing not heated as stated.     but the area is beautiful", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r140458507", "sub_review": {"Value": 2, "Location": 4, "Sleep Quality": 2, "Rooms": 3, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "more bad than good", "review": "We've been to the Hotel La Perla in August 2012 for one night - it was the last night on an organised trip crossing the alps with a mountainbike. We did stay in the rear building, which had the advantage of being quiter. good: the location close to the lake (but with the downside that the front building lies at the main street, which is very noisy) bad: the rooms haven't seen any refurbishment for quite a while. But I couldn't believe, how small and old the bathroom was - the shower courtain divided the bathroom and you could take a shower only almost sitting on the toilet (the pictures on this website are true!). The storage room for the mountainbikes was a big laugh.  OK: Bed was OK, also breakfast (knowing that in Italy usually the breakfast is rather basic) However, knowing…", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r139919153", "sub_review": {"Value": 1, "Location": 4, "Sleep Quality": 3, "Rooms": 1, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "\"La Perla, never again\"", "review": "If there was a minus for staff and service I would use it. From arrival the staff were unfriendly, unhelpful and and times rude which I complained about without apology. In my opinion the rooms were definately nowhere near 3* standard and the floors not properly cleaned as I found out when I spilled something on the floor and cleaned it up myself. As there was no AC and the ceiling fans did not work properly I asked for ice to keep my water cool for during the night due to the heat only to be refused more than one small plastic glass. Everything semed to be too much bother and not a smile in sight.  I chose to eat all my lunches & dinners at nearby Restaurant Velvet where the staff made up for my disappointment. Also, at breakfast most times plates teacups and milk containers…", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r137802206", "sub_review": {"Value": 1, "Location": 5, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled solo", "rating": 1}, {"title": "La Perla, as I saw it.", "review": "Just back from Riva Del Garda, having spent 7 nights at La Perla on a Bed and Breakfast basis. I have to say that I have no complaints whatsoever with the hotel. After reading all the awful reviews, I was dreading it. The hotel is in a good location near the beach and the standard of food was good, all week. You could eat as much as you wanted for breakfast. Yes, it is repetitive but having stayed in 3-star accommodation elsewhere in Garda, that is what you can expect.  The staff were friendly, pool cleaned every morning, the rooms were a bit jaded but kept scrupulously clean. No air-con but the ceiling fan kept the room comfortable. Bathroom cramped but always plenty of hot water and clean towels. I would not hesitate to return to this hotel.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r137577942", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "La Perla, no pearl anymore", "review": "Minus: First at arrival room were badly cleaned. There was even left some medication pills on the bathroom sink, probably from the guest before. Our young son could have eaten that.  Not good.  Secondly no AC, but that we knew from before arriving. Problem was that the ceiling fans did not work, we politely asked them to fix it or change our room cause it was hot and my pregnant wife needed it. They did neither, no working fans or change of room. The fans was never fixed during our three nights stay. We had to sleep with balcony door open to the busy street. Problem was we lived at first floor so it could be climbed and entered without too much problems.  Breakfast was ok but they often ran out f.ex yoghurt or other things a hotel shouldnt run out of. No wifi and using a old pc…", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r135643470", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Dont even go there", "review": "Just come back after a week at the La Perla and have to agree with most of other comments about terrible food. Newmarket travel allocated our hotel on arrival and we know now why.Had we known we were going there we would not have upgraded to half board and would have eaten out Food very repetitive and not much of it. missed one evening meal while at opera given a pack up  which consisted of dry bread rolls and cold meat, cheese and boiled egg left over from breakfast, which we paid approx. £8.00 each for! First two days fried egg,sausage and mushrooms available for breakfast which then mysteriously disappeared along with selection of cake. One day not even the statutory boiled egg was available. Terrible weak cup of coffee with breakfast not even a drink provided with evening…", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r132761422", "sub_review": {"Value": 2, "Location": 4, "Sleep Quality": 2, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "A Really Bad Hotel", "review": "Let's start with a few positives. The hotel is a very easy walk from the lakeside and Riva is a quite delightful town. Also, there are no cockroaches in the hotel as someone has suggested; ants, yes, you will find these crawling round the floor at various points in the dining room. Bedrooms might charitably be called adequate but are rather cramped and grubby.  The food is unbelievably dreadful. I can endorse all the other reviewers' comments regarding poor quality, small portions and the limited - very limited - range. I can't believe I spent a week at an Italian hotel and never saw a tomato or an egg! Many of our Newmarket Travel party gave up on the food and dined out at restaurants in the town.  The overall impression is one of utter meanness on the part of the owners. This…", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r131815009", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Awful hotel", "review": "Newmarket Travel placed us here with no opportunity to change. This hotel was supposed to be of equivalent quality to the Hotel Bristol that they contracted to provide on their \"Seven Cities of Italy\" holiday. According to Tripadvisor and clients of the Bristol I spoke to when on excusions it is not. The hotel is seriously bad. Could not sleep due to traffic noise.  Rooms are primitively furnished and small. Meals are dreadful – limited choice, small portions very poor quality. Avoid Newmarket Travel if you want to avoid this hotel. AAAAAaaaaaaaagh!!! 50% of their clients were placed here.They are still sending clients there; unbelievable! No wonder they are rated the worst travel company in the recent Which report.", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r131724153", "sub_review": {"Value": 1, "Location": 3, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Awful food", "review": "Avoid this Hotel May 27 2012 Travelling with Newmarket Travel we only had this hotel offered to us and were the only two on this package to stay here. Food was dreadful -  very small portions sometimes cold, and the quality was awful - All from catering packs - no fresh fruit only tinned. Beds were rock hard but room was clean though basic with no tea/coffee facilities.  The owners - nicknamed Mr & Mrs Mussollini - stood guard at mealtimes and in bar at night glaring at staff and guests ( must have trained in a POW camp). They even gave our \"Welcome pack\" from Newmarket Travel to another couple hence we never about attending the Newmarket briefing at another hotel. Included in the \"Welcome pack\" was our prepaid Venice excursion (£102.00) which they gave to someone else who…", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r130942779", "sub_review": {"Value": 1, "Location": 3, "Sleep Quality": 1, "Rooms": 2, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "mr ching", "review": "i came to this hotel for the shoe fiere never again mice and cockroches everywere dirty dirty terrible, dont go there the owener watched us glaring at us during our evenings in the bar , she came to our table and took away the free chrisps that we got with our drinks everything is dirty even the bathrooms i got a bad stomach     from the ham at breakfast.the drinks on sale was the cheapest from the supermarker but sold at full price.the girl at the front desk was rude and seemed to be away with the birds spoke hardley any english. this dump should be closed down.", "date": "January 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r126510648", "sub_review": {"Value": 1, "Location": 1, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled on business", "rating": 1}, {"title": "Basic but enjoyable", "review": "We stayed here for a week and found the location was good for the lake and a short walk into the old town where there are lots of shops, bars and restaurants. The room was very very basic and the bed was not very comfortable but the food was enjoyable and the staff were very friendly. We rented a car just on the other side of the road and there was great free parking at the hotel. The pool was  a nice size and was very quiet as everyone was at the lake.", "date": "March 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r125053516", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "terrible food", "review": "Just returned from a week at La Perla Hotel in Riva Del Garda. While the hotel in general was o.k. the bedrooms were clean and tidy but basic, the food left a lot to be desired. The breakfast was continental which was o.k. but just the same things every day, but the evening meals were not very good at all, very small portions sometimes cold, and the quality was awful. You had to tick a menu the night before for the next day meals just like being in hospital and there was only a choice of two things which you only ever got with either potatoes or vegetable never together. There was no choice for pudding so if you did not like what was on offer hard luck. Would stay at this budget hotel but would recommend only bed and breakfast and eat out for evening meal.", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r119386692", "sub_review": {"Value": 2, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "faulty towers lives on !!", "review": "We were very disappointed with hotel. The staff were all fairly friendly and the cleanliness was a good standard.  The rooms were small and basic,a desk fan for temperatures of 30+. Our room was on the street side.  The traffic was continuous throughout day and most of night.  The beds were extremely hard. after 5 days we got a better room at the back of hotel with a ceiling fan and better beds. the food was not the best, not enough of fruit or vegetables and the Italian cuisine you would expect being in italy.", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r118078225", "sub_review": {"Value": 2, "Location": 2, "Rooms": 2, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Struggling", "review": "I agree totally with the last reviewer, however I have a few things to add.  The waiting on staff and the housekeeping ladies work very hard and one of the people on Reception (Armish I think his name was) was very helpful, however not all of the staff are pleasant or helpful and the owners I'm afraid, need to go back to hospitality school. It does not cost anything to greet your customers with a smile and a good morning (in italian of course - heaven forbid they should try out any english OR german, but that's OK) I found the food acceptable - I know some people were complaining whilst we were there, although the difference between b&b and HB was only 10 euros and within that they provided four courses - what more can you say.  I was disappointed that we were unable to borrow…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r117412913", "sub_review": {"Value": 3, "Sleep Quality": 2, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Reasonable Hotel, Good Location", "review": "Had I relied solely upon the comments of recent reviews, I probably wouldn't have made a booking.  However, having now experienced a stay here for myself, I can say that it was much better than I had expected.  That's not to say that it's perfect, though.      First the positives.  The hotel is situated in an excellent location – less than a five minute walk to the lake, and about 20 minutes along the lakeside to the town centre.  The rooms were very clean and the staff were friendly and efficient.  Evening meals were served with an accompanying menu for the following day's evening meal, so that choices could be made in advance.  This worked out better than the system reported in previous reviews (based on a breakfast-time menu slip for the evening meal) because one day we knew…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r116082609", "sub_review": {"Value": 3, "Sleep Quality": 2, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Beautiful lake Garda Awful hotel", "review": "I agree with other travellers this hotel is not value for money, the rooms very hot beds rock hard l slept on a pillow !  Breakfast stale rolls plastic ham no fruit.Dinner even worse no choice I had omeletts for two meals no veg no choice sweet.  They really take your money and do every thing on the cheap.  Complaints make no difference. Dont go there !", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r111592335", "sub_review": {"Value": 1, "Sleep Quality": 1, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Remember this is classed as a 3 star hotel.", "review": "I checked reports on this hotel before leaving on our holiday.  I wished I hadn't because I was very concerned with comments received by other guests.  I even thought of cancelling because the reports were so poor.  However, thankfully I didn't.  I was pleasantly surprised. We didn't arrive at the hotel until 2.30 a.m. and were pleased to find a plated meal awaiting us. The room  was very cold and the bed sheets felt  damp but the room was  clean.  However, where were the bath towels?  Hand towels are not very good for drying after a shower! Breakfast was what you would expect from a foreign hotel - a continental breakfast - a good choice and plenty of it.  The evening meal was adequate; I can honestly say we were never hungry.  The only disappointment was the dessert - no…", "date": "October 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r83294877", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good Value hotel - close to Lake", "review": "We have just spent a week at La Perla, the hotel is clean & comfortable. Hotel is a pleasant 15 minute walk to Riva which is a lovely town. Rooms were fairly basic though had all essentials provided.  Would recommend requesting a back room on a high floor, as we had a front  room on first floor, which had noise from the traffic & dinning room. Staff were helpful & friendly. Food we found reasonably ok but nothing exceptional.  We ate out 2 nights & found a lovely italian restaurant near the lake front in Garda. Eating out was reasonably priced if you looked around - most expensive was soft drinks & tea about 2.5 euros each.  Trip to Venice well worth while, although a very long day with alot of travelling. Also worth visiting Arco, we actually walked via Grotta which was a…", "date": "October 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r83057303", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Pleasant, but noisy!", "review": "We have just returned from a weeks stay at La Perla and while it was very comfortable and clean, it was noisy as we faced the very busy main road.  We were told by the rep that it was a 10 minute walk to the centre of town, but this was only possible if you went by car!  Make it more like 25 minutes, but it was very pleasant walking alongside the lake.  The food was passable but sometimes very salty and the bread always seemed stale.  The bar was a great disappointment as it was too brightly lit and seemed more like a cafe.  Some background music might have helped.  The Irish waitress, Mairead was absolutely lovely though.  We usually went next door to the Garda or the Savoy Palace hotels as there was a bit more life!  I wouldn't recommend it for young people or children.", "date": "October 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r82903024", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 2, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Comfortable room but it faced a petrol station on the main road!", "review": "I agree with other comments regarding the location of the hotel and its nearness to the lake. However, the walk by the lakeside to the centre took us 25 minutes unless we hurried. This was ok when we wanted to take our time but it was a long walk to get to the ferries. Our room was large, airy, clean and very comfortable but it faced the main road opposite a Q8 petrol station and was very noisy! We understood from other guests that the back rooms were quiet but small ! There was an unattractive bar area and some more seating in an open space facing the road but no real lounge for relaxing. The food was well cooked and varied but rather unimaginative.  A pity about tinned fruit and powdered juices when fresh fruit is so plentiful. Very nice croissants for breakfast. Basic but…", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r81598034", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 2, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Lovely Hotel, Poor food.", "review": "The Hotel La Perla is a very nice, well situated, clean hotel just a few minutes walk from a beautiful mountainous part of the lake in Riva.  The room was lovely and clean and nicely furnished and the staff all very friendly and helpful.  However we were very disappointed by the food.  The breakfast was an adequate continental breakfast but the evening meal was very lacking in choices and flavour.  In particular the salad bar was pitiful - consisting of only grated cabbage, grated carrot, lettuce and broad beans the same every night!! There was only two choices of starter and main and all felt like it was done on a very low budget with very meagre portions and little or no vegetables.  As a result we ate out more than half of the holiday.  We are not faddy eaters or expecting…", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r79738393", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "We love Italy!!", "review": "Recently returned from 10 night stay at the La Perla. I have been reading other reviews posted here and I agree that it desperately needs air conditioning as the rooms were like a sauna some nights. However that's my only complaint. The hotel was in a great location, and the staff were all really nice to us very friendly and helpful. English was spoken by most staff, so we all managed to have a chat each day. The dining area was spacious and the staff were lovely there too. Our waitress was very attentive and the head waiter was a charming man who went out of his way each day to ask what we had planned and tell us what was nice to do there. The Thomas Cook rep Elaine came to us at the hotel and was a pleasure to meet. She gave us lots of useful information and we booked a couple…", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r77661614", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "AVOID IF YOU WANT TO GET A GOOD NIGHTS SLEEP", "review": "Just returned from 2 weeks at the la perla.Firstly let me say that riva and lake garda are stunning and a great place to visit,but as for the la perla, well here goes.The hotel is extremely clean,but the rooms are very basic and uncomfortable.The beds are really hard and so are the pillows,there is no air con and only a small fan in the rooms.it is really hard to sleep,because the room and the bathroom are like saunas.The food is terrible and the puddings are cheap and  tasteless.The restaurant itself is also like a sauna,its supposed to have air con but it didnt work very well.It was so hot in there you couldnt wait to get out.The pool wasnt very clean not like the rest of the hotel,and please beware of the loungers they arent very good and tend to collapse with you on them.", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r76801929", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "No bella by any standards!", "review": "We have just returned from a 2 week stay at the La Perla. I did read the reviews before leaving, but went with an open mind! The entrance is impressive, clean, modern, & cool. Thats where it ends! The rooms are drab beyond belief. There is no air con, either a ceiling fan , or a desk fan. No use what so ever. It averaged 30+ degrees during our stay, so it was a blessing to get out of the room. The bathrooms are extremely small, & again extremely hot. The shower was a mere trickle, useless! The rooms are however clean, & the towels are very good. The beds are rock hard, as are the pillows. The pool turned my daughters hair green, not the best! The food is very repetitive, & the dining room like a sauna. Again no air con, & very few open windows. The plus is the fab view.", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r76675584", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 1, "Rooms": 2, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Basic hotel in good location", "review": "La Perla in Riva ( not to be confused with the one in Garda itself) is a basic 3* hotel. It's location is excellent. There's a lane directly across the street which takes you to the beautiful lakeside in a couple of minutes. There are plenty of restaurants within strolling distance of the hotel. You can walk into the centre of Riva in about 15 minutes along the main road or take a bit longer & walk along the lakeside path. The hotel has a very nice outside bar area. Our room was in a separate building behind the main hotel. The entrance & lobby area are very smart & quite modern. Our building was much older. The rooms are basic but with plenty of space & a good sized balcony. Our room was on a corner so we had 3 different views from the windows which was nice. These windows…", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r72815590", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 2, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Fantastico holiday!!!!!!!!!", "review": "My Sister and I just returned from Riva. Great location of hotel, close to Lake and Riva. All staff very pleasant. Rooms very clean. Didnt like some of food but we are in a foreign country!! Pleasant dining room with really helpful staff. Loved the Gala night. Got to mention Mairead, sorry if spelt wrong. Lovely lady who worked behind the bar. Looked after us on our late arrival and throughout our holiday. She went the extra mile and thanks for Barries tea bags!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!. Irene and Pauline xx", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r72444557", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "No air conditioning in rooms", "review": "Just back (yesterday 18/07/10) from Lake Garda (La Perla)  Our room faced due south and fronted the main road and there is NO air condtioning in the bedrooms. Most ceiling fans do not work so small desk fans provided  - in last weeks very hot weather it was almost impossible to sleep. Food poor/dull, but rooms and pool clean, bar prices reasonable  Went with Newmarket travel  - and as another guest said \"you have more chance of seeing a ghost than a Newmarket Rep\" Felt very abaondoned on the return transfer as confusion reigned over pick up times (at various hotels ) and a coach driver who did not speak english and NO rep anywhere  Would go to Lake Grada again - not to La Perla and probably not with Newmarket Met some nice people (including the 4 ladies) and collectively we made…", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r71487549", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 1, "Rooms": 2, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Pleasant accommodation, but food not good", "review": "My room was pleasant and clean, as was the whole building. The food was variable - some of it was awful (tomato soup and breakfast juices from powder for example), but some of it was okay. The \"Gala Night\" was ridiculous - most of us have progressed beyond being impressed by a Head Waiter wheeling around a lump of pig on a trolley!   Security was bad - room keys are on a board where anyone can help themselves and our cases were left in an open lounge on the day of departure.   Some of the staff were pleasant and helpful, some weren't.", "date": "May 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r69041941", "sub_review": {"Value": 2, "Location": 2, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 2}, "travel_purpose": "", "rating": 3}, {"title": "Fantastic Hotel, Staff very very helpful.", "review": "Just back from La Perla Hotel in Riva, we had a fantastic time, the hotel is very well run, the staff were extremely helpful, caring and very polite as were all the resturant staff. The room we had was very clean and modern with a small but very good bathroom with shower and hairdryer. The food was very good with two choices of starter and main course and will bend over backwards to order alternative if you didnt like what was on the menu. The walk down to the lake, which is over the road from the hotel is a lovely walk, which is about 20 minutes to the harbour, but about 10 minutes along the road. The hotel offers fantastic views. I deffinately want to go back.", "date": "June 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r68871240", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Don't bother, noisey and unfriendly staff, food dreadful and too salty.", "review": "Stayed here for five days in April. Rooms clean but need refurbishment, en suite too small, pillow like bricks.Staff very offhand and unfriendly, especially the restaurant manager, pork every night a bit too often, boring salad the same every time, cheap bought in puddings, it seemed to me all done on the cheap with no real Italian food. Had to buy bottled water as staff would not allow a jug of water on the table. Maitre de' told us that  no restaurant in Italy put water on the table, wrong, the restaurant two doors down put a jug on every table, as did many others. Swimming pool was dirty & was never cleaned whilst we were there, no chemical tests were done, in fact, I had one swim & my eyes were very inflamed after, it took 2 hours & lots of eye drops to clear up, avoid the…", "date": "April 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r63323952", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 2, "Rooms": 3, "Cleanliness": 5, "Service": 2}, "travel_purpose": "", "rating": 2}, {"title": "Family run basic hotel, clean and well maintained.", "review": "This is a family run hotel just a 15 minute stroll along the magnificent Lake Garda from the town of Riva. The hotel is clean and well maintained although does not benefit from a mosquito net, air-con or a fridge in the room. The breakfast is from 7am-9.30am and consists of breads,ham, cheese,jams, chocolate spead, cereals, tin fruit, yogurt, tea, coffee,  juice & water. I can not judge the evening meal because i like to explore the local restaurants (which are fantastic, more so if you chose one off the lake side up a side street) so only ate they once but was disappointed, you get served a plated meal then you can help yourself to salad/veg. You chose your meal at breakfast vai a leaflet left on your table. Maid sevice is every day so beds are made and clean towels provided…", "date": "July 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r35753055", "sub_review": {"Value": 4, "Location": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Staff lovely ~ unfortunately food wasn't....", "review": "Stayed here on 9th May for a week. The hotel, the staff and the room were really nice. The location was on a busy main road, with shops, supermarkets, bars and restaurants within easy reach. Crossing directly over the road took you down to the lake's edge and a very pleasant walk into Riva. That's the good points. Here come the bad - Our room was directly located above the kitchens and therefore we were woken early every morning by staff loudly talking, or departing guests trundling their suitcases along. The beds were very hard and the pillows like sandbags. The swimming pool was dirty even after it was cleaned. Breakfast consisted of three cheap supermarket cereals, croissants, two fruit juices made from powder, yoghurt, salami, ham, cheese, tasteless white rolls, aniseed…", "date": "May 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r30359453", "sub_review": {"Value": 3, "Location": 3, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Nice friendly hotel", "review": "We have been to Riva Del Garda before, and compared to the hotel we stayed in then, LaPerla was wonderful! The staff speak excellent English, and were all very friendly. The room was basic, but clean, as was the rest of the hotel. The food was sometimes a bit erratic, but on the whole, we found it quite good. As with most half board options, you choose your evening meal at breakfast - the evening  meals usually consist of salad bar, pasta or rissotto starter, meat or fish main course (only potatoes provided with this, but apparently it is the norm in Italy not to have a lot of vegetables with the main course) this is followed by desert (no choice, but we're not great dessert eaters-so didn't mind)  Breakfast was the same fare daily, but this again, is normal for most 3 star…", "date": "September 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r20086319", "sub_review": {"Value": 4, "Location": 5, "Check in / front desk": 4, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good hotel with great food and staff", "review": "Having previously visited Lake Garda on a day trip we decided to spend our two week holiday in Riva.  The hotel seems quite modern with an excellent range of food.   They have a Gala dinner one night during the week and a buffect night, get there quick as the food flies out of the window quickly.  The waiting staff are excellent.    Our room was on the top floor overlooking the pool. The breakfast was the best we have had in Italy with great waiting staff.  It was a short 5 min walk to the lakeside and a longer 30 min walk into Riva town. We used the local ferry to visit Limone, and Malcesnie.  We also hired a car for two days and visited Gardaland, great for kids young and old.   There is a great ice cream parlour across the road and to the right it is very new looking with…", "date": "July 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r10015940", "sub_review": {"Value": 4, "Location": 3, "Check in / front desk": 4, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Belated Honeymoon", "review": "We were re-allocated hotel by package holiday company on arrival in Garda. We therefore approached reception in anticipation! no need to have worried, although the hotel is allocated a 3 star rating in holiday brochures we found it clean tidy and inviting we personally rate it higher. The room had two single beds , air con, safe and fridge, and was clean and inviting. It was maintained by hotel staff each day. The bathroom facilities where clean and modern. But the outstanding part for us was the restuarant, the food , choice of menu and staff  really made the stay in this beautifull part of Italy magic.The hotel does have an outside pool which is almost new, we did however find the pool rather chilly!, Lake Garda itself was far more to our liking.Other facilities in the hotel…", "date": "September 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r8755499", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Good Hotel", "review": "This hotel is in Riva, at the head of Lake Garda (not the hotel in Garda town).  Just spent a 4 day break at this hotel, was rather worried as to what we would find as some of the other reviews we read before going were not very favourable.  We were pleasantly surprised, the hotel is on a busy street a good 20 minute walk from centre of Riva, but with good views of the mountains.  Just over the road there is a path which takes you down to the lakeside, a beautiful walk with stunning views.  You can also walk into town this way - its a much nicer walk than on the roadside.  The hotel was immaculately clean and modern in design.  The staff were friendly and helpful.  Our room was 201 at the back of the hotel with balcony, in quiet position.  There was no air conditioning, but…", "date": "August 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r8452261", "sub_review": {"Value": 4, "Location": 4, "Check in / front desk": 5, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "perfect location", "review": "Hotel is situated 100 yards from the bus station which enabled us to hop on and off the local buses.  4 minute walk to the Lake with breathtaking views.  Ferry for visiting all the towns was 2 minutes after reaching the lake edge.  Hotel was superb.  Waiter service at your table every evening was exceptional.  Food was brilliant.  Rooms were cleaned daily to a high standard.  Bathroom was immaculate.  We normally do not visit the same hotel twice in a row but we are definatey thinking about booking this hotel again next year. ", "date": "August 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r8377763", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Garda, beautiful and so clean", "review": "My wife and I had a week in Garda, Lake Garda, Italy at the beginning of June 07 and instantly fell in love with it's beauty and it's cleaniness you could eat your meals off the streets, very impressed. We stayed at the La perla hotel which was only 3 star but as good as some 4 stars we have stayed at, the meals were very good with a good variation and the waiter service was second to none, the rooms were basic but immaculately clean and with one of the best showers I've used. The hotel is only 10 minutes walk from the lake in a quiet location, there are dozens of cafes, restaurants and bars and a good selection of small shops in the narrow winding streets, Bardolino which is a lovely town and bigger than Garda is a 45 minute walk along the lake side which is truly beautiful and…", "date": "September 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r7998195", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Long Walk", "review": "We were  moved to La Perla from a central hotel due to overbooking but were told that it was only 10 mins out the road to Torbole - it was 1.45 miles & took us 25minutes to walk either by the main busy road or the lakeside walk. We are fit & able but some of the other guests found it a bit of a struggle . The rooms were small but clean if  a bit 60ish. No tea or coffe facilities but that is normal. Drinking anything in your room is banned but we had our own kettle.We did enjoy the pool even though it was cold but were disappointed that the view from our balcony was of the filling station across the road & a few cranes. Very noisy at night & early morning. The food was edible but boring & the Germans ate all the croissants in the morning & the salad buffet in the evenings so it…", "date": "July 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d314208-r5819328", "sub_review": {"Value": 2, "Location": 1, "Check in / front desk": 3, "Rooms": 1, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}]