[{"title": "Lovely stay ", "review": "Arrived at the hotel at roughly midnight. We were given our room key and took by caddy to room. We paid the extra for the upgrade which is worth it WiFi is a great in room 485. We were given a map telling us where we can’t go as hotel is off limits. I find that strange as we upgraded our room so we should be able to go anywhere. Air con took a while to get going, The tv has a USB port if you want to take a external hard drive it only shows bbc world news in English. Breakfast has plenty choice eggs salad veg and fruit as well as toast and croissants.  Lunch and dinner were also plentiful I can’t see how anyone could say the food is boring. We tried the Turkish restaurant it was very nice but say no to the raki my boyfriend was poorly all day after it. We had exact same other than the drink.  We headed to the main pool at 9:30am the sun is making its way round. The entertainment staff are friendly and tried to include us even though we were 2 of the 6 English guests staying at hotel. More English had arrived mid week.It’s was a nice touch the entertainment staff shouting over to us to check we were listening during the pool games.  The pool with slides is cool to there is no food there but they’re is a drinks bar and the staff are very friendly. Note it’s around 3 degrees higher at this pool as you don’t get sea breeze. The evening entertainment had various shows which the Germans seemed to love which we thought was ok. On Monday and Thursdays they have a disco at the pool bar it’s all over the top pyro lights and everyone is up dancing a lot of fun even if your just watching.  Outside the hotel is s bar the “golden fizz” great after hours has football and entertainment on we heard a very good singer,the staff were very friendly and made us some delicious cocktails.  We ventured into side 3 Euro’s on the dolomus. Taxi back was 8 Euro. We ate in side it was 49€  for two steaks and two drinks, everyone is super friendly there. We booked the dolphin cruise which was 50€ it was fairly average the places they show you on leaflet looked completely different in real life, Although food was nice and foam party was a nice touch,  On the day we left we asked if we could keep our room on but unfortunately the room had it’s next guest arriving. We got use of the shower room which was a room over looking the pool with slides. You had use of it for half an hour and it had towels and shower gels inside. Which is less stress for you carrying things around. Overall we really enjoyed our stay here we meet some lovely people and feel refreshed and would come again thank you melas. …", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r709911231", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A great big thank you", "review": "We have just got back from a 10 day stay at melas holiday village, and what a great holiday it was on arrival was meet at reception by too great guys who both spoke good English checking was easy our luggage was taken to our room up a flight of stair and put in the room then the bell man showed us how the air conditioning worked which was helpful a small tip 10 lira went down well,  the rooms are a normal size with 2 single beds put together there was also a pull out bed if needed & a good size bathroom there is plenty of storage & free safe  in the room. The rooms are very well keep and clean by the house keeping staff who also top up the free mini bar with bottled water coke and fizzy orange, tea and coffee every other day. Eating it’s a all inclusive resort there is a freshly cooked food always available at all meal times some great some not so but in general we always found something and if you don’t fancy going to restaurant you can eat at the pool bar at lunch time. The grounds are very kept very clean the gardens are well maintained by the many gardeners and around the pools the pool attended work hard cleans at least 4-5 time a day emptying ash trays wiping down tables and picking up used cups, one thing I would say there is a slope from the pools to the top of the resort which could be awkward with someone with a disability, pools there are 2 pools and 2 small children pools the 2 main pools are just over a metre deep and the children’s one are ankle deep, there is an aqua park at the top of resort with slides which as opening time for the kids or young adults but you can still swim or sunbathe when the slides are closed. hotel staff were great can understand you and many can speak English much better then my Turkish and they can’t do enough for you and most had a smile on there faces and a good morning as there walk passed, we have got to give a  mention to the animation team who work hard to insure that everyone a good time play games and the pool or playing darts, shooting etc  And a special mention to Ahmet and Ersin and Fatima who take time to get to know you and get you to join in with the fun, the resort is mainly German but that didn’t matter because as I said mostly all the staff could speak English and the evening entertainment was spoken in various languages  and we never felt uncomfortable. The beach is right outside the resort (sandy) but be careful when going into the sea it’s rocky under foot there is a lovely promenade which you can walk all the way into side old town.  In all we had a great holiday and will be returning…", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r709368309", "sub_review": {"Sleep Quality": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Absolutely Melastic!", "review": "We travelled as a family with children aged 6 and 8. We loved absolutely everything about the holiday village and we will be back to stay again. Staff The Melas resort has a real international mix of guests and the staff so an amazing job communicating in a wide range of languages. Some of them have stronger English, some stronger German but all have the basics and they will refer on to someone who can talk your language if there is something they don't understand. The lady at guest relations at the reception was amazing. Incedibly helpful and friendly. All the staff worked hard and were pleasant and friendly. The hotel is kept immaculately clean and our maid always kept our room pristine.  The entertainment team were fab, lots on offer and the evening shows were good. We loved the circus shows and Michael Jackson. The head of entertainment made time for everyone and genuinely cared that each and every guest was having a hood holiday. Food and Drink There was a great range of food available in usual all inclusive buffet style. The food was delicious and there was plenty of choice. My children loved the pancakes at breakfast. There are other restaurants on site and you can book one for each week you stay. We ate at the Turkish and Fish restaurant during our stay and had wonderful meals at both. The  Turkish pisa doughnuts at the aquapark and gozeleme at the beach bar have to be tried during your stay. There was a good range of drink available on the all inclusive including some alcoholic and non alcoholic cocktails which were all delicious. Facilities The site has lots on offer. The main pools were great with smaller paddling pools for little children. The aquapark with the slides was great fun for children and adults alike and the lazy river was a nice change of pace. The lifeguards at the aquapark did a great job of making sure everyone was safe. My children went to the kids club a few times and enjoyed it. My eldest was allowed to go to either mini or maxi club as he was nearly 9 and that was perfect for him.  The really enjoyed darts and golf.  On fridays they have inflatables on the green for the children. This was brilliant a wide range of bouncy castles and drinks put at the edge for the inevitably warm kids. There are loads of activities available each day and pool tables, table tennis etc... Location The hotel is just over a miles walk from Side.  The town is amazing, ruins everywhere so fantastic to explore. My two horrible history fanatics loved looking for mosaics and imagining what happened. The only ruins charged for were the ampitheatre and the museum. The charges for these were small and well worth it. The walk to Side was manageable in the cool but we used the Dolmus bus often at least one way. The stop is outside the hotel and its east to use and cheap. Outside the hotel there are also many shops and bars for excursions, clothes shopping and food. They are much cheaper than the hotel shop. The beach is on the hotels doorstep and always had plenty of sunbeds. The water was lovely and the sand great for sandcastles and digging! There are rocks in the water, so I would advise beach shoes. My kids loved the beach and spotted lots of fish.  Overall We loved every moment of our holiday and we'll be back.  The hotel was good enough you could just stay put if you so wished but the surrounding town and countryside were beautiful and not to far for those who like exploring.…", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r700828385", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Fabulous Family holiday ...... wow ......", "review": "Having never visited Turkey before , we was a bit apprehensive of what to expect ...... let me assure you , it was outstanding ....  When we checked in , at 11.30pm , the young lady , took our names and passports , attached our all inclusive bands , told us to leave our luggage in reception and go to the adjoining bar for refreshments and to the restaurant for food after our journey. Her English is a lot better than my Turkish , we returned to reception , where we was shown a map and explained the dos and fonts and where stuff is around the resort , then we was shown to a golf buggy with our luggage and driven to our room. (Great start to our holiday). The resort is mainly foreign tourists from Germany etc , I would say about 5% English . This was no problem to us , we communicated and got along fine with fellow guests and respect in the pool and around sunbathing areas etc . It is immaculately cared for , teams of gardeners tending to the plants , teams of maids tending to the rooms , you could not fault the grounds or the surroundings. The restaurant serves a wide range of food , stuff we had never tried before , but delicious , (I didn’t travel to Turkey expecting to have a full English every morning ....), you do have to be prepared to adapt your diet a bit , a bbq most nights cooking meats etc, loads of salad and fresh fruit and desserts. The waiting staff are really friendly(Musa and Mehmet to name a couple) and ensure , your glass is always filled . Tip the staff they deserve it !! The animation/entertainment , work hard to ensure that everyone has a good time , live shows most nights and pool party afterwards , where everyone gets together no matter the nationalities ..... There are 2 main pools and an aqua park pool , the sun beds around the main pool are keenly taken early , but we found the quieter aqua park area to get sun beds up until 10am and most afternoons .  The beach has plenty of beds throughout the day , the resort has its own segregated part of the beach , with own lifeguards (also pool areas) and 24hr security for peace of mind. We had a 2 bedroom apartment, it’s a bit dated , but had a free safe , a free mini bar , restocked every second day ( water goes , soft drinks and beer). The bed were comfortable and bathroom stocked with shower gel etc and lovely shower. I recommend a Turkish Bath , it’s amazing and massage afterwards very relaxing .  We had an absolute amazing time , and look forward to returning again ..... Melas raised the all inclusive bar for me ........❤️.…", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r698162263", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Fantastic summer holiday", "review": "From start to finish a great holiday!!!  Lovely suite room cleaned to a good standard every day. Good choice of local drinks. Fantastic food. Lovely entertainment team especially Berk and Ahmet, who were the ones making the most effort to get people around the pool joining in with the activities daily.  Position of hotel is great with shops and bars directly outside and Side a 5 min bus or taxi ride away. If you fancy a walk it's about 20 mins to Side but there are bars along that route also.  Evening entertainment was ok nothing special but was normally followed by a pool party that was ok.  The only annoying thing was the Melas hotel and Melas holiday village were separate and couldn't use the hotel bar beach bar etc BUT if you go the the hotel you can use everything in both areas (this needs sorting as it's a bit unfair)  Thanks for a fantastic holiday we will see you next year for our 2020 holiday (I want the best family suite possible:0)).…", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r697829025", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Excellent food", "review": "Arrived in the early hours and immediately felt welcome.  Check in was speedy and we were driven to our room, which was nothing like the photo on the Thomas Cook web site.  However the room was clean with basic toiletries and good air conditioning. The pillows on the bed however were horrendous - exceptionally fat and unforgiving!  I used a folded up towel instead.   The food at The Melas is excellent with plenty of choice, we ate at the main buffet and the Turkish a la carte and highly recommend both.  The only criticism is that the restaurant finishes at 9pm which seems early when the sun is still shining at 8pm and we were reluctant to leave the beach.  The public areas are very clean and the gardens are immaculate with beautiful plants and flowers. Just outside the gate are…", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r697003429", "sub_review": {"Sleep Quality": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Disappointed", "review": "Overall the hotel was nice however for the price charged we expected more, this is not a ‘5* hotel’ . Rooms were average but plenty big enough for our family of 4 and were cleaned daily by the maids. Staff made the whole week extremely uncomfortable as they tended to just stand and stare or follow daughter around. This was uncomfortable for the whole family and led to my daughter feeling for comfortable on the beach rather that within the hotel. Entertainment and staff only cater for German and Russian no entertainment was in English and no staff spoke it making it difficult to communicate. Staff were rude , the only staff that made an effort with us were the maids who did a very good job. This experience has put us off returning to such a beautiful country.", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r696847449", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Good holiday", "review": "We are staying at the hotel. Staff is very good,smiley and warm-blooded.  Sea is clean but there are big rocks inside. Need to be careful about rocks. Beach is very good. Aqua park is small but enough for kids. Hotel stuff are very careful about security in aqua park. Meals are not wide range but delicious and tasty. Visitors are mostly families from Germany,netherland Russia. Cleaning is good. I can visit here again. Thanks for a good holiday. ", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r695848083", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Very well kept hotel and friendly staff", "review": "Just got back from 10 nights at Melas Village with partner are 2 children (6 yr old and 20 month old). Had a fabulous time here. Hotel was spotless every day and food was of good quality with a good choice every day in main buffet (didn't try a la cartes). All of the staff we came across were very friendly and helpful (special mention to our housekeeper Gonul Arikan who made our kids feel extrmely special every day she saw them and her towel animals were amazing). Also a special mention to Sherif in the pool bar. Always had a smile on his face and even though there was a language barrier was always friendly. If you're coming from the UK then yes the staff speak more German than English but there is enough staff that have an understanding of English to make you enjoy your stay.…", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r695685109", "sub_review": {"Value": 5, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Good 4 * hotel", "review": "We stayed here with 2 teenage boys in July. This is a good 4* hotel. Mini bar re stocked every other day with fanta, coke, water and small beer. Pool towels changed every 4 days.  We found all hotel staff to be very helpful from reception to Pamela in guest services. Smile and be pleasant to the waiters and bar staff and you will have no problems. Tea coffee kettle in the room and no problems with Air con.. Very limited English tv channel and when asked maintenance promptly came and retuned a poor signal. Whole site very clean and well maintained. Animation team welcoming and we enjoyed the pool games and shooting. Try the aqua gym in the sea ( but pls don't take children in armbands!) Pool with slides less busy and easier to get sunbeds but limited pool bar. We enjoyed the…", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r691519184", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Thanks for a fantastic holiday Melas!", "review": "We stayed in the Melas Holiday Village for 2 weeks at the end of June and cannot rate the resort and the staff highly enough. From beginning to end we had the best time. The place itself is stunning, spotlessly clean and very well maintained. Location is perfect, right on the beach and not too long of a transfer from the airport. The food was great and plentiful.  We didn’t do any excursions, but plenty of options should you want to. And now for the best bit - The Staff. From Reception staff, maintenance/cleaning staff, bar/restaurant staff to The Animation Team. They work tirelessly around the clock to make sure you have the best time. I would like to thank every single member of The Animation Team as each and everyone of them, male and female, played a huge part in making our…", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r691362208", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Holiday “village” in the true sense", "review": "Firstly this is not a 5 star hotel - trip advisor take note.  Any member interested here's a detailed review  Pro's  1. Amazing location, right on the beach front 2. Good clean pool 3. Decent food variety in buffets but repetitive. Can get sick of it after 2 days  4. Child friendly   Cons ( gosh this is going to be long) 1. Very average rooms (sea view)  2. The standard category rooms at the back facing a car park are depressing, secluded & come with a super noisy oldddd air-conditioning. 3. MOST of the staff doesn't speak or understand English. 4. I felt the staff was overworked, rude & grumpy ( waiters & bar-men especially) . Maybe because it's an all inclusive resort with a heavy flow of guests!? 5. The local alcohol that comes in the all inclusive package is also poor…", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r688992440", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "First time in Melas Holiday Village", "review": "Most amazing holiday ever. First time in Side, Antalya Turkey and our first time ever in Turkey. It was the best decision ever to spend a week in Melas Holiday Village. Once we arrived on our first night, the reception staff were very friendly. Spoke english fine,and they explained how everything works and where everything was. We were driven to our rooms which was located by reception close to the aqua park with the slide. Lovely breakfast with lots of different options of food. The best part however was meeting the Entertainment Team - Ahmet, Ersin, Uur, Nesrin and the rest of them but especially Ahmet. He was very funny and taught us English girls how to get better at shooting and had so much patience. He also spoke English and translated everything for us as 80% of the guest…", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r681637522", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "1st Visit", "review": "Dear Guests,  We thank you very much for your review.  We are glad that you have spent a pleasant holiday and would like to welcome you once again.  Kind regards,  Your Melas Team", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r681295164", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Fantastic ", "review": "Great hotel in a nice position on the sea front, staff were absolutely brilliant, must give a big shout out to the entertainment team especially Berk and Burak who went above and beyond their duties to ensure we had a great holiday.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r680355135", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Middle of the road 5 star...", "review": "Nice resort with a good pool on the coast line and well kept gardens. Rooms are very dated with poor and loud air conditioning. As the picture shows the labels have come off so a challenge to workout the settings. The food is very average too. The old town is 3km away but a good 40mins walk. There are a lot of resorts in the area, I would check others too before booking. ", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r678518260", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Holiday blues!!! ", "review": "Dear Guests,  Thank you for your rating and opinion about our hotel.  Kind regards,  Your Melas Team", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r677021460", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Good hotel with terribly loud evening program", "review": "So me and my friend while booking this hotel was a little worried, as there was no recent reviews! We arrived around 1:30 am  and straight away they sent us to the bar for any drink we wanted so we got the melas special cocktail of course. Then we got quickly driven to our room with our bags and we said we was hungry and the hotel had some hot food laid out in the restaurant which was really nice. We then decided to walk around the grounds and have a little wonder as its a big holiday village. There was no one about apart from security so we thought we must be only ones here. In the morning walking to breakfast we was soo wrong as we see so many family's and kids. 😅  All the staff at this hotel are so lovley. The waiting staff work so hard. Memet was the one who stood out to…", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r671353006", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Ignore the negative reviews!", "review": "Dear Guests,  Thank you for your positive and detailed rating.  We are very happy that you had a pleasant stay with us and would like to welcome you once again.  Kind regards,  Your Melas Team", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r635385679", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fantastic resort", "review": "Nicely designed and clean hotel that could be perfect if only there was no evening program that almost ruined our holidays...the shows and discos were super loud and kept on till 11:30pm almost every day. We asked to be moved to a further room but the music was so loud (and so bad...) that we still were bothered by it. Cant imagine how bad it was closer to stage. We travelled with a 16months old who usually goes to bed around 8:30pm and our evenings were stressful. The hotel manager should rethink their evening animation as the hotel is full of old people and families with small kids who just want a bit of rest. It was impossible to „hide” from the evening noise. Everything else was perfect.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r626958505", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Excellent Resort", "review": "We stayed here for a week starting October 5th. Very impressed with the Village. Very clean, great staff and good food. Mostly German guests which was great as they are much better behaved than their British counterparts. I would have no hesitation in recommending this place and will definitely return.", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r624460783", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "thank You", "review": "Dear Colin,  Thank you for your positive and detailed review.  We are happy that you had a pleasant stay with us and would like to welcome you once again.  Kind regards,  Melas Team", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r620706916", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Excellent resort and holiday", "review": "We have just returned from Melas Holiday Village and after reading some of the reviews I can’t understand what went wrong for them people who didnt enjoy themselves, we had a fantastic time. In my opinion people make holidays and all the guests and staff certainly helped us enjoy ourselves. Let’s start with the animation team, a massive thankyou to Jon and his team. Thanks for everything you did, you really put the effort in to make us and everyone else that I could see enjoy the holiday, you gave everyone the opportunity to join in if they wanted to. The pool games were awesome and very original and you certainly spent some money on the entertainment (the inflatables, evening entertainment etc). Plenty of activities for everyone to get involved with (we personally got involved…", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r611828078", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Very enjoyable", "review": "Dear Nobby,  Thank you for your positive and detailed review.  We are happy that you had a pleasant stay with us and would like to welcome you once again.  Kind regards,   Melas Team", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r611039711", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Nice place, great for kids, food not that good", "review": "We have just returned from this excellent resort and I have to say that I cannot agree with or understand some of the more negative reviews. We had a wonderful holiday & it would be hard to find a cleaner or better designed holiday village. And that's what it is - a holiday village - not a hotel- so we expected for things to be slightly more spaced out. In fact we quite enjoyed having to do a little exercise and walk (no more than 5 minutes to anywhere though) from one pool to the beach, slide pool or restaurant. We didn't have any trouble finding sunbeds at 9.30/10am but maybe because we didn't actually want to be by the pool and preferred the beautiful grassy terrace overlooking the beach, where we quickly formed a very good relationship with the exceptionally friendly and…", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r611007341", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Worse holiday ever! ", "review": "Very disappointing holiday. We came downstairs at 8am to find that there was NO seats at the pool area. We had to go down to the beach. Next day decided to wake up at 7am to quickly get a spot because it’s so hard to find 5 seats for your whole family. Again, every seat was taken and someone then told me that the Russians come down at around 4/5am to put their towels down. I think this is absolutely ridiculous! All week we couldn’t sit down near the pool so had to go down to the beach. (I hate beaches!) as it was a holiday village everything was a long distance away. The drink bar was a 5 min walk and in the afternoons it was closed so I had to walk up to the pool area to get drinks. The evening meal was closing up around 8am and we usually have our meal at 8/9.  Staff were rude…", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r610203453", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Think twice before you book !", "review": "Great family holiday ! But with a few niggles hence the 3 out 5.  Stayed in a superior room and was as expected,well presented  with excellent air con. Hotel grounds really nice and clean and constantly well maintained.Two different pool areas to enjoy although the depth of the pools was too deep for small  children so choice is limited if you need to chill a little and let the kids splash about. Sun loungers by the pools get reserved very early by people putting towels on them in middle of the night !! This isn't a problem on the hotels private beach which is sandy until you step into the sea which is very rocky and dangerous underfoot.  Food really delicious and with something for everyone. Didn't get a chance to try a'la carte so can't comment on that.   Fantastic evening…", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r609958902", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Worse holiday ever ", "review": "Family of 5 first time to turkey and most definitely the last terrible experience  ever  We stayed for 2 weeks only 4 members of staff spoke to us the entire time we was staying there 1.our cleaner 2.waiter 3.barman  and 4. 1 animation guy  The pool bar has the rudest staff imaginable they served other guests before us or would rather rip up cardboard boxes than serve us, huge flies in the slushy machines (I have pictures) my daughter asked for 4 ice creams to which this terrible barman put 4 scoops of ice cream in a paper cup so my daughter said no 4 ice creams separate please the barman huffed muttered under his breath something not nice judging by his face and slammed 4 ice creams down to which other guests looked up to see what the noise was  Food was ok If u knew what u was…", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r608071030", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Best family holiday ever!", "review": "From start to finish, this holiday was amazing! Returned home from Melas Holiday Village last week, and can’t wait to book to go back! We are a family with two children aged 5 and 22 months. They both loved it! It was great being taken to our room with our luggage on a golf buggy! Our room was very comfortable, with great air con, we had to turn it off a few times as we got a bit cold. The food was to a great standard! We enjoyed the great selection of fruit at breakfast, the fresh salads and the stations outside the buffet restaurant were lovely! The A la Carte restaurants were amazing!! The children loved the ice creams and ice slushes. The sweet treats made by the water park were also good and I couldn’t resist!  All the staff were so helpful and they went to great measures…", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r607589028", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "International", "review": "  Dear Guests,  Thank you for your positive and detailed review.  We are happy that you had a pleasant stay with us and would like to welcome you once again.  Kind regards,  Melas Team", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r601089173", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Reasonable", "review": "The staff, hotel, surrounding were really good. Food not very good got boring by the end of fortnight buy the a la carte restaurant were fabulous!!! The only other thing that did let the hotel down was the Air conditioning or lack of it, bedrooms very old A C and rest of the hotel just fans so was so hot in the evening. Overall really enjoyed the holiday but in the evening the lack of air conditioning was a problem as it was 31degrees in eve!! I would  go back if  I wanted to but may not be for two weeks as the food was really not good!!", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r598558404", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Really relaxing stay", "review": "Beautiful resort, clean rooms! Staff were very friendly and accommodating.  Great that the beach was only a short stroll from the hotel room, plenty of water activities within walking distance such as parasailing,  and power boats with inflatable sofas, bananas etc. Great fun!! All inclusive food was varied and plenty on offer. There were 4 restaurants aside from the main one which had a la carte menus these were included with the all inclusive price but only once per week and had to be pre booked. Worth it though! ", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r597450206", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Amazing Hotel", "review": "Dear Guests,  Thank you for your positive review.  We are happy that you had a pleasant stay with us and would like to welcome you once again.  Kind regards,  Melas Team", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r596566014", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Loved it. ", "review": "We have just checked out after seven days at the Melas. The hotel is very comfortable, absolutely spotless, with light airy rooms. Our room overlooked the pool in the quiet area of the hotel and it was perfect to watch my teenagers when they wanted to be by the pool on their own. The staff are most helpful and always there to sort out any problems we had. The room was cleaned every day,with fresh towels.  There are 2 parts to this hotel and numerous swimming pools for every age group. There is never a need to get up at the crack of dawn to get a Sunbed.The entertainment was geared for all ages. The food was amazing, plentiful, varied and of excellent quality. I would have no hesitation in recommending this hotel.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r593371165", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great relaxing 2 weeks", "review": "Dear Guests,  Thank you for your positive review.  We are happy that you had a pleasant stay with us and would like to welcome you once again.  Kind regards,  Melas Team", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r591242572", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very good hotel", "review": "We were happy with this hotel very much. My son love water slides and swimming pools. Food is amazing and every day was something different.  Chidren club team were amazing too: very creative and funny. Evening programs was something incredible and we never felt bored. Most people in the hotel were from Germany and few rusian couples. We never had any problem with staff or people who stayed in hotel.  I’m happy recommend this hotel and we will totaly come in this hotel again. Thank you Melas team for incredible hospitality!!!", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r590590290", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Fun But Relaxing Break", "review": "Dear Guests,  Thank you for your positive and detailed review.  We are happy that you had a pleasant stay with us and would like to welcome you once again.  Kind regards,  Melas Team", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r589226736", "sub_review": {"Value": 5, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A hotel for all the family", "review": "We visited this hotel as a young couple and we would highly recommend it. The food was superb; there was a wide variety and the food was of excellent standard. We visited the fish a la carte which was situated right next to the beach and provided us with excellent sunset views to accompany our delicious food. The grounds were immaculate, exceptionally clean and well kept. The pool area was great, nice view of the sea. The sea was warm but watch out for sharp rocks. Lots of activities to do during the day, the animation team were great, Ahmet was especially friendly from the team. Entertainment at night was good, after the show at the end of our holiday they would have music next to the pool. Although staff struggled in English and we seemed to be the last to be served because of…", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r585377756", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Fantastic", "review": "Dear Guests,  Thank you for your positive and detailed review.  We are happy that you had a pleasant stay with us and would like to welcome you once again.  Kind regards,  Melas Team", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r582220077", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "May break away!", "review": "We visited this hotel as a family of 10. 2 babies, a toddler, a 10yr old & 6 adults.  There was something for all ages. A kids club & mini disco for the toddler, plenty of grasses & shaded areas for the babies as well as 2 baby pools. An older kids club for the 10yr old. As well as 4 large water slides, mini disco, tennis courts.It was right on the beach with fridges full of drinks on the beach. Beach towels were provided. The entertainment team were fab, very entertaining & talented. A few of them spoke several languages too. The staff on reception we very helpful too,espically Eka who went over & above to make sure we had an enjoyable stay.  We can't recommend it enough & can't wait to go back", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r582167721", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Holiday ", "review": "Had the best time here. Would definitely come back here the staff are all so friendly an make you feel so welcomed. Great place. Food was delicious, always something different every night but with a good variety. We had no issues here an would definitely come back.😃", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r580742000", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Autumn Break in Turkey", "review": "Fantastic resort, helpful and attentive staff in every department, from restaurant, beach & pool bar, sun beds staff to the chambermaids. Breakfast had lots of choices, very tasty, dinner was just ok, felt the food was never very warm/hot which was a little disappointing. Room was clean and functional, big TV, bed was comfortable.  Fitness room was very old & tired and the bikes especially need updating. All in all great value for money!!!!", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r539171872", "sub_review": {"Value": 5, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice week", "review": "Nice clean rooms , immaculate gardens, pool areas clean, food not the best but ok, beach area a little cramped with the sun loungers very close together, lots of German and Russian guests only a hand full of British. It is rated 5 star but to be honest we've been to better 4 star hotels. Weather was good apart from one day of torrential rain.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r533751106", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great family hotel", "review": "We stayed in a two room appartment which was great for us and the two teenagers.The appartment also had separately controlled air conditioning in the lounge area and the two bedrooms. The drinks fridge is re-stocked with water, coke and beer every two days.  The staff are all really helpful and 'all inclusive' was good as the kids could get drinks and ice creams without us having to get off the sun bed each time. It is possible to get a sun bed by the pools and on the beach although it requires a careful search if you arrive late morning especially if you want a few that are together. The hotel is geared up for German and Russian tourists with English being the fourth language. It is much easier and quicker to order drinks in German. You are also more likely to get what you…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r525246449", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Excellent hotel choice in Side", "review": "This was a last minute holiday booking, so we were pleasantly surprised when we arrived at Melas Holiday Village. Once we had checked in at 10:30pm, the restaurant was still open with a few dishes for us to grab a quick bite after our journey. Our 2 bed apartment was modern, spacious, had comfortable beds and two balconies. There was plenty of wardrobe space and mirrors in every room.  The bathroom was large with a walk in shower. Rooms were cleaned daily, bed sheets changed every 3 days, mini fridge re-stocked every other day with free beer, fanta, coke, still and sparkling water. The small kitchen sink was useful for brushing teeth. The only disadvantage was not having a 2nd bathroom as we were a family of 5. The air-con worked brilliantly with no smell of damp and each room…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r523581288", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "I think you never regret about trip here ;)", "review": "We lived not far from reception, restoraunt, water slides. Cottages without ladders are very good for baby strollers ))  Good food with variety sorts of meet and fish. Good beach. But you should be very careful in water becasuse a lot of stones (big and small) are at the bootom. Pay attention - bars and other amenities of Melas Resort are not serve guests from HV  v.v. also.", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r521630315", "sub_review": {"Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "great holiday", "review": "We spent there a 8 day vacation there with family. It was an awesome holiday. There are several reasons why I recommend this place to everyone: 1.) Awesome food. Many choices, everything tasted great. It is truly all-inclusive, there was non-stop food even besides the main meals, and huge choice of beverages, including cocktail. 2.) the water slides, the pools were perfect, and the sea beach was close, the water was clean, free water in the fridge even on the beach :) 3.) The hotel has a stage, where they had a program every evening, dancers, illusionist, acrobats etc with great shows. 4.) The staff was extremely helpful and friendly, English was not a problem. 5.) There are also some extra, like great view, gym, spa. There was only one \"contra\", the wi-fi was very bad. If you…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r518325159", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Enjoyable Holiday", "review": "Visited with my wife and grand daughter for a week in the sun.   The hotel was OK but to be honest we have been to much better for similar cost in Turkey.  Visiting in August you expect everywhere to be busy and it certainly was, however the hotel facilities seemed to be very stretched for the number of guests especially the bars and main restaurant where most times there were just not enough waiters. No criticism of those who were serving they did their best, but looked stressed and over worked and gave few smiles.  There were very few UK people there and it was often difficult to communicate with the staff who spoke little English.  Turks, Germans and Russians accounted for 95% of visitors whilst we were there.  Reasonable hotel for families with small children but not so good…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r516835150", "sub_review": {"Value": 3, "Rooms": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Family Holiday", "review": "We have just returned from our family Holiday at the Melas Holiday Village.  This complex is made up of small apartment blocks surrounded stunning gardens.  One thing that stood out was the amount of room , we could always find sun loungers around the pool or water park. The beach is right across the promenade again loads of space and not all crammed in.  Food was good, wide selection of different disses with an evening BBQ located just outside dinning hall.  Midday snacks also served at both pools, with selection of ice cold drinks.  The animation team where very good, holding activities throughout the day plus a show in the amphitheater at night, they always took the time to stop and have a chat.  You will read a lot of reviews regarding 95% German, this is true but this never…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r511320187", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Good Holiday", "review": "It is a great hotel and the hotel area is so large and green.  Rooms: There are so many different style of room, all of them are very nice. , Foods: Breakfasts, lunch and dinners are all good, only the red meat is not sufficient.  Pool : Dirty! The hotel management can not solve this problem because pool area is not sufficient. However I did not observe infection with children and adults.  Water slides: There are great lifeguards and kindly push people to obey safety rules. Congratultions!  Hotel area: Super atmosphere  Seaside: Large enough and there are enough sunbeds at the seaside. Sea is perfect.  Animation team: Poor  Third party animation events: Great", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r509528584", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Bad End To A Nice Holiday ", "review": "To be fair this is a lovely hotel, it's well kept, the food is nice BUT we had a very bad experience on the last day, I did email the hotel hoping at the very least for an apology but this was not forthcoming so here we go.....I have never ever moaned about any hotel I've ever been to but the way me and my family were treated means I have no choice but to say something and warn others. As we had a night flight return I asked if there was somewhere to shower so we could change clothes for our return, we were advised that we could use the shower in the Spa in the main hotel so we turned up after a day in the beach to clean up. At 5.15 we were advised by the Spa manager to go to reception for towels who stated it was too late to get towels, we then asked the Spa manager again who…", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r499211214", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "At home ", "review": "In Melas Holiday Village you are truly at home! This place has touched your heart and given you wonderful memories. That's why you'll always be deeply connected to this special place. This is your happy place!", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r488769103", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Don't think, just book it!", "review": "This place is superb.  I'm a single female traveller and a bit of an explorer to boot and this couldn't be more perfect.   My twin apartment was spacious - with a sitting out area, table and chairs and drying rack. Two sofas inside, kettle, big wardrobes, free safe and free mini bar topped up with a couple of beers, water, soft drinks etc every other day. Cleaning staff were friendly and cheerful. Hotel was filled with mostly German and Russian tourists (I think) but it didn't matter, no chance to feel lonely, all entertainment staff, waiters etc. either spoke English or if not, found someone quickly who did.   The place is filled with flowers and trees, all kept beautifully - none of those high rise horrid hotel blocks, each was a small block of two or three floors overlooking…", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r488546346", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Yet another great holiday", "review": "We have now been to the melas holiday village 6 times and every time we go it just gets better always improving things like the pools and restaurants,great food great service.great holiday,very German but that has never bothered us or been a problem", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r474491220", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A great holiday", "review": "Just returned from a week at the Melas Holiday Village with my 20 year old daughter.    Room - (stayed in room 508) although on the small side, was quiet and very clean.  It appears that the bedrooms have been modernised with good furnishings, sofa, tv, fridge (free mini bar replenished every two days), tea/coffee making facilities, FREE safe, and excellent air conditioning.  Our only disappointment was that the bathroom was very dated with old bath, shower, wall and floor tiles.  It was very clean and the \"old\" shower actually was very good.  Also our room on the ground floor had a tiny balcony/terrace, struggled for two of us to sit at the table.  However, we didn't spend much time in our room and the beds were probably best we have slept on, soft ahhhh instead of concrete…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r419209962", "sub_review": {"Location": 5, "Rooms": 3, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Fantastic ", "review": "Just returned from a fantastic two week holiday at the melas holiday village . I can honestly say this is one of the best hotels that I have stayed in . The hotel itself is clean & modern , the grounds well kept . The hill is a bit hard work after a long day in the sun . The air con in the bungalows is fantastic as they all have there own units rather than all running off one . The pools & beach all clean & well kept . Staff all friendly and cannot do enough for for you . Animation brilliant , they all worked so hard and always had time for you .  A few minor gripes , the pool snack bar is very repetitive ( nuggets pizza & pasta chips etc  ) there are only so many nuggets you can tolerate , would recommend maybe  having some fresh cooked chicken etc & some fresh bread , the only…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r407829902", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Fabulous", "review": "(my visit was in fact in Oct 2012 but there was no option for so long back) Too bad Turkey is in the state it's in at the moment, because this must have been the best hotel I've had vacation at. Husband and 2 kids (5 years and 8 months old), it was great in every regard. Fantastic food, location right at the beach promenade, wonderful atmosphere with low buildings and lots of greenery, and most of all - the best entertainment team I've ever experienced. Classy high quality evening shows, kids club with various activities during the day, multiple opportunities for adults. I spend 2 weeks there and I long to go back! The only negative was weak wifi - only available at the reception area, which is quite far off. Hope they've improved on that since.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r403253732", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Fantastic Honeymoon", "review": "Dear Guest, thank you for taking your time and we value your comment. It was a pleasure to welcome you in 2012 and we would really appreciate to see you again. Our Wifi is now improved, available in almost the whole hotel area and free of charce. It was nice to hear from your positiv feedback and we are waiting to welcome you again.  With best regards from Side, Your Melas-Team", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r402774269", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great Family Resort", "review": "After a very bad start in another hotel we were moved to Melas, from the moment we got out of the taxi we were greeted with smiling faces and staff who couldn't do anymore for us.  As it was our honeymoon they arranged lots of lovely treats for us and made our week a fantastic one.  Would definitely recommend this hotel to all friends and family and will most definitely be back", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r379411513", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Melas holiday Village - Pros/Cons 30/09/2015 (review from young family) Out of 10/7.5", "review": "Dear Guest, thank you for taking your time to write a small comment for our hotel. It was a pleasure for us that we had the chance to provide you an unforgettable honeymoon and that you were satisfied with our services.  We would be glad to welcome you again.  With best regards from Side, Your Melas-Team", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r315130176", "sub_review": {"Value": 3, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great Holiday at Side", "review": "This hotel is amazing. Rooms, services, food and grounds are all good. Best thing about this hotel is its animation team. They are great people. They offer many activities throughout the day and each day there is show at amphiteater.  I really enjoyed pool games and water polo. Evening shows are mostly dancing and they are superb. Few times there was disco party at the pool after the show.  Beach area is big and there were plenty of seats even during the day. See was warm, but there were quite many rocks in the water, so be cerafull.  I would recommend this hotel to anyone who want to have fun all day and evening. Thank you Melas for great holiday. Ondrej  Buch", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r312321277", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Honest review of a great holiday", "review": "Dear Ondrej, thank you for choosing Melas Holiday Village and your comment.We are glad to hear that you had a pleasant stay and that you were especially satisfied with our animation team. It is nice to read your feedback and that you can recommend our hotel to other people. We would be glad to welcome you again. Have a good time.  With best regards, Your Melas-Team", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r312015336", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Brilliant Holiday at the Melas.", "review": "Just back from a week at the Melas holiday village in Side. Chose this holiday for our sixth visit to Turkey as we hadn't been to Side before. It's a good hour transfer from Antalya but motorway all the way. Room - We had an apartment which was great with 2 teenage kids. There were 3 Air/con units in the apartment which ensured it was always cool which was a welcome escape from the heat. The mini fridge was stocked daily and rooms were spotless. Probably the best we have stayed in yet. It was very quiet at nights with the smaller apartment blocks. Hotel - the grounds of the village are immaculate and very well maintained. There is not a thing out of place and there appears to be an army of workers throughout the place.There are 3 bars in total, reception/pool and slides. Staff…", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r311882008", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Melas ", "review": "Dear Allan, thank you to share your thoughts and holiday experience with us and that you wrote a small comment. We are glad to hear that you had a pleasant stay. The Melas Holiday Village staff are always trying to deliver excellent customer service at all times and we appreciate your feedback. Gladly we can tell you that the wifi will be free of charge from the next season 2016. Also our managemet is working for a better connection. Safe will be free of charge as well from the next season on. It would be a pleasure to welcome you again.  Best regards from Side, Your Melas-Team", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r307200319", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Lovely holiday", "review": "Just returned from a fantastic ten day holiday at the Melas. On arrival the check in was swift and as we arrived quite late at night we were offered a meal in the restaurant. The service at the Melas is excellent from the reception staff who arranged our a la carte evenings in the restaurant to the entertainment team. They work tirelessly to provide a great holiday for all guests of all age groups and nationalities. Though the resort is mainly for the German market we got a great service and the staff could speak to us in English. The gardens are maintained to a very high standard. There are so many different areas of the Melas to relax and enjoy the scenery its impossible to get bored with it. We as a couple have been to Side previously but enjoyed our stay here much better…", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r304913921", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Ice cream, ice cream, ice cream", "review": "Stayed as a family of 5, children aged 5, 9 and 11, we cannot rate Melas holiday village and their staff enough.  Food was out of this world and inspiring. Waiters were so kind and patient with our children. Grounds immaculate and staff clearly work hard. A la carte restaurants very good, our favourite was the international. Location again fantastic and we particularly enjoyed the market. We will definitely come again, we fell in love with Turkey, the culture and people. Thank you Melas :). ", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r302364649", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Very nice holiday village", "review": "Dear Guest, thank you for choosing Melas Holiday Village and we value your comments. We are glad to hear that your first visit in our hotel was such positiv and you are planing to come back for another visit. It would be a pleasure for us to welcome you again.  With best regards from Side, Your Melas-Team", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r299068719", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great hotel. You get what you pay for.", "review": "On arrival 1st August we were placed in one of the villa apartment type buildings.room 596. The room was really spacious and modern and the air con was amazing. Woke up in the night freezing! Because it was on the top floor we asked reception if we could move as my partner has a bad knee and they located us in the main building above the restaurant which had a lovely sea view but was a smaller room. The air con is this room was really poor so we asked after a few days of waking up sweating if we could move to another room after several attempts by the maintenance to sort it failed. Again we were given the option of another room in the main building but the air con was again poor so we declined. A tip for anyone staying is try to get in the separate apartment blocks as they have…", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r288287403", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Melas Hotel Side, Turkey.", "review": "Dear Guest, thank you for choosing Melas Holiday Village and your comment. Feedback from our guests is really important for us so we can improve the services for our customers. Your comments are noted and we will be happy to pass them on to the different departments. It would be a pleasure to welcome you in one of our Melas Hotels again.  Best regards from Side, Your Melas-Team", "date": "December 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r279753351", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "2nd stay and yet again fantastic", "review": "Stayed at Melas holiday village with my husband and 9 year old son. We also travelled with our friends a family of 4. Transfer was longer than expected we were advised this was due to upgrade of roads for 2016 g20 summit. Hotel set in beautiful manicured grounds. Cleanliness is second to none. Mainly Germans, norwegians etc but I like to holiday away from brits.  Everyone was well mannered and friendly with very few Russians in the resort. I would say approximately 5 British families  in the resort but suited us perfectly. Animation team worked extremely hard Toby and otto spoke great English and made a point of ensuring we knew what was going on. Shows were of high standard and summer party was absolutely fab. Food was varied and always fresh. We used Mediterranean restaurant a…", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r270417309", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Relaxing family resort", "review": "This place is exactly what we signed for.  It is a full catered for holiday resort for families.  The staff is professional and friendly.  The quality of the rooms is very good and the garden is superb.  It has lovely swimming pools and a nice beach and there's plenty to eat and drink everywhere. It is however aimed at the German speaking tourists who are the vast majority of the hotel guests, so if you're Belgian (like we are) you'll end up being talked to in German because that's what they assume you are.  Although you'll get pleasant smiles and comments if you try to say or order something in Turkish.", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r266608610", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "relaxing resort", "review": "Dear Tom, Thank you for the time you have taken to write a comment on this page. Unfortunately we don't have any french or dutch speaking personal. But german or english is no problem. It was a pleasure to welcome you and we hope to see you again. With kind Regards, Your Melas-Team", "date": "November 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r238720311", "sub_review": {"Value": 4, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Great for families with young children", "review": "you should visit this resort for at least 5 days relaxing period ,with a full board package ,the resort located on lovely beach and a number of swimming pools for all families .on full board all inclusive you don't need money in your wallet.back draw on the resort the holiday flats with one bath not advisable for family of 4 and sound insulation between rooms are not good ,over all its beautiful resort and well coming staff", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r238043285", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great value for money, lovely location.", "review": "Dear Guest, thank you for choosing Melas Holiday Village for your holiday and for the time you have taken to write a comment on this page. We are pleased to learn that you were satisfied with our service.  It was a pleasure to welcome you and we hope to see you again. With kind Regards, Your Melas-Team", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r236772704", "sub_review": {"Sleep Quality": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Value for money", "review": "My husband and I had never been to an all-inclusive resort before, but now that we have a toddler, we wanted something nice and easy. And Melas Holiday Village was just that. We stayed in a two bedroom apartment that was comfortable,  had lots of room and a nice view of the waterpark.  It was very easy to get to the pools and the beach. There was something for everyone at the buffet, although I found the food a little bland. But we could even find something thatr our toddler would eat at every meal. :-) The staff and waiters were always friendly.   The onlly drawback was that this place is aimed at Germans and while my husband speaks German, I don't speak any, so it felt a little lonely at times. I would have liked to be around more travellers who spoke Danish or English. But…", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r235114953", "sub_review": {"Value": 4, "Location": 4, "Rooms": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "", "rating": 4}, {"title": "Hotel aimed at Germans", "review": "There are a lot of good points for this hotel , such as location ,cleanliness, childrens annimation team , plenty of sunbeds and varied depth of the pools . However ,there are quite a few not so good points such as the hotel reception staff were unable to understand or speak english the food in the restaurant was repetative and aimed more at the german taste buds ( not that I ate much during my stay due to a stomach upset ) no coffee / tea facilities in rooms and few electric sockets in the rooms. Looked for Thomas Cook rep daily in reception and only caught up with her at the airport where she told me she doesnt go to the village only to the Hotel although my welcoming letter said different. . A disappointing holiday experience and shall not be returning .", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r231664533", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Would not return if you paid me!", "review": "Dear Guest, thank you to share your thoughts with us and that you wrote a small comment. We regret that our hotel with all the staff could not fulfill your expectations for a good holiday. We would like to note that the guest structure is international and also english speaking. As you will surely understand we are a family hotel and there are some periods of school holidays with more guests from the same country. We are pleased to pass your remarks on to the concerned departments.  With kind regards from Side, Your Melas-Team", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r231176698", "sub_review": {"Value": 3, "Rooms": 5, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "not impressed", "review": "Just returned from a week at the melas holiday village and must say a week was enough, this hotel complex has lots of good points, but has lots of not so good points especially if you’re English or have mobility issues We arrive late on a Sunday the only guess to get off the bus, there are 6 in my party 2X 18 year old a 16 year old with Autism and 2x 86 year old with sticks and walkers and me , so a mixed bag. I had Email the hotel direct to say parent had mobitaly issues and Thomas cook had request ground floor rooms due to this and we had special assistant as my parents can’t not do stairs. On arrive we were told to go straight to dinner as we only had 15 mins before it stop severing at 9pm, we just got our food which was cold before they started clearing away, we had not…", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r230086638", "sub_review": {"Rooms": 5, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Magnificient", "review": "Over all is not a bad place but comparing to the money we spend we expected more. Majority of staff speaks German so it was hard to communicate with them.even the night animation and pool activities in German. There are no tour or trip buses.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r229354369", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Perfect relaxation.", "review": "Dear Menana, thank you for your comment. We would like to note that the guest structure is international and also english speaking. As you will surely understand we are a family hotel and there are some periods of school holidays with more guests from the same country. We noted your remarks and will pass them on to the concerend departemt.  Kind regards from Side, Your Melas-Team", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r228819470", "sub_review": {"Value": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Book it - you will love it", "review": "Recently returned from Melas Holiday Village. Travelled with children and grandchildren and the village had something for all age groups. Previous reviews state that there are not many Brits at the Village and this was the case we were in a minority so played \"Spot the Brit\" and met up with some lovely people during our stay. Village is designed for families with 2 main swimming pools 2 x children's pools and an Aqua Park - we all enjoyed the pools and the private sandy beach outside the hotel. The Animation Team worked hard day and night keeping guests entertained with some very inventive pool games which attracted large crowds of spectators as well as competitors. Our grandchildren took a shine to Emily who was very good with the kids.  Food is great and very varied in the…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r225111342", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great place", "review": "Dear Rossi, thank you for choosing Melas Holiday Village and that you took your time to wirte a comment. We are glad to hear that your visit in our hotel was such a success and we were happy to read all the friendly words which we will pass on to the other departements.  It would be a pleasure for us to welcome you again.  Best regards from Side, Your Melas-Team", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r224024621", "sub_review": {"Value": 3, "Location": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Turkish Delight", "review": "My first impressions of this hotel where not great,after dropping other people off at wonderfully gold and marble hotels the Melas was a disappointment with its disgruntled doorman and roofless reception BUT after getting settled in and exploring the grounds we found it to be relaxed, very friendly staff, funny entertainment, wide range of food, good activities, great for families and we would recommend the hotel. If you want sophisticated, dress code, high class hotel it's not for you, if you want family, fun and a relaxing holiday then I would recommend this hotel.", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r216288844", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Animation staff were brilliant", "review": "Dear Mrs E.Long, thank you for taking a little bit of your time and writing us a comment. We are glad that we were able to convince you with our inner values.  It would be a pleasure to welcome you and your family again.  Best regards from Side, Your Melas-Team", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r214932460", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Fabulous hotel", "review": "Just returned from 2 weeks at this amazing hotel 3rd to 17th July, this was our 1st experience of AI In Turkey and we were not disappointed. On arrival we were greeted with a very welcome fruit cocktail before being shown to our beautiful modern room with a side sea view.  ROOMS:  big bright modern- well stocked fridge with Coke,Fanta,Beer,Water, soda Water. A kettle with tea coffee making facilities even though it is available everywhere all day long Large balcony with reclining chairs. Towels changed everyday. Bathroom had shower and separate bath with jacuzzi. Bathing products and hair dryer are provided.  Plenty of wardrobe space with hangers a plenty. Built in safe for a reasonable charge. Air Con is brilliant keeps the room at a great temperature  very welcoming after a…", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r208751939", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "One of the best all-inclusive hotels I have stayed at.", "review": "Just got back from a 1 week stay (2014 April 26 - May 3) with the extended family (2 adults and 4 children). We stayed in the family rooms which are more like a bungalow.   Our check-in was very very bad. We arrived around 330 in the morning and something was wrong with our reservation as one child was \"missing\". It took the rather unhelpful person working the night shift 45 minutes to complete the checkin. Of course, when we got to the kids room (we had two rooms), the third bed was not made and it took them another 30-40 minutes to get that settled. Bad start on our vacation....   The food has a acceptable variation over the week we stayed there but no really fancy dishes. All the sallads etc were the same from day to day and there was about 15-20 warm dishes to choose from…", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r203986182", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Better than expected", "review": "Dear Peter, thank you for choosing Melas Holiday Village and your comment.We are glad to hear that you had a pleasant stay and you enjoyed most of it after your bad start for which we are deeply sorry. Our hotel and the whole staff are trying every day to improve the service for our guest so we are thankful for your remarks which we will pass on to the concerend departments.  It would be a pleasure to welcome you again.  Best regards from Side, Your Melas-Team", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r203607056", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "We loved this hotel", "review": "I stayed here on a family holiday (grandparents, toddler and wife) in one of the apartments (two bedrooms, living room). The room appeared brand new with a modern bathroom and modern furniture. The room size was ideal for our party. Staff were always very friendly and the food in the main restaurant was very good for the type of hotel (I am not a fan of large hotels that offer all inclusive deals, but here I was proven wrong; plenty of choice, hot, fresh, very few queues, decent wine). A must is the turkish a la carte restaurant. The gym and heated indoor pool in the Melas hotel next door can be used, but the pools and beach in the village offer plenty of choice and fun. The beach is not overcrowded and there is space between the sunbeds (look down the beach a bit and you will…", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r202096979", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "great setting", "review": "Dear Franz, thank you for taking a little bit of your time and writing us a comment. We are glad to hear that you had a pleasant stay and we were able to convince you with the service and the food, especially the turkish a'la carte restaurant.  It would be a pleasure for us to welcome you and your family again.  Best regards from Side, Your Melas-Team", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r181860403", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "best holiday, don't hesitate just book.", "review": "We are just back from a week at the Melas Holiday Village in Side staying from 14/04/14 to 21/04/14 on an all inclusive package. The food here is amazing plus there are plenty snacks to be had in between regular meal times. Our 11 year old daughter had a great time as one of the animation team - Emily - was especially nice to her and took her under her wing in the teenage club. Mini bar in the room is free - stocked with water, soft drinks and two beers. Refilled daily but hardly ever used it as the bars are open all day and late into the evening. The Melas hotel next door offers free access to the fitness area, saunas and steam rooms. Massage can also be booked here. The grounds are quite secure but still offer direct access to the promenade, excellent for jogging and walking,…", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r180089166", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely hotel & location", "review": "We stayed for 2 weeks from 7th sept. the two last reviews on this hotel are good.  The melas village and melas hotel are on the same complex. Which ever you stay at you can use the facilities but not have food or drink . We stayed at the melas village and thought the place was lovely. We arrived on a late flight , we were checked in quickly, the lady receptionist is the best. we were taken to our room by a helpful porter in a golf buggy who showed us the bits in the room and we tipped. We had a room in the main block above the restaurant . Comfy beds put together as a double, wall mounted TV,  only BBC world news but that didn't matter, not there to watch TV. Hair dryer, beach towels supplied and changed for a small fee down by the main pool, no kettle but we took our own with…", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r178165771", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Good but not Perfect....", "review": "Dear Guest, Thank you for choosing Melas Holiday Village and we value your comments. We are glad that you enjoyed your first stay at the Melas Holiday Village. Feedback from our guests is really important for us so we can improve the services for our customers. Your comments are noted and we will be happy to pass them on to the different departments. It would be a pleasure to welcome you again in our hotel.  Best regards from Side, Your Melas-Team", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r176487233", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Amazing", "review": "This hotel is one of the most difficult I have had to review, so many excellent aspects but quite a few disappointing ones I would of liked to award it three and a half.  First the positives....  A few people have mentioned Brits being in the minority we found generally everyone we met during our weeks stay extremely polite and very well mannered we never had a problem getting sun beds on the beach or by the pool and being late risers we usually made our way down to the beach around 11am.  I don't think I have ever visited a cleaner hotel, the village hotel gardens, pool areas and private beach are immaculate everyone works tremendously hard to maintain such a high standard.  The animation team work tirelessly throughout the day and we found the evening shows very enjoyable and…", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r175556162", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Nice family hotel.", "review": "Dear Guest, thank you for choosing Melas Holiday Village and your comment. We are glad to hear that you had a pleasant stay. The Melas Holiday Village staff are always trying to deliver excellent customer service at all times, we appreciate your feedback and this wil be passed to the relevant department.  We would be glad to welcome you again.  Best regards from Side, Your Melas-Team", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r172013180", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Very Continental", "review": "My family and I booked this wonderful holiday. We were very pleased as the staff were very friendly and the good was incredible. Staff would bend over backwards to help you x very clean maid service everyday. They too up mini fridge every other dAy.  Great entertainment for the kids x  Highly recommend x ", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r171890924", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "NOT 5 STAR BUT EXCELLENT 4 STAR", "review": "Arrived back last week and spent a great week at this complex.  Arrived in around 6 in morning and cart took us to our room in the village.  First impressions dark small and very old fashioned in need of revamp.  Felt a bit cheated as had seen pictures on site and was expecting 5 star accomodation.  Went for quick walk around and went for breakfast at 7 am.  WOW what a spread and everything and everywhere was spotless.  I put the room behind me and moved on to have a great holiday.  I am the fussiest person regarding cleanliness and good quality food (I own a gourmet company so expect the best).  The food was always very hot and cooked perfectly.  Great range of food everynight to suit all tastes.  My partner was a bit annoyed as no bacon for breakfast but everything else was…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r169521309", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 3, "Rooms": 2, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Amazing holiday!", "review": "My husband and I and our 2 children, aged 3 and 8 spent 14 nights at the Melas Holiday Village in June this year. It was our first time in Turkey and we were unsure what to expect.   After an awful journey with a 5 and a half hour delay we finally arrived at our accommodation at 5am. Check in was really fast and we were delighted with the Delux Family Room we had booked. It is based in the block of rooms above the main restaurant. It is beautifully decorated with a fantastic walk in shower, very comfy beds and steps down to 2 sofa beds/sitting area. The air conditioning was excellent, sometimes too cold! The rooms were cleaned daily and the cleaner we had was lovely, so friendly.  The village itself is lovely. We have never seen such a clean place. There were teams of staff…", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r169343460", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Good value quality price", "review": "Dear Julie, thank you that you took a little bit of your time to write a small comment for us. We are glad to hear that your first stay in our Melas Holiday Village was such a success and it  would be a pleasure to welcome you again.  Best regards from Side, Your Melas-Team", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r165022803", "sub_review": {"Value": 4, "Location": 5, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "", "rating": 4}, {"title": "Beware the curse of the wristband, and the wellness robbers!", "review": "We've staid in a bungalow that had a big balcony. Bed was very nice. The bathroom however was a bit stinky of moldiness.  Bungalow located near to the theatre so very loud late at night. Food was ok but not enough fish or sea food. Selection of wine was not great at all. Very conevient location. 2,5 km from Side center so great walk along the beach. I do recommend the hotel.", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r163426859", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Best holiday ever", "review": "Just landed back in England on the 8th June 2013 having stayed in this hotel from the 1st to the 8th June 2013.   Don't be fooled, this hotel caters for Germans mainly and the staff speak fluent Turkish (as you would expect) and German. Being the product of a secondary education in the 70's neither me nor my wife speak either.  When we stayed there we were told that there were 1400 guests and 15 of whom were British. You can imagine who got the lion’s share of the attention?  On day one a smart looking chap called “Hamsa” from the wellness centre approached us. He said that we could call him something else but even with my secondary education I could pronounce Hamsa adequately. He noted that our tans had not started and we must have a Turkish bath and massage, we would be…", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r162004118", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "A splendid vacation !!", "review": "We just returned from a week at this beautiful hotel. The hotel is very well maintained and has a lot to offer for young and old. For the first time we booked all-inclusive services and we enjoyed to the max! The food was good and diversified. The service in the restaurant was excellent & outstanding! The hotel is perfectly located; the beach right on our doorstep. The rooms are spotless like the rest of the hotel area. On a rainy day we made use of the wellness area. The treatments were really good and staff extremely kind.The only negativ point is the unfriendliness of the reception team who seemed really demotivated and unwilling to assist. All in all a great hotel to a fair rate!", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r161304884", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Fantastic place to stay", "review": "We stayed at the Melas from 22/01/2013- 29/01/2013 for our anniversary. I don't really know what to say because I just COULD NOT find any fault with this place at all. The staff can't do enough for you, the service is spot on, the food is amazing and fresh. Rooms spotless- indeed all areas of the hotel were spotless. I would recommend a stay here to anybody- the pools and spas/saunas are a must", "date": "January 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r151138512", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "1st visit - will not be our last :)", "review": "What an amazing holiday - The animation team are fantastic, there is lots to do for all ages both day and night. Various sports, pool games, competitions, talent shows and brilliant evening shows put on by the team. It is a beautiful setting, lush and green, a few steps to the glorious beach. Our family room consisted of  2 rooms - one big double bed and 2 singles with plenty of wardrobe space. No tea/coffee making facilities though. We were opposite the main dining room and if you looked to the right from the balcony you could see the Sea.We were just a few yards away from the main pool (which all the activities usually take place around). The kids pool is fab and joins onto another pool which overlooks the main pool & sea. Both the fish & turkish a la carte restaurant make a…", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r141032733", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "What title", "review": "Dear Guest, thank you for choosing Melas Holiday Village and your comment. We are glad to hear that you enjoyed your holiday in our hotel and it would be a  pleasure for us to welcome you again.  Best regards from Side, Your Melas-Team", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r136394477", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "great from start to finish", "review": "Beautiful rooms and ground, first morning we turned up for reps meeting only for her to not turn up or even bothering to call reception to let us know. There was no rep information books for us to look at to gather some info about the surrounding area. When we booked the holiday we asked the travel agent to check if we could keep our room on as we had to vacate by 12 noon and wouldn't be picked up until 11.20 that evening . We were told we would have to wait until we checked in but there would be no problem, we then had to wait until our last day before they decided yes or no only to be told no, we could have willingly throttled them. Over all the holiday was enjoyable though despite  the sweltering heat.", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r136194827", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "OK, but wouldn't stay again", "review": "We arrived mid-afternoon and there was a german speaking couple checking in before us. They were given what looked like a large information pack on the hotel. We received a piece of cardboard with the mealtimes on. This was the start of a \"them and us\" type experience, mainly due to the lack of English spoken Or understood by the staff. We were driven by golf buggy to our rooms. I had emailed the hotel after we booked asking for adjacent or adjoining rooms which were provided. The rooms were of a good size and the maid kept them spotless, she was also very friendly. The only downside to the rooms was the lack of seats/chairs in the rooms. We could have used a step in the bathroom to climb into the shower as the bath was so high. the balcony door lock didn't work but as we left…", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r120251391", "sub_review": {"Value": 3, "Location": 4, "Rooms": 4, "Cleanliness": 5, "Service": 3}, "travel_purpose": "", "rating": 4}, {"title": "Melas Holiday Village October 2011", "review": "I found the hotel very big with nearly 900 rooms in different blocks spread over a well manicured garden. Room was very good and well cleaned every day. The staff were polite, efficient and very helpful but with the majority of the guests being German or Dutch I found it easier to speak my limited German but it was good practice. The food in the self service restaurant was very good with something for all tastes (the saffron fish was superb as was the grilled turkey). The hotel is on a sloping site so it made me keep fit and the walk along the promenade to the old town was good. I found the sunbed situation was OK and there were always some available by the promenade or on the beach. The mini bar in the room was well stocked with water, cola, fanta, mineral water, bottled water…", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r119154126", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "All inclusive - first experience", "review": "Spet 2011 - Just back from one week in the Melas Hotel (as opposed to the Holiday Village).  1 hour transfer by coah from Antalya airport - arrived mid afternoon, took 25 minutes to check in and not even offered a drink, despite 40 degree temperatures.  To summarise, pretty much what I expected Turkey to be - Hotel tired and styled typically middle continental, and I say with a good understanding given that my wife is German. No difficulty therefore with the language as most of the staff spoke German and little English. That being said, the Hotel is being gutted and re-fitted over the Winter of 2011, which will no doubt improve things. Our room, which was a two bedroom apartment, not attached to the Hotel, with one shower and toilet for 4 adults, was poor and certainly not what…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r118859507", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 3, "Rooms": 2, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Lovely holiday", "review": "Staff - excellent very smiley and friendly although some only speak German not English  Pool - Good but you had to get up about 7 to get a sun lounger as the families grab them! Food- Amazing, full range everyday, always salads, pizza, pasta, bread, and then meat and fish which changed then whole cake table and fruit for pudding. This was at lunch and dinner. They come and refill your drinks at the table. If you have a special occasion they will even decorate the table with flowers, we saw it for a few people.  Beach- Great, always possible to get a lounger on the beach, beach bar for ice cream and non alcoholic drinks. See very clean.  Room- Fine not luxury but clean and comfortable, everything you needed, cleaned and fridge filled daily.   All in all a great holiday, the only…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r118570839", "sub_review": {"Value": 5, "Location": 3, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Lovely Holiday", "review": "We arrived in the dead of the night and the welcome was great. Well spoken reception staff and food prepared for you. The room was amazing, like we were the first visitors to embrace the new modernised delux room. Breakfast, lunch and dinner were good but very boring after ten days, very similar, day in day out. The entertainment was good and the hotel staff tried very hard to please you. There were alot of German's but they were pleasant and friendly. No problem finding a sunbed either by the pool or on the beach. To summurise the hotal was above average, but side was just on your doorstep and made the holiday experiance that much better. The main town was just a 20 min walk away, walking on the promenade which was lively with shops, bars and restaurants. Side with the roman…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r118465409", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "SEPTEMBER 6TH TO 2OTH 2011 MELAS", "review": "Hoilday of a life time Food, room, entertainment excellent.we are going back next year as it was the best holiday wev,e had in years. chris/norm bristol.", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r118402481", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "GOOD", "review": "Good hotel, Food great, Rooms good, Entertainment Crap,", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r118351687", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Fantastic Holiday", "review": "Just returned from Melas Hloiday Village with my best friend.We are in our fifties and go away once a year together leaving our husbands at home,and I must say we had the best time ever.We had room 432 and it was amazing.The housemaid,her name was Nilufor was wonderful and so were all the other staff.Everyone spoke when they saw us and from the start of our holiday till the end we had a wonderful time.The entertainment at night was fabulous,and we even did the club dance at the  end of each  night.It was hilarious.And as for the Gala evening,well what can I say except that it was magnificent,everyone worked so hard to make it a wonderful evening.Never before have we stayed at such  a lovely place. everyone at Milas Village were wonderful it was a  beautifully kept place.The…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r118112498", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "fabulous family holiday", "review": "we travelled with friends who had visited before, from checking into newcastle airport to arriving home was a perfect family holiday. spotlessly clean, great service and 1st class food.", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r118065337", "sub_review": {"Value": 5, "Location": 4, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great holiday overall", "review": "Lovely setting and spotlessly clean, our room was in a great location overlooking the swimming pools. It is advisable to take an alarm clock though as a serious lack of sun beds around the pool areas meant we had to get up at 7 to beat the \"Germans\" for any sun beds!!! Around the childrens' pool they were all gone by 6 o'clock (not my idea of a relaxing holiday). The food was fabulous and lots of variety. The Turkish a la carte and the Gala night were especially good. The activities were organised by the Animation Team, who were very friendly and multi lingual. The hotel is closing in October to be refurbished and I think it will be even better after this. If you are reading this, Melas Holiday Village, here are my suggestions for improvement; more sunbeds around the pool with a…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r117494006", "sub_review": {"Value": 4, "Sleep Quality": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "fantastic Holiday in Turkey thanks to Melas", "review": "We arrived in the early hours and were greeted at reception by a very helpful receptionist, who spoke excellent English and booked us in, it was at this point we were informed we had been upgraded to a deluxe family room a statement that we didn't really believe. We were taken to our room on a golf buggy with our cases, and what a surprise when we opened the door  it was a split level room with a large double bed on the upper level and 2 single beds on the lower level which lead out on to the balcony. the bathroom was large and had a walk in shower toilet and sink and was very clean. the whole room was decorated to the highest standard. The next morning we set about exploring the village and found the whole place to be spotless. there are 2 main pool areas in the village. the…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r117140967", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Hotel OK but I wouldn't go back", "review": "I have to start by saying that we stayed at a fabulous hotel last year and we couldn't help but compare it to the Melas.  All in all the hotel was fine.  It is clean, the food is absolutely lovely, there is plenty of room for everyone and the location is good.  We had booked 2 rooms and were upgraded to a family apartment on arrival.  This seems to be quite common.  I have to start by saying that there is a very definite difference between the Holiday Village and the Hotel.  For example, people staying at the Hotel can use all the facilities in the Holiday Village but if you stay in the Holiday Village you can go over to the Hotel to use the pool but you will be unable to get a drink (not even water).  The Animation Team organise activities through the day and these are…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r116710900", "sub_review": {"Value": 3, "Sleep Quality": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Faultless Hotel - We will be back!", "review": "Hotel   The hotel was quite large with approx 100 rooms in a variety of bulidings spread over a large area with lots of space left open for lovely gardens and playing areas with no high rise buildings in sight the majority of the building are in a sort of alpine style. The hotel was extremely clean and the grounds, buildings and gardens were constantly being cleaned during our stay and there were no problems with bugs or the like.  The range of nationalitys at the hotel was the most varied I have ever come across and not a problem at all. English, Scots, Welsh, Germans, Moldovans, Russians, French, Dutch, Turks, Belgians off the top of my head although I would say the majority of guests are German.  --------------------------------------------------------------------------------…", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r115963393", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely hotel", "review": "Stayed for one week at the end of June with a child aged 8. Lovely clean and spacious rooms with 2 bedrooms and kitchen area and good sized balcony (we were upgraded to a suite which was possibly a self-catering unit in past times.) The food was of a good quality HOWEVER we went to book our restaurant reservations on Day 2 and there was no availability for either restaurant so please book early. ALSO the Thomas Cook brochure claimed the galas were weekly. Technically they are but actually alternate one week for the hotel, one week for the apartments so we missed out. So, coming back to the food, yes it was good but it did get rather tedious for breakfast, lunch and dinner. If we'd managed to break this up with the restaurant reservations then I'm sure I'd be singing from the…", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r115649359", "sub_review": {"Value": 4, "Sleep Quality": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good value", "review": "Hotel is very convenient with families, especially with children.  There is sandy beach with a warm sea, that is not getting deep very quick. We stayed in a family room, and enjoyed the beach, food, service and the place very much.", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r115415163", "sub_review": {"Value": 4, "Sleep Quality": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "lovely but male staff rude", "review": "melas holiday village is extremely clean staff cleaning inside and out all day long .we were very lucky as we were given a brand new room which was lucky .spoke to another english couple who had old room not very good the whole place is shutting for five months to make improvements .the resort seems to be full of germans and russians who are extremley rude hardly any english people .the male staff fawn over them speaking  to them in german and russian because of big tips .they speak little english .had to wait and wait for drinks with meals and plates to be cleared for next course .we found female staff cleaners etc extremley polite .we were extremley lucky to go to gala dinner which was wonderful and free not on every week though more like a banquet with show and live band and…", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r115204840", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "clean and tidy but  room for improvement", "review": "MY husband and eight of our family returned today from melas, We had stayed there about five years ago and thought we would take the family as a treat for my 50th birthday, we thought we would stay in the hotel part as a speacil treat, but before we had unpacked we knew it was a bad idea. The room where old and had bad aircon, we were told we could not use the main pool only the hotel pool and the slides pool'  When we went to look at the hotel pool, we were shocked it was nice but very quiet and hardly any sunbeds, We just knew the hotel was not going to work for us, we went to complain and explained about my birthday and that nine of us would never get a sunbed by the pool, We said we had been there before and could we downgrade to the village , They did this, and we where put…", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r110561840", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Room for improvement", "review": "Stayed at the Melas holiday village in May. Found the resort to be clean and the food of a good standard . Perhaps not as much choice as other Hotels of similar standard that we have stayed in in Turkey . We did use the fish restaurant which you could use once as part of the all inclusive deal this was in the sister hotel next door. This turned out to be a bad choice . The food was not as good as in the main dinner we had been using and they served each course only when everyone had finished the previous course .So we were all waiting for the slowest dinner to finish and people stared to walk out as they got tired of waiting. The resort has a strange system in regards of the pool towels .They give you one per person but if you want a clean one after your swim they will charge…", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r109063886", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Paradise at a nice price!", "review": "We stayed at the Melas Holiday Village in Side this September (13th to 20th) travelling with Thomas Cook. The flight out was something of a nightmare (to be reviewed separately!), having been delayed by 8 hours. However, the holiday itself did not disappoint.  We arrived after 11pm with the flight being delayed, and the hotel where efficient and courteous on our arrival, checking us in quickly and driving us by buggy to our rooms. They also provided us with a meal at that late time as we hadn't eaten for some time.  The village is set around a steep sided valley with accomodation set in small blocks (max 3 storeys high) around the top and sides of the valley. The valley centre is landscaped with gardens. The pool complex is split in two with a water park at the top and a…", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r82082981", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "OK", "review": "We stayed for a week in the Holiday Village ealier this year. I was expecting small villa style accomodation in the village but it turned out to be a Youth hostel style style large accomodation block with lots of rooms in. It was really noisy in the morning when people were getting up and the beds were rock hard. Other than that the room itself was quite nice with a large balcony overlooking the pool.  Hotel and grounds very clean. The food was great and staff were fairly attentive. The drinks service is a bit hit and miss and they do seem to favour serving large groups of Germans first.  The main downside to the village is that there is not much to do in the evening. The animation team shows are Ok for kids but not really for adults. There are a small number of seats in the…", "date": "April 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r82059797", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Excellent :)", "review": "Me and my boyfriend went to this hotel in August 2010 and it was an amazing holiday. The people that worked there were very helpful and friendly and the hotel was kept generally clean. The food was amazing and there was so much choice at breakfast, lunch and dinner. There are shops right outside the hotel and we also walked into Side in the evening. We also went to the Managvat market which was very crowded but great for bargains. There weren't many English but we didn't have a problem with the other people staying there, and there were also a lot of cats around the hotel but we didn't find these a problem either. You can pay in Euros or Lira at any shop or in the market. There was never a 'fight' for the sunbeds which was lovely, we even went to the pool at 2 in the afternoon…", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r81770876", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "absolutely fantastic", "review": "First time to Turkey with myself husband daughter and 3 grandchildren ages 5 7 8 it aws absolutely fantastic beautifull grounds excellent food very clean and friendly childrens enetainment great and exceptional animation team good shows very professional and garla dinner 1 night was out of this world the only down side not a lot of English but all i can say is that is your loss missing out on a fantastic holiday will be back next year", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r80566960", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "absolutely brill", "review": "It was the first time of staying in the Melas holiday village, could not fault any part of the holiday,  from the moment we step into the lobby the staff were very friendly and helpful.  Food was out of this world, waiters were always on hand to keep your glass top up.   overall i would go back again.  There are lovely sights to see. The only downside was that there was a lot of Germans, but they were no bother to us, so were very friendly.", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r79901864", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "excellent  holiday", "review": "First time to Turkey the whole holiday was brilliant ,food , accommodation and staff.Only downside was mainly German visitors ,but we still had a great time .Would recommed this holiday village ,location beautiful. would go back again .", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r73877948", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Good stay in a great part of Turkey", "review": "Have holidayed last three times in Egypt - this is what we were comparing this to.  Food - Good, a bit samey but no stomach upsets which is unusual for us  - we ate out a night just to vary it a bit as well - some lovely choices in Side town. With a 1 week stay you get 1 a la carte, Turkish v. nice.  Location - Terrific, great beach, near shops, 25mins walk into town on a lovely new esplanade - easy to get a taxi if you can't face walking back. Side very good - ruins, harbour a really nice touch - more than just faceless hotels.  Room - bit dated, small, but clean and adequate. The sister hotel next door is more glam. This is more family / simpler but we liked it - seemed friendlier.  Service - Generally very good, nice atmosphere, helpful, much better service at the bar than we…", "date": "June 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r71497694", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Great holiday from start to finish", "review": "Have just returned from a week at the holiday village.  The hotel and grounds are well maintained and the whole complex was spotless at all times. The food was excellent and meals and snacks are provided up to midnight so there is a good choice. The drinks are served by waiter service so there is no queuing at the bar for ages like some all inclusive hotels. The rooms were clean and tidy and the maid service was excellent. The entertainment in the complex is about average for turkey with pool and beach games in the day and a show followed by the disco in the evening. There are shops and bars about 2 minutes walk away or you can get the bus to the nearby town of Side if you get bored of being in the hotel.", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r44135146", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Amazing", "review": "I Would recommend this hotel to everyone, this was our second time here and it was as good as the last year! No faults! 10/10!", "date": "August 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r39452137", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Nice Holiday", "review": "I have just returned from 2 weeks at the Melas Holiday Village with my wife and 7 year old Daughter . I arrived at the village at 05.30 am to be greeted by a very efficient reception desk which was pleasing after a long journey and hassle that we encountered at Stanstead airport. We were quickly taken to our apartments by a man in a super charged golf buggy who assisted with transfer of luggage and tried to communicate the fact we had air-conditioning and a mini bar in the room. After 30 seconds he lingered and i thanked him but he still lingered. Again i thanked him then realised he was after a tip so i explained i would see him later as i had no Turkish money on me at the time. Eventually he left. We had favoured a sea view room which would have been excellent if the tree 10…", "date": "July 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r36164285", "sub_review": {"Value": 5, "Location": 5, "Rooms": 3, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "great holiday", "review": "Myself and my daughter have just returned from a weeks holiday at the melas holiday village which was for my daughters 21st birthday. The accomodation was excellent set in spacious gardens and the maid service second to none. It was our first time all inclusive and we were surprised by the standard of food the amount and how well presented it was. All the staff at the village from were so helpful and friendly. The animation team were amazing and without them the holiday would not have been the same they work so hard 6days a week and always have time to stop and chat or give you a smile and a wave Rose is the most adorable person i have ever met. Most nights there is a show of some kind and sometimes afterwards a dance party by the pool although this finishes at 11.30pm  there is…", "date": "October 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r21395309", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "", "rating": 5}, {"title": "brillant holiday village", "review": "We have recently returned from the Melas Holiday Village. 2 families (4 adults, 2 children). Must say it was a brilliant holiday. the children loved the water park which is centered by the village rooms we were in.  The food was exellently prepared but would agree it would do the waiters no harm to smile once in a while. The odd one or two were ok but it isn't something that would spoil a holiday. Mostly ate in the restaurant but late lunch of burgers, spagetti and pizza down by the main pool where animation team centered the activities. Lady down by beach also makes wraps with filling from 12-4pm which were lovely. Watched a few of amination team entertainment at night, mostly mimed but a lot of work was put in to the productions and some good shows. We stayed for 2 weeks and…", "date": "July 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r18805525", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 4, "Rooms": 3, "Cleanliness": 4, "Service": 3, "Business service (e.g., internet access)": 3}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Melas Holiday Village Good for Families", "review": "We recently returned from the Melas Holiday Village and had a lovely time (4 adults 2 kids), weather very hot with only a slight  breeze over the pool area.  The waterslides were very good for  kids and adults (trouble keeping them off them) the waterslides open at 10am until 12.30pn, they open again at 2pm until 5pm, ice cream is available from 12pm until 5pm onwards (which is a life saver, can go up as many times as you like), their is a small bar situated here which only serves drinks, need to be down before 9am to get a sunbed (unless you speak nicely to the pool man he is more than happy to reserve a bed for you).  Breakfast, lunch and dinner was served in the main restaurant  (waiters could do with smiling, which is more or less catered for the German's, Russians & Dutch…", "date": "July 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r18414394", "sub_review": {"Value": 3, "Location": 3, "Check in / front desk": 3, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Would return to the Melas", "review": "We have recently returned from this resort. We all had a wonderful time and our children (aged 8 and 3) cried when we left, making us promise to return.  We had a family room. This meant that we had our room with double bed and an interconnecting room for the children with two separate singles. The bathroom was nice, with a powerful shower over a bath. The balcony was a good size, overlooking the immaculate grounds. Our maid was efficient and very friendly. She came everyday and left towel art on several occasions.  As we were staying in the village part of the resort, as opposed to the hotel, we could use the main restaurant and the pool snack bar.  We ate in the restaurant for breakfast and our evening meal. There was a good variety of food, which was always well-cooked. There…", "date": "May 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r16552646", "sub_review": {"Value": 4, "Location": 4, "Check in / front desk": 3, "Rooms": 4, "Cleanliness": 4, "Service": 4, "Business service (e.g., internet access)": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Perfect!", "review": "After much searching on the internet for a good price/quality hotel, we booked our holiday at the Melas Holiday Village for a week at the end of October 2007 (we just got back).  The Melas is definitely one of the best resorts we have stayed at. Our party consisted of parents, children and grandchildren, ranging in age from 2 to 60 and everyone had a great time.  The rooms are clean and modern. The restaurant is really excellent and all the food is freshly prepared. The sous-chefs are always walking around to check everything is ok. The staff are very friendly and help out however they can. There is a guest relations person called Nora who speaks Dutch, German, Turkish and English and she is really very helpful.  The beach is right on the doorstep and is very clean, with fresh…", "date": "October 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r10401057", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Fantastic Holdiay Experience", "review": "Our family of five, with children aged 13, 11 and 5 have just returned from the Melas Holiday Village and we enjoyed a fantastic holiday.  The hotel service, food, animation, beach, pools and rooms were superb. We were a little unsure of what to expect given the wide range of reviews of Turkish hotels on various travel sites. The Melas was highly rated on both this site and several others that I had reviewed. The reviews were right on the money as this is a great resort.   We arrived on a Sunday and were treated to drinks at the bar and lunch while the staff prepared our apartment. The apartment was well appropriated with a refrigerator, two separate sleeping rooms and a modern bathroom. The only minor downside is that the apartment was a little small for five persons and there…", "date": "October 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r10077663", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Relaxing Holiday", "review": "The hotel is definitely 5*.  It is extremely clean and the food was excellent.  There are several places to eat and all very good. The daytime activities were ok, however my children (15 and 12) would have been bored with the entertainment had they not made friends. The evening entertainment was poor.  It finished at about 10.30.  The disco opened at 11.00, but no atmosphere as noone ever went!  The shows were ok but finished far too early and we were left with nothing to do. Even though the hotel was excellent, i wouldnt go again purely because of the lack of entertainment.  So its a good job we were happy to have a relaxing holiday!! ", "date": "August 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r8613556", "sub_review": {"Value": 4, "Location": 4, "Check in / front desk": 4, "Rooms": 5, "Cleanliness": 5, "Service": 4, "Business service (e.g., internet access)": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Best Holiday i have ever been on!", "review": "Just yesterday i came back from my holiday at Melas Holiday Village. I must say, i have been on some pretty impressive holidays but this has got to be the best by far! I spent two weeks with my family, my mum my dad and my little sister, 12.   When we got there the staff were so friendly and just made you feel completely welcome.   There are three main pools in the village, the biggest one is were the animation team play games and entertain you throughtout the day.  The second pool is a little bit smaller and gets alot of sun, great if you want a tan. Beside it is also a small baby-pool.  Both of these have a lovely sea view.  The third pool is on the other side of the complex and is a water park with four waterslides and a lazy river.  Proberley the best part of my holiday was…", "date": "July 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r8383801", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "loved melas", "review": "We have just returned from Melas this morning and would definately recommend it. Absolutely fantastic! There were 5 of us in our party, ages ranging from 12 to 63. My 12 year old son was entertained all day long by the animation team who were all so friendly. Lots to do or you can just relax by one of the pools or on the private beach. The food was excellent and plentiful.Everywhere was extremely clean. All in all Melas was a great place to stay and we will definately be going back! ", "date": "June 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d314859-r8083109", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled with family", "rating": 5}]