[{"title": "Don't stay here", "review": "After viewing reviews we were enticed to stay here. Our welcome was mostly demondtrated by ingoring us. Finally they wandered out the front greeted us with a bored \"yes\". After asking about room rates we questioned prices quoted here on TripAdvisor and were firsty told it couldn't be this hotel, then he said he would not match the price as it was wrong. Customer service 0! Honestly 0!", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d316489-r691961416", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Can't fault this hotel for value for money", "review": "So it may need the decor refreshing but I cannot fault this hotel for location or the friendliness and helpfulness of the staff, would return in a heartbeat to Molyvos 1, the room was comfortable and clean and the breakfast more than adequate", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d316489-r675320170", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Hotel molyvos 1", "review": "Great location. Just by the sea. You can watch a beautiful sunset from the porch (palm trees block the view from the balconies). Small pebbly beach. Sea was too wavy when we were there so we had to go to far beaches by car unfortunately. Hotel is very old. Rooms are very small but clean though. We slept tight three days in a row.  Breakfast is sufficient but the same everyday lacking too many choices. Hotel is waking distance from the center to all the dining places. Staff is friendly and helpful with customer needs. Overall we had a nice time.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d316489-r621683177", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Good location opposite great beach and close to centre of Molyvos", "review": "Very nice location opposite the beach, close to the centre of Molyvos and not too far from the harbour.  The beach offers sun loungers and umbrellas at 2 euros each and also showers. It is stony as you walk in, but then becomes sandy. The water was fresh in late June and incredibly clear. Great place to swim.  The palm trees between the hotel and the beach did block most of the view of the sea, but then again, they did provide green and shade.  The breakfast buffet offered a good choice which could be taken outside under the trees looking over the beach. What I really liked is that although the buffet closed at 10am, this was \"Greek time\", so it was usually possible to pop back for seconds or another last cup of coffee before it is all cleared away. I do understand that a hotel needs to get on with other things, but I really dislike a strictly enforced sharp cut off time.  The staff were very helpful and friendly, especially the lady at the breakfast buffet. The reception manager arranged a laundry service to collect and deliver for us who did a very professional job, although it was quite pricey.  Negatives: The rooms are rather small.  One towel rail was broken.  The air con was over the entrance door in a lobby area and didn't cool the room very well.…", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d316489-r594311467", "sub_review": {"Value": 4, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Standart hotel", "review": "Molivos is very popular place for tourists. The hotel is close to the center, you can go in 5 minutes by foot. The breakfast is not ok for me. Hotel's beach is very nice. The room is enough for 2 people, but not for 3. ", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d316489-r521692802", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Nice view, bad room quality", "review": "The view of the Aegean sea is perfect from hotel. But the room quality is really worse than expected. Even we are scheduled more than 1 month ago, room was not prepared and smells terrible. Plus beds also smells like humid. Probably not gonna stay here again. ", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d316489-r485643550", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Perfect location", "review": " Very close to the hearth of Molyvos- walking distance or take mini train shuttling every 20 minutes Hotel has its own beach, 3 euro for each chair You should lower your expectations for breakfast Rooms are acceptable vs price and location- clean but need maintenance Stuff is friendly", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d316489-r412561613", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "This hotel is 20 years late for renovation", "review": "All the negative comments you read about this hotel are right. Yes it has a great location but poor on rest of everything. The rooms are too small and they need to be re-furnished according to their sizes. The beach of the hotel is very dirty too. It is better to stay at small pensions with a view next to the castle .", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d316489-r409868250", "sub_review": {"Value": 2, "Sleep Quality": 2, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Lovely Hotel. Beautiful place", "review": "When we initially got to this hotel we though there was a mix up with our booking. The receptionist was very helpful, called bookings.com, gave us an ice cream and sorted it out. We had a castle view room, which was nice. Good and quiet air conditioning. In the morning you can have your breakfast buffet on the terrace overlooking the clear blue sea.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d316489-r399437764", "sub_review": {"Sleep Quality": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Silent Hotel", "review": "Very good location, staff are very helpfull, rooms are very clean but very simlpe furnitures. If you have sea side room, you can hear sound of pebblestone beach in your room. Sunbeds are not free you have to pay 2,5 euro for one each and 1 euro for umbrella. Sea is very clean and not very cold.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d316489-r395333293", "sub_review": {"Location": 5, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Disappointing", "review": "Travelling for business and pleasure with a friend, we chose this hotel because of some good reviews. But it was truly disappointing. I've been to Greece many times and was astounded at how bad this was. I look forward to the warmth of the small Greek family-run hotels, but this one seemed to be run by a handful of Albanians, one of whom was distinctly unfriendly. Unfortunately he was the main desk clerk. We booked on Booking.com and perhaps as a result they stuck us in the two employee/driver rooms on the first floor in the back of the hotel.  When we offered to pay more to change our rooms, they wouldn't let us. But then when we checked out they ended up charging us for a nicer room, anyway--even though we didn't get it!", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d316489-r384253568", "sub_review": {"Value": 2, "Sleep Quality": 2, "Service": 1}, "travel_purpose": "Traveled on business", "rating": 1}, {"title": "We LOVED staying at Molyvos 1 Hotel", "review": "My wife and I loved staying at Molyvos 1 Hotel . The location of the hotel is absolutely perfect and our room was great . The owners were very very helpful, when I asked for a couple of extra things for our room . The terrace in front of the hotel was fantastic and the view was incredible . The breakfast was wonderful, with a great and varied choice of food . I highly recommend this hotel if you want to stay in Molyvos itself.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d316489-r376046935", "sub_review": {"Value": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Beautiful hotel on the beach", "review": "The hotel provides an unforgettable experience rest and relaxation with the sound of waves. Breakfast on the terrace under the palm trees overlooking the sea, is the best  way to start  the day on vacation. The friendly staff will make the atmosphere even more beautiful.", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d316489-r339374341", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "A standart budget hotel close to center", "review": "The hotel is close to Molyvos town center but 15 mins by walk. The rooms and the overall hotel is not that special, the room price is reasonable but not very cheap. The people in the reception were not there we we got and we had to wait a bit.   There is no wi-fi in the rooms!  The breakfast and the coffee is not that speacial also, very standart!  If I go there next time I would definitely choose a hotel in the center.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d316489-r318533159", "sub_review": {"Location": 3, "Rooms": 3, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Nice hotel in Molyvos by the beach", "review": "A very nice, tidy hotel ,perfect location  by the beach. Nice lunch restaurants near by. Friendly staff ! Breakfast served in the garden under palm trees.  The only negative thing is that the beach in the front of the hotel is not free for hotel guests.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d316489-r310407813", "sub_review": {"Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Overall terrible experience...", "review": "The only thing worth about this hotel is the location.... Otherwise it does not explain the price charged for a hotel that has reallyyy small rooms, not properly cleaned with extremely bad matress. Worst of all was the airconditioning that did not work at all and the attitude of the receptionist answering to our complaints that it used to work to the previous guest...really?? Is that an answer??i would not recommend at all this hotel... It only takes advantage of it's location and does not offer even the basic.. The bathroom also was very small, with a really bad smell and broken door handle. Not to mention that no parking is available. Would not recommend this hotel at all and worse even stay again...", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d316489-r304041854", "sub_review": {"Value": 1, "Location": 4, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Location, Location, Location", "review": "One of the best locations in Molyvos. You can enjoy your breakfast (not full English) on a huge terrace with 30 metres to the sea. Lot of restaurants nearby. The atmosphere is relaxed and quiet.  The beach is right in front of the hotel and sunbeds available for 2,5 euro/day. There are stones one the beach, but when you are 5 metres out the seabed is pure sand. The stones are rounded and walkable. The rooms are small and not updated. Air condition is extra charge for 4 euro/day. The beds are fine. Due to location and the fact that we will choose the same hotel again, we give it 4. ", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d316489-r290626167", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Great hotel for exploring charming Molyvos", "review": "I did not expect much of this hotel judging by other reviews. But it was a perfect base for exploring Molyvos, and it is the first hotel to the seaside, we could have a quick swim in the evening and shower in the room a minute later. And the beach closest to the hotel has a blue flag, which we can confirm. There are pebbles, but when you get in the water, there is a lovely carpet of sand. And we saw a lot of fish too.  The staff was friendly, it is a family hotel, which we liked. We also had wi-fi, air-conditioning and the refrigerator with no extra charge. This is a breakfast only hotel. You have a lot of choice like classic coffee, tea,  breads, cheese, salami, butter, jam,  boiled eggs, cereal, honey,homemade marble cake and cookies (yummy), homegrown tomato, cucumber and…", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d316489-r231044863", "sub_review": {"Sleep Quality": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Mixed Feelings", "review": "Lovely location right across from a small tree lined beach. Rooms were small and cluttered with old furniture and bedspreads that have seen better days. Air conditioning barely worked and wifi would only work in reception and the garden. Everything was clean and there was a balcony overlooking the garden and the sea. The garden is lovely to sit in and relax. Breakfast is basic with cornflakes, boiled eggs, cheese, yogurt, tomato, cucumber and bread. Breakfast never changes. There are lots of restaurants with views of the sea near by. The staff of the hotel were lovely and very helpful. I am not sure I would make this hotel my choice again even though the accommodation  is very good value for the location.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d316489-r220456438", "sub_review": {"Location": 5, "Sleep Quality": 2, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "The bare necessities", "review": "My husband and I were really disappointed with our stay at this hotel.  For some context, my Greek husband and I travel frequently to Greece and often stay in simple Greek rooms (as opposed to larger run hotels) because the location and quality of stay is usually fantastic with Greek hospitality.  This hotel was the worst Greek room we have stayed in.  First of all the positives: it is a beautiful building with a nice patio outside where you can take breakfast and sit with a drink in the evening (although the hotel has no atmosphere so very few people do this).  The hotel is very close to Molyvos which is just gorgeous and has lots of restaurants and tavernas for a night out.  The negatives for us included:   - It is well within earshot of the rowdy bar 'Congos' that our Greek…", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d316489-r219187688", "sub_review": {"Location": 4, "Sleep Quality": 1, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Delightfull pleasure at the beach", "review": "Wanting to get away on a sweetheart holiday only, our eyes fell upon Molyvos 1 on Lesbos. I must admit I was a bit reluctant at first because of the photos - old style. But situated on the beach and the former reviews being so good we decided to make this little boutique hotel our destination. And what a lovely surprice. The staff greeted us with open arms and had everything ready for us. In literally 10 mins they had us checked in and on our seaside balcony. The palm trees in front will give you some privacy, so it is perfect.  The décor is somewhat old. Never mind that, your time is spent on the beach and in the old harbour or Mithimna (Molyvos) town, in which the Molyvos One is very close by.  The beach (right outside the door) is actually a public beach and the Greeks…", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d316489-r219177710", "sub_review": {"Sleep Quality": 4, "Rooms": 3, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Enjoyable Stay . . . Will Consider Returning", "review": "Enjoyed the location, stay & convenience.  If you are looking for what is right you will like it; if you are looking for what is wrong, you may be disappointed.  Simplicity, hospitality and a bit of charm coupled with a sense of the facilities feeling tired and a very basic breakfast.  We were fortunate to have a seaside view.  Other reviews capture  the hotel quite well.", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d316489-r218123994", "sub_review": {"Rooms": 3, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Nice hotel, great location", "review": "Hotel Molyvos 1 is situated on a perfect spot: just meters from the beach, very near all the shops and restaurants. It’s a perfect place for relaxing vacation. Service was friendly and the atmosphere relaxing.  On the minus side is the fact that you hear all the movement on the corridor very easily… which means that all you do in your room is heard in the corridor. The breakfast was ok, but there were no variation during the week.  If I sometimes go back to Molyvos, I choose this hotel, Molivos 1, without hesitation.", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d316489-r217074759", "sub_review": {"Location": 5, "Sleep Quality": 3, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Best compromise value & price", "review": "First of all - hotel stays on the best location, Molyvos is such a beautiful town and this hotel is away from noise but still in center. Also hotel is very nice, stuff is friendly and I really enjoy having breakfast practically on the beach (all tough breakfast we must admit it - is quite poor, but that is Greece :)). But again - hotel has great homely atmosphere and I like it because it's in family run with a little number of rooms - so it's really more hosting I believe. Rooms are big enough, clean and with a little balcony - but better this then nothing ;) What we didn't like are quite hard bed and pillow. And what we find unusual that towel change only on 3 days. But there was no problem if you need it earlier - you will get new fresh towels without any complication. I…", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d316489-r216070003", "sub_review": {"Value": 5, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A lovely stay right on the Beach", "review": "We had a lovely stay of four nights- if only it could have been longer.  The rooms were simply furnished, the windows open to the sea, the breakfast taken on the terrace also facing the sea was simple but included greek yogurt and honey.  Very decent coffee.   The amaryllis boarder that defined the large terrace was in full bloom.  We could easily overlook the sound of 3am revelries (a single lane cobbled road between our room and the sea) as the hotels' location allowed us ease of access swimming and walks to dining and window shopping.  There was convenient parking for the car.  We were pleased to have this hotel recommended to us and will be back.  ", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d316489-r161549227", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "Best place to stay", "review": "Molyvos I is the best place to stay in Molyvos, Lesvos. The owner of the hotel Suli is a very sweet woman and very helpful. I've been there a couple of times and always stay there. It's close to the harbor, the castle, the shops and the taverna's. Their beach is also good. You can get massaged by a chinese couple when you're sunbathing for a reasonable price.", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d316489-r152595017", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Quite and on the beach", "review": "The hotel has a nice garden where you can have your breakfast and the beach is just in front of the hotel. Although the furniture of the rooms are old, the location of the hotel is excellent... The area is silent and you can enjoy a nice sleep before jumping into the sea in the morning. The hotel staff are friendly. Molyvos has nice restaurants but I can advise you the closest one, Triena Restaurant where you can eat Lesvos cuisine.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d316489-r137733984", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "On the beach with a nice garden.", "review": "The hotel is on the beach. It has a very nice garden where you can have your breakfast.The breakfast was poor.Because we were very pleased with its location, we didn't care much about the breakfast.  The furniture of the rooms are old, but the matresses are new and comfortable. You can sleep with hearing the waves.   No shampoo in the bathroom,just the soap.  For dinner, there are restaurants and cafes on the beach,they are very close to the hotel. Or you can  walk up to old Molyvos.  The price is reasonable.  We would like to stay at this hotel next time for a few days for the sea and relaxation.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d316489-r137339926", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Lovely", "review": "This year i visited Molivos second time and again chose to stay here. I believe this hotel is perfect for its location, just next to sea, and prices are very reasonable. Not being at the port is an advantage, the visitors can sleep without any noise. The rooms are not luxurious, but good and clean. I just would prefer a double bed rather than two single and adjacent beds in my room. Also the breakfast could be better.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d316489-r137069703", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Molyvos 2: Beautiful, quite, excellent food!", "review": "We have stayed in Molyvos 2, a property owned by the same company as Molyvos 1, but in a quiter Eftalou. The place is PERFECT for families. We stayed in two connected rooms; a double one for the parents and a single one for our 11 year old. Both had excellent airconditioning and a nice view of the sea and an orchard. Both rooms had refrigerators, the double room also had a microwave and two cook tops. Both had beautifully renovated bathrooms. The hotel is right on a beach (extremely clean already and they also remove sea grass every morning), but what is even better is the hotel's wondeful pool with warm sea water. This was a big hit with our family.   We had half-board with breakfast and dinner. The dinners were delicious. They have a local cook who prepares excellent local…", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d316489-r135980167", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "A nice hotel in the island of Lesvos", "review": "Hello, we have had a fantastic time in this hotel with my family. Very helpful and polite. We think to go back in 2013.", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d316489-r126743042", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Excellent hotel", "review": "very good hotel. close to taverna's, restaurants, shops.  you can easily walk to the castle on top of the hill via old,narrow steps and streets.    Our room was on the 1st floor, a corner room and was big enough.    We had a balcony. A very good airconditioning - The change of the towels is a bit poor. Very friendly staff.   Guests of the hotel are very often \"repeaters\". We met a lady who spent her 5th week there during August/September 2011 and was returning since 1960 to Lesvos. Must be a record.   I can recommend this hotel, and also the nearby Hermes Hotel. The two hotels seem to co-operate.   The first two nights of our stay we slept in the Hermes instead of Molyvos I. There was not sea-view room available upon our arrival. We just had to wait for 2 nights. This was no…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d316489-r118683986", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 3, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great Value - Poor Quality", "review": "This hotel is good value (we paid 45 Euros pn incl Breafast)  and is in a good location for visiting Molyvos. The communal areas, especially the outside areas are very clean and comfortable. However if you don't like to see ferrule cats mating during your breakfast - you might want to avoid this hotel, or Lesvos altogether for that matter.  The bedrooms are very simple - clean - but frugal in facilities. Beds are small (short) and very very hard. Only 1 pillow per bed. Balcony is tiny.  The breakfast - this is dire. Coffee is awefull, juice is only cordial (squash), there is yoghurt, honey, processed cheese and meat, and some bread, no sign of any fruit. A very dissapointing start to the day.  The front of the hotel has other bars and hotels either side and can be noisy - it may…", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1191013-d316489-r111059412", "sub_review": {"Value": 4, "Sleep Quality": 1, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}]