[{"title": "Very good", "review": "Perfect service. Place has a parking, were on our way to return the car at BCN. Got there after having late lunch/supper, so were not looking for food. Place is sort of isolate for that matter. Has a nice bar. After getting to the room, had a big beer in the lobby (it wasn't very claen). Breakfast was nice. Room was comfortable and we had a good sleep. Service was fantastic. Very good place on the way.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r716843635", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Just about ok", "review": "I was working at the circuit di Catalunya and our team were staying at the hotel. The WiFi was ok and the staff were very helpful. The breakfast is terrible.  Fruit apples and oranges and some were badly bruised and marked. Fruit salad was out of a tin.  Bread for toast the cheapest and tasteless.  The breakfast pastries not very good either. The coffee terrible , just hot milk. The bed was ok but the pillows just really hard lumps of foam.  The bathroom was ok. I know it’s a holiday inn but we stay at lots of basic hotels and this was probably the worst for breakfast. When you are working at a race track you do need breakfast in the hotel and this was a big disappointment. ", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r714079731", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Perfect spot for one night ", "review": "Had a great night at the hotel. My flight came late after midnight, reception is open 24h/24.  Clean room, bathroom is top. Free parking next to the hotel. Not so far from Barcelona. Breakfast is also good. ", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r711218978", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great stay", "review": "We stayed here with my extended family. We received great service, clean rooms, decent breakfast and great value for money.  We arrived very late at night - straightforward checkin. We were also allowed late check out in 2 of our rooms making things convenient.", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r700119704", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great location for  proximity to the Barcelona GP circuit", "review": "Thank you for your recent stay with us. We are pleased to know that our staff attended to your needs in a friendly manner. However, we are very sorry for the inconvenience you have had. We continually strive to improve the hospitality we offer and comments from our guests are always welcome. We know that you have several options when it comes to lodging and we hope you continue to take IHG into account in your future trips.  Sincerely,  Laura Martin", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r694287248", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "BEAUTIFUL HOTEL  NICE AND CLEAN  GOOD STAFF", "review": "nice hotel good breakfast and nice staff very friendly 20 to 25 minutes  from barcelona beach  (barceloneta) hotel close to the highway fromthat location maybe  an hour you can go visit some other citys other than barcelona   i found the location  very appropiated  to see other citys than barcelona city center and the beach i will come back for sure ", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r687116735", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "June 2019", "review": "Dear Mr./Mrs    Thank you for taking the time to write giving your opinion about your recent stay at our hotel. I am glad to know that we have been able to fulfill your expectations and gave us the opportunity to serve you. Your opinion is very important to us and we appreciate your comment, which will help us improve the services we offer. I hope you continue to use our brands for your future travel needs.  Thank you ", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r684745183", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Nice place for a few days", "review": "After telephoning the hotel directly to enquire about cancellation options should I require to cancel up to 24 hours prior to the visit I was told that this would be fine.  Subsequently I went ahead and booked a stay and in the end I needed to cancel.  This was done online.  It was done within the time period discussed at the point of booking.  I was therefore surprised to see they charged my credit card after the cancellation in full.   This was raised with them over the telephone and they said it would not be a problem but they still went ahead and charge the card in full.  The charge being almost £1000.00.  I raised this issue in email and was given the brush off. In short they were not refunding the charges. Advice: proceed with caution here.  They’ll tell you one thing over…", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r625085532", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Good location near the circuit", "review": "I don’t understand why all the complaints.sure it’s out of Barcelona so why would anyone come out here without a car?. Not very smart travelers. Check in was easy and good service. Room was clean And maintained daily.i was out there for a conference, and have stayed here a few times. Yes, breakfast was nothing to speak of, but this is holiday inn express, therefore understand the system. Will return again and folks stop complaining. Good hotel", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r616118366", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Filthy", "review": "Nice furniture, very comfortable bed, clean bathroom. I wouldn’t choose this hotel when in holiday (only because the location is in an industrial area so expect lots of trucks and nothing nice), but for business trips is definitly a good choice.", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r597307258", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Nothing special.", "review": "I only stay there 3 nights with my wife that hotel it's 1HR and 45minutes from that city there's nothing around it's a restaurant a 15 minute walk distance and town is another 10 minutes on bus they are really not much to do on the area.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r522853539", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Good place for a stay not so far from Barcelona", "review": "Dear alexandercB6535RK,  Thank you for taking the time to express your thoughts and concerns. We are so glad you liked the room accommodations you received.  Please allow us to apologize for the shortfalls you have experienced and any inconvenience you may have encountered.  It is regrettable that we fell below your expectations.  The feedback we receive from our valued guests, like you, enables us to target problem areas and take the necessary actions to ensure similar situations can be avoided in the future.  Thank you for staying and we all hope to have an opportunity to serve you again on your next future visit.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r489342937", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great location", "review": "If the budget matters, and you have a car and ready to drive 40 minutes to Barcelona, this place is good for you. Clean, comfortable, rich breakfast, free parking - it is a Good place for a stay not so far from Barcelona!", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r484469242", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good hotel with easy access to the circuit", "review": "I booked this hotel because it was close to the circiut, how close I wasnt sure but we walked it in less than 5 mins. Just up the road to a path past the trees and there is gate 3 which was great for us as we in the main grandstand. Also found the breakfast quite good cereal,toast spreads,eggs,ham, yoghurt and fruit. We didnt hire a car so found 1 restaurant but no shops within walking distance. We arranged a taxi to the hotel from Prat airport for £52 one way and due to traffic restrictions we got the sagales coach £10 one way back to Barcelona on Sunday then a taxi to airport.Our flight was 8,30 pm and we made it in plenty if time. The sagales coach stop was just down the road from the hotel and although there was a very long queue it moved quickly and there where a lot of…", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r464786824", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Bed and breakfast was inadequate", "review": "Gracias por su reciente estancia con nosotros.  Nos complace saber que nuestro personal atendió a sus necesidades de una manera amable. Sin embargo, sentimos mucho las molestias que ha tenido.  Nos esforzamos continuamente por mejorar la hospitalidad que ofrecemos y los comentarios de nuestros huéspedes son siempre bienvenidos. Sabemos que tiene varias opciones cuando se trata de alojamiento y esperamos que continúe tomando en cuenta a IHG en sus viajes futuros.  Atentamente, ", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r463157853", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Good hotel but super noisy guests!!", "review": "Let me start by saying that the hotel staff is very friendly and will help you as much as you can. The rooms are good size and the beds are comfortable. We were there for 3 nights and 4 days. This hotel is close to major highways, there's a restaurant close by that serves fast food. The 1st couple days we had great breakfast no issues but the 3rd morning there was about 50 to 75 Chinese tourists who were ALL over the lobby and breakfast area, talking loudly, attacking breakfast buffet without any consideration about other people! It was a mess and we barely got anything for ourselves when we saw that there were more people coming we ended up leaving. So a suggestion for future travelers if you ever see a bus in the lobby wait till after 8 AM to eat breakfast!", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r444485256", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Great Hotel", "review": "Hi TravelLife15,  Thank you for posting a candid feedback from your recent stay with us. It is great to know that you were able to appreciate the service provided by our staff and the condition of our room and beds among the others. However, I was concerned to see that you had some issues with other guests during the 3rd morning of your stay. I would like to apologize for any inconvenience this issue may have caused you. Rest assured, your comments will be shared with our management team to properly address your concern.   Again, thank you for the review and I hope that we would have another chance to accommodate you again in the future.    Regards,    Mike F.  Case Manager  IHGService", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r433581532", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "City Break", "review": "The only reason we gave it a four its because of the location, we booked this trip with TD visa expedia, by the time we realize how far from Barcelona downtown it was too late  , no refunds We were happy with the hotel, friendly staff, specially the guy on the afternoon shift that we forgot his name, very helpful and friendly  Free breakfast included and good prices, it takes about 30 minutes walking to train station , or you can take the bus a block away from the hotel,  it takes about an hour total to get to plaza Catalunya or las ramblas , Barcelona has a great transportation system (once you get familiar with it , get ready to get lost a couple times) make sure you buy the ten tickets for 19.60 euros for two zones ( if you want to go to Granollers the next train stop is…", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r431881087", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "More like Faulty Towers", "review": "Room was very clean and had everything we needed. Staff were very helpful with bus timetable and location of  train station, Hotel not within walking distance of station so very aware of returning from Barcelona centre to catch last bus. We received a complimentary continental breakfast.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r405982489", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "“A good deal if you have a car and an excellent sense of direction”", "review": "Coffee and milk was never replenished in the room despite asking repeatedly. Then coffee cups got removed from the room for two days. The bath would not fill up so asked for a plug and this took two days to arrive. The hotel ran out of wine for three of the seven nights we stayed. The beds were not made properly just had the duvet thrown over them tightly. An email detailing all of the above was not replied to despite the card in the room asking guests to feedback any concerns. On the plus side the desk staff were very friendly BUT things were slow to be resolved.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r387508202", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Very good hotel", "review": "Hotel is very nice. Very nice and helpfull people. Hotel is too far from station. You have to go to station by bus. From station is about 4 kilometers and it's too fat to walk. Bus goes every half hour. ", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r382666205", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Budget overnight stop outside of Barcelona", "review": "If you are looking for a budget overnight stay near the highway you are ok here. We didn't visit Barcelona this time, so we can't say how comfortable the city visit is from outside here. Hotel clean, Free parking with video surveillance and free breakfast. Good wifi and very friendly staff.", "date": "January 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r339708749", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Not a Holiday inn express as we all know them.", "review": "Dear mac2214jv,  Thank you very much for taking the time to share your recent experience with us. We are very pleased to know that you were satisfied with your recent stay with us particularly with the hotel and the staff. It has always been our goal to provide the best experience to all our guests and with your review, it just goes to show that we are on the right track.   Again, thank you for staying with us and we hope you give us a chance in the future to show you how great our hotel is.  Sincerely,  Christian C. Case Manager IHGService", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r339443621", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 2}, {"title": "Ok for a short stay, but….", "review": "if you are stuck on the way between southern France and Barcelona, maybe you need to look for a different place. the hotel looks abandoned inside and out, very poor quality everything and to top it off, the worst breakfast that you can think off. cheap quality and really not apetizing to look at at all. this place urgently needs an inspection by the IHG directors cause it really gives a bad name to the holiday inn name. one last thing, the smell in the room and the hallway is just unbearable.", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r335616363", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "A little out of the way, but an easy commute.", "review": "Dear Billyarmstrong,  Thank you for taking the time to express your thoughts and concerns regarding your stay at our hotel. We value each feedback as this will allow us to identify the areas that may benefit from our additional attention. I am sorry to read that we fell below expectations when it comes to the overall look of our property. It is also regrettable to know that you were not thoroughly impressed with the food served. I have taken note of your comments and shared them with our management team to review the procedures we have in place and make necessary improvements accordingly.  While we understand you did not have an overall great stay, I sincerely hope we get another chance to give you a more pleasurable stay should you be in the area again.  Sincerely,  Ingrid V. Case Manager IHGService", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r323053715", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good Value", "review": "Spent a weekend at the hotel as we were unable to get a hotel in Barcelona and considering it was about 50% cheaper anyway, thought we would give it a whirl.. Very clean throughout, staff were very welcoming and breakfast was basic but enough for you to start the day off...  Only real negatives were that the mattresses on the beds were very thin.. The train/metro station is a 7 minute taxi drive away (don't walk, it's too far if you have young children and takes about an hour )... At night it's hard to get a taxi back to the hotel so we used to go to the next stop beyond Montmelo to Granola which has a taxi rank outside the train station and then catch a taxi back to the hotel for about 10€ and only takes about 6 minutes... Don't catch a taxi from the airport to the hotel…", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r322365158", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Great Staff fine location for a stop over", "review": "Dear Elevate-Elevate,  Thank you for taking the time in posting a review about our property on TripAdvisor. Thank you for noting the cleanliness level of our property and for recognizing our hotel staff. It is indeed heartwarming when a valued guest takes the time to acknowledge the passion and effort that our customer service team put every day. However, I am sorry for not meeting your expectations when it comes to your bed and breakfast experience. I would like to follow-up on your experience, thus I have sent you a private message so that I can get further details regarding this matter.  Thank you again for your assessment and I hope to hear from you soon.  Sincerely,  Ingrid V. Case Manager IHGCare", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r301217725", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Too far from the city!!!", "review": "The front staff was excellent during our stay.  She was very attentive and helpful, but as other posters have said it is a bit in an industrial zone.  The closest restaurant is a ok hotel-restaurant next door which expensive food that clearly was prepackaged.  So having a car is a plus.  We stayed one night as a stop over on a trip through Spain and thought it was great.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r275572458", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Good place to stay for couple of nights if you like a quiet place .", "review": "Lovely clean hotel & staff were helpful and very friendly..... but do not stay here if you want to be near bars & restaurants!  My daughter booked the Holiday Inn Barcelona thinking it was the one near Llacuna. There isn't a bar or restaurant in sight & it's very industrial. You really need a car to stay here or be a fan of formula 1. We stayed one night & found another hotel nearer to the city for the remainder of our visit.", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r261826157", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent place to stay for the F1 but too far away from barcelona", "review": "Hotel is far from the crowded streets/city center of Barcelona but at a stone throw distance from the circuit de catalunya . The place is good to stay if you have a car otherwise you have to be dependent on local bus which can reach you to the nearest rail station that's Montmelo or hotel can arrange taxi if you want .The hotel is good and the staffs are very helpful in nature which will make your stay comfortable . Breakfast is good but option and variety is less .I stayed there for 5 nights with my wife for celebrating our 1-st anniversary and it's really a great experience .", "date": "February 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r256426119", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "FAR FROM BARCELONA, BUT GOOD PLACE TO STAY", "review": "Need a car for this hotel stay. clean rooms, breakfast so-so. hotel has free parking, if you need to be in this area, which I did, then it is fine, but not advisable if you want to be in barcelona proper. the staff was very helpful,especially the manager luara, she was excellent in her job. quiet but difficult to find, off the beaten path", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r234119762", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Good Hotel", "review": "Dear srimanone,   Thank you very much for sharing your experience with us.   I am pleased to note that despite some shortfalls, you were still able to enjoy your stay and you were satisfied with the services and amenities that we provide. Guest comfort is of the utmost concern to us and our hotels are committed to making every possible effort to provide a comfortable environment. Your review will be used to consider improvements needed and we hope that you will give us another chance and allow us to make your stay as best as it can be.   Sincerely,   Dhan M Case Manager IHGCare", "date": "November 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r226834758", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Great service in tranquil location", "review": "This is a clean hotel with good breakfast facilities. The only issue was that its abit too far from Barcelona centre. We had to get the underground and taxi which made the children tired. There are a few restaurants nearby.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r221373421", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Comfortable !!", "review": "Dear Hanna484,  Thank you so much for taking the time to leave us your feedback. Your comments are highly valuable to us and will assist us in our continuous efforts to maintain and improve the service level we aim for. I am pleased to know that you had a satisfactory stay at our hotel and are delighted to hear that you found our facility clean and breakfast good. I appreciate feedback that we receive, whether positive and negative to ensure we provide the best level of service and facilities that we can give to our guests. Thank you again for your review and I hope to have an opportunity of welcoming you back again soon.  Sincerely,  Krysllin G. Case Manager IHGCare", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r206752542", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Walk to the race track ... and do not expect more", "review": "Firstly I can honestly submit this review- Very Good!- because I had my own transport.  otherwise I am not sure what it would be like!  This hotel has free parking and great wifi throughout.  There is no restaurant but the breakfast spread is good and generous & in the evening reception will order you pizza which is fast & tasty enough.    It is not in a picturesque location at all; nearby a cafeteria joined to a petrol station, a hotel ibis and that is all.  But the staff are very friendly (Hello Marc & Sonia!)  Marc was not flustered to check me in when I showed up with a bus load of tourists (seperate) and to have a chat at the bar.  Even with the bus load of tourists, the hotel was still peaceful and enough breakfast for all ;)  And dear Sonia on reception was kind enough to…", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r205858362", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "WELL WORTH IT!", "review": "Staff customer service was exceptional for us.   Check-in was easy and quick and so was check-out.  Rooms clean as well as bathrooms.  Breakfast was continental but we had a variety to choose from so not disappointed.  Site is excellent if you wish to just sit back and relax as it is nowhere near busy roads. F1 Catalonya just a few yards away but even when they were testing cars we did not hear them until we walked out of our room.   We had everything planned so transport was not an issue for us but when we just needed to tour we took the local bus to nearest train station Montmelo, not a walking distance if your feet are not that good but we did on a sunny day with no problems. If you need to be in central Barcelona then may bot be the best site as you have to take a bus to…", "date": "February 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r195764491", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "cheap and confortable", "review": "Excellent stay for different reasons: - cheap but still having a high quality standard based on Holiday Inn - far from the center of Barcelona but not incredibly and easily reachable from the Autopista - private free parking - close to the Catalunya circuit (if you need it) - breakfast included - kind staff", "date": "January 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r192449277", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Comfortable stay", "review": "Dear istant_traveller,  Thank you for taking the time to review our hotel.  We are so pleased you enjoyed your stay! We appreciate the time and effort you have taken to inform us of your experience.  Guests such as yourself enable us to maintain the high standard of service expected of us. We thank you for having chosen our Hotel.  We take this opportunity to send you our best wishes.  Thank you again for your kind words.  We hope to have you as a guest in one of our hotels again soon.  Regards,  Brenda J. Case Manager IHGCare", "date": "November 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r185067675", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Very nice stay, not convenient situated", "review": "Stayed here for two nights last week. Comfortable clean rooms. Very helpful staff. Located in an industrial area so not very scenic outside. Checked out at 4 am and the reception staff was kind enough to offer coffee! (Thank you Mercedes!!) Plan to return to Granollers next year and probably wouldn't look elsewhere.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r179027767", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "as expected", "review": "Hotel looks like new, very friendly staff, each of them was trying to help and guide us.  Inconvenient location for people who are traveling by itself without car. There is a public transport - bus, but it is not so efficient, was late everytime.  Hotel is situated at industrial zone, so it's more convenient for groups who are travelling by bus", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r177162321", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Honeyday/Holimoon.", "review": "We had booked in January to stay in August. we researched after booking and found we were further from Barcelona than first thought, however this was a bonus as we ended up seeing other areas of Spain. the hotel was clean and all staff were really helpful. breakfast was usual continental style which was ok. if you stay and don't have a car there is a good cheap bus to train station, or as we did, walk. I would stay again but would ask in advance for double bed, we had twin beds and had to compromise. even though its situated on an industrial site its not noisey. Overall a pleasant stay.", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r174248043", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Best for value!", "review": "We stayed at HIE Montmelo for the second part of our trip in Spain. After our bad experience at the HIE Bonaire in Valencia, we were at least relieved by a better stay at this one.   Cleanliness was better - compared, and the place is better maintained. The air condition unit was not very efficient but the little cool air it emitted was at least enough to sleep with shut windows. Our room was at ground level, not the utmost for privacy as you'll need to keep curtains closed most of the time.   Staff is very nice and helpful. Hotel was most busy on weekend and it was quite challenging for the breakfast blond haired lady to cope. Even though she looked exhausted, she managed quite well and deserves praise.   Between Saturday and Sunday there was activity on the track, and the…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r167088232", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Great for the racetrack of Montmeló", "review": "Dear GOH77,   Thank you for your feedback and for choosing our hotel. Our efforts are always to ensure our guests are satisfied and our hotel is maintained to be comfortable while you are with us. It is great to know you appreciated the cleanliness of our property and the service delivered by our staff. Please accept our apologies for the inconvenience you had with our facilities and the noise. We highly value views, opinions and feedback from our guests, as this allows us to constantly improve the service we provide.  Thank you for staying with us and we all hope to have an opportunity to serve you again.  Sincerely,   Karen C Case Manager IHGCare", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r159556718", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Good value for the price--but hard to find", "review": "Very close to the speed circuit of Montmeló (a must for any rider going there), comfortable and of good value. Staff could be more sympathetic and internal procedures could be more effective. Breakfast was alined with the category and price so the overall experience was Good!", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r141944125", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Overnight Stay", "review": "Dear PJMW,  Thank you for posting a review of our property. It is great to know that you found our location suitable for your needs and the breakfast served lived up to standards. Your additional comments regarding our staff has been noted and I appreciate you letting us know your views as this is our best means of improving what we can offer.  I sincerely hope the next time you're in the area, we get the chance of hosting you again!  Regards,  Pam G. Case Manager IHGCare", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r140854138", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Best for Formula 1 average for Barcelona.", "review": "Much too far from Barcelona. Not recommended if you are without a car. But having a car it can save you more than half of expensieve barcelona city hotels. On the other hand absolutely best choice if you came to see Formula1  race. Circuit of catalunya track is just few steps away. Typical ibis express. Not very spacious rooms, but clean and a free breakfast and free parking.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r137706373", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Not up to standard", "review": "When we came, we where served by a wery nice and helpful younger woman. She helped us ordering food, and she really tried to give us the best service. Also she could speek english! The room is ordinary, but they also come with a distinct smoke smell. The AC was not in function, it was terrible hot in the room. Of course we should have reported this but it was late and we didnt want to change room in the middle of the night. Also this is something the cleaningstaff should see and fix before customers come to the room.  The breakfast was a complete joke! It is absolute not a hotel breakfast. Almost everything was empty, and we have to tell the staff to fill up, bad service! Also the older one of the two had a bad attitude and looked liked she hated her job. It was a complete mess…", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r134960414", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "You just cant go wrong with a holiday Inn right??", "review": "Dear Abakus99,  Thank you for taking the time to write us a review. I am glad you had a good experience at check in. I am sorry for the inconvenience you experienced at breakfast. I will follow up with the staff to ensure incidents like this won't happen again.  Again, I do apologize and regret that this impacted your experience at our hotel.  Sincerely,  Pam G. Case Manager IHGCare", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r133902710", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "to far from barcelona", "review": "We booked this hotel as the hotels in Barcelona city were way to expensive, plus you can't go wrong with a holiday inn right? wrong!!  Don't get me wrong the hotel was spotless & exactly what you would expect from a holiday Inn.. The staff that were prepared to help couldn't do enough for us..but 1 or 2 soo let the side down. Maree was the most helpful, she not only gave us a bus & train timetable, but organised taxi's from Granollers to get us home when we got stranded in montmelo.  The absolute worst thing about this hotel is the location..Yes it's quiet, but thats because its in the middle of Nowhere & would definitely benefit from even an indoor pool. There's a bus, that runs every 30mins costing 2 euros to montmelo town, where you catch a return train to Barcelona, for 4.40…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r131087957", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Not good enough!", "review": "10 MINUTE WALK to train that takes half an hour to barcelona", "date": "March 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r127667602", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 2}, {"title": "Barcelona trip", "review": "We flu to Barcelona for 5nights. Hotels in Barcelona are very expensive so we decide stay outside the city. We found Holiday inn in Montmelo which is 30minutes by train from Barcelona city. Excellent train communication. From airport El prat do montmelo is direct train, single train ticket is around 7euro. From montmelo train station to the hotel is a bus number 510, single ticket 2euro. Good idea is to buy T10 ticket (10 journeys for 1,5h each), which will allow you to travel for 1,5h (this time will cover your bus from the hotel, train to barcelona and metro if you want to go farther then passein de gracia station)   Don't take a taxi cos is very dearly, unless you have to like we took it to get our morning (5am) train on sunday where is no public transport Hotel is situated…", "date": "February 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r125976490", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Nice quiet hotel, but far out from the city centre", "review": "I booked this hotel for a short stay, without a car. It is a very clean, quiet hotel and of a good standard. However, if you are staying here to go into Barcelona, it isn't easy. The hotel is in a quiet area surrounded by factories and business premises, no shops etc to speak of. We took a taxi to the nearest train station then the train into Barcelona which took about half an hour.  If you have a car this would be a lot easier, or if you are there to see the forumla 1 racing, then it's a great option.", "date": "March 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r121858552", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Worth it", "review": "We had been staying around Spain and this one was the easiest to get downtown by train once you found the train station.  Being from Canada. we're used to seeing a train station.  Well it was more of a metro stop but it is near the municipal parking lot which was free we think. At least the car was still there when we got back.  It was 3.90 Euros return and took us to the downtown and all the metro stops in half an hour. The hotel is within walking distance of a restaurant and a gas station which has a very large selection of food including pagaged lettuce. A short drive or a long walk is a restaurant called Viena and it is sort of a fast food place. I had a nice salad with chicken and my husband had a hot dog and fries. it was reasonable. The staff at the hotel was friendly and…", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r114644732", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "4* for first stay, but only 2* for our second visit", "review": "I've given this hotel a 3* rating, reflecting the average rating of the two visits we made to this hotel.  The hotel is about a 30 minute (easy) drive to/from Barcelona.  It is a great place to stay if you are on your way to/from the city.  We stayed their twice:  once on our way to Barcelona for a cruise, and the other on our way home.  (We are currently ex-pats in France).  The hotel is relatively new, the bedding is comfortable, and  because of the relatively remote location, the hotel is very quiet.  The rooms are more American-sized than European-sized, which was nice for a change.  The rate is a fraction of what you would pay to be in the city center of Barcelona - especially when booked in advance via the Internet for the Internet only rate.  They also have a connecting…", "date": "February 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r98271386", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "A little far out...and a nightmare to get to from airport", "review": "My boyfriend and I booked this hotel as a last minute cheap deal for a city break.  After research it was established that it would not be dear for a taxi, and would be a lot less hastle: we were €100, the hotel is the middle of nowhere -next to factories to be exact. On that night we thought that we would take a walk into montmelo to find the train station, although there was a bus which ran regulary (well every half hour) we walked it was about 20 mins and found that it was only €3.40 return to Barcelona city and the service was great they only thing was it took half an hour to get to.  The hotel it's self was spotless, although quiet (which isn't always a bad thing) oh and on the first night due to the lack of restaurants in the area we had take away pizza which was the best…", "date": "February 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r96659497", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Good hotel to stay in with a car", "review": "Good - Hotel is really nice with comfortable bed and excellent breakfast.  Very clean hotel. Free outdoor parking.  Bad - You need a car which we have so it was not a problem but it was very difficult to find even with a GPS  - a lot of roundabouts so we kept on getting lost.  We paid for a 2 nights internet connection.  It was fine on the first day but none on the second day.  The front desk person said she will give me a credit but when I checked out the next day, a different front desk person said he cannot give me a credit as he cannot do anything about it.  That was an issue that made me feel a bit bad about the hotel.", "date": "January 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r94527408", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Catalunya Race Track", "review": "Stayed at this hotel for three nights. It its really close to the Catalunya race stadium where they host the Grand Prix and Moto GP so If you intend to visit the circuit then this is the place to stay. The Hotel is fine quite new and the breakfast is adequate cereals bread preserves croissants yoghurts tea coffee etc pretty good for a continental breakfast. This horel is in the middle of nowhere for this reason I wouldnt stay here again. Its great if you are just going to the circuit. If you want a taxi to the train station it costs 10 euro and its only about 2km away. It costs about 3.50 euro each on the train return to Barcelona and when you return there is no taxis so you have to walk back.", "date": "October 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g670666-d320985-r47074497", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}]