[{"title": "Below average", "review": "Istanbul’s most famous street, pedestrianized Istiklal Caddesi (Independence Avenue), throbs day and night and offers a fantastic array of architectural sights, shops, treats, and throngs upon teeming throngs of people. At the avenue’s northeastern end is expansive Taksim Square, thought by many to be the very heart of the city, with many of Turkey’s most renowned restaurants and some of Europe’s most happening nightlife in close proximity. In striking contrast, Beyoglu’s less trafficked areas – such as the affluent Cihangir and the antiques district of Cukurcuma – exude Old World charm and provide contemplative calm and splendid diversion via an assortment of cozy cafes, attractive boutiques, and quiet lanes.", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d3367757-r606226234", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "They ripped us off. They charged me 4 times for one stay.", "review": "The hotel is located in few minutes walking from Taksim square but the neighborhood is not to be recommended. At night you don't feel that safe. No lift in that hotel which is not convenient for people with heavy laguage The room is large but the bathroom is very small. Beside that the owners are very nice and try their best to help.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d3367757-r482927449", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Do n't go there ", "review": "At first I liked it there, the price was quite low and the location pretty good although it is in a poor neighborhood. We booked the room through booking.com and they pre-authorized my credit card, so when I got there we just agreed they could keep the money they pre-authorized as long as they wouldn't charge me a second time.  When I got back home I was pretty satisfied, only a few months later I realized while checking my bank statements that they charged me another 3 times - so in total they charged me 4 times for one stay.  I got in touch with booking.com and after one month booking.com returned my money, but they removed this property from their website since then.", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d3367757-r459399114", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Not professional", "review": "I booked deluxe room for 5 nights in December 2016 , after couple of hours I and my friend decided to leave the hotel and find somewhere else, reason been hotel is located in very poor and creepy neighbourhood , no facility in the hotel , no lift , shower not working , toilet set broken , matrix all smell , hair left in the room , if you want to waste your money then do not hesitate book this hotel . The only thing worked was the wifi .   ", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d3367757-r419174692", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Good location for nightlife ", "review": "It was my first time to try this hotel I sent them an email asking them my room to be in first floor as i have issues in my back and leg and they replied confirming on that my room is in first floor. However i checked in 8 in the morning, i only left my luggages as they said my room will be empty at 12 which i respected as i was the one who came early. I stayed in the street and came back at 12, paid for the hotel, on my way up the stairs i discovered my room is on the 4th floor. Accordingly i refused totally the situation and we kept arguying and they gave me my money back. And i had to walk on my feet me and my friend with luggages as there were no taxis in the area searching for a hotel which was sure very expensive as it was holiday season. So they caused me waste of time and money. They are unprofessional at all. If from the begining they said no rooms on first floor i would have accepted, and if they said so since the morning i would also have accepted but not to make me discover after i pay and go to my room.…", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d3367757-r358557319", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "very basic, reasonable price, exceptional location geographically, but in a poor neighbourhood.", "review": "Istanbul’s most famous street, pedestrianized Istiklal Caddesi (Independence Avenue), throbs day and night and offers a fantastic array of architectural sights, shops, treats, and throngs upon teeming throngs of people. At the avenue’s northeastern end is expansive Taksim Square, thought by many to be the very heart of the city, with many of Turkey’s most renowned restaurants and some of Europe’s most happening nightlife in close proximity. In striking contrast, Beyoglu’s less trafficked areas – such as the affluent Cihangir and the antiques district of Cukurcuma – exude Old World charm and provide contemplative calm and splendid diversion via an assortment of cozy cafes, attractive boutiques, and quiet lanes.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d3367757-r311242765", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Five star service, one star price!", "review": "These rooms are pretty much exactly as described: basic functional rooms with basic facilities for heating food.  All the appliances work just fine, including the valuables safe and air-con.  With one exception: the TV worked, but there was no signal for the local channels.  Not that I was bothered at all by this - I don't understand Turkish so it would have been pointless to watch TV for me, but if you do speak Turkish and want to watch TV, you should ask the very helpful staff at the reception desk about TV signal.  In any case, the WiFi signal is strong and internet connection fast enough to stream videos from phones, tablets, laptops etc and to connect to the TV if you like.  The kitchenette consists of a fridge, a kettle, a sink, two plates, two forks, one cutting knife,…", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d3367757-r284723063", "sub_review": {"Sleep Quality": 4, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Clean and quiet place!", "review": "If you need to travel inexpensively, this is the place for you! You're not going to get turn-down service or a spa shower, but what you will get is a clean, simple room to clean up and sleep in and....a host that will respond quickly to the dozens of emails you send, arrange to meet you at the airport, supply you with maps, lend you her metro card, and take you on a personal tour of the city if you're so inclined. Some added perks were air conditioning and wifi, making this an even greater bargain! Maria was our very friendly and efficient email contact during the planning stages, but it was Anna who met us when we arrived and was always there to offer friendly, helpful assistance. I can't imagine any hotel in town with a concierge that could've attended to us as well! At first,…", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d3367757-r280173505", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Clean, cosy and well located", "review": "We stayed twice, first in May and then came back in June 2015, as we liked it :)  It's a family place and the owners are very welcoming.  They speak Turkish, English and Russian… probably even something else ;)  The rooms have everything needed, small kitchenette includes: fridge, sink, kettle, some tableware, some rooms even have microwave. Iron is available by request. A laundry is next door (with a russian-speaking lady).  TV has about 2000 channels, almost on every european and asian language.  The rooms are clean and light, the upper terrace is a nice place to have a breakfast. The location is a bit \"downtown-like\", and the street is very steep (not suitable for running on the heels), but all the streets are like that north to Istiklal. However the neighbors are very…", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d3367757-r273777322", "sub_review": {"Sleep Quality": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Holiday", "review": "We stayed one week in Nicoleport Hotel. Shahin, Anna and her husband have been very helpful and kind. They gave us all necessary informations to get to the hotel, told us where to find this and that. Rooms were simple but clean (sheets are changed every two days). We had electricity and hot water all the times, a fridge and basic tools to cook cold meals. Neighborhood looks a bit abandonned at first sight, but we never had any kind of problem and people have been very nice. What we liked most : the location (5min walk from Istiklal) and the rooftop !", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d3367757-r234126850", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Great hospitality", "review": "Istanbul’s most famous street, pedestrianized Istiklal Caddesi (Independence Avenue), throbs day and night and offers a fantastic array of architectural sights, shops, treats, and throngs upon teeming throngs of people. At the avenue’s northeastern end is expansive Taksim Square, thought by many to be the very heart of the city, with many of Turkey’s most renowned restaurants and some of Europe’s most happening nightlife in close proximity. In striking contrast, Beyoglu’s less trafficked areas – such as the affluent Cihangir and the antiques district of Cukurcuma – exude Old World charm and provide contemplative calm and splendid diversion via an assortment of cozy cafes, attractive boutiques, and quiet lanes.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d3367757-r231757564", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good, basic and clean hotel.", "review": "Really friendly people and an amazing warm welcome. Very helpful at anytime. We got a lot of good tips where to go. Room was clean and  the location is good. Its close to the Big Taxim street with all the shops.                 ", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d3367757-r229930529", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Probably excellent", "review": "Thanks for your Kind words. We Hope you enjoyed your time here. Look forward to see you again in Istanbul Warm regards.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d3367757-r226899532", "sub_review": {"Location": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Excellent overall experience", "review": "My boyfriend and I stayed in September 2014. Shahin and his uncle picked us up from the airport which was helpful (40EUR, however after 30 hours in transit from Australia we we're prepared to pay for the convenience). The hotel is located a short walk (5 min) from İstiklâl Caddesi, however on the other side of the main road (easy to cross via an underpass). We were told later that was the 'Harlem' of Istanbul, but we didn't have any troubles. There were a few beggars and other shady characters about, and if you are a single female you may not feel as comfortable. Shahin walked us up to İstiklâl Caddesi to show us the way and helped us buy a IstanbulKart (travel card) which was great. We stayed in the room on the ground floor. Room has air-con which was great, as it was very…", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d3367757-r209150149", "sub_review": {"Value": 5, "Location": 3, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Clean & Good Staff", "review": "Dear Janelle, Thanks for writing a review about us. Hope you enjoyed your stay, Warm regards, Nicoleoprt team", "date": "February 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d3367757-r195766174", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "One night in Istanbul, in Nicoleport Hotel.", "review": "Istanbul’s most famous street, pedestrianized Istiklal Caddesi (Independence Avenue), throbs day and night and offers a fantastic array of architectural sights, shops, treats, and throngs upon teeming throngs of people. At the avenue’s northeastern end is expansive Taksim Square, thought by many to be the very heart of the city, with many of Turkey’s most renowned restaurants and some of Europe’s most happening nightlife in close proximity. In striking contrast, Beyoglu’s less trafficked areas – such as the affluent Cihangir and the antiques district of Cukurcuma – exude Old World charm and provide contemplative calm and splendid diversion via an assortment of cozy cafes, attractive boutiques, and quiet lanes.", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d3367757-r192233513", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Best Service!", "review": "Easy to find first time by taxi, it is very lovely place, near to the center. Owner and personnel very good and very kind. I was at groundfloor. Position is very good, because in very short time, 3/5 minutes you arrive in full center, Istiklal Caddesi, main street, with any Embassies, little tram like in San Francisco, and so many shops, one nice church visited by tourists, so many restaurants cafè, restaurants, and at the end Taksim Squar, so big and circular. At the opposite direction of this street, you can find souvenir's shops, one or more good change of money, and all you need. You are in full center of Istanbul. After there is Galati Tower. I had good time there, and I will come back next time in same place, to seee again splendid Istanbul. Nicoleport Hotel is sure, and…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d3367757-r175977346", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Feels like home", "review": "Dear Giovanni,  Thanks for your detailed review and tip. It was a pleasure to host you in our hotel. We are happy that you liked istanbul and enjoyed your trip. Hope to see you again in Istanbul.  Regards, Maria", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d3367757-r175646419", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Nice place to stay in Istanbul", "review": "The best and friendliest service ever! The hotel is really close to Istiklal Street, for whoever is interested to have a walk whenever the time of the day is. The hotel service is one of the best we ever experienced, although the location is in a branched small street, it is really convenient (close to a bus stop) and close to Istiklal Street. We just loved the beautiful hosting of Nicoleport Hotel.  Very friendly hostage and comforting service.", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d3367757-r175378195", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "\"More than a Hotel\"", "review": "Dear Selshara, Thanks so much for your kind words. We are happy to hear that you enjoyed your stay in our hotel. Hope to see you again in wonderful Istanbul. :) Cheers Maria&Ferruh", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d3367757-r174506980", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nicoleport is an absolute gem in Taksim", "review": "Istanbul’s most famous street, pedestrianized Istiklal Caddesi (Independence Avenue), throbs day and night and offers a fantastic array of architectural sights, shops, treats, and throngs upon teeming throngs of people. At the avenue’s northeastern end is expansive Taksim Square, thought by many to be the very heart of the city, with many of Turkey’s most renowned restaurants and some of Europe’s most happening nightlife in close proximity. In striking contrast, Beyoglu’s less trafficked areas – such as the affluent Cihangir and the antiques district of Cukurcuma – exude Old World charm and provide contemplative calm and splendid diversion via an assortment of cozy cafes, attractive boutiques, and quiet lanes.", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d3367757-r170258801", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "A place to feel comfort and respect", "review": "Last week, I spent a few days at this hotel. As far as lodging is concerened, it is by far the best value I have ever found in Istanbul. I have stayed at a number of hotels and various other accommodations in Taksim, Beyazit, and Bakirköy; the homeyness of the place and friendliness of the staff at Nicoleport, top them all. It is tucked away at an inconspicuous corner of an old charming district, just a kitty-corner away from Taksim square and the very popular Istiklal Caddesi. A quick 10 minute walk takes you to all major modes of transportation, fabulous shopping, international cuisine, and some famous historic places. The rooms are quite spacious, by Turkish standards, very comfortable and have all modern conveniences. I once paid 4 times as much, per night, for literally a…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d3367757-r168015103", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Very helpful staff, clean room and a good location.", "review": "Dear Parviz, Many thanks for your nice comment on our hotel. We enjoyed hosting you as well and hope to see you again in Istanbul.  Best Regards Maria&Ferruh", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d3367757-r164115389", "sub_review": {"Value": 5, "Location": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "I met an angel !!", "review": "Close to Istiklal street (10minutes walk) - clean - comfortable- most important point for me was staff's behavior which was really superb and they were next to me whenever I need them.. From the time I reserved the room till the end of my journey .I really owe them they did their best for us .. I highly recommend this place Everything was exactly the same as they described before reserving", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d3367757-r164098954", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great fiew from the roof terrace ;-)", "review": "Dear AmirHamzeh, Thanks for your kind comments. It was a pleasure to meet you and your lovely family. Hope to see you again in beautiful Istanbul. Best Regards Maria", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d3367757-r163605454", "sub_review": {"Location": 4, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Very helpful, Great Stay", "review": "Istanbul’s most famous street, pedestrianized Istiklal Caddesi (Independence Avenue), throbs day and night and offers a fantastic array of architectural sights, shops, treats, and throngs upon teeming throngs of people. At the avenue’s northeastern end is expansive Taksim Square, thought by many to be the very heart of the city, with many of Turkey’s most renowned restaurants and some of Europe’s most happening nightlife in close proximity. In striking contrast, Beyoglu’s less trafficked areas – such as the affluent Cihangir and the antiques district of Cukurcuma – exude Old World charm and provide contemplative calm and splendid diversion via an assortment of cozy cafes, attractive boutiques, and quiet lanes.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d3367757-r163120831", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Pregnant traveller", "review": "I was about to give up looking for places to stay in Istanbul as I was looking for a place the very night, but I called Nicoleport they were so kind to find me and my brother a room. I knew that the hotel was close to Taksim but I did not expect it that close. It took us only 5 minutes to walk from the hotel to the Istiklal Street.  Besides the location, the owner and his wife, Maria, were so kind. They increadibly helpful. As we were in Istanbul for an exam, they made sure that we would be there at the right time.  The rooms were clean as big. I had the opportunity to put drinks into the fridge. The bathroom was okay, too.  One of the things I loved was the terrace where you had a good view. Me and my brother met new people up there.  I had a great time and recommend everyone…", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d3367757-r162508168", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Your home away from home in Istanbul", "review": "Dear Nese, Thank you very much for choosing our hotel and your kind review. Hope you and your brother are successful in all aspects of your life. Cheers Maria&Ferruh", "date": "March 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d3367757-r156609766", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "perfect base to explore Istanbul", "review": "Stayed here with my husband for 3 nights in May 2013. Arrived in Taksim tired from travelling and being 7 months pregnant. Struggled to find the hotel however the owner kindly came to find us and took us to the accommodation. Ideally located for exploring Istanbul. Beautifully presented rooms for a great price. Owners are extremely accommodating and speak very good English - always on hand for any help / advice you may need. Would definitely recommend to others and would look to book again in the future.", "date": "February 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d3367757-r153558090", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely place to stay!", "review": "Dear Gemma, Thanks so much for your incentive review and the tip about the hilly streets. Actually Istanbul is located on  seven hills, so it will be safer if the travelers wear a pair of comfortable shoes or sneakers.  You are right, our hotel does not have elevator. We try our best to accommodate children, pregnant ladies or elderly people in lower floors. It would be great if the guests inform us about the floor that they prefer to stay and we will arrange that before their arrival. However our hotel has only 4 floors and we have a nice terrace on the top floor that worth's to visit .  At the end we hope your baby will be as beautiful as her/his kind parents.   Best Maria&Ferruh", "date": "January 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d3367757-r149226280", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great Location and Friendly Staff", "review": "Istanbul’s most famous street, pedestrianized Istiklal Caddesi (Independence Avenue), throbs day and night and offers a fantastic array of architectural sights, shops, treats, and throngs upon teeming throngs of people. At the avenue’s northeastern end is expansive Taksim Square, thought by many to be the very heart of the city, with many of Turkey’s most renowned restaurants and some of Europe’s most happening nightlife in close proximity. In striking contrast, Beyoglu’s less trafficked areas – such as the affluent Cihangir and the antiques district of Cukurcuma – exude Old World charm and provide contemplative calm and splendid diversion via an assortment of cozy cafes, attractive boutiques, and quiet lanes.", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d3367757-r142978356", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}]