[{"title": "Absolute Luxury", "review": "We stayed at the hammock during August 2019 and it is absolutely beautiful, a perfect place to relax and unwind. The rooms are spacious and the resort is located right on the beach, also there is a massage parlor about 30 yards down the street which is amazing.   The complimentary breakfast was amazing, they had such a range of food available and it's so lovely being able to enjoy it looking out over the beach. I do think the food is quite expensive but there are cheap local restaurants with fabulous food.  Amazing stay, thank you guys!", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r708037553", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Absolutely stunning resort", "review": "We stayed at the Hammock Resort in Mae Nam for 7 nights during August 2019.  This resort is absolutely beautiful and we were thoroughly impressed. I would just be too glad to go back and visit again now!  A few notes: - Location is superb but good for people to know that Mae Nam is a quieter part of the island.  - Restaurant at the resort is quite pricey so we did not eat there (We only had breakfasts as we had booked a package including breakfast)- we did make some suggestions on this though. - The rooms are very clean, neat and have everything that one would need. - The staff are friendly and helpful and assist where needed. - The resort is ON the beach which is great!  We were very fortunate to sit with Johnson (one of the partners of the resort) and give some of our feedback and suggestions/ideas on our last morning which he welcomed happily.   We will definitely be back and would HIGHLY recommend!…", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r706771187", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Enjoyed it so much we came back", "review": "A couple of years ago we stayed here for a few nights and it was the highlight of our trip so this year we decided to stay for ten days. No regrets.  The location is the main selling point. It's right on Maenam beach at a part where the water is especially shallow. Great for families or people who prefer standing to treading water. There's plenty of space for everyone. The hotel is within just a few minutes walking time to dozens of restaurants, convenience shops, laundry places, pharmacies and the Thursday evening walking street.  The staff have made this trip another great one. They've all been really friendly and have gone out of their way to accommodate us even when it was beyond the call of duty. Thanks to them all.", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r701287861", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "pizza time a lil pricey buttt does the job", "review": "stuck on the beach and hungry as ever after last night we stumbled in at 11.30 just went for a pizza which was great a little like a supermarket oven pizza but made me happy none the less. slightly pricey for drinks 80 bhat for a ice tea but hey im stuck on a beach check out our travels ig - @seewhatwesee_", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r701287104", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Beautiful location and great service", "review": "The Hammock Samui was a great choice for my quick stay in Ko Samui. It is so close to the beach you can practically step out of your room into the water! There are great little deck chairs and a bar on the beach to enjoy the scenery at all times. The bungalows are a generous size and well maintained. My only caution is that it is reasonably far away from the airport so it can cost quite a bit to get a taxi there - this might be fine for a longer stay but there and back on a quick trip can add up.", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r675147427", "sub_review": {"Value": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Island break", "review": "As part of my Thai holiday, I was booked to spend 4 nights at The Hammock Beach Resort in Koh Samui. I was surprised at quiet and peaceful it was. The hotel itself was OK, clean but very basic, needless to say I was not really impressed with it. If you want a laid back holiday woth not much going on Koh Samui is the place to be. For me however it was just too quiet. I'm a city girl and it was just to boring and quiet for me. I a sure that it will suit honeymooners or tourist who want to relax.", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r662486759", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Not as advertised ", "review": "This was not a good experience for us, we arrived and got checked in when we were shown to our “bungalow” I thought we were in the wrong place from looking at the pictures on the website, we had booked for 14 nights but only managed one night we got put in room G04 I’ve since seen other reviews about this room and would agree with what they have said, they did offer to move us to another room but said it was just the same, I do not like leaving negative reviews but I am extremely disappointed.  Even when we checked out 13 days early there was no question as to why or to try help us! We just got told “no refund” and charged 40 baht for a bottle of water ", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r661542755", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Quite spot, when there isn't construction work!", "review": "Unfortunately my stay wasn't as relaxed as I had hoped due to building works next to my room. There is a large hotel being constructed literally at the entrance and works would commence at 8am until 10pm at night. I think it would be better to let customers know in advance as I would have opted for somewhere else. It's a long way to come and so beautiful to have this spoilt by such noise. It could still be heard from the beach so couldn't really escape it (obviously not as loudly). This room would have been best unlet during; G004. Not helped that the scooter parking bays were here also and the staff area, lot's of loud talking early every Morning. And I'm a heavy sleeper!  Anyhow, other factors were positive. Right on the beach, b.fast was OK (eggs made fresh to order),…", "date": "February 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r655383769", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "First time to Thailand", "review": "Dear Katem_b, Thank you for taking the time to review your stay with us. Thank you for bringing some issues to our attention. We apologized about the construction next door that disturbed your stay. We will soon have briefing and training for all our staff to better communication and to better our services.  I'm hoping to have you again as our guest on our resort on your next vacation in Koh Samui to experience our better quality of services. Again Thank you. Regards, Len Clemente", "date": "February 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r654876418", "sub_review": {"Location": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Good budget resort", "review": "The hotel was quaint, the rooms were clean and the staff were helpful and friendly. It is situated right on the beach and is very well maintained. The hotel restaurant offers a good variety of food which was tasty and reasonably priced (breakfast was included in the price of our room). There are plenty of other restaurants in the area if you'd prefer something other than Thai food and there are lots of shops within walking distance. The hotel does not offer laundry service but there is a lady just up the road who does and she can have it back to you within a day. I recommend this hotel as a great place to stay in Koh Samui.", "date": "January 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r646070144", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Amazing hangout at Maenam Beach", "review": "The Hammock is a true classic hangout on peaceful maenam beach. With direct beach location, close to the weekly night market, many dining and massage options it is a hidden gem.  Bungalows are always clean and functional. Staff is always friendly and helpful. Breakfast is very nice sitting close to the beach, with multiple egg choices and fresh fruits.  When in doubt. Pick the Hammock :)", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r640059140", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Lovely food with a great seafront view!", "review": "Very nice restaurant with seafront view. They serve high quality food and the price are reasonable! They have happy hours from 5:30 till 7 - buy one beer, get another one free! I loved hanging wicker chair so you can ride like on a swing and enjoy the sunset! ", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r639293434", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "A great view", "review": "It’s a amazing place to relax, with a nice music, listening the waves song. We can drink or eat something with a amazing view.   The staff is very friendly and helpful with clients.    The prices are a little high but pay the great experience.", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r633307453", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Great stay, next to beach, clean rooms", "review": "We stayed here for three nights and we have really enjoyed it: - the hotel is next to the beach, where it is not that crowded as at chaweng beach - the hotel is 100meters away from the Thursday night market and a few kilometers from the Fisherman's village - rooms were clean and they supplied beach towels & shower towels - breakfast good with croissants, juice, poached eggs, bread, rice etc  I really recommend to rent scooters (possible at the hostel at 300 bath per day, which is slightly more expensive than normal), as you can easily explore the island", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r610054144", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Five days in The Hammock", "review": "We believe that the information about this hotel indicates a structure bigger than the reality. The rooms are small and the swimming pool too.  We had problems with the bathroom. It was also small and the water, during the shower, did not run down through the drain. The same problem happens with the sink but the staff fixed the problem quickly. In general we had a great time in this hotel. All staff was amazing with us, specially the front desk table lady that every morning was very nice with all guests. She supported us all days.  The food in the hotel is very good and the breakfast too. We liked very much this place. We just expected to see the structure that we looked in the pictures.", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r606561388", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Nice Beach Place", "review": "Good for drinks, bad for food.  Extremely hip and casual atmosphere directly at the beach. Food service can be much improved. Our group of 4 people got each lunch dish separately prepared over 1,5 hours. ", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r596159764", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "7 night stay", "review": "Lovely hotel located right on the beach! The breakfast is wonderful so much choice! Beds and towels changed daily- but you do have the option not to have your room cleaned.   The only thing that is say that need to improve on is the timing of serving the food but the food is delicious when it arrives...  Great staff really friendly anything to help you... anyone visiting ko samui please visit the elephant sanctuary not far from the hammock samui  absolutely amazing  Thanks again for a great stay!! ", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r593440398", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Impressed and pleasantly surprised ", "review": "My bf and I booked for two days before heading to Koh Phan Gan. It was quite cheap and the rooms looked clean and self contained/cottagey online. Everything was exactly how I had pictured it upon arrival. The food is good, the cocktails great and the rooms so clean. You are left to your privacy. It is small but the pool is so cute and the beach really is beautiful. The staff are reserved and though people are complaining, I have to ask what these reviewers are expecting? Enjoy Thailand’s hospitality and it’s peoples way of being without expectation as they do you. Everyone is just going about their days - and they are pretty lush here. thanks Hammock xxxxx", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r593126027", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Very nice hotel with yummy breakfast", "review": "We stayed for four nights at the hammock an absolutely loved it. Especially the yummy breakfast and the helpful and friendly staff need to be mentioned! The restaurant itself may be a bit overpriced, but it‘s everybody‘s choice to just walk a few meters and eat at a restaurant in the walking-street. Would definitely recommend the hammock!", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r589192829", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Honeymoon", "review": "We booked this property as we were travelling round Thailand on our Honeymoon. If you are a couple and want a nice relaxing beach with choice of massage, fresh fruit brought to you, cocktails and friendly local dogs scaring away strange men, then this is the place for you.  This is placed within the China Town of Koh Samui so I would recommend to venture out for something to eat as there isn't alot of choice on the menu and it is way over priced, considering that a restaurant 5 minutes walk will give you the same dish for more than half the price.", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r587083660", "sub_review": {"Value": 3, "Rooms": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Small and quiet ", "review": "I had finished a week of detox, and wanted a place for a couple of days to transition. The resort is small, which is fine. I had a some small issues which wouldn’t be a big deal, if the personnel was more attentive. The young lady left in charge, tried hard, but the truth is she doesn’t really have any authority to make it right. Overall the location was fine, I had a beach front room, the air conditioner worked properly, bed was a little hard (fine for me), pillows too high and hard. WiFi not reliable.I’d go into details, however I had to sign a waiver.... negotiated a late check out for the little issues I encountered. ", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r581520655", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Disappointing stay", "review": "I have to say after reading the rave reviews of this place my husband and I thought it would be a lovely little beach getaway, but oh how wrong we were.  Let’s start by location, hidden down an alley where they are doing construction most of the day next door. It is beachfront and that is about the only bonus.  The first room they took us to had muddy foot prints all over the floor, when we pointed this out the staff tried to say it was us. We assured them that was not to case and they gave us another room. This room had water stains on the ceiling and mold in the shower. The beds were like sleeping on cement, even for Thailand these beds were hard. Also one of the light switches was broken however they did fix it by the time we returned from dinner.  The wifi worked for a few…", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r576750439", "sub_review": {}, "travel_purpose": "", "rating": 1}, {"title": "Holiday ", "review": "stayed here for 8 days highlights the beach picture card perfect sea warm. Breakfast ok adequate. Downside rude receptionist and a guy bebind the bar. Highlight was a cake was made for my birthday and a girl sang happy birthday to me made my day. Overall enjoyable holiday. ", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r575818234", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Relaxing Boutique Experience", "review": "I absolutely loved this place. Out of all the hotels that I went to throughout Thailand, this one still sticks out in my head. The small outdoor pool leads straight to the sandy beach, there's a big, open patio/porch to eat breakfast near the bar as you overlook the ocean. The food was solid across all meals. They have incredible daiquiri drinks that are served to you at your beach chair. What more could you ask for? The rooms are quaint, modern and clean and the bungalow style layout was really cool. The staff was also helpful and very nice. I look forward to visiting The Hammock again!", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r555634714", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Enjoyable weeks stay", "review": "Thank you for taking the time to your comments about  your experience at the Resort it is always nice for the team to hear. Thanks again for your feedback and we look forward to welcoming you back again! Have a good time from The hammock  team.        Kind regards   Anuphong Juanroong Guest Relations Manager", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r551526755", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Over-Priced Even for a Budget Hotel", "review": "I stayed here over the Christmas holidays 2017.  I spent a week there.  Objectively, there are plusses and minuses. Overall though I would not recommend this place.   First, I arrived late following a long flight and I was woken very early by the din of hammers hammering, drills drilling, power equipment, etc. on a construction site immediately adjacent to the property and directly behind my bungalow.  Okay; they cannot control that.  I asked for a different bungalow and as the hotel was not full I could not see a problem with that.  They gave me a different bungalow and also demanded an immediate cash surcharge. I paid it; I didn't think it was fair, but I paid because I didn't want something like that to spoil the holiday mood.  Then, there are power problems. The power goes…", "date": "December 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r550214284", "sub_review": {"Sleep Quality": 4, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled solo", "rating": 2}, {"title": "Small but perfect little beach hotel. ", "review": "We stayed here for one night before heading onto another island. We checked in late due to flights, the staff were very welcoming and also helped us book our ferry ticket. They realised we were due to check out for the ferry before breakfast so they arranged a breakfast to be made up for us in take away boxes the nest morning. This was especially good as it was meant to be toasted sandwiches which meant as a gluten free I couldn't eat them. After explaining this they put a box of fruit and a box of scrambled egg and veggies together instead. We also had a surprise when we got to our room, which was clean although small (good enough for a short stay). We had welcome drinks and rose petals on our bed. Love a little bit of luxury when it wasn't expected.  Also comfy bed! ", "date": "November 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r537441756", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good value right on the beach", "review": "Stayed 1 night only, Bed was firm but comfortable. WI-FI was good in some locations, we asked to be moved as we work early morning and the staff were very accomodating.   Right on the beach, a small pool and plenty of spots to relax. It's exactly what we were expecting for the star rating and cost.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r535532338", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "An okay visit", "review": "Overall the hotel was okay. I have some comments though. First of, there wasn’t much vegetarian food. The first, and only, time I ordered food, I ordered a meal without chicken. When I received the food, there was chicken in it..  Once we got to the room, I checked the toilet. I flushed the toilet and from the inlet water, there was poop and dirt in it. This continued throughout the week.   During the end of the week, when we were about to sleep, we could hear animals above our ceiling. There was some space between our room and the room above us where they were. We could only conclude that it was a couple of big rats that run around and squealed during a couple of hours. The next morning, we said this to the receptionist (she didn’t seem too surprised), and luckily we got…", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r535410387", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Relaxing and comfortable ", "review": "We stayed here for 4 nights. The room was clean and comfortable and the WiFi worked well in the room. They provide you with a beach bag and beach towels to use. The sunbeds are comfortable and there are plenty for the amount of guests. The restaurant is very expensive for what they serve. Breakfast is limited. The staff are friendly at times and rude at other times. There are 2 friendly dogs that seem to live there. We enjoyed watching their antics. Would recommend staying here ", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r527159896", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Enjoyable stay", "review": "The hotel was right by the beach, far from commercialized chaweng beach, free breakfast buffet, friendly and welcoming staff.  The only downside i can remember was that the kitchen and bar closes at 10p, and maybe that the meals are rather small portioned.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r509047863", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very nice and chilled...", "review": "We decided on a last minute holiday in April...we decided on Thailand in the morning and booked the afternoon, 3 days later, we were on a plane...and wow what a lovely relaxing holiday we had.  We had a lovely bungalow...everything was just perfect...  Service was just wonderful...wifi was more than excellent, seeing as I still had to work while I was over there and my signal to my devices was better than back home...  Food was good...we had the buffet breakfast included in our stay...was perfect!  All in all everyone was extremely accomodating and we wouldn't hesitate going back...", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r506862784", "sub_review": {"Value": 3, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "My Happy Place", "review": "Magical Meenam lulls into a torpa with its wonderful laid back Hipppy Vibe. Loved our stay here. On a wonderful part of the beach. Accommodation is spotless maybe a little small  but for the price I was happy plus only sleep in the room. Really good shower. Good food  in  the  restaurant and breakfast  good too lots of choice. Staff were lovely too Highly recommend and will definitely be back. Nothing can compare to lounging on  a beanbag sipping  a cocktail and watching  the  sunset in this little oasis and of calm and beauty.  Book it you wont I promise  regret it. From the minute we checked to the moment we regrettably left I ruly felt I was as close to Paradise. As good as it gest for its price and rating..", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r481995079", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A room is not a bungalow.", "review": "We booked 3 nights in a bungalow at the Hammock via Booking.com.  When we arrived we were shown to a first floor room (clearly not a bungalow).  The air con wasn't working, and the wifi wasn't working.  They got someone to fix the aircon, a few hours after we arrived, the wifi sort of started working but was unbelievably slow.  The bed was also incredibly hard, with really uncomfortable pillows.  And in their restaurant we had the nastiest, and highest priced Pad Thai that we had in our three week stay in Thailand.  We checked out after one night, as we wanted to stay in a BUNGALOW (ie one storey self contained building) not a room, and had been totally missold.   The Hammock wouldn't refund us, saying we had to get a refund via Booking.com.  Booking.com have been useless, very…", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r469380361", "sub_review": {"Value": 1, "Sleep Quality": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Good location but.....", "review": "The reservation was made a while ago, but as I was reading reviews before arriving I was getting nervous. When we got here I could see what others were saying. Of course we got a back row \"garden villa\" over the septic field!   The room itself is small, but clean, has a fridge, a functional safe, and places to hang clothing. The air con works well. The bed is hard and low to the ground. The floors are painted and slippery! Avoid the towel on the floor by the door, you could go flying!  However, the beach is gorgeous, the location in Mae Nam is charming and we paid a good price for the room.... so I'm in it to win it.... spend the money on massages and nummy Thai food!", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r461309549", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "NOT nice and NOT as promised ", "review": "We had booked, a bungalow ON THE BEACH, through booking.com.  When we arrived early, we should wait for the cleaning to finish so we waited in the bar.  WE NEWER GOT OUR BEACH FRONT HOUSE. It was rented out to another. Later we heard another costumer complaining. They got a house in the back instead of the beach front house as promised.  We decided to cancel Since \"beach front\" was what we looked for, and the place in top of that look very bad, we decided to cancel. Booking.com was very helpful. ---------- The price and promises do not follow each other. NO VALUE, AT ALL, FOR THE PRICE.  The houses have seen better days, a century ago.  The restaurant is more a roof with some tables, not nice, and the menu and what we could see on the plates, was cheap cafeteria food. But, you…", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r459404879", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Lovely hotel hidden away", "review": "The Hammock is a lovely hotel. We had a nice room and a lovely hot shower. It seemed very windy there but that may have just been the weather across Samui at the time. Breakfast was nice and eggs and bacon were made to order. Drinks here were very expensive! If you want to drink, I recommend going to the shop 2 minutes down the road for booze at a fraction of the price. Good access to Mae Nam night market which pops up on a Thursday night. It's a bit of a distance from Chaweng Beach but not a problem if you're confident using the public transport. Great hotel. ", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r450904968", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Maybe caught at a bad time?", "review": "So we stayed here for 3 nights and I feel it may have been a bad time for the hotel as it rained (very VERY heavily) our entire stay, but a series of events made this place particularly bad.....  First impressions - the pool is filthy with plants and bugs and the beach and water are dirty. I mean soooooo murky and mucky that you can't get in the water. Not really the hotels fault though as there was a storm so I took that into account.  Happy hour fraud- we had a break in the rain so sat on the beach in the evening. A sign was up saying buy one get one free for cocktail happy hour, we were within the time frame so ordered a cocktail each. The staff got my Black Russian wrong 3 times (not just a bit wrong...... I'm not a fuss pot..... but he brought a White Russian, then a…", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r446921678", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Nice stayed", "review": "It was very nice stayed in this special design accommodation, food are nice, of course in reasonable price, nice view, nice music, nice staffs, fast check-in, clean and comfortable, quiet, except the room toilet have weird smell.  I came with my wife, thinking to bring my kids to here in next year.", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r444607638", "sub_review": {"Rooms": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Beautiful rooms and view but over priced!!", "review": "We'd been here in the 1st week of December and the weather was just not with us. It was a high tide with lots of rain. We had booked a water front bungalow and the water was just 2 feet far from us. There was hardly any sand seen on beach. It was just too close to the sea and that made us a bit uncomfortable. However we then moved on the room on the 1st floor . View wise it is just perfect, staff is also good, rooms are tiny but clean and tidy but i only feel that it is too overpriced. There are other better resorts around which are much bigger than this. Pool was too small, though if looks big in pictures, restaurant food is dam expensive and not worth at all. Over a good experience but I don't think I will really look forward to stay here again. ", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r444221586", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "A little piece of heaven. ", "review": "This hotel was my little piece of heaven for the 3 nights we spent in Ko Samui Mae Nam. We'd actually booked elsewhere but ended up finding this little gem along the beach and agreed we just had to book!  We were lucky enough to bag a beach front room which was wonderful. Lovely and clean with free bottled water as well as lots of snacks and drinks to chose from in the mini bar. Breakfast came with the room for a little extra which was standard continental breakfast along with things you could order such as omelettes, pancakes etc.   We had one evening meal at the restaurant also which was lovely. Traditional Thai food good cost and tasted lovely. The cocktails were strong at a price of 250 TBH.   The only thing I would pick at if I had to was that the maid didn't visit during…", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r438532697", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Cute, Quiet, Boutique", "review": "Had a lovely stay at hammock. We originally booked for three nights, and then ended up booking an additional 5. The bungalows are small and modern, with lots of light. The staff was lovely and helpful. The beach at hammock is one of the. Eat spots that I could see. They really made an effort to make it look adorable by putting out lights and tables in the evening. I would definite stay here again, and highly recommend it. Very great value for the price! The only issue we had was with the wifi, which didn't work well in our bungalow (we were in the furthest one away, however). ", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r434169366", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Wonderful stay at seaside resort with excellent price/value", "review": "We enjoyed our family stay of four nights at this seafront hotel. The monochrome design of the rooms was a pleasant contrast to other hotels in the area. The staff is motivated and helpful, the breakfast and other meals very nicely done.  It is a small resort, you can easily venture on  foot to good nearby dining options.  VIa the beach to upscale chef Mathis or simple beach alternatives, or via path into Mae  nam Chinatown to excellent Korean and Japanese restaurants without the busy traffic from the Mai  road.  Happy to return! ", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r428334362", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Peaceful, relaxing trip", "review": "Resort - small, cosy, relaxing Beach - clean & calm sea which is great for swimming. Vendors at the beach is not pushy to sell their wares.  Room - stayed in a beach front bungalow , view is fantastic, every morning can watch the sunrise , room floor very slippery when wet, can do with more clothes hanger to hang clothes, bathroom could be better with a shower curtain. Better if can provide hand towels  Restaurant - breakfast included has a good variety of assortment, restaurant was able to cater to a birthday dinner by the beach.  Staff - all can speak english, courteous, friendly & helpful. Nearby resort - within short walking distance to convenience stores, eateries, spa & massages Overall if have a chance will come back.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r413747668", "sub_review": {"Sleep Quality": 4, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Nice place, but room too expensive ", "review": "We didn't receive a warm welcome when we arrived. They forgot our welcome drink. Our room wasn't ready so we had to wait. One hour later our room was ready. A bungalow at the beach with a beautiful view. The room is very clean but very small, not what they mentioned in the ad. The room is basic and doesn't have room to store your things. We didn't receive towels untill 2 o'clock. When they cleaned the room they took the towels and at two o'clock we received clean ones. The floor was very slippery. I fell 2 times. There are nice restaurants nearby. The beach is great and cleaned everyday. A great place, but very overpriced.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r411249593", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great to chill out!", "review": "The beach was fab, nice staff and good food. Such a good place to unwind away from hussle bussel. Massage on the beach and cute rooms. Except the bed was very hard and pillows not so comfy. I didnt really mind but my partner had trouble getting comfy. Staff really helpful and booked our ferry to kohphangan. I loved this place! ", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r407920006", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great find", "review": "Thank you for your review Lauren.  You are correct when you say its a great place to unwind.  Many of our guest feel the same way once they arrive.  I'm happy that staff was helpful with any needs that your required.  I'm sorry that your partner found the bed and pillows hard.  I will look to improve this for any future guests comfort.  Thank you again for choosing the Hammock.   Jason Balogh (GM)", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r405180800", "sub_review": {"Sleep Quality": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Lovely hotel for a short stay", "review": "We were told about this resort by friends who had been here the previous year and we loved it perfect for a few days stop over on the island, we got a room right on the beach. The rooms where quite small but the resort itself was small and quaint.  The staff were amazing and very helpful although not much to do in the area but we just wanted to chill so suited us fine. The beach itself was huge and very beautiful", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r400306582", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Rainy Songkran at Samui", "review": "Thank you for your review Tmachill.  Its a wonderful thing when your friends recommended us and you found the stay just as good.  I hope you will pass on are resort to other friends also.  Hope we see you again.  Jason Balogh (GM)", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r392378522", "sub_review": {"Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Great beach front stay", "review": "Amazing hotel, arrived late at night and we were unsure how close we were to the beach. Then we woke up in the morning and realised we were right on it! Had a lovely breakfast both mornings, they offered so much including fresh fruit and waffles wth chocolate sauce. They also had a menu with eggs/omelettes/sausages/bacon that you could order to have. The beach is lovely and quiet with nice deck chairs and beanbags. We only stayed for a night so can't comment on the nearby area. The rooms were lovely and unique and cleaned every day during breakfast. Bug free too! Staff also very friendly. Great value for money. ", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r391879171", "sub_review": {"Location": 4, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Amazing", "review": "Amazing resort in the Maenam beach far from the crowded Chaweng beach but close enough to get there by bike, taxi or tuk-tuk. The rooms are really nice and tidy and the bed is really confortable! Last remark, Mr. Jason was the nicest person ever and helped us with a lost bag! Thank you so much!", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r390258852", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nice rooms.... Not much around the area!!", "review": "I stayed here for 3 nights a few weeks back. The rooms & bathrooms are fairly small.  The hotel does have breakfast, good wifi, amazing place right next to the beach & friendly staff  The only thing is the location.... There's not much to do around the area at all. I went out with a few friends on multiple nights and couldn't really find anything to do?? There were no supermarkets nearby either so had to walk a while to find any!!   Apart from that, a pretty good stay! ", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r386886733", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Top Notch Stay at Hammock Samui Beach Resort", "review": "The Hammock Samui Beach Resort may not be a 5-star resort, but it offers the best of a beach-side holiday very few other resorts can offer. I stayed at the beachside bungalow - so open my door and I have the gorgeous sunrise and a huge stretch of beach ahead of me. Glorious without a doubt. The breakfast was simple yet excellent, wifi connection good. Staff had excellent attitude. An excellent place to just enjoy the beach and waves and explore Samui town- and also close to Mae Nam pier in case you want to head to Ko Phangan!", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r386431457", "sub_review": {"Location": 5, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Ideal beach hotel for a relaxing week", "review": "The Hammock is a small hotel right on Mae Nam beach.  It is definitely worth paying extra for a beach view room.  The breakfast included in the price is substantial.  The front desk staff are fluent in English and made up for the wait staff's limited English.  We never used the pool the whole time we were there as the beach is so inviting.  As we are not really beach type of vacationers, a week in Mae Nam was too long.  Next time, we would probably stay at a beach that had more things to do during the day and night.", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r382619273", "sub_review": {"Sleep Quality": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A little piece of paradise! ", "review": "I can't recommend The Hammock highly enough! It's location right on the beach is ideal. The accommodation is fantastic. The staff are incredible...I was surprised with a cake on my birthday even without mentioning it to them. The food is delicious. The drinks are cold. Outstanding in every regard. Loved my stay here and will definitely stay again if ever in Koh Samui! ", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r380531995", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Nice hotel and location to unwind away from crowd", "review": "Staying in this hotel is awesome. Beach front which I super like. The beach is shallow, which is good for family with children. Staff are friendly and attentive. The room is clean and the surroundings as well. They provide different types of beach chairs and bean bags to lounge and chill with. Nice place as well for sunrise and sunset watching which is so exciting to look forward to everyday. Location is what i like the most because its away from the crowd and very peacful. ", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r376715623", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Good things... Small packages", "review": "Good things come in small packages.... Our room was compact however very comfortable, the location was great. the beach was clean and the pool looked good, we didn't use it as the beach was just there! The dogs & staff very friendly 😃 Breakfast in the restaurant on the beach was awesome... Overall highly recommend, if you're there in a Thursday night be sure to check out the market. Oh, & there are some great little restaurants just a stroll away. ", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r375388284", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nice beach hotel", "review": "Stayed here for 2 nights, loved the quiet location. Its bar/restaurant closes quite early in the evening, you might be lost for things to do at night as there isn't much else around. Deluxe room decor is nice but the room is not very spacious at all. No wardrobe. Nice staff and nice breakfast. Overall I would recommend for a short stay in Samui.", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r373003451", "sub_review": {"Sleep Quality": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good little spot ", "review": "Had a lovely stay at The Hammock. It's in a gorgeous spot on the relaxed MaeNam beach. Nice little pool overlooking the beach and views of Koh Phangan.  We found the beach area very relaxing with good sunbeds and beanbags. Nice room, one of our favourites from our travels around South East Asia. Comfy bed, nice touch with the beach bag. Cleaned everyday.  We were there during Songkran and the staff were in good spirits throwing water at each other and the guests it was a fun/friendly atmosphere. Good value for money, would recommend!  Tip: You can get a ferry from a small pier (you see it pull into the beach at 11am and leaves at midday - it's not well advertised) just close to the Hammock over to Koh Phangan direct, stopping at Haad Rin and up the east coast. Which saves time…", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r365044232", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice location nice resort. ", "review": "The resort is located on Maenam beach, close to walking street. The hotel beach was quiet and no local vender to bother you. The resort was nice and clean. Very friendly and helpful staff especially GM and housekeepers. About the food it was great.  Highly recommended for your holiday. ", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r356225550", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Wonderful", "review": "Located right on Maenam beach this is a great place to stay.  Its a very relaxing place.  The staff are very friendly and very helpful is you need something.  The rooms are cleaned everyday and done very well.  I will defiantly be back.  Thanks for the wonderful time.", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r350695221", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Budget hotel with good facilities", "review": "Excellent value for money, rooms are neat and clean with showers large enough for two persons at the same time. Free wifi in all rooms and bar. good breakfast from 07-00 to 10-00 and the meals from 12-00 to 22-00. The rooms have safe deposit box but no wardrobes, only pegs on the walls with hangers.", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r348714847", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Beautiful, quiet place in Samui!", "review": "Very nice, quiet hotel in Samui at MaeNam beach! The lady & the sir at the reception were really kind and helpful!!!The helped us a lot! The boys and the (perfect) girl at the bar/breakfast were also perfect!we were speaking every day and laughing a lot! The room was very clean and the shower water was warm enough! The restaurant has also very good Thai food and good prices! There you will eat the best spring rolls in Samui! We fully recommend it!   P.S. The price could be less.", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r346529575", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Quiet stay away from the busy chaweng", "review": "We stayed there one night, it is located a bit far from the nightlife but it is a nice quiet area on the beach, they have some beachfront bungalows but we didn't had the chance to stay in them as they were fully booked. It is very near Chinatown where there was a lively market on Thursday night. The beach is not white sand but it's still very nice. The Breakfast was good and had a decent selection (bread, croissant, jam, eggs, bacon, cereals, yogurt, muesli..).", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r346027450", "sub_review": {"Sleep Quality": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great little resort on the beach ", "review": "We loved staying at the Hammock Samui resort. The staff were great, incredibly helpful and all round lovely people! We only stayed for two nights but we'd definitely stay again. The food was great as were the cocktails. The beach was lovely and we really liked the chilledness of the area and hotel. Lovely thank you Hammock Samui! ", "date": "January 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r345347309", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Well managed hotel in the best location", "review": "My husband and I stayed for 6 days in one of the beach front bungalows which we found very spacious, clean and well maintained. Such a nice way to wake up looking out over the ocean, I highly recommend bucking it up to get a beach front bungalow if possible. The other bungalows look as nice, just a bit smaller. So for the person complaining of the shower not being big enough (Lol) etc. you get what you pay for. The shower size in the beach front was more than acceptable. The breakfast is fantastic! A nice array of fruit, juices, bakery items, granola and cereals as well as eggs to order. I'm not sure how anyone could possibly complain about the breakfast and I am a picky eater. The beach front was always kept clean and raked daily, the staff were exceptional! I can't thank all…", "date": "January 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r344633434", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Cute clean rooms right on the beach!", "review": "Well furnished, really clean rooms. The beds were really comfy with good quality linen. If I would change anything it's that the bathroom, in particular the shower would be a little bigger, but I do appreciate they are on a small plot. However, the shower itself was one of the best I've had in Asia, with lots of hot water. You get lots of free drinks and snacks and beach beach towels in the rooms too. Breakfast is nice and as we had to go to the airport early they made us sandwiches to take with us instead. Staff were really friendly and helpful and spoke very good English. Location is very good, very close to the walking street in mae nam but still quiet. It's right on the beach and has lots of sun-loungers on it's nice stretch of beach. There is also a nice little pool and…", "date": "January 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r342825812", "sub_review": {"Value": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Unless it's on a sunday", "review": "Stayed here for 3 weeks, there are some ups and downs:  Upside: - it's calm, not a lot of parties around - the receptionists are helpful when you need something, e.g. making an appointment at someplace (if you have a phone number) - there's AC - there's wifi - there's a tv in the room - they have books and films that you can  borrow - you get breakfast everyday - the rooms have a fridge, safety vault, showers and most things you need, there's plenty of room for your stuff if you travel light (I only had a carry-on bag)  - there are a lot of places to eat near the hotel - there's a night market every thursday  Downside: - the wifi doesn't work when it windy/raining i.e. when you need it - there's no hot water in the shower - the bed is really hard (but after a week you stop…", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r335380400", "sub_review": {"Value": 3, "Rooms": 3, "Service": 2}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Beach Front, Cute, Clean", "review": "Just stayed at this resort for 2 nights after backpacking across Vietnam, Laos and Thailand. Very familiar with simple hotels across Southeast Asia. This hotel was very cute, cheap and right on the beachfront. The rooms were very clean, staff were friendly, breakfast included. This is a great resort to stay at for the price.", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r329960479", "sub_review": {"Value": 5, "Location": 4, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Beach front, cheap and great place to stay", "review": "Booked 2 nights and ended up staying 8! This place is such good value for a beachfront hotel with breakfast included. The rooms are nice and clean with everything you need, like a storage area, safe, kettle. You'll get clean towels for shower and beach everyday which is great. The breakfast has a lot of options so it doesn't get boring. Lots of nice restaurants nearby too. Highly recommend!", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r328566553", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nice location...room needs improvement.", "review": "I know this is a budget hotel. We weren't familiar yet with what you can get with the bang for your buck in Thailand yet. We booked this room because we were staying at the Baan Talay Pool Villas and saw that this was their sister hotel. The pics looked nice. The room was veru different from where we were at, but i wasn't expecting too much knowing that it was a budget hotel. When we arrived, i loved the location. It is right on the beach and near some shops and restaurants and a Thursday(?) night market. I don't think i am too picky...i am happy in a shoebox room as long as it feels clean. The room was tiny, which wouldn't have been a big problem but the room itself was a little run down. The paint on the walls was cracked and chipping. I'm sure a new layer of paint could fix…", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r328357881", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "warang", "review": "The hammock is a beautiful hotel on mae nam beach ,the room a bit small but not bad anyway. breakfast was good in the restaurant on the beach. pretty swimming pool. I will back again. Good for couple or friends, not recommend for family who have children.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r320915278", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great!!!", "review": "Location? Out of the way, quite hard to find if your on your own or if you do ask a local who does not know how to speak English. But I must say the accommodation was just what I needed. Right on the Mae nam beach which is pretty big. Rooms are very cute bungalows and affordable if your on a budget. Staff arent really sociable, but i do have to thank Angelo for being a great help during my stay and also the girls that cleaned my room everyday. I would stay again.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r318816345", "sub_review": {"Location": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Goede locatie, goede prijzen, maar service en huisje kan beter", "review": "My girlfriend and I booked 2 nights the Hammock via booking.com for a low price. Staff should treat the customers a little bit better. They help you and answer your questions but not really enthusiastic…  Well, location is prefect, rooms are really small(very little space for your suitcase/backpack) and the shower smells really bad. But for us not issues that bother me too much as I only use the bathroom 5 minutes a day. Keep the door closed and you will not smell it in your room. For the price of 1350 baht per night we are pretty satisfied about our stay ", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r314626817", "sub_review": {"Location": 4, "Sleep Quality": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Hesitating on arrival", "review": "When arriving (in a small alley with the entrance really hidden away) and checking in we were doubtfull if this was the hotel we wanted to stay in. The swimming pool is really small (and cold because all day in the shadow) and the room looked like in a hospital (to bright white). But once settled and experiencing the beautiful seaview and having a meal at the restaurant, this hotel was appreciated more and more every day!", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r299451418", "sub_review": {"Sleep Quality": 4, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Superb", "review": "We stayed at the hammock 4 nights and it was our last stop on our thailand trip and we enjoyed nit being in a hostel for the end. Prices are ok and they clean the room everyday. Breakfast is included. We had to check out quiet early so they made us Sandwiches. Rooms where perfekt for us but we had not much luggage. Close the bathroom door. It stinks! ", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r294534109", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely place in quiet location", "review": "These beach bungalows were absolutely lovely. Very compact and stylish and right on the beach. Mae Nam beach itself is lush, however it is very very quiet. This area is even quieter at night and can feel like a bit of a ghost town. We just stayed for two nights which was plenty before moving to the busier parts of Koh Samui. I would recommend this hotel as it is lovely but I wouldn't stay there for a whole trip due to the location being quite atmosphereless.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r293314626", "sub_review": {"Location": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Great place for a short stay...", "review": "This is a small hidden gem in Koh Samui. (blink and you will miss it!!). The place was amazing and the price was really cheap....... we took a room that opened onto the beach directly.... these were priced higher..... but worth the cost!!!! They also have a small swimming pool for kids!!!!! I would give it a four star experience and the food was tasty too!!!", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r284080952", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Clean and basic in a quiet location", "review": "The Hammock was ideal for my two night stay on Koh Samui. Right on a quiet part of Mae Nam beach with views across to Koh Phangan. Staff were helpful and my room was clean and comfortable. Close to local bars and restaurants too.", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r279417905", "sub_review": {"Sleep Quality": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Good pampering", "review": "Consdering i rate a hotel based on whether you can walk barefoot in the bathroom, the hotel was absolutely great! But jokes aside, clean, homely, quaint and good rooms. Only food I had here was breakfast and the hotel staff was friendly and very helpful. though maenam itself is not the best for solo travel. It should be viewed more as a retreat. On Thursday nights you get to see the night market; good street food and decent bargains. But hotel is good if you want to sit at the beach and laze away with a direct view of ko phanghan", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r277851268", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Great place", "review": "Small but comfortable rooms with mini fridge and safe. The beach location is dead centre, lots of shops and restaurants near by. A night market every Thursday. Finally rocking good connectivity for watching Netflix late at night. Would definitely stay again. Also staff are really nice.", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r266588524", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Paradise!", "review": "Amazing...people are nice, rooms are so confortable for such a price :) food is also very good! Best place of the mae nam beach in koh samui!!go there if you want some rest after 2 weeks of road trip. Perfect place to finish ur travel. ", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r263360030", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Ok not great", "review": "Thank you and we are delighted to know that you enjoyed your stay with us.  We are hoping to meet you again soon.", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r262191012", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Great beach but extremely small rooms at exorbitant prices", "review": "We have just spent 5 nights at the Hammock in Maenam. This resort has crammed about 30 bungalows and rooms onto a very small block of land on the beach. The rooms are tiny with no hanging spaces or room to unpack anything. They are all painted concrete inside. Our room was in need of repainting . The matress is placed on a platform which takes up most the room to form the bed. This is a good stop for 1 or 2 nights but gets to be too small for longer stays. The upstairs rooms with sea views or beach rooms might be better and less claustrophobic .the beach front rooms have no privacy. The beach area is pleasant but the pool is too small to use other than a quick cool off. The hotel was only half full so plenty of beach chairs but would be not enough if it was full.  Breakfast was…", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r262117529", "sub_review": {"Value": 2, "Sleep Quality": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Great stay", "review": "Really nice experience here, the bangalow is really clean and comfortable, it is straight on the beach and you always have long chairs available, i would recommend this place. The beach is surprisingly quiet and widi works everywhere.", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r259368366", "sub_review": {"Location": 4, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Highly recommended!", "review": "We stayed here mid-january 2015. To simplify things for those in a rush, I would highly recommend staying at the Hammock if you are comfortable in a room with limited storage for your clothes and toiletries and are fairly adventurous. We originally just booked for one night, with previewing more places the following day in mind. We walked to about 8 other resorts in the area the following day (previewed rooms as well) and decided that there was great value at THE HAMMOCK and booked for 2 additional nights. (Obviously you can never have everything you want unless you pay the big bucks). My wife and I think that this place is fantastic. We are from western Canada, and thought it had a very friendly staff, was very clean and modern, the food was very fresh (the complimentary…", "date": "January 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r254596203", "sub_review": {"Location": 4, "Sleep Quality": 3, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Clean rooms, beach view", "review": "Great service from Ghandy and the rest of the staff, reasonably priced although eat food elsewhere (try the Deli!) we loved the comfortable chairs and the overall style of this place. Mae Nam is a good place to relax but still close enough to other parts of the island.   We had a beach view from across the pool. This is a good room! Try to visit the Thursday night market and the sushi restaurant around the corner (Koburi).", "date": "January 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r251567626", "sub_review": {"Value": 4, "Location": 5, "Rooms": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "Front beach rooms are fine", "review": "We stayed in Hammock hotel for 3 nights in the very end of December. The hotel is right on the beach. The sea was clean, but there is a small river on the right. So we preferred to cross the river ant take a swim some hundred meters away from the river mouth. The place is quiet, maybe a little dull. There is a small Chinese temple nearby and few caffes along the beach and restaraunts in surrounding streets. Bophut Fisherman's village is about 5 km away. It is possible to walk to the village, but the road along the busy road is not pleasant. Better catch a tuk-tuk for 100 baths per person.  Our front beach room was fine, in fact it is a small house standing very close to the other three in the front line looking at the beach. Interior is in white and grey colours, the bed is…", "date": "December 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r250551178", "sub_review": {"Value": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Price worthy and very central", "review": "As we had to fly back to Germany the day after we stayed for one night at the Hammock, which is located directly at the beach. The room was surprisingly quite big (we had the standard room) and quite modern. The breakfast was the best we had during our Thailand visit and was huge. Service was outstanding and super. All support needed was looked after. Thanks again!!", "date": "January 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r249884075", "sub_review": {"Location": 5, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Dirty beach, basic rooms, no hot water, staff who don't care", "review": "This place is awful, they're charging top drawer prices for a very basic room that doesn't even have enough hot running water for two people to shower and it wasn't just our room, everyone was complaining about it too. When we got here, the beach was covered in bottles and rubbish, unfortunately the beach was swept away in the night, I'll put some pictures up later. We thought it was odd that they make you pay on arrival, it soon became apparent why, it's because the place is so terrible and the staff so unhelpful you would be tempted to walk out and find somewhere else so they guarantee you can't. Dreadful, dreadful, dreadful, definitely find somewhere else! You have been warned!", "date": "January 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r249374764", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Bohemian accommodation on the beach", "review": "What a great little find this place is! We booked a beach front villa and it was definitely worth it - you can hear the waves crashing on the beach even with your windows closed. Huge comfortable bed and the room was appointed with basic but good amenities including safe, plenty of towels, mini fridge, shower gel, beach bag etc. You can walk just a few steps from your verandah area and be on the beach, which was also good for swimming. The curtains are not black out so bear this in mind if you like to sleep late. Breakfast was basic but enough to get you started for the day and although the drip coffee is good, there are also espressos and lattes available, and eggs cooked to order. We ate lunch here one day and had a spicy thai salad and a curry and they were excellent. As…", "date": "January 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r247481510", "sub_review": {"Location": 5, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "The staff make this a special place!", "review": "We stayed at The Hammock for a week over Christmas 2014. From the moment we checked in until the moment that we left the staff went above and beyond to make this a special holiday for us. During our stay it was my mothers 60th birthday and when she arrived for breakfast the staff had prepared a cake, balloons and were playing 'Happy Birthday' on the stereo! Similarly for Christmas Day the staff made a huge effort to celebrate with us! Breakfast was good, eggs freshly prepared to order, a variation of sides and most importantly BACON! ;) Location is great with a pretty beach and a handful of local Thai restaurants close by- additionally every Thursday evening there is a night market which is very festive. Our only complaint is that although the rooms are beautiful in design they…", "date": "December 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r247299613", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Very good for the price", "review": "I stayed in a standard room for two nights and had a great ocean view from my balcony. Even tough it was very windy during my stay, I enjoyed listening to the waves while having a singha:-).  The resort provides beach chairs and a breakfast which was satisfying for me.  The nightmarked on thuesday evening in the roads just behind the hotel is amazing! You definitely need to check it out if you're there on that weekday! Had a very yummy fresh prepared phad thai gai and satay gai- and it was very cheap! The shopping is also cheaper than in the regular tourist shops.  Two things should be improved at the hammock: the housekeeping, which didn't clean my room (but as I stayed only for two night so it was ok - and I could have said something at the office) and the other thing was the…", "date": "December 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r246607857", "sub_review": {"Value": 4, "Location": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Nice hotel, Poor Service!!", "review": "This little hotel is located in a good, quiet location with a lovely beachfront. It would have been a lovely stay had it not been for a few service issues while we were there.  If you plan on being out later into the evening (i'm talking anything past 9 pm) DO NOT leave your key with the reception. I made the mistake of doing this, and on returning, not only was the reception unmanned, but there was actually no staff to be found anywhere on the premises. This was not only incredibly inconveniencing but also quite unsettling. It was ultimately the use of a phone from a neighbouring hotel that saved the evening.  Barring my unfortunate experience, I would have happily recommended this place.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r241271609", "sub_review": {"Location": 4, "Rooms": 4, "Service": 1}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Worth every penny", "review": "It was indeed a long journey from Surat Thani; 1.5 hours bus ride & 45 mins by high speed ferry & not to mention the waiting time. But it was all worthwhile with the perfect choice of stay. Mae Nam beach is a quiet area, unlike Chaweng. So if you are looking for a relaxing and excellent service, this place would certainly do the justice!", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r236156887", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Great, peaceful hotel at a beautiful beach!", "review": "Stayed here for 9 nights with my boyfriend, and it was everything we could have asked for! Small and quiet hotel right on the beautiful beach of Mae Nam. If you are looking for a party, you should go to Chaweng instead. But if you are looking for some peace and quiet to enjoy Thailand I really recommend this place! Every Thursday at 5 pm there is a market about 100 metres up the street from the hotel. I recommend everyone to go there and see the stands with food, drinks, clothes and stuff they sell. There is a handful of restaurants in this street as well.   We stayed in a beach front bungalow, and I would really recommend this! We had a beautiful view right on the beach with our own private balcony. The restaurant had really good food, but I would avoid the pasta - the chef is…", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r232823764", "sub_review": {"Sleep Quality": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great week", "review": "Me and my friend spent a week here in September. Our room was a great price, clean, and got tidied every day. The breakfast was included and had a good choice.  The area was quiet which we liked meant you got a sunbed on the beach.  The staff were friendly and helpful and let us extend our stay.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r229933980", "sub_review": {"Sleep Quality": 5, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Small and quiet", "review": "As a budget traveller this hotel may seem small and not upto standards due to the impression it can give, but after a few more days this hotel was like a home away from home. Staff was friendly and fun, the hotel is steps away from the beach hence no need to book beach front rooms. The hotel is located on a quiet beach, hence great for relaxing. Also the front desk staff member Angelo was a great at directing us for our needs like transport to full moon party. Will stay there next time!", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r229009511", "sub_review": {"Value": 4, "Location": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "Better places to stay elsewhere", "review": "Stayed here seven nights, I was conflicted on whether to review or not but decided it's best people know the truth about this place before booking. I prepaid my stay so I was stuck, but the pictures looked so nice!  I was in room G-08 which was supposed to be a \"superior\" bungalow but is actually one room connected to four others facing a wall. So, while they may actually have some detached bungalows, most are attached and odds are you're going to get one of these. If you're a non-smoker and the people next door to you are chain smokers, well you're going to inhale a lot of second-hand smoke in your room like it or not. Speaking of the rooms, they're pretty dirty, cobwebs hanging from the ceiling, a few with captured bugs waiting to be eaten by the spiders. Lots of mosquito's in…", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r227789576", "sub_review": {}, "travel_purpose": "", "rating": 1}, {"title": "Nice hotel on a beautifull beach....", "review": "Nice hotel located directly on the beach which is very nice and quiet. Staff were helpful and polite. One flaw of the hotel were the white sheets, which were probably also clean but with dirty stains of various colors that were not really pleased.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r225966381", "sub_review": {"Location": 4, "Sleep Quality": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Loved it", "review": "I'm really bummed we only got to stay here for one night - I definitely could have managed a few more! The Hammock is a small place, but that is one of the things that makes it so charming.  It seemed as though every room is just a short walk to the bar, restaurant and beach!  Our room was airy and clean and in quiet Mae Nam it was a nice break from staying in Chaweng previously.    We read on here previously if you stay here on a Thursday to check out the night market that's just up the road (seriously less than a 5 min walk) -- definitely do that!  We were so glad we did, we picked up a few cool things at great prices and got to try some amazing food. Overall a great stay at The Hammock, would definitely go back!", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r224945815", "sub_review": {"Sleep Quality": 4, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very good but very quiet!", "review": "I really liked this place. The hotel initially comes across as small but this gives quite a family feel. You are literally right on the beach so I wouldn't say it would be worth paying extra for sea view unless you really want it. The area is very very quiet -  we stayed here for 3 nights and found this enough. It is lovely to relax however it's an expensive 500 baht journey one way to Chaweng beach where the shops, restaurants and night life are. The rooms are quite small but liveable and kept clean. Breakfast is brilliant, choice of western food (eggs, pancakes, bacon), Thai food and cereal. Would recommend but not for too long! ", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r223345684", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Relaxed, on the beach, great food! ", "review": "My mom, boyfriend and I stayed at The Hammock. We were welcomed in a friendly manner by Gandhi and were shown to a clean and well designed room. The inclusive Western style breakfast was great. There was a great range of Thai and Western food options. There is a friendly young waiter who served us with a smile each time.   There are lounger chairs on the beach set aside for Hammock customers. There are red bean bags around the small pool, which is cooler than the sea of you need to chill out.   We will definately stay here again if we go back to Koh Samui.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r222797261", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "A little paradise on touristic Ko Samui", "review": "We, my wife, 21 month old son and I, had the pleasure of staying at The Hammock for 6 nights. We had a great time, from the welcome to the goodbye. When you awake there is a great breakfast waiting for you. With eggs, bacon, fruit, drip coffee (a rarity in Thailand), croissants and more. The best we had during our holiday. After breakfast you can jump in the small but refreshing pool or have a swim in the sea, which is just 10 steps away from the restaurant. With staff nearby to serve you drinks or a bite to eat on the beach, while sunbathing and relaxing. In the evening the restaurant serves a wide variety of Thai an European foods. Always with a smile an great taste!! The rooms are modern white with some design elements, a very friendly look.   If you arrive with little kids,…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r218868403", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Lovely small hotel with extras", "review": "We stayed in a garden room,  room number G02 which was 30 secs from the beach and no noise from the pool or restaurant.  Room was clean, bed comfortable,  beach bag with two beach towels provided, and two large umbrellas in case you have a rainy day, both were a nice touch.  Two small bottles of water provided each day.  The bathroom was adequate although did smell from the drains,  think this is normal and we covered them over which helped.  Breakfast was fab,  we are vegan and other than buying our own coconut milk from the nearby shops were able to eat to our fill!  Fresh fruit,  oats,  breads,  as well as 4 hot dishes and eggs by order if wanted.  In the evening the restaurant does not serve vegetarian food but there are other restaurants within a 10 min walk, we didn't eat…", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r217909030", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Terrible!", "review": "Never stay here!:(  Swimming pool is really small, reception isn't friendly. There are a lot of ants in the bed and mosquitos at the room  - you can't sleep! At the last day they say that we used minibar and must pay, but we didn't.", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r217369865", "sub_review": {"Location": 4, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Cozy and Excellent Hotel at Beautiful Mae Nam beach, Koh Samui", "review": "Our first impression was that hotel was a bit small. But just after a few hours we just loved it. The small and personal hotel was perfect for us after a busy period of work. The relaxed atmosphere at the hotel was brilliant and you felt to be at home pretty soon. We stayed in a pool deluxe room and had the pool (small one) just outside our doorstep. The room is a bit small when you arrived with two large suitcases. But we managed to rearranged it. When it rained it was a smell in the room but housekeeping did everything to keep this away. I strongly believe its not the hotel that can be blamed due to Koh Samui plumbing situation when heavy rainfalls can come quickly. This was not an issue for us anyway. Small gardens with large hammocks (swings) if you want to enjoy this.…", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r214454864", "sub_review": {"Sleep Quality": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A great place to stay", "review": "Stayed here a week with my girlfriend as part of our island hopping tour of Thailand. It's a great place.  Rooms are small, but comfortable and cosy. Checked in around 7 pm after a nightmare 6hr delayed boat from the mainland, were greeted well and promptly shown to the room. It was icy cold, which was a nice touch.   I'll be honest and say it's nothing exceptional, but it was clean, tidy, fairly modern and an awesome place to stay, the location right on the beach instantly puts you in chill out mode everyday!  Was very difficult to find. My advice here is get a taxi to the Hutcha resort. It is right beside the hammock, you have to go down a couple of roads from the Main Street and even then you don't see it until you're basically at the entrance.  The only cons were that the…", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r213171831", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Nice hotel in samui", "review": "Good address in Maenam, to me the best beach in Samui The rooms are a bit small but very well done, good restaurant with sea view, staff very welcoming sun-beds and a nice shower after the sea bath  Not easy to find", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r211304274", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great Value", "review": "My husband and I stayed at The Hammock for two nights.  The customer service was wonderful!  The staff always greeted us with a smile.  We stayed in a Superior Bungalow.  I should note that the bungalow was very, very small.  However, it was clean and comfortable and suited our needs (as we wanted to spend most of our time outside enjoying the beach).    The buffet breakfast is lovely with plenty of options (eggs, toast, cereal, yogurt, fresh fruit, fresh vegetables, etc.).  The electricity did go out once during our stay, but it was fixed immediately upon informing the staff.  Another thing to note is that the pool is also very, very small.  Again, we were there to enjoy the beach -- but it is worth mentioning for future travelers.  We were looking for a tranquil spot on Koh…", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r211026925", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice quite resort, on the beach, challenge to find", "review": "I got lost for two hours trying to find this place, so good luck, have a smartphone and local sim card so you can call the resort for directions when you get lost. However, with all that being said, you will be rewarded by a pleasant little resort with Bungalo style rooms that are nicely appointed with beach towels, a good pressurized hot shower, cable and wifi. The rooms are a bit small, but for short term stays it works fine and there might be larger superior rooms avaiable as well. The beach is nice, the breakfast was good, sunchairs, pool, bar, motorbike parking, it had everything I really needed. It was easy walking to the small beach town of Maenam that has a night bazaar on Thursday night.", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r210937878", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely - Right on the Beach", "review": "We stayed here for 4 nights in June and its a great place. Rooms are clean and spacious and has a great shower. We had a superior bungalow with air con and tv. 2 bottles of water were given everyday and breakfast is included in the price. Varied selection on the breakfast which was yummy!! There was a slight smell in the bathroom from the drains but nothing to really complain about. Overall - perfect!! ", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r210227622", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Right on the beach", "review": "I only originally intended to stay here for two nights, but loved the place so much I ended up changing my entire schedule and staying an extra night. The hotel is located right on the beach front, in the center of Maenam beach. The bar/breakfast area overlooks the sands and sea, a perfect place to start or end the day. The location itself is not the busiest place ever, if it is nightlife you are looking for I suggest you stay in Chaweng. But, if it is a relaxing piece of tropical paradise that you are looking for, then this is perfect. The area hosts a few shops and restaurants so anything needed is always available. The staff at the hotel are brilliant, fast, happy and they keep the rooms exceptionally clean. When I return to Thailand, I will definitely be staying at this…", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r209398927", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Comfi and clean rooms great staff", "review": "We spent 4 nights in this really awesome place and just loved it! The staff is really friendly and always happy to serve to your pleasure. The food in the restaurant was really good. And the beach just a few steps from the doorstep is enjoyable (the water feels more like a bathtub than refreshing though) The surrounding area has a lot to offer as well (supermarket, restaurants, massages, etc) and eith a rented scooter you get farther away easily. Ee only paid 1400 baht for a nice room on the first floor. Bakcony facing the beach. Not too expansive and worth every cent in our opinion. One of the most beautiful places we stayed at on our journey through asia. Definitely recommended!", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r208286712", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good decoration, Close to the beach", "review": "I stayed in Standard Bungalow for 3 nights  The hotel is a nice place, good decoration, close to the beach and suitable price.  The hotel is located in a small alley and hotel direction sign is too small so it's hard to go there.  Parking is very very small", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r207815063", "sub_review": {"Value": 5, "Location": 3, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Lovely place", "review": "I spent 5 nights here with my girlfriend(I wish we could have stay longer). The room had enough space and it was clean but to be fair some extra storage would be appreciated by some people. Food was excellent and reasonably priced. Breakfast was simple but very, very nice. My favorite was the crispy bacon. We had full ocean view from our room and we just loved it. The place is very peaceful and quiet and this is what we were hoping for. Motorbike rent was easy also from the reception and we had a great time discovering the island. A part of it anyway. The staff was very helpful and very friendly. I would and I will recommend this place!", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r207055418", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Right by the beach.", "review": "My boyfriend and I picked The Hammock because it was one of the more reasonably priced places in ko Samui and was on the beach that we were told was the best. The rooms are fine, a little run down overall but has everything you need and are clean. The breakfast is good especially with being set right on the beach the view us awesome and not like any other on the island with ko phangan being opposite you. Is a bit of a longish walk from the road and the area is very quite but that was fine for us as we were looking for a relaxed sort of place! ", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r203911312", "sub_review": {"Value": 4, "Location": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "", "rating": 5}, {"title": "Good resort, dirty beach", "review": "Paid $35 per room in Dec 2013 through agoda. We really liked the rooms. Nicely build, small but clean and cozy with character. There is a tiny pool. Breakfast that came with the room was really great. Biggest problem with this location is that there is a drainage with dirty water of Maenam flowing into Ocean right in front of the hotel. So for us going into water was out of question. Otherwise, we enjoyed this place.", "date": "December 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r203251302", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Don't want to leave!", "review": "Thank you for sharing your holiday experience at The Hammock Samui Beach Resort!  We really appreciate your good comments about our resort and our customer service. About the beach, we apologize that on the time you stayed here, the sea was a bit dirty because of the river beside the resort, but it is not the whole year. I would suggest you try to visit us again some other season to see and experience the beauty of Meanam Beach.  We are looking forward to welcome you back here at The Hammock Samui Beach resort.", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r199769784", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good things come in small packages", "review": "Hammock is one of the nicest and cutest places we've ever stayed. Its a lovely intimate resort with an almost Mediterranean feel to it. Its also located on the best beach in Samui; Maenam. In all honesty we found all the other beaches to be dirty, overcrowded and not suitable for swimming. Maenam is your best bet if you're looking for some peace & quietness. Although the rooms are relatively small we loved staying here. The use of smooth concrete gives a cool & refreshing feel. The beds are very, very comfortable and the rain shower is fantastic. Everything you need from a little fridge to cable flat screen TV with a DVD player. Yes, the rooms are small but trust me; good things come in small packages. There is a lovely deck terrace and a little pool overlooking the sea.We were…", "date": "February 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r197929338", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "intimate, nicely organized resort", "review": "Hello Ms. Gina!   Thank you for the positive review of our Resort. We are very pleased that you enjoyed your stay. Our staff members always try their best to provide a great service for all our guests.  We are looking forward to welcome you back here at The Hammock Samui Beach Resort!", "date": "March 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r195961505", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Small hideaway", "review": "This is a small resort, occupying a sliver of beach front property in Maenam. We stayed during peak season, and whereas the beaches in chaweng and Bo Phut are packed, this part of Maenam beach was relatively quiet. The price was good, the staff was fantastic, and the general ambiance of the hotel was just right. Even the crowd this place draws seemed to be more friendly, mellow and relaxed than many other spots.   The resort is accessed off the main Maenam Soi, so there are restaurants, shops, and a 7-11 within walking distance. We strolled our daughter around in the evenings, and it was nice not to have to negotiate the main ring road.   The resort is tightly packed in, but the designers did a good job with what they had. Most units are free-standing bungalows close to the…", "date": "January 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r194294642", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "small resort with nice stuff", "review": "Hammock is nice small resort on quiet area of Koh Samui. We stayed on a beachfront bungalow and it was really nice. It had a nice own terrace in front of it. The room is completely white colored. There were some ants and one gekko. It was quiet and nice and the bed was good to sleep. The beach is quite average for Thailand standard. But the beach was clean. Breakfast was ok, nothing special. Staff is really nice. Could stay here again.  We made a notice that the other bungalows had only very small terrace in front of them and then you have already the next building there to stare. I would not stay any other than beachfront bungalow.", "date": "November 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r192207851", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "pretty pricey during high season, otherwise really good", "review": "We stay there for week on our Thai trip, and there we´ve  felt best care of all accomodation on the others isands we visited. Resort is clean, modern with good restaurant. We loved huge breakfast on the beach.   Anyway beach bag is included.", "date": "January 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r191472570", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Beach bags a nice touch", "review": "A more than comfortable room with all the necessities. We especially liked the beach bag with extra towels. Staff were always pleasant and more than helpful. They went the extra mile when they provided a boxed breakfast for us when we had to leave on a very early bus. Would happily recommend this resort to anyone staying in this area of Samui.", "date": "November 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r190977238", "sub_review": {"Value": 5, "Location": 3, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Value for money", "review": "A little late update... I stayed here during Christmas Week last year, it was the peak season and this is the only hotel left with a good price for a week. I can say I'm pretty surprise... After a 25hrs roadtrip from Singapore, this hotel totally makes up for it. The view! I totally forgot how tired I was when the reception area greeted me. Hotel staff was really helpful, I don't know why some of the reviewer said otherwise. But yeah.. Anyway.. during the Christmas Day itself they surprise us with Some Christmas Cookies in a box on our bed after our day trip (we got out pretty early that day to Koh Nangyuen).   Note: Every Thursday there will be somekind of night market on the road leading to the hotel, for those of you who going rent a bike at a nearby shop near the hotel, I…", "date": "December 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r190938008", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 5, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "More than acceptable, particularly with a beachfront option", "review": "We had Beach from bungalow (more like a attached room) straight onto the water. Definitely not 5 star but it's not aimed at this and you are in Thailand, but friendly staff, great spot on Maeman away from the crowds. Yes there were a few ants in the room...  Not sure what the complaints are on the breakfast but mine was included and perhaps it's not a smorgasbord, but there is a decent selection for a basic European, English or Thai.  Just beware as mentioned before in other reviews the Thursday markets block the streets till 12 am! Unlike other reviewers we saw this as a fortuitous experience to sample the great food. But driving the car to the hotel with the bags in the rain at 1am was a pain", "date": "January 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r190578791", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice location ok service", "review": "We stayed for 2 nights in a garden view room. The room is small but cozy and the shower was hot! They provided a beach bag with towels! The rooms are for 2 people only. We squeezed 3 in a room and it was ok for 2 nights. The beach front was calm and peaceful but there are not a lot of beach chairs or space. The staff was helpful with making reservations and you are able to rent a motorbike from the reception! They did run out of toilet paper which they were not too concerned about when we asked three times. The restaurant has a decent happy hour and great servers!", "date": "January 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r189556793", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "STAY HERE", "review": "Stayed here only 1 night.. But right on beach, clean and tidy room, nice staff, safety box, so cheap and near a few shops & resturants but about 5min walk! Good if you want a chill out. Overall nice experience & cheap! If ever in thailand again but return for short period. ", "date": "November 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r185031224", "sub_review": {"Value": 5, "Location": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 5}, {"title": "Unexpected quiet beach location", "review": "We originally only booked 2 nights , so we could move on if need be, but there was no need so stayed another 3 nights. staff, all very young, were extremely helpful and courteous.  As previuos reviewers have said the bungalows are jammed in, but they still remain private. The buildings are rendered concrete giving the place a bit of a spanish feeling, and great soundproofing. A coat of paint is needed inside but besides that these very small but adequate rooms are comfortably.  Both my wife and I slept poorly, but not sure why.  The matress is quite firm but comfortable.  It sits up on a concrete block which seems to work ok. Maybe the lack of sleep is a feng shui thing? The pool and restaurant area is very inviting to sit around abd the beach is well maintained by the hotel…", "date": "November 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r184199814", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 2, "Rooms": 3, "Cleanliness": 3, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Hammocks, beach and value", "review": "Easy going place to unwind on the  beach or in the hammock swings. Not too busy, not too quiet. Small adequate rooms. Great value for the cost. Good breakfast spread. Not far from the ferry arrival point. 30 pharmacies within a couple of kms (??!). Reasonable eating options. Kid friendly beach and pool. All very easy and relaxing.", "date": "November 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r184114131", "sub_review": {"Value": 5, "Location": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "tidy little beach hotel", "review": "We had a beachfront room which was pleasant, modern, clean and tidy but the bathroom is a bit small. I think the problem is that squeezed in between two other resorts, there was not much space to make the rooms and the gardens a bit spacier. The beach area is nice and there are lots of sun loungers. I didn't like the list you first see when you enter the room, with \"how much you have to pay when you break or lose it\", as there were no other informations at all in the room. The pool is a bit on the small side, but with the sea in front, it's not a big issue. Breakfast was better than expected (I probably don't expect much). I was amazed that the hotel was asking 350 Baht for the trip from Mae Nam (Lomprayah) Pier to the hotel as it's a mere 5 minute ride. Even the \"normal\" taxis,…", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r182785547", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Directly on the beach", "review": "We stopped in Beach Front Bungalow. These are only some steps to the sea. Very good place, magnificent sunrises here. It is a lot of pleasant restaurants nearby directly on a beach. The room very simple, concrete, but is all necessary, even a beautiful beach bag. The breakfasts is normal, the stuff too. Unusually pleasant and quiet place.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r182779356", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Peace and quite", "review": "Initially we booked only 1night, knowing we would leave Koh Samui the next day. When we came back to the island, we knew for sure where to stay our next couple of nights. We stayed both at a room and a bungalow, we liked the room better but they both were very pleasant. The beach is amazing! Clear water, not much people in sight. Breakfast was great, we also had dinner there that was very good. The staff was very helpful getting around the area. Although they don't have a 24hour reception service, someone stayed only to check us out at 4am. Motorcycle rental service is available and at a good price. The location is remote from Koh Samui's main attractions, but the fisherman's village is just 10min driving distance away. Travel agency is right at the end of the street, so are…", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r182343118", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Sweet hide out", "review": "This hotel was a pleasant surprise, as Samui can be quite silly with its value for the money. We lived on a neighbouring island and really enjoyed staying there whenever we would come to Samui. Its very clean, very friendly stuff who will give u a discount if they can. Its right on the beach, and as far as Samui goes its a sweet beach. Aesthetically its very pleasing and even swanky looking, white rooms, rounded edges, and super modern bath facilities. We always eat out, so cant say anything about the food, but in general while in Thailand its so silly to eat in a hotel, ever. The surrounding area is full of places to eat, massage parlours and its ideal for taking the boat to Koh phangan. Thursday is a steet market which is really one of the best we have seen. Its truly lovely.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r181677721", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good value", "review": "We spend here one day, waiting between flight from Phuket and boat to Koh Tao and it was ideal for this.  Located on the Beach,friendly staff and beautiful beach side with huge three providing shade for relaxed lying on the sun bends..............great value for $$$$.", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r180893122", "sub_review": {"Value": 5, "Location": 3, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Average hotel", "review": "Nothing special about this hotel. Average rooms, good, but dirty beach, average food. Breakfast is strange - very Thai style. We have tried to use included breakfast only once... But unfortunately couldn't eat it. We went to breakfast every day to nearest Hacienda Hotel.  The staff is below average. Especially I would like to mention reception guy - Ghandy. He is very crafty. Be cautious with him - despite of his smile he will put every extra dollar on your bill. For example if you late on check-out for an hour it will cost you 300 THB.  Rooms are never cleaned if you don't ask to clean.  All in all the hotel worth its cheap price. You buy cheap hotel - you get bad service. No magic here.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r179032297", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 2, "Service": 1}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Nice quite boutique hotel", "review": "We staid three nights on the standart room upstairs with sea view. Was confortable and nice. All what you need  the service was stuning. The beach was quite and nice beatiful. Area is quite. An europerean people. If you dont want parties and noice on koh samui .this is the place to relax.  We recomend this little hotel cause is quite and private and unique style.  And the food ia realy great and  the staff was friendly. ", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r178251180", "sub_review": {"Value": 5, "Location": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "Mixed bag!", "review": "As a couple, we stayed at Hammock in mid-september.   As far as value for money goes, this little place was excellent.  At the time, $AUD 33 per night including breakfast for a standard bungalow.   Breakfast was pretty good,  your choice of eggs made to order and all basic fruits,  cereal, toast, bacon, salad and an asian alternative (eg, fried rice), as well as filter coffee and tea were all a part of the buffet. Any extras such as a milk based coffee (cappuccino/latte) were extra to which was added to your room bill. All other meals we had during our stay were great and of variety between western and thai food.  As for the room well, it was a mixed bag. The rendered bungalows were adorable to look at. Each with a front porch or balcony,  complete with a table and chairs.…", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r177988450", "sub_review": {"Value": 5, "Location": 4, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Nice Boutique Hotel - Great Location", "review": "We stayed at the Hammock hotel for two-weeks, after evacuating the crappy hotel behind there.  The Hammock was great. We really enjoyed our stay.   We had one of the beach front rooms and it didn't disappoint. The room decor was well done, and had great character. Nice bright white concrete rooms. Minimalist in nature, good lighting in the rooms and comfortable beds.   We could roll over in bed and catch the sunrise.   The food was actually quite tasty, and well done. The breakfast was predictable and of good quality.   The internet quality was excellent. We enjoyed the town and could still get some work done.  The staff was extremely friendly, helpful and non-overbearing.   The beach in MaeNam is nice because it's not overrun. While the sand and water clarity isn't as good, the…", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r176712993", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very good original hotel at reasonable price", "review": "Located in Mae Nam beach in a quiet location. Some bars, restaurants and shops available in the area.  The hotel style is a little bit \"funky\" and really nice. We had a standard bungalow. The bungalows are close to each others but there are plants in between them that give a nice atmosphere. The bungalow we had had no view but it was very close from the pool and the sea. (there are however much more expensive bungalows with either pool or direct sea view).  Warm welcome with a drink from the friendly staff.  The bungalows are not big but the interior is well furnished. They have a small terrace. Silent AC. Bedding is good and bathroom is OK (not very big).  Safe, mini bar and flat TV in each bungalow.  Free wifi in the room/restaurant/pool area. Towels and beach towels provided.…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r175910437", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Very nice relaxing place", "review": "Very cute and small resort. The houses are small but perfect for two. The breakfast is very good. The beach is nice and quiet. The view is amazing! The only thing \"negative\" to say about this resort is that the small town is quiet and has not many bars/resaurants. But if you rent a scooter you can get around easy.", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r175271461", "sub_review": {"Value": 5, "Location": 3, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Best in Mae Nam", "review": "Stayed here for a week after a disaster of a week in another resort...friendliness and location of the place was awesome,great beach and choose a beach side bungalow. .the restaurant serves tasty,fresh uncomplicated food,staff friendly and helpful,rooms clean,stunning king size bed...what more can one ask for..will be back in 2015 :))", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r175110941", "sub_review": {"Value": 4, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Directly on the beach", "review": "Very nice hotel. Not too big, directly on the beach. Located in a more quiet part of the island, which is called Mae Nam Beach. Not like the noisy and busy Chaweng. You can easily rent a motor bike/scooter and cruise the island for 200 Baht a day (5 euro).   The hotel has nice rooms, especially the ones facing the sea. We stayed in the ones on the pool and they were great as well. The other ones behind ours were a bit packed on the other rooms.   The hotel did offer a great breakfast, although it was not included according to booking.com. And from the hotel you can go swimming directly in the sea, which is clean. No sharp stones or coral. Sand is a bit more coarse then in Chaweng but still fine.  Only point for improvement was the Wifi connection. This was not working most of…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r173038739", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Right on the beach", "review": "The best part of the hotel is that is right on the beach, you have breakfast watching the sea and this is great!  The staff is really nice and helpfull, the services offered are really expensive tough, compared to what you can find in Any othere agency in Mae Nam.", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r171048630", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great location and good food", "review": "Great location in the middle of Maenam beach...lots of beach restaurants nearby, but the food at Hammock Samui is really good, too! (We liked the glass noodle and the skewers). The rates were good and the room was pretty nice (the only downside was that there was very little ventilation in the room and it felt damp). Overall, we would recommend staying here!", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r169821294", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Greate lacation and sea view !!!", "review": "Hotel is located on the middle of Maenam. Great view to Koh Phan Gan and the sea. Excellent beach that is always empty. Easy to find free lounge. Good breakfast. Good service. Close to main restaurants and working street. But very very small rooms. It is worth to stay there. Great value for money.", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r169026017", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Stay here !!", "review": "Super relaxing, great location and nice staff! Stayed for 3 nights - comfy king beds and excellent wifi, staff were really friendly and helpful - the beach is beautiful - would stay here agin in a heart beat.", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r168375717", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Small beachfront hotel, good location and views", "review": "The Hammock is basically a 1.5-2 star hotel that has a great location.  As we checked in, no one helped us with our baggage which we had to drag through the narrow drive, moving laundry out of our way, and then pick up and carry to our room.  (I was expected to give the bellman a tip after that).  I am glad we booked a beachfront room, otherwise the rooms are very small.  Not good if you have lots of luggage.  The beachfront room does have a very nice view of the water and two private mats that you can relax on, or chairs that are less than 5 feet away.  Walking along the beach there is a great vender that sells fruit and grilled corn.  The breakfast is nothing to rave about, but it was free and was a good snack before we began our day.  The bar’s mixed drinks are so-so.  The…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r166225134", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "fantastic location on quiet clean beach-gentle sea, smiling staff, small new resort.", "review": "My daughter and I booked this hotel online after checking a few websites including TripAdvisor. We chose Mae Nam beach  for its reputation for being quiet and Hammock Samui Beach Resort for its good deals When we arrived in mid March, we were upgraded to the Beachfront Bungalow as the one we booked was taken. This Beachfront Bungalow was one floor up which was a little difficult for middle-aged me but the view was really spectacular.The only major drawback was that the drains from the toilet did not seem to work properly and there was a stench when we arrived. This was rectified with chlorine bleach poured into it. But this had to be done regularly during our entire stay.  We paid and stayed for a weekend and breakfast was part of the price. It was a good, substantial breakfast.…", "date": "March 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r166203284", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Cute little one", "review": "I was there with my boyfriends for 2 nights for a short vacation in Samui. We've never been to Samui before so had no clues where was the hotel and found the staffs were very helpful giving direction. Finally we got to the hotel by our car and found out there was no space to park my car. Anyway, the room we're in was lovely - it was a P-02. The shower curtain is a pain coz it would wrapped you up when you were showering. Rain shower was best! I love it. :) The swimming pool is too small and it is too close to the reception and the restaurant so we were too shy to swim there. The beach chairs were nice, the beachfront is lovely. The food and a quality of breakfast buffet is fair. Not fault for booking this hotel.", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r164547571", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Finally! Quiet paradise!", "review": "After a week in noisy Bangkok & Chiang Rai, I was desperate for quiet sleep & was glad I chose Mae Nam over much noisier Chaweng.  Resort: stunning view on beach, good breakfast, nice staff (thank you Gandi for everything!), clean, smallish room (ie not big enough to do a workout), but hot water (took me 3 days to figure out how to get the right mix of warm on the taps), they provide beach bag & big towels, DVD movies, kettle/coffee in room, frig, AC (unfortunately couldn't change angle so sort of blasted the face at night & have to pay more to leave on while out), little deck. Grounds are adorable, leafy path to bungalows, well-kept, tidy, thick but plentiful pillows. The best: soooo quiet! They have strict noise rules so utterly silent by 9pm. Bliss! Reception \"closes\" at 11…", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r161952774", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Poor management.", "review": "Couldn't find the place. NO SIGNS AT ALL. No parking. When we asked for an extra bed they said: sorry no housekeeping. They also said we are not allowed to have an extra blanket. What kind of management allows policies like this? Luckily the gentleman at the front desk gave us some blankets later on. Sorry to say but the food was over priced and deep fried from frozen. After a seven hour journey with four kids in the car this was an absolutely appalling experience. Never again. ", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r157596275", "sub_review": {"Value": 2, "Location": 1, "Rooms": 3, "Cleanliness": 2, "Service": 4}, "travel_purpose": "", "rating": 1}, {"title": "Lovely Little Place, tucked away in Maenam Beach", "review": "First of all, we would like to say thank you for choosing The Hammock Samui Resort and for sharing your experiences from The Hammock. We all value our guests reviews and use it as an effective tool to do our best in improving our services.   Generally, maximum number of person for accomodation on the room category you have booked is for 2 persons only. Children below 5 years old are free of charge if utilizing the same bed as the guardians. Children above 5 years old, normally, are charged additionally with extra breakfast only. But if it were 4 persons stayed in 1 room, we would normally charge the guests  with an extra bed which we heard you did not agreed with, and the request was made at passed 10 in the evening, which our housekeepers are already off duty.  We do our purchasing twice a week, and since we only cater to a total 26 guests rooms, we don't normally purchase a lot and we priced them reasonably and comparably to others. But we respect your opinion about it and we will certainly  try our best to do better.  We are also sorry if the signage at the main road and on the next street are not visible enough, but mostly, our guests gives us calls to ask for further directions, or if not, we send someone to go and pick them up to the point where it is easy and convenient for them.  Again, thank you for your review, we will take this review seriously to do better in the future.", "date": "March 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r156358454", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Nice quiet hideaway", "review": "We stayed at the Hammock Samui Beach Resort for 7 days and nights from 2 Feb 2013, our aim was to use it as a base to tour Samui Island, which we did. We were in a beach front room and had an extremely good experience. The staff were very friendly, breakfast was buffet, eat as much as you like. The hotel  is a series of concrete huts making up rooms, our room was a decent size but we had the high end choice. Our room was right on the beach with views of Koh Phangan. Maid service was very good, clean towels every day. We ate in the restaurant 3 evenings and I must say that the European food was excellent, I didn’t try the Thai food because the other 4 evenings we ate out in Samui. The only down side for me was that I hired a car and this hotel doesn’t have a car park, but they do…", "date": "February 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r154924008", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A small boutique place, nice details!", "review": "We enjoyed staying here in Mae Nam Village, at the Hammock. A trendy place, good value for money. The rooms are a bit small but comfortable and they have even a nice beach bag for the beach towels. Staff friendly and helpful. There is a computor with free internet to borrow in the reception/bar area. Cool red bean bags to chill in by the pool. I never saw anyone use it, but for children it might be good and it looks nice! Thursday evening is the Walking Street in the village. Go there! We walked along the beach 5 min to the right to Moonhut Bungalows for lunch as we had fiends staying there. Their food was always delicious. We had dinner once at The Hammock which was also good. The breakfast was a bit poor.", "date": "February 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r153613137", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Perfect, loved out stay here", "review": "After spending 4 days in patong Phuket the hammock was a nice change, all the staff here are super friendly and this made our stay amazing.. I really don't want to leave, the beaches are beautiful and by far the best food I have had on our whole stay in Thailand.. Can't wait to come back :) ", "date": "February 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r152499958", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Hammock by name hammock by nature!", "review": "So relaxing! Away from the hype of Chaweng this is a real Haven in Samui. Modern minimalist decor, beautiful location, excellent breakfast, staff who just can't do enough to make your stay more comfortable yet are not in any way invasive. I intended to arrive here on Friday night but unfortunately missed my ferry as such arriving at 7am the following morning. My room was ready straight away on arrival. I pre booked and prepaid my accommodation and it was entirely my own fault however the staff kindly offered a late check out free of charge until 6pm Sunday when I depart for Phanang.  In addition to all mod cons, rooms come complete beach bag and beach towels. They really seem to have thought of everything, the extra little touches make for a very relaxing stay!", "date": "February 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1182465-d3824768-r151271219", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}]