[{"title": "Goodbye", "review": "I am afraid we too are saying goodbye. We have stayed at this hotel more than ten times including two Christmas and New Year So unique ....glorious pool, beach villa over the sea, empty real beach, little village and local restaurants just a pleasant walk away. So quiet no pool music ...fabulous. However this was all years ago......unfortunately no investment and each time we returned the hotel had become poorer. Our last visit was March 2018 and we decided, so reluctantly, that we could no longer stay where so much does not work or function. So so sad this was a unique find, kept it a secret to myself. Alas the dream is over.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r704914551", "sub_review": {"Location": 5, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "", "rating": 3}, {"title": "3rd review - time to say goodbye ", "review": "We decided to wait until today to write this review as we went yesterday to see this resort again. We stayed 3 times in this resort since 2013 therefore we know it well but unfortunately we have seen it going downhill year after year. Our last stay was January 2018 and we decided that we would not come back.  The lack of maintenance is a real shame as the architecture of the hotel, style of the rooms and location are unique. When we visited it yesterday we noticed that they repaired parts of the roof and part of the beautiful exotic wooden floor but still this is not enough. The pool didn’t look clear at all, sun beds in need of TLC, facades in need of painting, etc. It looked like a ghost hotel.  We have seen through the years a massive reduction of staff and although those currently employed are really doing their best, they cannot save the hotel. It is a real shame as this place could be amazing as it was in the past. It needs investment but this is in the hands of management.…", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r641530792", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "RUN DOWN, HAUNTED HOTEL", "review": "My partner and I planned a romantic two-night escape following a dentistry trip to Bangkok, and this haunted hotel, horror movie setting nearly ruined it.  The Andaman was so bad that we did not spend more than one hour there and found alternative accommodation in a far-superior 3-star down the road. The owner is over-bearing, the staff do not speak any English, and although we were one of only two rooms booked out of 80, they somehow managed to send us to the wrong room.  The place was messy, dirty, run-down, and eerily quiet.  Not one of the internal phone lines to reception, restaurant, or spa was answered despite trying for 15 minutes nonstop.  The wifi did not reach our suite. Our ‘Beachfront Villa’ was behind two other beachfront villas, which were completely closed up.  There were water stains down the walls and on the ceiling, no privacy from the resort walkways, holes in the floor and ceiling, and some light switches could not be found.  The infinity pool could not be used, it was green, smelly, and with numerous broken patches of tiles throughout. The owner personally greeted us on our arrival, and then, upon seeing that we were leaving, bad-mouthed our accommodation alternative.  While the Andaman may have been 4+ star at inception, it has clearly never recovered from the 2004 tsunami, in which it was marked as ‘Closed until further notice’.…", "date": "November 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r559460505", "sub_review": {"Value": 1, "Rooms": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Worst experience ever in Thailand", "review": "Very bad experience.. This is suppose to be a 4 star hotel..!! It’s more 2 star. It does’nt fit the description at all! The bar inside the hotel is closed and empty for everything, the pool restaurant we could’nt get soda or icecream. No one here at this hotel speak english at all, even the reception. so we can’t communicate with them. we have ben many times to Thailand, never experienced anything like this..! The rooms smell very bad of moist/mold and the fitness is impossible to use for the smell and dust/dirt. The hotel is in very bad condition, missing tiles and holes everywhere, missing paint. There is no children club og any entertainment at all, no shop or anything to do. The breakfast is really poor and not very good. Worst in Thailand ever. We have ben in Thailand more then 15 times.   …", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r551958546", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Overrated Hotel", "review": "We might have a wrong expectation, but here are our comments: We had a Beach Villa and have never been so close to the water/beach,but this is also the most positive we can say. Had dinner at the sea restaurent and got almost frozen spring rolls- that is a no go. The pool look \"green\" and we just tried it one time- that was it. we saw staff cleaning the 3 upper layer by a brush , just wonder , was it only to have the pool LOOK FINE ? Our Beach Villa are supposed to be the best, but there was 8 spots hanging free our of the roof and we do not like such things - safey and risk for fire are high if not correct handled. There was not wifi at the room ( this are noted , but we are in 2016 and also a must by now at ANY Hotel ) The beach was find and we did a lot of walking . Staff did not speak english very good , this is sometime of course a part of this, but even in the reception the english was very poor. not acceptable.…", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r468081407", "sub_review": {"Value": 2, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Excellent Stay!! Very Nice and Peaceful", "review": "Great stay, it was really nice to be there.  the staff on the beach restaurant were excellent and helpful. BUT, please do something with the mosquitoes on the beach, especially dinner time. You need to get some repel for clients because when we asked for something there was nothing to provide. The room (villa) I stayed are quite old but still looking good, just some painting, renovation and will be good to go.))Mosquitoes net would be nice too (in the room mosquitoes are not that big deal)", "date": "January 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r461375611", "sub_review": {"Location": 5, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "pure paradise", "review": "I think thus is the best place for couples i ever been. Tremendous swimming pool, fantastic rooms, nice staff and good quality of food.  No entertaiments - all i want for the rest. Best place ever - no noise and no nervous.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r432069430", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A vacation in the Paradise ", "review": "Beautiful nature, excellent rooms (large and decorated in the national style), good breakfast. There are a couple shops and restaurants, a fruit shop, an excursions shop and Thai massage nearby. The best thing is that there were very few people on the large territory and on the beach. It was possible for me to be on the beach and don't see anybody around. The only thing I can complain about is poor wifi in the rooms (it worked normally only in the lobby). ", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r404358816", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Avslappnande hotell i vackra omgivningar", "review": "After reading reviews on TripAdvisor, I was a little apprehensive about the standard of this hotel. My fears were ungrounded, It was very good without anything to complain about. The staff were polite and friendly without being obtrusive. The room was big with a balcony overlooking one of the ponds, the gardens and a distant view of the sea, no complaints. The hotel had quite large grounds with many plants and trees and was situated 5-10 minutes walk from the harbour town with it's 2 restaurants, 1 bar (very good, thank you Anchelee!) and 2-3 shops. The fact there was not so much there was not a problem for me and in any case you can easily find out about these things before booking. Best about the hotel was that it was peaceful and quiet which suited me. The least good was that…", "date": "January 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r348079529", "sub_review": {"Value": 4, "Location": 4, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Week in the villa", "review": "I stayed there 2 times. I was wondering what has changed over the past 3 years. Below my findings: poor English skills of people in the reception – still the same; internet – only on PC in the lobby, still no WIFI; only 1 out of 3 dirty PC in the lobby working – all PC working but still very dirty; boring breakfast offering for European only eggs, toasts, milk and corn flakes – still the same; terrible music in the lobby and during breakfasts – even worse with additional Chinese “hits”, but from the other hand: dinners in hotel restaurant – with lower prices and still the same decent quality; quiet place with not too many guests – still the same peaceful atmosphere; garden and swimming pool– still well maintained; no music on the pool – only me, good book and the birds singing.…", "date": "January 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r347076641", "sub_review": {"Location": 5, "Rooms": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Fantastic holiday for our family", "review": "Beautiful place. Fantastic staff and surroundings. Very helpfull and polite employees. They even gave us a complimentary dinner on our last evening and gifts to our children. Good food and nice pool area. Highly recomended for both couples and families. Really quiet and nice accomodation. ", "date": "February 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r343614423", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Amazing", "review": "Been on Andaman Princess two times now, and im going back in January.  So pleased with the service, especially the people working down at the pool. Never had any bad expirience with anything or anyone there. Good food, and i absolutely love the pool! Even tho it could use some maintaince. Im totally in love with the place! Se you soon! 😊", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r309256018", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "WORST RESORT EVERRRRRRR", "review": "Don't stay here these people called the Thai police on us because they tried to charge us 200 Canadian dollars for laundry. We were I swear to you the ONLY PEOPLE in this entire resort literally 1 room noooo one goes here! There is nothing around here to do literally & no food to eat. We stayed here for 1 day 1 night and didn't eat ONE THING ! they told us because no one is around they don't have food. That there's a snack place down the street where we went to and they sell expired since 2014 chips! DONT STAY HERE!!!! nothing but trouble and problems to ruin your vacation here. they'll speak their language to you as if you speak it. HIGHLY PLEASE RECOMMEND you stay far away from this place.  And they don't even deserve 1 star!", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r306840789", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Avoid this worn hotel", "review": "Very tired and worn hotel that has probably had no maintenance for years. Me and my boyfriend booked this hotel for one week in february 2014, thinking it would be a grand and beautiful place. We were very wrong. Despite it being the peak tourist season in Thailand, the resort felt very desolate. When we first walked in the hotel there wasn't any staff to greet us, so we had to wait 15 minutes to check in. Not a good first impression. While walking around the hotel grounds we quickly noticed that a lot was wrong with this place; low maintenance, worn interior, water damaged floors, debris lying around the grounds (I could go on). The staff seems to have given up on this place and they're not making much of an effort to keep it clean and welcoming for the guests. The only other…", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r263263753", "sub_review": {"Rooms": 2, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Best avoided", "review": "Great pool, but that's about it. Rated as 4* but not the luxury stopover we expected from the seriously out of date website. Whoever owns this has obviously not been investing to keep it up to standard. Rooms fine but the wooden corridor outside had actually rotted through in a few places. Everything tired and the beachside villas looked like they were actually falling into the sea. Some building work on decrepit villas but nowhere near enough being done. Food average and seems to be a destination for mass Chinese and Russian package tours. Avoid.", "date": "February 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r258800240", "sub_review": {"Location": 3, "Sleep Quality": 3, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Still perfect", "review": "If you like peace and quite, an endless and almost deserted beach, or just want to cool it by a huge pool, Andaman Princess is the place. Choose between nice hotel rooms or one of the excellent bungalows by the pool, in the garden or on the beach. We recently had our second stay for two whole weeks, and this time we brought friends with us. On our last stay we complained about our wifi connection, but now it was fixed an ok. Staff is helpful and friendly, food is excellent both for breakfast and dinner. If you get bored it is easy to hire a bike or motorbike to explore the island, or you could go snorkling on Similian Island.", "date": "February 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r257817680", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "2nd time still happy", "review": "A very nice hotel, amazing location. The island is beautiful, the beaches are amazing. The hotel has improved the swimming pool. The water is clearer. Still a quite place. Breakfast is nice, different dishes everyday. The prices are really good. For the spa 90 min of happiness (oil thai massage and hot herbal compress for £20). This year they had an issue with the sea erosion, but they said they will repair everything at the end of the season. Still, it had no real impact on our holiday.", "date": "January 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r249283510", "sub_review": {"Sleep Quality": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely trip", "review": "I visited Andaman Princess Resort as my family trip at Koh Kho Khao. The staffs are helpful and friendly. The breakfast was nice, the prices is reasonable. I will definitely go back there and recommend this hotel to my friends.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r235969443", "sub_review": {"Value": 4, "Location": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Disappointing", "review": "Dear Saranya,  Greetings from Andaman Princess Resort & Spa!  Thank you for your review of our hotel and stay with us. We are happy to hear that you enjoy during stay with us and look forward to welcome you and your family again.   With best  regards,  Walaithip P. Director of Sales   Andaman Princess Resort & Spa", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r225567372", "sub_review": {"Location": 2, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled solo", "rating": 2}, {"title": "Perfectly peaceful", "review": "I didn't write this review immediately after my stay because I didn't think I could be objective. Now a year has passed, it's time to let people know about my experience at the Andaman Princess in summer 'green (rainy) season'.  I stayed 30 nights in July/Aug. 2013 - booked directly on resort's website - in a Deluxe Room w/breakfast and 'free' round-trip airport transfers.  A DISASTEROUS START - I provided my flight information when the booking was made. A week before arrival, I emailed the resort with my flight information and asked for confirmation a driver would be at the airport to pick me up. They replied in the affirmative.   When I arrived at HKT no driver was there. A Phuket taxi driver could see I'd been 'stood up' and 'attached' himself to me. I found the resort's…", "date": "February 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r194543124", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great escape", "review": "Stayed at Andaman in Dec 13 and had a great stay, the island is lovely and perfect for doing nothing. Our first stop in Thailand and just what we needed after Christmas stress. Located in beautiful garden. Stayed in appartment, but bungalows looked great. Rooms are really nice and what you can't expect from pictures. Good breakfast!   Service varies. It's very good at reception (however they did not have a map of the island) but at the Pool/Restaurant it's terrible. However staff leaves you pretty much on your own which suited us well (ie no pushy waiters).   Great pool and we also used the tennis court. Beach is not great so we stayed by the pool and on day at Hoppla beach. The hotel rents out mopeds for 300 Bath, would recommend a trip around the island but not much to see.…", "date": "December 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r190550739", "sub_review": {"Value": 4, "Location": 4, "Rooms": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "", "rating": 4}, {"title": "Brilliant stay on a paradise island", "review": "Your are welcomed into your room with \"welcome to your new home \" and this summarises your feeling. Beautiful room, attentive and discreet staff, peace and quite. We really enjoyed it. The spa is absolutely great and the prices are so competitive ( same as Phuket, Patong or outside the hotel) but with a feeling that you are the only customer. A kind of exclusive place. You can rent a scooter at the hotel for a day and explore the island, empty beaches. My only negative point is the quality of the water of the swimming pool, a bit cloudy.", "date": "December 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r189947567", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Tired hotel, quiet location", "review": "We stayed a week here, nice location away from everything and on a long beautiful beach with few people. Rooms large and well furnished but first room had water damage and mould, and it took a very insistent effort to get it changed. Pool was spacious and winding with various features, but water was rather cloudy and surface not cleaned well (hygiene concern, some rashes), also tiles were coming loose. Service was average, reception in general responsive and helpful. Nearby restaurants offered a variety of food, beachside places especially nice. In general would say facilities were built to quite high spec, but maintenance has sadly lagged and it shows in many ways. Note on transport - ferry service 5min across is with small boats, hotel has arrangement for free crossing on…", "date": "December 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r189687002", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 2, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Needs some serious tlc", "review": "We have just returned from this hotel, having stayed 5 nights. I think this once was a stunning hotel but is seriously beginning to lose its looks. What a shame. Staff were disorganised, when we arrived they couldn't find our booking, then they put us in the wrong room ( to our disadvantage), and it was only because we wanted to upgrade that we checked our original booking. Finally, in a garden villa which was beautiful inside but where we were located, to the side was what we thought an abandoned JCB and rubbish. We were amazed to see the JCB working on our last day so maybe some building work will be happening? Breakfast at best was chaotic, staff stood around looking helpless, tables were not re-set or cleaned. At the pool area at midday we were subjected to an eclectic mix…", "date": "December 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r189429069", "sub_review": {"Value": 2, "Location": 3, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "calmness", "review": "Nice hotel although some renovation would be needed especially at the pool area. Rooms are nice and large but description see view should be change for see oriented. The location if very peaceful and calm. Nice garden, very nice beach with sand and not many people. There are some nice restaurants 5minutes walk from the hotel and few shops. The hotel has nice and modern (as for the hotel) gym. The tennis court is there but the surface is very destroyed. The best travel agent girl name Mam is located between ATM and the harbour restaurant. They have competitive pricing and provide good service, including pick up from the hotel, boat travel, very modern minibus etc.  We had very nice holidays!", "date": "November 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r185195261", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Quiet,comfortable,beautiful", "review": "Excellent, we had Bungalow next to the swimming pool, it was  just10 steps to the swimming pool. Room was really big,comfortabe and clean,bathroom as well. Very quiet place, it is just fantastic place for relax. Food in the hotel was not very good we used to go to a restarant 5 minutes from the hotel, very cheap and very delicious. I recommend to rent a motorbike and get a ride through the island for example to the Sunset Restaurant, amazing. This place and Koh Kor Khao Island is for people who want to take a rest it is not good choice for people who are looking for \" night life\" and so on...I cannot forget to mention beach, just one word,VIRGIN.Architecture of the hotel is inspired by Royal Palace, it is breath taking.", "date": "December 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r160187982", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great place, luxury hotel...", "review": "Andaman is great. Beautiful oriental style with huge swimming pool, lovely beach with almost nobody around. So if you like idyllic scenery with not many people around it's just perfect. Standard rooms are clean and very big, with wooden floor, a bit old fashion style, nice bathroom and sea view balcony (top 3rd floor). Koh Kho Khao is an island but there is everything you need - shops, bars, restaurants, travel agents with many nice trips, bike rental etc. If you like to go to the other site it takes 7 min on the boat and it's very cheap (around 1euro both ways) We had great 2 weeks in that hotel and I will stay for 2 weeks longer if I could. Bar service isn't great and they charge itself 10% for service and extra 7% for VAT on the top of the price from menu, but food and drinks…", "date": "November 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r146029712", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Beautiful hotel, spectacular pool area!", "review": "The Andaman Princess is a really wonderful hotel done in a beautiful royal thai architecture. We stayed in a suite, which I believe is worth the extra money; the room is really spacious with beautiful carved and ornamented wooden interior, the bathroom is big with both a shower and a bathtub. Unfortunately, the beach was a disappointment to us. However, the pool area makes up for this; it is truly the most appealing and beautiful pool we have ever seen, the way it is formed together with the dark green tiles makes it look and feel more like a lush exotic river. Its design also enables the guests to find a somewhat private spot by the pool, something that usually is a major problem with most hotel pools. Also, the staff is really kind and helpful; lovely people! All in all, this…", "date": "January 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r133684246", "sub_review": {"Value": 4, "Location": 3, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Andaman Princess", "review": "This hotel could be and probaby once was amaizing, sadly it is obvious that there is a lack of funds to maintain the hotel and grounds, there would seem to be a lack of water too, the shower in our beach front bungalow was very weak and the water luke warm at best, none of the fountains were working the pool was at least a foot lower then it should of been, and the showers around the pool no longer worked. Such a shame as this could be an outstanding hotel, its location is perfect close to the harbour the pool is huge and affords everyone their own bit of privicy, however i cant see the resort improving anytime soon and would only expect to see it sink into further decline. Sadly the price of the rooms does not reflect this and they are still quite expensive, although we…", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r127501725", "sub_review": {"Value": 2, "Location": 4, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Andaman Princess", "review": "The hotel is beautiful, but it is run down. The pool is amazing, it is so big. When we booked, the website said there was 5 restaurants. Although only 2 were operating when we arrived, one for breakfast and the other for lunch and dinner. The bar area has been turned into a library/ sitting area( hardly any of the reading material is in english). I would recommend walking to main street to get dinner. It's cheaper and there is alot more choice. The staff are friendly enough, but they aren't very helpful and they only speak limited english. Make sure you ask the hotel how much you should expect to pay for the long tail's to and from the island. The drivers try to rip off westerners. The hotel is perfect if you are after a quiet and relaxing holiday.", "date": "March 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r124450473", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Second time even better", "review": "We spent 10 thoroughly enjoyable and totally relaxing days at The Andaman Princess from January 10 to January 20. Although the resort was close to full it never once felt crowded. We had booked a garden villa and found we had been upgraded to a Pool Villa which was a fantastic surprise, the villas are well worth the extra expense as they are like a small house with a totally seperate living area and bedroom.  Each room, including the bathroom is huge, the bedroom easily accomodated an extra single bed for our son and could have fitted up to 3 extra beds if necessary.  The buffet breakfast has a wide range of choices and the staff re-fill your coffee or tea very promptly. As stated in my previous review, the highlight of the resort is the magnificent huge pool that meanders its…", "date": "January 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r124129619", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Once was – is not any more !", "review": "There is no doubt, that when Andaman Princess opened is was supposed to be the flagship of koh Koh Khao. Probably  the Tsunami in 2004/2005 sat the hotel back  enormously. And the fact is that is has never recovered ! The hotel is worn and all over you see the signs of lack of money. From  the broken  tiles in the pool, to the fountains without water. From the lack of pool towels to the shappy looking pool bar. From the dirty beach area to the sad empty  reception area. It’s actually very sad! We had a feeling of visiting a hotel in the end of a season, right before closing down, even though we were there in the absolute highseason. We spend 4 nights from jan 05.2012 to jan 09 2012 and paid no less that 8200 bath  pr. night for a beach villa, and that’s a lot of money  and even…", "date": "January 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r122968455", "sub_review": {"Value": 2, "Location": 2, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Nice hotel if booked as a last minute holiday....", "review": "Very nice, if a little bit run down hotel, with friendly staff. Very clean and nice rooms with ok views. Speaking with the staff is mostly only possibly through common hotel sentences, as their English isn't that good. (Conversation not possible)  Extremely large and spacious pool. (by far the best feature of this hotel!) Maybe a bit shallow for a 1.94m bloke :-) It's only 1.50 meters,.... if they remember to top it off once in a while.....)  The gym is a mess. Don't bother bringing work out clothes to this hotel, the equipment is lacking, not very well maintained and the whole gym is not very inviting. We took long walks down the beach which is also very nice.  Absolutely no room service.... (Why???)  If you're visiting off season, prepare to stay at a hotel where the…", "date": "November 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r121380796", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Couldn't fault it, looking forward to staying gain in 2012", "review": "Me, my husband and my 9yr old son stayed in a garden villa from Jan 3 until Jan 10 2011 and we totally loved it. The villas are designed in traditional Thai style with vaulted ceilings and are huge and very well appointed. The lounge/kitchenette area, seperated from the bedroom with a heavy sliding door, was excellent, especially as my husband is a night owl and I like to get up early. The extra bed and breakfast  for our son was free of charge (which is extremely rare). The bathroom was also huge and the spa had coloured underwater lights - very funny.  It was great value for money and we plan to stay next January for 10 -12 nights. The villa is tastefully fitted out and although it was advertised as a 'garden villa' it faced the sea towards Ban Nam Ken, we couldn't have asked…", "date": "January 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r97171872", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Nice hotel with friendly staff, in a calm and peaceful location", "review": "We stayed at the Andaman Princess Resort for two weeks, over New Years Eve. Travelled with our son, 1.5 yrs. Had a wonderful time, peace and quiet, and the staff was fantastic, especially with our son. The hotel pool, and the surrounding beaches, are perhaps not the best for a toddler, but it was ok.  If leisure and relaxation is what you are after, Andaman Princess is a great place to stay, and the villas can definitely be recommended. The hotel was pretty fully booked around New Years Eve, but it never felt crowded.  We generally dislike staying in the same place for as long as two weeks, so during the second week we got a little restless and made a few trips into Khao Lak, both daytime for shopping and evenings for dinner variation. The food at the hotel is alright, but…", "date": "December 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r94019767", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "We returned for a second visit - and loved it still!", "review": "Two years ago we stayed at the Andaman princess resort for 2 weeks over Easter and left with a wish to return (see my review dated May 2008). This Easter we used the excuse of celebrating an anniversary to return with our family, and we were not disappointed!  Last time we were two adults and three children (aged 2, 5 and 10). This time we were thirteen! That is: seven adults, (me, my husband, my mother, my father, my sister, her daughter (aged 23) and my sister’s husband) and six children (aged 4, 7, 12, 6 months, 6 and 10 years).  Unfortunately for different reasons we have not been able to write a review before, but better late than never. The big rooms, the beautiful bungalows, the magnificent pool area, the quiet atmosphere and the friendly employees were still as we…", "date": "April 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r89680630", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "peaceful resort", "review": "the hotel had just opened a week previous to us arriving and coupled with low season was serenly peaceful and tranquil.after a very smooth check in was pleasantly surprised by the large room with what looked like a new refitted bathroom and a well stocked mini bar at reasonable prices.the hard wood flooring had such a shine you could literally see your reflection in it. the grounds of the hotel are large with a multitude of wildlife to keep the camera clicking away at regular intervals.the large swimming pool provides more than enough room to find your own space.the staff at the hotel aim to please and always succeed regardless of what you may require. so to put it in a nutshell if r&r is what you are after this place will take some beating!!", "date": "October 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r86285504", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Just loved it - we are going back this winter!", "review": "This is such a beautiful and quiet place.  After 10,5 hour flight from Oslo to Phuket we got on the bus which in about two hours took us to Koh Kho Khao ( a short trip with a  short longtail boat trip included).  Everything went very nice and smooth, and when we arrived to the hotel, we were greated by the staff with a drink and some information.  Our room on the first floor were very nice and spacious.  Beautiful bathroom with a bath tub and shower.  The balcony was quite small and very hot!  So when we are going back in February 2011 we have ordered a sea front villa.    The first night we had our dinner at the U thong restaurant at the hotel, very good food there.  Hubby had a pine apple shell filled with pork, rice, peanuts and vegetables.  Nice and yummy,  The service at…", "date": "February 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r85623964", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A fantastic hotel, on a fantastic island", "review": "We stayed here easter 2010 - and it was perfect. Cozy, quiet, relaxing, fun, active and over all: excellent.   We stayed in what is called a bungalow in Apollos webpages (Norwegian travel agency). This was a huge, clean and very well kept house, with a fantastic jacuzzi in the bathroom. If you go here, I absolutely recommend the bungalow. It cost a little bit extra, but it is worth every penny.  The staff is nice (not all of them are good in english, but still), very helpful and positive. The bungalow was clean and beautiful, great service, and a great location on a quiet beach.   We even went out to party on a local bar, next to the hotel one night. A lot of fun, with Thai karaoke. The Koh Kho Khao-island is not made for partying, but it's possible to have fun there.   My…", "date": "April 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r61617443", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Pleasent stay", "review": "Stay for two weeks in mars at the Andaman Princess Resort & Spa. I was travelling by my self, but my daughter and her friend whos be travelling around in Asia for two months spend a week with me. The staff was very friendly and it was no problem to get a room just beside me för my daughter and her friend. The hotell was quiet and calm. I have a deluxeroom and the bed was great.  The balcony was small but OK. The poolarea was great and just a few step down to the beach. I take a walk at the beach every morning and lunchtime and just meet a few persons  -you have the beach for you own. The restaurante was not so good. The breakfastbuffé was OK, but i have eat better in other places. I always at knight go down to the harbour and eat lovely dinners in one of the restaurant. Cheaper…", "date": "March 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r60815023", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Romantic, beautiful, not too crowded, the perfect vacation!", "review": "My boyfriend and I stayed at this hotel for 2 weeks. When we first got there, it was evening. I was sceptical at once, because I didnt see any other hotel guests. But the next morning it was people eating breakfast, people at the pool etc, so I didnt feel \"alone\" after all. I guess the only reason we didnt see any people the first night, was that people were out eating dinner. We only ate dinner at the hotel twice, but figured the food were better other places, and also half the prize. I also like eating other places than the hotel all the time, it's much nicer to go out and see other people! The staff at the hotel are really nice, good service and always smiling. I've never seen such a great pool before! It's huge, and just perfect with all the palms and plants all around. Its…", "date": "March 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r59724198", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Wonderful Holiday", "review": "We stayed in this hotel for two weeks,everyone was so friendly,smiling and even some staff cant speak english but still they are trying their best to communicate to everyone...it was a very quite and good place to relax with..next year we will come back and bring the whole family, and the thing that we observe is there are a lot of complimentary in this Hotel like free internet use for 24 hrs.,free dvd,fitness,tennis and the trips prices are really affordable..and also if you go with dinner there are this band playing,  they sing nice,and at their age they know a alot of songs from 60's to present, and also there are some nights with a buffet and thai shows,foods are great!We can't wait to come back again..", "date": "February 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r56539581", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Secluded island (nice), just OK hotel", "review": "I have had friends staying in Koh Kor Khao before (in KKK Beach Resort), whispering to me that Andaman Princess is the ultimate luxury hotel in Koh Kor Khao,  Well. I have stayed in one or two 5* hotels and resorts during my relatively short life, and no, it's not good enough for this price level especially in Thailand.  It might be the best resort on the island, but luxury it is not. Breakfast: Average (kudos to the waffle stand!). Rooms: Enough space, but especially the 1xx rooms need renovation. Restaurants: Average. Staff hardly speaks any English (if you want to be a 4*-5* establishment, your people need to be able to speak English.).  Also, why did you ever use the lobby area as a restaurant (which happened half of the time of my stay, during Dec 23th to Dec 27th)? And…", "date": "December 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r54133092", "sub_review": {"Value": 1, "Location": 5, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Wonderful and Worth every penny !!!", "review": "I have been to many resorts in Thailand such as in Krabi, Phuket and Hua Hin. I must say that this is the best place I have ever stayed in! In addtion to the Andaman Princess resort, Koh kho Khao island is truely amazing with unspoilt nature.  I stayed at Andaman Princess for 3 weeks, with my husband, from 20 December 2009 onwards in the Deluxe Sea View Room. The room is very spacious at 45-55 s.q.m I think. What I loved about the room is that there is a resting area with a huge window where I can lay down and see the gardens and the landscape from my room. I would recommend to spend some time lying there in the night. The stars are beautiful.  Another thing that I loved about this place is they do offer free DVD movie rentals with more than 200 titles. Those movies offered were…", "date": "December 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r53905941", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Spacious, Spotless and Serene", "review": "Visited in January 2010 after a wedding in India on the way back to the USA. Although a bit of a trek (2 hours) from the airport at Phuket on an air-conditioned spacious hotel van (we arranged for transport in advance), the extra time was worth it.  A very authentic (as in basic) ferry  (#6 was the number on the boat) for a 10 minutes ride from mainland to the island where the hotel is. Golf cart took us from the boat to the hotel (3 minutes)  Beautiful property, well maintained and thoughtfully constructed. A welcome drink (well received) and a friendly welcome from the Manager. The front desk was always helpful throughout our stay.  Rooms were very spacious, comfortable  and immaculate.  Small balcony on our 3rd floor room with quick elevator nearby if we did not want to use…", "date": "January 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r53802749", "sub_review": {"Value": 4, "Location": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "The good, the bad and the ugly (and the excuses!).", "review": "Firstly, we have travelled all over Thailand on many visits and have stayed in everything from beach huts to the Shangri La. This resort has a predominantly Swedish client base and knowing them to be a discerning bunch and having reviewed the reports on TA we thought we had struck gold on booking this resort.   The Good. OK, so the people are delightful (as they are in most of Thailand), this may be a quiet, peaceful resort, with a nice pool, on a small, out-of-the-way island on the beautiful Andaman coast, but that's where it ends.  The Bad. I agree with the last reviewer from Kent, this hotel masquerades itself as a luxury 4* resort but falls a long way short. We stayed here for 11 nights during Christmas and New Year, we paid a lot of money for the best beach villa in the…", "date": "December 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r53614633", "sub_review": {"Value": 2, "Location": 2, "Rooms": 2, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Great relaxing place to stay.", "review": "Overall a great place to stay at a reasoanble price. I would recommend it to couples or families who are looking for a relaxing place to stay.", "date": "January 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r66168490", "sub_review": {"Value": 4, "Location": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "Awful", "review": "We booked in this hotel for 13 nights and left there  7 night earlier than should have, the service the cleaniness, the staff & the food wer not that of 5* as sold to me by the web site, i would give this hotel a max of 3*'s. Further videos and photo's will follow this report on my return to the UK, I have booked out of the Andaman and bookd into a proper 5* hotel in khao Lak, other booked out early too, ROG the manager has no customer service skills, his staff come from the mainland to get experience in the hospility trade then  leave before the monsoon season to work in bigger hotels in Phuket, please do not vacate to this location if you have stayed in a 4 or 5* hotel before, you will be bitterly dissappointed, further reports from over the xmas and new year period will soon…", "date": "December 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r52764164", "sub_review": {"Value": 1, "Location": 4, "Rooms": 2, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "24 golden hours every day!", "review": "Excellent accomodation and service!  A hidden and yet luxurious gem on a truly genuine thai island without mass turism.", "date": "December 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r52294003", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Thanks to all of you", "review": "The staff was excellent. Best service ever. You all made our holiday perfect. Smiling and nice people everywhere. This is paradise.  Cons: - free wired internet in dedicated room, but no wireless in rooms or lobby - cold water in the shower", "date": "December 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r51935953", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Wonderful hotel", "review": "Andaman Princess is a wonderful hotel. I always come here with my guests from Germany. Everybody enjoys it and they don't want to leave. Great food, very friendly and helpful stuff, a lot of extras for free, a long beach, spacious rooms. It is a wonderful place to stay and have a good and relaxing time. Go for it!", "date": "December 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r50622818", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "A Hidden Gem ---on a secluded Island", "review": "We wanted to avoid the usual tourist spots hence through lot of research settled on this place.  The taxi takes almost like 1.5 hrs to reach Baan Naam Khem Pier  from Phuket Airport ( Since its a small area ask the taxi to go past Kho Lak -which is a major spot with lot of resorts etc .)and once at the pier call up the hotel or inform them from the airport itself and they will arrange for a boat to transfer  to the resort . We later realised that if we had asked the hotel to send us the cab it would have been cheaper as from Phuket it costed 2000 Baht to reach the pier and the hotel charges 1500/- once way. to the airport in Phuket..!! We stayed for 5 nights. The resort is a luxury resort with a great look and feel to the whole place exactly as its there on the website ! Rooms :…", "date": "October 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r49161849", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Three weeks of total relaxation", "review": "We came to Koh Kho Khao and had no idea what it would be like. We found a lovely, quiet place and came to a beautiful resort  with flowers, lovely staff, bungalows with lot of space and built in a nice architecture. People talk of the special sunsets in Koh Kho Khao, and they really are. An enormous orange sinks into the sea. You can become religious, if you not already are. If you go to the very north of the island, it takes about 40 minutes by motorbike, you can find your own beach.", "date": "January 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r25912960", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Wonderful high quality getaway", "review": "Found this hotel while surveing the coast line north of Phuket on Google Earth. Surprised to find this little pearl on the Island of Kor Khao.  We were at first at little worried about going to an island so fiercefully hit by the tsunami four years ago. The hotel was to be opened for the first time  30th dec, but only five days before the tsumani hit.  I guess others have been worried to because the hotel has struggled the first years.  We asked frankly about this and were eased by the answer. The hotel is built from stone and all buildings remained standing after the tsunami.  Of course they were damaged and most of the hotel had to be completely restored before opening a year later. Water came to one meter over the lobby floor. The  hotel floor over the lobby level is big…", "date": "February 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r24328915", "sub_review": {"Value": 5, "Location": 4, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely place", "review": "January 2009 We were two weeks guests at Amandaman Princess Resort & Spa in January 2009. We had been accommodated into a fine shore summer house. When one stepped out from the door, you  had the possibility to chosen to swim in the sea or in the pool. The pool was splendid, with its palms and basin which was shaped beautifully and ended in a big basin. The pool and the area was the biggest which we have seen. The care and the service were first-class and extremely versatile and tasting food. I recommend the place to such which want to have a peace and rest ones. There was no music playing in the outdoor areas anywhere and the shore was a nature reserve and all water scooters and other devices which produce noise were forbidden. Salespersons was not seen either.  On the outside…", "date": "January 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r24052801", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 4, "Rooms": 5, "Cleanliness": 4, "Service": 5, "Business service (e.g., internet access)": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Nice and quiet", "review": "We stayed in the main building in a \"standard\" room, which was realy nice for a family of four, with kids 7, 8 years old. I would go for a bungalow next time they are FABOULOUS.  The pool area in fantastic. Nice breakfast and fantastic staff, always present but never in tha way or pushy in any way.  We didn't use the hotel-resaurant more than once in the evening and was not all too impressed. However it is close to the pier (A 5 min walk) were most of the rest of the resaurants on the island is placed.  The beach starts in one end of the hotell and runs for 20 km north. No risk of any crowds at the beach. The personal space on the beach is about 100 m....", "date": "January 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r23652283", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 4, "Service": 5, "Business service (e.g., internet access)": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Very nice Hotel", "review": "We was arriving in Christmas Eve and was met by the hotel staff at the pier and was droved up to the hotel, the in checking was great everything was prepared before so it was very good. The room was excellent we lived in a ”standard room”   which was big and perfect decorated in a nice Thai stile.  The day after we had a delicious breakfast with a view out over a fantastic pool which end up in the sea (just as a computer manipulated picture). The food in the restaurant was delicious; I recommend the red snapper with white vine sauce, one of the best I have eaten!   The pool is very big and beautiful, and if you don’t want to be there you only have to go 100 m to the beach and then you have at least 5 km empty beach to walk or just be on and you are nearly alone. Everything at…", "date": "December 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r23628875", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great Place !!! Will be back next year", "review": "Reserved the room through a travel agent as part of charter/hotel room package for my family of 4 at a duration of stay of 21 days. Arrived on 15 December 2008 in the evening.   Upon arrival, I was greeted warmly by the staffs and of course a standard welcome drink. After a speedy check-in, I was escorted to the room that I had booked, which is the Deluxe Seaview Room (room 311). Great room with nice balcony and a large bathroom. The decoration is is very nice giving a very Thai feeling.   As it was already quite late when we arrived, we booked a table at their restauarnt (can't remember the exact name). The menu is moderately extensive and the price is quite cheap if compared to other hotels. My wife and I each ordered the Pork Chop set and 2 children decided to try the thai…", "date": "December 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r23392829", "sub_review": {"Value": 5, "Location": 4, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Amazing Experience", "review": "We stayed as a family of six, ranging in age from 15 to 57. It was a beautiful hotel, with stunning surrounding landscaping.. The Island itself was tranquil, but had everything you needed. The food was amazing, and breakfast would see you through most of the day. The pool was beautifully laid out, and surrounded by fragrant blossoming trees. The beach was good too. There was plenty of entertainment laid on in the evenings, ranging from gentle music or traditional Thai dancers, to 'Elvis'. The rooms were large and well equipped, and we felt had a certain 'wow' factor, as did the enormous reception area, with a view across water right down to the sea. Probably the best thing was the staff, who were without exception, lovely.  It isn't the type of place to stay if all you want is…", "date": "December 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r23367003", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Perfect vacation in harmony and beauty!", "review": "Recently came back from Andaman Princess with lovely memories and a rested body and soul. It was my first trip to Thailand and my expectations were well met up! Pool = GREAT!, SPA = WOW!, Villas by the sea = I was speachless! Beach - YES!We stayed in room 916 just by the edge of the water, the sea was rocking you to sleep and a welcoming turquise picture in the morning. It is true that the beach is not wide, but it is at least 5km long and most of the time nobody at all. (most people stayed in pool area) It was a nice contradiction to stay at a modern, clean, yet very thai decorated hotel, just beside a deserted beach! The sand was light and fine grained, some larger rocks here and there, just as a natural beach should look like. One thing to say to bring justice to the bad…", "date": "December 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r23305534", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Magnificent pool, birdsong and solitude", "review": "We, a family of five (me and my husband and three children aged 2, 5 and 10), stayed at the Andaman Princess Resort for two weeks end of March 2008. We had booked the hotel as part of a tourist/charter package. I had also read the reviews in advance and was very curious. We were very positively surprised. The hotels architecture and the swimming pool are even more beautiful than depicted on their internet site. The pool bar was open 10-18, with towels available. The lobby is impressive and even the lavatories in the lobby area was a sight . In contrast to previous reviewers, we loved not being part of a crowded tourist machine with entertainment and noise at night. We did not miss the beach as we used the amazing swimming pool extensively , and had a two days /one night trip to…", "date": "April 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r16203058", "sub_review": {"Value": 4, "Location": 4, "Check in / front desk": 3, "Rooms": 5, "Cleanliness": 5, "Service": 4, "Business service (e.g., internet access)": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Hmmm - this place has no soul... Sure this hotel is in Thailand?", "review": "We were planning on staying 5 nights at this hotel during our tour through the South of Thailand. Left the hotel after 2 nights. The island is very secluded and does not really look and feel like the South of Thailand. Beach and ocean is ok, but certainly not outstanding (especially compared to the Phuket, Krabi and Samui regions). The hotel itself does not have any beach as it managed to destroy all nature with a horrible and huge concrete wall - looks like the container pier in Dubai and somewhat reminds you of a military camp...  This was a very very strange place. Although practically everything was fully booked in the South of Thailand during that time, this place was empty. We booked online but once we got there nobody was aware of our reservation. Then it took 2 hours to…", "date": "January 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r13883335", "sub_review": {"Value": 2, "Location": 1, "Check in / front desk": 1, "Rooms": 4, "Cleanliness": 2, "Service": 3, "Business service (e.g., internet access)": 2}, "travel_purpose": "", "rating": 1}, {"title": "Honest opinion", "review": "I read all the reviews prior to my departure to spend New Year at the resort. I viewed all the online prictures and some of the negative comments resulted in me forming an opinion before we arrived.  Although they said the hotel was full, we never saw more than 15 people at a time. We had a villa right on the waters edge (916). Two days into the stay we decided to checkout and head to Phuket. This was no disrespect to the resort. The only negative is that it has no bech AT ALL and is pretty remote. We used it as a base to go rafting down the SOk ( highly recommended ) and to go across to Similan islands.  The staff were very good and the food was fair. Drink and dinner prices were a bit high for what you got and very few staff spoke any decent english.  All in all, this is not a…", "date": "December 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r12325446", "sub_review": {"Value": 4, "Location": 2, "Check in / front desk": 2, "Rooms": 4, "Cleanliness": 5, "Service": 3, "Business service (e.g., internet access)": 1}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Almost perfect", "review": "Summary: Beautiful hotel in a lovely isolated location ideal for a honeymoon.  More than a week could get boring.  Positives: Rooms first class, large, comfortable, luxurious, immaculate.  Whole place feels very luxurious. Restaurant food quality very good. Pool area very nice. Pictures don't do it justice. Service very friendly. Generally good but room for improvement. Lovely long beach pretty much deserted. Just as you would imagine. Prices for food and drink not bad (2 of us spent £250-300 in a week on lunch, dinner and all drinks) Quiet peaceful location  On the negative side: Restaurant menu is limited. At certain times the beach right in front of hotel disappears due to tide though access to the rest of the beach is still possible. This only affects the beach right in…", "date": "February 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r7545008", "sub_review": {"Value": 3, "Location": 4, "Check in / front desk": 2, "Rooms": 5, "Cleanliness": 5, "Service": 4, "Business service (e.g., internet access)": 2}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Not good-not 5 star!!", "review": "Check in ok and room fine, clean & spacious. Whole hotel looks beautiful but something definitely missing. Resort and hotel seemed totally deserted, encountered 1 other couple and then found out we were the only guests staying which made for a very souless and frankly eerie silence everywhere. I like quiet but this was deafeningly quiet. No fountains working around pool area to break the silence and pool bar /restaurant closed.  In our room no info on what to do, no room service menus or indeed opening time of restaurant, breakfast times etc. The restaurant looked nice but huge and with no guests would make for a very mournful dining experience. Asked at reception for a room service menu, waited 20 mins and rang again, eventually a menu appeared with a very limited choice.…", "date": "January 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r6654508", "sub_review": {"Value": 2, "Location": 3, "Check in / front desk": 3, "Rooms": 4, "Cleanliness": 3, "Service": 1, "Business service (e.g., internet access)": 2}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "If you are looking for a Spa - don't come to this resort", "review": "The hotel looks great when you first get there - oak floors and lots of fountains. Really beautifull. But there are some problems. I stayed there for one week during christmas 06. And during this time I had to complain about the toilet not functioning several times (ended with  my boyfriend fixing it in the end). I also killed a couple og cockroaches in the bath room. This was supposed to be the deluxe room....  This Resort and Spa has no spa menu - so if you want to have spa treatments stay somewhere else.  There where very few guests at the hotel - and so only one restaurant was open, and it had a very small menu. Can get quite boring since there are no bars and such on this island.  On Koh Khar Island there are no bars, restaurants or shops to speak of. Only one restaurant -…", "date": "December 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1956010-d506955-r6550851", "sub_review": {"Value": 3, "Location": 2, "Check in / front desk": 2, "Rooms": 3, "Cleanliness": 4, "Service": 1, "Business service (e.g., internet access)": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}]