[{"title": "Just be prepared. Read this review", "review": "I normally read a number of reviews before I start tapping away. Of those I read, although some good points I feel clarification is in order.  OK main point, very important. This is not all inclusive, at best it's full board with some free drinks for 12 hours. 11am to 11pm. Outside of these times you need to pay for anything, including coffee and water. Get used to this and it will be ok.  Meals:  The hotel is predominantly Spanish occupation. So the menu choices at the buffet are probably different to what you expected. The food is edible and varied but you need to be prepared to experiment. You won't see a lot of English cuisine. Breakfast is not great and the choices limited and often colder than required. But you can eat cold meats, cheese, yogurt and pastries. Plenty of fruit available. They need to up their game here a bit. But if your prepared is ok.  Pool: Not for children, no shallow end. No diving or jumping or any horseplay Very strict not much fun.  Entertainment: Same problem and the food. It's geared around local tastes.  Now very odd. They have various entertainment such as bingo, dance class and karaoke. Bingo you play for a small necklace about 2 Euro and a cocktail you must drink there and then.  Board games, now this is a puzzler.  You have a selection of board games but.....you can not play them in the  bar, you must go elsewhere. Very strange. But if you accept this it's ok.  Now the overall bit. The hotel is clean. The rooms are clean and well kept. The staff can be a little grumpy so what. They are working your not. WiFi.... forget it and don't pay for it. It's very poor.  Location. 20 mins walk from anywhere and a LOT of hills. But taxis are cheap and very quick to come.  It's a cheap holiday in a back street. It's not horrible and if you accept the way things are you will have a decent time  Is it a 3 star hotel.  No I have stayed in better 2 star. Is that a problem. No.…", "date": "November 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r728394138", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Catering and No Hospitality..", "review": "Dear guest. We´ll take note of your comments, and we regret that there have been some aspects of your stay that have not been satisfactory. It is our intention to improve day by day with the suggestions and comments that our clients make us. Thanks for your visit, and best regards ", "date": "November 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r728339230", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Very friendly 😀", "review": "I believe in starting how I mean to go on. In that spirit, upon entering the Hotel Perla you are given you're room key, hotel information and a welcome note.   THAT note was the most welcome we felt our entire stay.   We were constantly looked down on by the elderly guests the entire time. Had we known younger guests weren't wanted at the hotel we would have booked elsewhere but there was no information to state this. All but two of the staff members were miserable. The nice ones being the bartender Diego and the lifeguard James. The other staff were awful though, in particular one of the other barmen who's name no one would ever give me and sadly the only way I can describe him is bald and rotund.  He was always looking at us as if we were something he stepped on, constantly making us feel like were a nuisance just for asking for a coffee (which takes about four seconds to make) and even going so far as to talk s*** about us right Infront of us. He assumed we spoke no Spanish. He was wrong! But the most insulted we felt is when he mocked us for saying gracias each time he served us. I apologise but my mother raised me with manners. He shook his head at us and said \"gracias, always gracias\" which may be confusing to read but in the context of the moment it was clearly a dig. Hi is without doubt the worst employee there.  I understand that they may not be used to having seven men all staying together. All of varying ages but it was my cousin's 21st birthday and so we came to this beautiful island to make the day special for him.  We realised early on that the younger members of the group required some looking after and so to appease the other guests we made sure each time we went to the bar we went outside and sat right down at the bottom, past the pool where no one else sat just so we were out the way.  The music was dated and very loud and is more catered to dancing in groups. So in our little corner we put our own music on and being Brits we like a good sing along. This just led to more dirty looks. EVEN on the nights when just two of us would go up and have a friendly game of pool (they were actually snooker balls on a pool table but that's neither here nor there) we were still treated like crap.   The worst part is we were unaware of the hotel's feelings about us because nobody said anything to us until day six when another British guest approached us and said that they had approached him and asked him to ask us to keep it down. At the time they asked him, he refused to do so as he was just one man with his wife and we were seven men and while I'll argue that we are in no way intimidating, neither are we particularly small. It was not his responsibility to talk to us. That lies solely with the hotel!  I don't want to go on too much longer but to sum up:  From our experience The Hotel Perla has 'ok' catering but it's hospitality is practically none existent.   The food is varied but the temperature is all over the place and there's not really anything that can be made into a meal. It's just random.  The same applies to the house keeping. My room was serviced every day and by that I mean they made the bed and closed the curtains. That was the extent of it. But my cousin's room next to mine wasn't serviced once despite having the please service sign on the door the whole time.  I've worked in the catering and hospitality sector for years now and I would never dream of treating anyone the way we were treated. Everyone has bad days but it's called putting on a happy face.   I will definitely come to the beautiful canary islands again but I WILL NEVER RETURN TO THE HOTEL PERLA!  Hotel aside we had a great time in a beautiful location and I would recommend it to everyone.…", "date": "November 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r726794697", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Week all inclusive ", "review": "Dear guest. Thank you for your opinion. We regret that you did not have a pleasant experience in our hotel, but we regret even more that we could not help you and make your stay more enjoyable. In any case, we want to thank you for sharing your experience, that will help us to analyze and improve those weak aspects of our service. Friendly regards.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r723942739", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Dated decor and not family friendly...", "review": "After reading the very negative reviews on here I was initially unsure what to expect! I’m going to be as honest as possible. What everyone needs to remember about Hotel Perla is that it’s only a 3 star hotel and is very competitively priced! The rooms are basic with a small ceiling fan which would probably be not cool enough in high season but adequate for November. Maid service was daily and cleaned to a very high standard. Beds were comfortable and there was a fridge in the room. No tea, coffee or kettle but that didn’t bother me. We were on floor 5 which was perfect, I would recommend asking for a high floor. Breakfast, lunch and evening meals were all really nice! A great selection so you would have to be really picky not to find anything to eat. Kitchen staff and waiters/waitresses were all really friendly (some other guests were quite miserable but hey that happens everywhere) the hotel had mainly German , Spanish, Dutch guests. Not many English at all but again that suited me. There is nothing here for children but again that was another plus point! The main thing that lets this hotel down was poor entertainment but apart from that we had a lovely stay. Barman Pablo was excellent and always happy to help! All staff we encountered at this hotel were very helpful, the reception staff too were extremely nice.. all in all it was a very reasonably priced week away 😀…", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r721957292", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Superb value, great staff.", "review": "I've come to the end of a great two week stay at this hotel. I am a regular visitor now having first booked at random a couple of years ago because of the price. As always the staff looked after me very well especially Diego in the bar. The rooms are kept immaculately clean. The food is good and I'd gonas far to describe the breakfast as excellent. Please ignore the negative reviews, whilst this hotel doesn't have the bells and whistles that some others do in the area, this is reflected in the price and you get excellent value for money. I've already booked to come back in January next year and look forward to seeing all the staff again then.", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r715251438", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Terrible", "review": "Dear guest. We thank you for the confidence you have placed in our hotel. We will be glad to welcome you again soon, and we thank you for sharing your experience on Tripadvisor.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r714970538", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "cheap and friendly", "review": "Stayed here for a week with my fiancée and we were not happy with service apart from one nice waitress  and one bar man think his names diago and a nice cleaner the rest were rude and generally unhelpful don’t seem to like the English if your German/Spanish you will fit in well rooms were adequate but no air con other than a ceiling fan all inclusive deal was terrible 11-11 never heard of that and there was strict rules don’t cater well for families should be advertised as an older adult hotel food well if you like to eat rabbit and a lot of fish then that’s fine not much variety jacuzzi didn’t work and no sun beds by pool even one of barmen asked if we were leaving soon said good when I said in a day very rude need customer service training would definitely not recommend this…", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r713200274", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "A change in attitudes needed", "review": "Dear guest. We apologize for any inconvenience you had during your stay. As for what concerns our staff, we will notify your comments to the person in charge, to take the appropriate actions. Thanks for your opinion.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r711319196", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Good cheap break", "review": "Once again a great hotel. Staff are impeccable and eager to help always friendly. Antonio as ever a gentlemen. If you ask you receive.whatever you're requirements the staff will endeavour to fulfil.nothing is too much trouble at this quaint hotel. Little things still need addressing. Aircon. More Spanish food. Free wi fi. Free safe deposit box. Sat TV would be nice. All inclusive pints would be nice as you're forever going to the bar which annoys the bar staff. Over all a Fantastic Hotel. I would like to thank Antonio and his staff for making my mum my brother and I so welcome. Were are booking again next year for 3 weeks. Can't wait to see all the staff yet again for the 3rd time. A very big thank you to Perla Hotel and its staff. See you soon my friends. Kind regards Take…", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r701096288", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Ignore the bad reviews ", "review": "We arrived at this hotel early hours Sunday morning, greeted by a lovely guy on reception called David. He made us feel extremely welcome from the get go and they had laid on some food and drink in case we needed it. We booked two rooms and I had emailed before we left asking for a high floor room and hopefully to be close, we ended up next door to each other which was perfect. We have rooms 602 603 perfect for bar, pool and sunbeds, couldnt of asked for better. Rooms are adequate and cleaned daily. It's a bit of a walk to the beach although a taxi back is advised. Staff work hard and are polite and humourous. Food is what you expect of a 3 star hotel and unless you're extremely fussy it's easy to find something. Drinks are great, not watered down rubbish. No complaints at all…", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r698212934", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Very Clean little hotel", "review": "Dear guest. Thank you very much for sharing your opinion and experience. We are glad that your stay has been fully satisfactory, and we look forward to receiving you on your next visit to Tenerife. Kind regards.", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r696409409", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Holiday ", "review": "Quite a traditional hotel. Had to pay for wifi outside of bar area. Rooms a little dated but were kept very clean. Not a lot of English holiday makers and entertainment was non existent. Free bus to beach and shops every day except Sunday. Jacuzzi was never on whole time as was there and kids were using it as a kids pool.", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r694017174", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Enjoyed our 2 night stay", "review": "Dear guest. Thank you for your review. We´ll try to improve on some points you mentioned, and reach your expectations in your next visit. Best regards, ", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r693989248", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Not great", "review": "We stayed at this hotel for five days. On arrival the receptionist didn’t speak English very well and asked us “sprechen zee deutch “ the hotel was very clean and the staff were all friendly. However it would appear they the hotel caters mainly for Germans and all the brochures were in German even the Thomas cook ones who we booked with. My wife was told before we went that it was adults only but there were lots of children. The food was what you expect from most hotels and was average however the bar staff served drinks in plastic glasses which was no so good. There were sings stating that glaze must not be taken outside to the pool which is understandable, however if you were spending the evening in the bar proper glasses would have been better. We had to wait 2 hours on the…", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r690803481", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Looks out of 1980 but a nice cheap stay", "review": "The hotel Perla was an average stay. Upon arrival at 2am my initial thoughts were worried as the hotel looks extremely old fashioned as if it hasn’t been redecorated for 40 years. However the room was clean and the bed comfy enough so happy to stay. Went all inclusive and cannot fault the food, especially as me and my partner are vegetarians we were weary but everything was delicious. The entertainment at the hotel is not worth bothering as the bar is tiny and about 2 people show up for their ‘DJ’ but there is a small pool and it’s nice to hang out in during the day when it gets too hot. There is a free bus from the hotel that goes into the centre of Puerto De La Cruz so no worries about the distance  and the times are relatively often too. Had a nice stay for what we paid. ", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r690052427", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Not bad", "review": "Dear guest. Thank you for your review. It´s a pleasure to know that you enjoyed your stay with us. Thanks for choosing us, and we hope to see you soon again. Best regards. ", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r688621216", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Mrs Shepherd", "review": "Nice enough. Spacious rooms. Great staff. Food plentiful and well cooked. Roof terrace pool and bar is cool. Few silly little rules like No food in rooms from restaurant (we went all inclusive). There were no hot drink making facilities in rooms. The hotel is in need of a lick of paint. A modernising program needs to be pushed into here. New TVs needed in rooms, current ones are old and dated. Our room was directly under the restaurant, which we were woken at 4am every morning (not very happy about this!). Air con in rooms would be good. For the price we paid, its wasn't bad tho. ", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r675310283", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Another great stay", "review": "Dear guest. Thanks for your opinion. We regret the circumstance that you describe with the location of your room, and we apologize. We hope you enjoyed the rest of your stay in Puerto de la Cruz. Thanks for your visit, and best regards.", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r673761999", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Very nice hotel", "review": "Another excellent holiday at this hotel. The staff were again great and even though the manager was on holiday the standard of service was amazing. Yanira organised the evenings for us and much fun was had. The bar staff as usual added to our pleasure. The rooms were their usual high standard and check in with David was super fast. Delilah’s smile always gives such a positive feel when in the dining room.  The only little gripe was the variety of food which didn’t seem quite as good as it has been, never the less my husband and I certainly didn’t go hungry so no real issues . Will we visit again? OF  COURSE WE WILL see you in October for visit number 7", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r664795646", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Three week stay", "review": "Hotel Perla is a good Three Star. Clean, very friendly staff. The only drawback is the buffet food - very 'samey' and often cold. Shuttle bus into town very efficient. Would definitely go back.Rooms with a garden view preferable although the balcony there only gets the sun in the mornings. Easy walk to restaurants and bars.", "date": "February 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r659004108", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Better than average but some drawbacks", "review": "Dear guest. Thanks for your review. We will consider your comment about our buffet to improve on this aspect. We are glad you had a pleasant time in our hotel, and would be happy to welcome you back soon. Best regards.", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r653758113", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely Return", "review": "This is an hotel that we will no doubt visit again.It is not where an hotel should really be built but is seemingly not unusual in this part of the island. Access for the less able is not ideal unless you are prepared to use Taxis.There are free bus/coaches which run regularly (weekdays but not lunch time) but finish early- are not usually disabled friendly and in the afternoon is often not large enough and thus alternative arrangements may be made. Unlike some hotels the service does not run on Saturday afternoons or Sundays. In fact if wanting to go to the bus station or places in that area it is quicker to walk directly than to walk from where the service terminates. It takes about 20 minutes to walk down in a fairly obvious route to the nearest point of town or following the…", "date": "January 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r650129022", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Almost perfect Perla", "review": "Dear guest. Thanks for choosing us. We appreciate your feedback, and we´ll take note of your comments, We regret that there have been some aspects of your stay that have not been satisfactory. Friendly regards.", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r641834592", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "My holiday", "review": "We stayed here 10 years ago on our honeymoon and came back for our 10th Anniversary.   In that time the hotel has been improved but the main thing is the staff are still as friendly.   Good size room with a fridge but no kettle (we took our own).   Hairdryer was good but TV only had American news channel as the only English choice.   Never mind we bought a weeks internet for E10 and listened to our local radio on our tablet.   Breakfast, lunch and dinner were all buffet style with lots of choice and very tasty too.   Entertainment every night was OK and we joined in the dancing.   We hired a car at the airport.   We remembered our way to the hotel as it is not easy to find (download a roadmap or take a SatNav).   It is a 10 minute walk to the town and beach but it is a lovely…", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r634152950", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Mr", "review": "Firstly the hotel, i think some of the reviews are a little unfair here, the hotel is a little shabby but its acceptable for 3 star,  similarly the food, canteen \"school dinner\" style and they clearly cater to a range of nationalities so the choice is not wide. People have also criticised the walk across the bridge into the hotel but its around a 5 minute walk, a little confusing to find your way into reception but nothing too bad  The hotel is in the middle of nowhere, its around a 20.minute walk into the town and beach bit well worth goimg a bit further to playa jardin which was lovely, taxis back qre around 5 euro, there is also a free bus but we could never seem to catch it for some reason so just ended up walking down/taxi back  So if you want a cheap break in a basic hotel…", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r631593750", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "My home from home", "review": "Dear guest. Our sincere apologies for the behavior of this member of our staff. We will send your comments to the Hotel Management, and we will do everything possible so that this type of situation does not happen again. We especially regret that your children have not had a pleasant experience, and we want to apologize for it. Thanks for your comments.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r624704372", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Better than we where led to believe", "review": "Sixth visit in 4 years. So happy to be back after a nightmare in Malta last year! Staff remembered me even after 2 years. That's what makes good service. Had a great holiday, met some lovely people. Service was,as always, excellent. From cleaning staff to management I couldn't have been made more welcome. Food was always well presented, never went hungry, room spotless, excellent courtesy bus service to town. Would not change anything. This is a 3star in 4star clothing. Not for everyone, but it suits me which is the important thing. Next year booked already 😎", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r623563953", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Don’t come here if you vegetarian!!", "review": "Dear guest. We are happy to welcome you back to our hotel, and we thank you for sharing your experience on Tripadvisor. Thanks for booking again, and see you soon. Kind regards.", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r622950094", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Not the best.", "review": "On reading the past comments and looking at the one star ratings was not expecting a great deal from this hotel. How wrong we were.... it isnt a 5* hotel but then again it isnt 5* prices.   We found this hotel to be quirky, clean, friendly, everything you would expect from a 3* hotel. Food is delivered buffet style so never going to be piping hot and if you want that there is a microwave to heat it up in. The re isnt a wide range of choice at meal times but we found something nice all the time. Restaurant staff very friendly and we had our usual bottle of wine on our table before we got back with our soup. Reception staff very good as well, requested a taxi from them a couple of times and it wasnt a problem. Room cleaned every day, towels changed every other day.  Free bus down…", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r621145471", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Excellent value for money", "review": "This was my third trip to this hotel this year and once again I'm sad to be going home. As others have pointed out it is very basic but what you do get is excellent value for money. I found all of the staff to be welcoming and friendly especially those who remembered me from my last visit. The food is not typically English but for me that's a plus when I go away as I like to try new things. If you're someone who likes to spend an entire holiday in your hotel, this place probably isn't for you but is a great base for a visit to the area. There's a free bus service apart from on Sunday and in any case local taxis are very cheap. I'd also recommend a visit to Loro Parque. I look forward to coming back next year at some point when I'm able to book some time off.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r620984141", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "cheap and friendly", "review": "Dear guest.We will be happy to welcome you again on your next visit. Thanks for your kind comments, and see you soon. ", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r620677562", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "This is definitely no a 3 star hotel", "review": "if you are expecting 5star, 4 star, then don't go, its that simple, however, if you want 3 star max, quaint and oldy worldly then go for the experience. it is no frills old time hotel with friendly staff, although some were a little rude. we live in the 21st century and wifi should be free, as should full sat tv, kettles cups ect, air con. however you look at this hotel, it is what it is, and that is, not 5 or 4 maybe bordering on 3 star, but with just a few little changes like, redecorating, air con, sat tv, kettles cups, disabled friendly, cote of paint new beds ect, then it could be 4 or 5 star. I would also mention that staff retraining would be a good idea, get rid of a few members of staff and hey presto you have complete happy staff. the manager was great and did…", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r618865074", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Not for English ", "review": "Dear guest. Thank you for sending us your opinion about our services. We appreciate that you share your suggestions, and we will take them in consideration for future improvements. Thanks for your visit.", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r618186482", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Miss Lyndsey Smyth", "review": "Worst hotel I have ever been to. Lifts don't work, they don't change towels, no aircon and the ceiling fan is useless and about to come off. Balcony doors don't locked, in a quite area that sleeps at about 9 pm more like a retirement village...the list goes on and on. It shouldn't be a 3 star hotel, more like a clean hostel with private rooms.", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r615950136", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Mr hotel inspector.", "review": "What a joke....Nuff said... waste of money. Had better holidays in war torn iraq.... ripped off... lied to... cheated ojt of my hard earned income.... could have had better holiday doing hard time in san quentin nick. Never book teletext holidays. You are better off going to snowden in december...  no kettle... rooms not cleaned... sheets not changed... no clean towels.... food cold... what a joke.. i shall send my report to all travel companies...", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r615701590", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 1}, {"title": "Awful / avoid!!", "review": "Dear Customer. We regret that your stay has not met your expectations. We also encourage you to publish in the media you think appropriate. But, nevertheless, all the inconveniences mentioned here are perfectly correctable in the hotel, and we would have been happy to solve them on the spot. Friendly regards.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r615640255", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "No sleep!", "review": "We came here for a relaxed holiday, we tried to be optimistic despite some reviews we read however we wish we listened!  Good points: the hotel is clean, most of the staff are lovely and welcoming, taxi is very cheap to get around or there is an option of a free bus!  Negatives: it’s out dated, the rooms are awful! The beds are hard, the tv barely works, the sockets are coming out of the walls, the overhead fan looks like it’s going to come off the ceiling every time we turn it on, some of the staff especially at night are quite rude! the food choices are limited and barely warm, we lived off chips and in the end ate out most of the time at a lovely restaurant in the centre close to the beach. This therefore made it a waste of the all inclusive option! the drinks served from the…", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r615414409", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "entertainment", "review": "Dear guest. We regret that your stay was not satisfactory. In any case we will take note of your remarks and solve the issues that you`ve detailed. Thank you for your opinion. ", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r614749906", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "J Prades", "review": "Unfortunatily every day from 5 a.m. we are woken up because of very loud noises and music coming from the kitchen above our room  Friendly staf and the food is ok, but not everything is included in the all inclusive arrangement. After breakfast (7-10am), the bar opens for all-inclusive at 11am. Between those houres you can't even get a cup of coffee or glas of water. Strange  Rooms are clean and big but dated", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r607931633", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Money went missing from our room", "review": "My wife and I visited Perla hotel between 24 July-2nd August. Our first impression was that the staff were helpful, and wanted to make our stay comfortable. By the end of the stay, we had a terrible and unacceptable experience, because we noticed that our holiday money was going missing from our room. First €20 went missing, and then at the end of our stay a further €100 note. We are sure that it went missing from our room, which was locked. We reported this through our travel agent,  and the police on our return to the UK, however the hotel did not respond to us. Because of this experience, and despite the rest of our visit being enjoyable, we would not recommend this hotel.", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r607142227", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Poor and Dissapointing, Expected More", "review": "Dear guest. We have contacted the hotel reception, and there is no record of your complaint, and it is very rare, given that you assure that it has happened twice. If you wish, i invite you to contact us to clarify what happened. Friendly regards.", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r603868286", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Week away from English snow", "review": "We stayed here for a week, all inclusive. As soon as we arrived there is a long walk down to the main reception. With suitcases this is not great as there is also a bridge to walk over as well. As the coaches/taxi cannot get to the main entrance you get dropped off at the back of the hotel. The reception is on the 5th floor. This was not sign posted when we arrived.   We paid for a double twin/standard. We expected at least 3 suitable beds as this was for 3 adults. The 2 single beds were okay but the 3rd chair/bed was terrible and gave myself terrible back pains. It was like a bed that was for the army! Forcing myself to use towels to suppress the bed springs from hurting my back.   The room itself was suitable for 2 people not 3, not much room. There are no drinking facilities…", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r597387138", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "great budget hotel", "review": "Dear guest. We regret the inconveniences during your stay, and especially in regards to the comfort of the extra bed. We will take note of your complaint. On the other hand, we want to inform you that it was possible to request a kettle at the reception. With regard to the rest of the issues that you detail, we will send your comments to the Hotel Management. Thanks for sharing your opinion.", "date": "November 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r596292227", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Avoid !!", "review": "Week away with my partner. We wanted a cheap week away from the snow in England. This is a nice budget hotel. We weren’t happy with our room as right beside the entrance but we were moved when we complained. Room was basic but clean, maid service daily and all staff quite friendly.  We did feel the hotel catered for the older traveller, entertainment every night, twice it was Bingo and once ballroom dancing, so not really our cup of tea.  There is a small pool but I could just stand in shallow end so not really suitable for children or non swimmers. Plenty of sun beds on the sun terrace. Town is quite a walk but there is a free bus there and back. Food basic but plenty of choice, avoid the bacon at breakfast, no where does a cooked breakfast like we do in England. Nice break in…", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r593624981", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "AVOID AT ALL COSTS!", "review": "I’m not one to complain online, even when I find something to be very bad, but this place exceeded any expectation of what horrendous is defined by.  I stayed here for a week with my Father, and I mean it when I say that I would’ve preferred to sleep on the streets.   My Dad is 55, and was the youngest tourist for miles apart from myself. Bugs and flies infested the room, no matter how hard we tried to get rid of them. Our toilet exploded and flooded the room with faeces on our first night, and we hadn’t even used it. It then happened again on day 4, and day 6. Each time, we had to wait over an hour to have someone come look at it.  I’m all for people having fun, but we were kept awake on 3 separate occasions by the people in the room above banging and moaning. The times they…", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r591822805", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Its not the Ritz, and I'm glad it's not", "review": "Dear guest We regret that there was not a single thing you liked about our hotel. We can understand that some inconveniences may have occurred, and we hope that we have been able to solve them diligently, but you tell us some aspects of the hotel that leave us in a very bad position and with which we can not agree. In any case, and on behalf of the entire hotel, especially from our staff, we apologize for any inconvenience we may have had some responsibility for. Friendly regards.", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r591274017", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Very Pleasant ", "review": "I love this little hotel, it is perfect!  The staff are friendly and helpful, from the charming David on Reception to the bar and restaurant staff who are so good at what they do.  The hotel is in a quiet, pleasant area of Puerto de la Cruz, a short walk to the tourist areas, bars, restaurants and seafront, but far enough away for it to be peaceful.  On my last visit the hotel was full of Spanish pensioners on their subsidised holidays i guess, but they were a friendly crowd and I had fun at the evening entertainment.  I only booked room and breakfast this time but the offering was excellent, lovely fresh breads, fruits, cereals as well as cooked items such as bacon (Spanish), baked beans, fried potatoes, omelets, fried eggs, sausages, yogurts and pastries.  although I must say…", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r581479788", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "AVOID LIKE THE PLAGUE", "review": "Dear guest. We appreciate your opinion very much, and are happy to recieve your comments and suggestions. We will take them in consideration. Thanks for your confidence, and kind regards.", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r563893121", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Our stay", "review": "Over the past couple of years I have become a regular visitor to this hotel. I originally booked at random because the price was low but keep coming back as the staff look after me so well. This place is basic and other hotels may have more extensive facilities but what you do get here is excellent value for money. The meals are of a good standard and I'd describe the breakfast as being excellent. The hotel whilst not on the seafront is only a short distance away from all local amenities with a free bus provided during the day. In any case local taxis are very cheap. The rooms are always kept very clean. The main attribute that this place has is the staff who will look after you in any way they can. I'm slightly miserable to be going home tomorrow but look forward to my next…", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r560780686", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Another nice stay", "review": "I fly home tomorrow after another very nice stay at this hotel. The staff here are wonderful and always make me feel welcome, which is one of the main reasons I come back. I accept that it is a fairly basic place but the price reflects this. As I've said in other reviews you will get excellent value for money. The meals on offer are pleasant, the breakfast being particularly good. The bar area is a very pleasant way to spend an evening. I was all inclusive and indulged in the gin, vodka and beer and can vouch for its quality. I've already booked to come back again in May and look forward to it.", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r559383736", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Very nice holiday", "review": "Dear guest. Thanks for visiting us again, and for such a kind review. Reviews like yours encourage us to continue working to improve every day.  Our staff will be glad to know that they have been actively involved in your stay to make it more pleasant and comfortable. Best regards, and see you next May. ", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r557535621", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great staff, enjoyable much needed holiday", "review": "We stayed her for one week....bit daunting with the reception on the 5th floor..but got used to it...room very clean...staff very friendly ..room cleaned daily and towels changed daily too..the resident cockerel you do get used to...plenty of choice of food .all in all a lovely week at the perla and would certainly visit again", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r555868208", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Celebrity get me out of here ", "review": "Dear guest. It was a pleasure for us to welcome you in our hotel. We would be glad to see you soon again. Thanks for sharing your opinion, and best regards,.", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r555692390", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Knock it down ", "review": "After reading some reviews, the Hotel Perla exceeded our expectations. The hotel is in a lovely setting with much greenery around it. It has a good roof terrace for sunbathing. The staff were very friendly and helpful throughout our stay even helping us to check in for flights and printing off our boarding cards. The restaurant offered a good variety of food. We don't drink much,just to say that our wine bill for the week was cheaper than our 'expensive' meals on the Ryan air flight back to England. Puerto de la Cruz is quite 'hilly' and the longish walks could be difficult for some, however the hotel runs a free return courtesy bus to the town/seafront. For the price we paid for the complete holiday, we were extremely pleased. The temperature even reached 27 C on one day with…", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r555176264", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Awful ", "review": "We went here for a long weekend and while I was only expecting 3star, what we got was dreadful.  Had read the reviews and it sounds OK but the staff were rude,  the place was dirty. There's a pool and a sun terrace but no shop,  jacuzzi,  or anything else.  They also tried to charge for the whole holiday on the way in and on the way out even though we had prepaid at a reputable travel agent.  The food on offer was bad and not much choice.  The bar tender was really nice,  shame it's not as described.  No gardens,  just small strip of gravel with some trees on.  Place is tatty and can easily be missed.  ", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r554667868", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Good value for money", "review": "Dear guest. Thank you for your opinion. We regret that you did not have a pleasant experience in our hotel, but we regret even more that we could not help you and make your stay more enjoyable. However, we are surprised with your claim of our cleaning service, as this is one of our most important efforts, and most of our clients praise the work of our cleaning staff. We apologize if this was not your case. Friendly regards.", "date": "December 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r549008712", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Clean and  Basic", "review": "Well located hotel with easy access to main town allowing return to the hotel for quiet relaxation.    Hotel has good facilities and friendly staff who was happy to assist in facilitating the disability needs that one of our party had.  Hotel has nice pool area, supervised with a life guard, roof terrace sun area allowing for good views over the resort.  Rooms are adequate with balconies or patios, clean and fresh.", "date": "November 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r546149817", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Good value for money", "review": "Dear guest. We thank you for your confidence in our hotel, and are happy to read that you and your friends had a nice stay. We wish you happy Christmas, and a happy New Year.", "date": "November 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r545613931", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Pleasant albeit a way out.", "review": "Three star hotel with mixed reviews, our expectations were fairly low on a cheap November package holiday, but grabbing a relaxing pre Christmas break I was happy with this hotel. It is quirky and basic, but clean and the staff are friendly especially if you try your pidgin Spanish. The room is somewhat shabby but we overlooked that. The tv only shows Spanish channels and there is a hairdryer, very quiet fridge and a safe in the room. No aircon but there is an overhead fan. On arrival I asked for a kettle - it was there by the time we entered the room - but no cups so you need to ask for these as well. Take your own coffee bags and milk then you're set for a decent coffee every morning. The machine coffee in the restaurant is vile. We asked for a quiet room and were given 427.…", "date": "November 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r545231962", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "First holiday alone", "review": "I loved this Hotel all the staff were lovely the food was brilliant something there for everyone. Luckily for me the weather was also spot on sun every day except one on my 10 day holiday thank you so much hotel perla for making my first holiday alone brilliant missing you already", "date": "November 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r544661299", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Lovely in November!", "review": "Dear guest. Thank you for your time writing this nice review. It make us always happy to read such kind comments about our staff, who works hard but with great enthusiasm. We`ll forward your comments to all of them. Thanks for choosing us, and we hope to see you next year. Kind regards, and we wish you a happy Christmas. ", "date": "November 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r541628258", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Charming place , fantastic staff", "review": "Just returned from a lovely relaxing all inclusive holiday at the Perla. The staff are wonderful. Everything is spotlessly clean. The breakfast is amazing! The food on the whole was excellent for a three star hotel, although maybe would not be acceptable for veggies. Very large comfy room, we stayed on the third floor overlooking the wall at the front of the hotel. Hourly free bus to and from the Martinez shopping mall. La Perla is built into the side of a steep hill, it's an easy walk down to the sea, but far too steep to enjoy walking back up, so we either caught the hotel bus or got a cab back for around 6 euros.  We enjoyed our visits to Loro Parque; 32 euros each and the botanical gardens; 3 euros each. All in all we had a great time and met some amazing people! Thank you x", "date": "November 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r540377875", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Dont listen to bad reviews!", "review": "Dear guest. Thanks for sharing your experience. We are happy to read that you enjoyed your stay in our hotel, and in Puerto de la Cruz. We hope to see you soon again. Keep well, and kind regards.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r538847472", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Holiday ", "review": "After a week away for the first time in Tenerife, i booked into this place. On turning up at stupid am (around 05.00 am on the Saturday morning , me and my partner were greeted by David. Who then proceeded to show us into the closed restaurant and told us to place our stuff down, and then to a table where they had a cold meat salad meal ready. I thought this was a nice touch and was very impressed by this gesture. Then after food showed to our room. Rooms and hallways around hotel are immaculate and although the rooms are a bit dated they are spotless. Booked all inclusive for the week. Not expecting a variety and thinking it was going to be same sort of food everyday , was pleasantly surprised. This is by no means the sort of food you would expect in a posh hotel but tasty all…", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r537411328", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Pleasant Hotel for the price,good value", "review": "Got back a week ago from a 8 day stay at this hotel.My partner and I were a little weary when we arrived at the hotel around 9pm after being dropped off at a roundabout a 5 min walk away from hotel,soon to realize that this is nearest drop off point for a coach to get close.The room was lovely and clean,very roomy for 2 people and was cleaned every day.All staff were pleasant although I think reception staff did struggle to communicate sometimes with their English,it wasn,t a major problem we got there eventually.Food in the restaurant was nice and quite varied,deserts were lovely.We went away with the intention to relax and we certainly did,weather was exceptional to be fair and the sun loungers were great on the roof terrace where we never had a problem getting any every…", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r536482991", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Ignore the bad reviews!!!", "review": "Dear guest. Thanks for this nice review. It makes us happy to read that you had a great time in our hotel. We hope to welcome you soon again. Best regards, and keep well.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r532641998", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "All Inclusive Break", "review": "just back from  a 7 day stay at the Perla Hotel was a bit weary after reading some the bad reviews my advice is ignor them! Many on here are very quick to forget its a 3 STAR hotel and you will have paid 3 STAR price. Yes the building and the rooms need an update most of the staff aren't great at speaking English. The room was cleaned everyday and fresh towels left everyday. As regards to the food breakfast was pretty decent lunch was a bit hit and miss and as regards to dinner there was always a great selection of food and you order your drinks soft and alcohol this is brought to your table by a waiter/waitress (never had this before in any all inclusive hotel) to be honest the hotel was much better than I was expecting by some the bad reviews on here I am pretty fussy and I…", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r532457435", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Holiday ", "review": "Dear guest. Thank you for your nice review. It´s a pleasure to know that you enjoyed your stay with us.  Thanks for choosing us, and we hope to see you soon again. Best regards. ", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r532088746", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Short break away", "review": "Very relaxing holiday, rooms cleaned everyday. Staff very friendly throughout the hotel. Plenty of choice for meals. The hotel is within a residential area which is quiet, on an evening. If your looking for nightlife you would need to go into the centre which is not too far away. Very relaxing holiday.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r531812930", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Could be a little 'Gem' with a few 'rule' changes :D", "review": "The first thing I would like to say after reading some terrible reviews for this hotel is that some people seem to forget that it has 3 stars and it is what it is! The All Inclusive meals are not ‘a la carte’ (oddly enough, because that is not what you have paid for!), but there is plenty of variety and you will certainly not go hungry, and I say this as quite a picky eater. Another plus is that you get table service for your drinks at lunch and dinner, something that I personally have never experienced in a 3 star All Inclusive Hotel so big thumbs up to the management on that one, it’s a nice touch :D. The staff  are all very friendly and as helpful as they can possibly be. I personally did not experience anyone being grumpy or bad mannered (except maybe the lady in the…", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r530235656", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Fantastic Holiday", "review": "Dear guest. Thanks for this objective and comprehensive review. Be sure that your comments and suggestions will be sent to the Management. Best regards, keep well, and we hope to see you on your next stay in Puerto de la Cruz.", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r530125266", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Pete", "review": "We have just returned after spending 10 days, arrived late at night and was checked in straight away reception staff very good, Food was plentiful even if you went just before service ended always something to eat, breakfast was good a selection of cereals bacon and eggs ect ( tasted like bacon) and if you like cake the selection was brilliant. The walk to town is not to long but the walk back is up hill and lots of steps if you have mobility problems possibly not for you but the free bus runs on the hour, The old town is beautiful. Staff were very friendly anyone who says they are rude we didn't experience this I think if your polite to them they will be to  you, the pool is vey deep and not suitable for children who cannot swim. Rooms were cleaned every day and the whole hotel…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r528665182", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Out of way", "review": "Dear guest. Thanks for letting us know your experience in our hotel. It makes us happy to read that you had a great stay, and would like to welcome you again in the future. Best regards.", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r528088094", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Nice hotel, lovely staff", "review": "Food ok, it’s situated in a hilly area. Third bed is a pull out bed, with a inch or so mattress. You can feel the bars underneath.  Would be better if it had three beds. Didn’t sleep at all on pull out bed. Weather not to good. Very near to mountain Region.  ", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r528020545", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Tracy", "review": "Hotel is clean.  Room cleaned everyday. Most of the staff are very friendly Food is very repetitive fish, veal, pickled rabbit, some sort of chicken.  All salad seems to b kept in vinegar(That's what it taste like) Lots of different bread to choose from which was just aswell. Food was probably ok but I didn't like anything. They cater for Spanish and Germans very well. Not so much the English. It is in a quiet area (but that's y I booked it) Free shuttle bus into town, takes about 10mins. So all in all its ok", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r526465778", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Nice hotel ", "review": "Dear guest. We'll take advice of your comments about our buffet. Thanks for sharing your experience on Tripadvisor. We hope to see you again soon. Best regards ", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r525503732", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Not suitable for people with limited mobility", "review": "After reading some of the reviews, I was quite worried to see what we had booked!  When we turned up I was pleasantly surprised! The coach dropped us off at the back entrance. I had already read reviews advising that the reception was on the 5th floor and a sign on the door confirmed this on arrival.   We were checked in straight away and the receptionist asked us if we wanted lunch as it was almost over. He said it would be best to leave the bags with him and go and eat which we did as we were starving.   The room probably needed updating but the positives were the size of the room, the balcony and the cleanliness. The cleaners really did do an amazing job! Some reviews say that towels weren't cleaned, but in our room a sign in the bathroom said something like \"help save the…", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r524907686", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": " Not the best or not the worst", "review": "Dear guest. Thank you for your review. It´s a pleasure to know that you enjoyed your stay with us. Thanks for choosing us, and we hope to see you soon again. Best regards. ", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r523885158", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Ok Hotel", "review": "Arriving after 21:30 we had missed the dinner sitting but the hotel offered late food which although wasnt the full buffet service was enough to see us through to the following breakfast service this was unexpected but welcome snack. The man on reception did not seem to happy to help when a safe key was requested.the room was of a reasonable size and apart from dust and old cobwebs on higher parts of the walls and on the ceiling was reasonably clean. The beds and pillows were a bit on the firm side but slept ok most nights other than the cockerels making a noise early some mornings and on one night noisy English guests. Pool was reasonably clean but the steps into the pool would not be suitable for anyone with mobility problems as there is a big drop from the bottom step to the…", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r523791799", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Loved it", "review": "I was put off this hotel when I read the reviews and thought \"what did I just book\" but my stay at this hotel was brilliant. The staff were friendly and very energetic. The food was brilliant with lots of different varieties. You could take what you wanted and how much you wanted as it is a buffet. hotel rooms were very clean as they were cleaned everyday. The hotel is quite isolated but there is a free shuttle bus that takes you into town and there is a supermarket 10 min walk up the road. The barmen were very generous with their alcohol and the cocktails were lovely. Entertainment was really good and I've had the song \"kutchy wa\" in my head for over month lol. The pool was a good size and there is a sauna which isn't opened until winter time because it's too hot during the…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r523157092", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great Stay ", "review": "Dear guest; We are very happy to read that you enjoyed your stay with us. Best regards.", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r522135265", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "AVOID - MONEY WENT MISSING", "review": "Have just arrived home after my second stay this year. Once again I was met with a warm welcome by staff. Granted this hotel does not have some of the bells and whistles that other more expensive places have but what it does represent is excellent value for money. The rooms are spotless and beds are comfortable. Nearby is the amazing Loro Parque which I highly recommend. The meals here are basic but always tasty. The bar is very pleasant and you will never have to wait long. The quality of the beer and gin being very good on all inclusive  (didn't really try anything else) I really enjoyed my stay and look forward to returning in February.", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r520280194", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Dirty and mean", "review": "Dear guest;  Thank you for your review, we are glad to read that you have enjoyed your holiday with us. We look forward to your return in February. Best Regards.", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r520259790", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Fab holiday ", "review": "I really didnt know what to make of this hotel until money went missing from our room.  First thoughts were;  Nice surroundings  Decent size room (old fashioned & no air con but good size)  Food very basic and not much choice - same evening and night  Cleaner a bit slap dash.  Bar man (old bald guy) extremely rude and nasty - when asking for a drink he said one drink only. We only had one drink and he then came over to our table to check. You pay for an all inclusive holiday what does it matter if you have more than one drink at a time? You have prepaid for it?  Then he started shouting at us in Spanish....if you ask me this is extremely rude and very embarrassing.  However it gets worse when i emptied my pockets and left 30 euro on the side the cleaner had been in and the money…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r519019723", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Quiet and friendly", "review": "This hotel is in a quite location , the food is different every night but the breakfast it always the same thing , it’s a long way away from the south airport but is close to the town which you can get a free bus to", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r518844497", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Massive Disappointment!!!!!!!", "review": "Dear guest. Thanks for sharing your experience on Tripadvisor. It was a pleasure for us to welcome you in our hotel. Kind regards, and we hope to see you soon again.", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r518324198", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Don't waste your money! ", "review": "The staff is horrible!! There is hardly no food in the restaurant!! There is no wristband all inclusive, every time you want to get something from bar you have to show this stupid paper!! The swimming pool is the size of my shed and it's placed on the roof!! It smells in the rooms, there is no air conditioning, the beds are hard, the bath tub is so small I can't even fit in it and I am 170cm!!! Never going back here, this is my first day and already want to go back home from this bulls*it!!!!", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r518264439", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Hotel not near the beach. .", "review": "Dear guest. We are sorry that you are so upset of our services and installations. and we regret that you weren't correcly informed about what's included in our establishment. Thanks for your opinion. ", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r518150970", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "OK", "review": "I booked this holiday being very mixed as had read a mixture of reviews so wasn't sure what to expect.  After arriving my first thought was yep the receptionist don't seem to like the British that much.   Positives or hotel;  Bar staff friendly and very efficient Room nice size  Powerful shower  Every room has balcony  Ok location if you enjoy walking  Lovely views from the pool and sunbathing area.  Plenty of sunbeds  Rooms cleaned everyday   Negatives of the hotel: Food terrible no vegetarian dishes what so ever. All you can eat is salad and chips be prepared.  In restaurant they serve you your drink. Very slow service and sometimes you don't get one at all NOT IMPRESSED.  Same food every single day no different choices - disgusting.  Ants in the bathroom - lovely!  No aircon…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r518149957", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Room far too hot", "review": "Currently staying here for two weeks no air con in room none of us have slept simply too hot my little boy is currently now poorly.pool is unsuitable for small children sun beds aren't on the same level.cant wait to Ho home having to get a taxi everyday into town as nothing to do for son in hotel. Room is cleaned everyday and food is what you would expect won't be booking again. It's like being in a sauna all the time at night not pleasant", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r517891743", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Couldn't wish a nicer family holiday", "review": "Dear guest. We are deeply sorry fo this inconvnience, specially for your little son. I have received feedback from our hotel Manager, and he had a meeting with you, to try to solve  any problem you could have, including a room change. I hope that you and your son will be able to enjoy your holidays as expected. Don't hesitate to contact us again if you need any further help. Best regards.", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r515973421", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Excellent", "review": "We spent 10 days in this lovely hotel.Rooms are simple but nice and clean. Nothing fancy but we didn't care cause usually we don't spend so much time in our room.Good sized balcony also. We had all inclusive and we couldn't fault it.We have never been hungry. Nice salads, lots of choice of mains, soups were really tasty too.Packed lunch was good also plenty of fruits, water, breadroll etc. Drinks, cocktails, sangria etc at the bar is good and we had little snack every day between 4-6pm. There is a free bus service to the centre and takes approximately 10 min. Pool is good, lots of tables and chairs around it. Staff is really really nice, very helpful, hardworking they are really lovely.We had a great time here.Thank you!", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r515523368", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "One week at Hotel Perla Tenerife from Puerto de la Cruz, Tenerife", "review": "Dear guest. Thanks for visiting us, and for such a kind review. Reviews like yours encourage us to continue working to improve every day.  Kind regards.", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r515191256", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Perfectly adequate ", "review": "Fantastic little place! Friendly staff who couldn't do enough for us! Food and drink was lovely and plentiful! Pool was nice! Couldn't ask for more! Thank you very much for a fantastic holiday pearla!", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r514497366", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Confused card games ", "review": "I am currently here with my husband and 3 children in a two week holiday all going ok but was very confused last night in the bar area . After our evening meal as a family we like to play cards we started playing and the lady behind the bar ran over and said no cards only outside on the terrace . On looking on the terrace there are only approx 12 tables all which were taken so nowhere to go now we were the only ones in the bar no animation taking place sat in the corner causing no bother just wanting a game of pontoon not strip polker . I went to reception to ask the reason why the guy didn't want to talk to me and shrugged me off with a wave of his hand saying rules rules so I'm quite perplexed if anyone can enlighten me 😳😳😳😳😳😳😳", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r512081644", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "great", "review": "Dear guest. Our Manager would like to contact you, in orrder to explain you the reasons for having this rules. However, we have several spots were it is possible to play cards, if that is what you desire. Please contact with our reception. Best regards.", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r510620906", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Great value for a 3 star hotel, great food, clean, good size room but rude staff let it down", "review": "me and my friend (BOTH 18) went all inclusive for 10 nights. it's lovely hotel friendly staff, good range on drinks and the food is okay always something to eat. its a bit of a walk to and from the town but there is a free bus. if you are wanting to go to Las Americos there is a bus that runs and it only cost €9.60. If you are wanting a quite relaxed hoilday then this is the place for you. if you want to go out on nights out and stuff I would say go to Las Americas.overall lovely place and had a great hoilday", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r509134657", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "It's okay...", "review": "Dear guest. Thanks for your review. We are happy to read that you had a nice stay in our resort. Kind regards.", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r507217631", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Food was grim, hotel wa adequate", "review": "I came here with my mum in Early July 2017. The bus drops you off at the back entrance, which is unusual as you have to walk along a kind of gangway which takes you across a valley. Once inside the hotel you find yourself immediately in a corridor of rooms and you have to take the lift to the 5th floor where you'll find the reception.   Reception staff are not helpful or friendly and will not give out any tourist-friendly advice such as how to get around or local events taking place or places of interest to visit.  For this you'll need to get the free bus into town and visit the tourist information centre where they are a lot more helpful.   We stayed on floor 6 which is the same floor as the pool and evening entertainment area. There is no door to the entertainment area and so…", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r506915437", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Was just what we paid for", "review": "This hotel is very clean and comfortable don't believe the bad reviews, it's a three star hotel for reason, and I believe it was value for money, the staff where lovely friendly, and helpful, I didn't like sunbeds not being next to pool but there was no room for them and the pool was small, our room was large and very clean and beds where firm but comfortable, as for the food it was just what you expect, there was plenty of choice, the only thing I could say is that it was hard a drink with lunch as they didn't have many staff on (at lunch as they did at dinner) I must say that the some British people (that we saw) are rude and so disrespectful, and definitely should be shamed of their behavior. Anyway it's a lovely town to visit with loads to do and see just be prepared to walk…", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r506670635", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Fantastic all round service ", "review": "Dear guest. We appreciate your opinion. Thanks for letting us know your experience in our hotel, and we hope to welcome you soon again. Best regards.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r506564484", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "We had a great time!", "review": "Staff so friendly and welcoming Santiago on reception couldn't of helped more if he tried food and drinks a plenty. I read reviews after we had booked and paid and expected the worst. Couldn't of been more wrong it was a very pleasant stay and the food was great everybody catered for . I would recommend to anybody", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r505533456", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Avoid if you dont like Cockrells ", "review": "Dear guest. Thanks for your fantastic and nice opinion. We are glad that you enjoyed your stay in our hotel. Kind regards", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r504645050", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Worst", "review": "So many negative reviews for the Perla Tenerife. We are well travelled and booked 2 weeks cheap and cheerful. We have thoroughly enjoyed our stay. My Points are that yes the hotel is a little dated in parts and would benefit from air conditioning in each room other than a ceiling fan. The baths need a non slip mat as it's extremely slippery. Being able to have a coffee after breakfast would be good and not having to wait until 11am. The food although not ala carte was plentiful for all nationalities and there was always something to have. Three staff in the restaurant were worth their weight in gold Delia, a really tall young man and another petite lady with long hair. One bald guy on reception was friendly but all the others were grumpy especially the head waitress and the rest…", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r504555457", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "It's Ok, cheap and basic. ", "review": "We arrived at about 20.45 And the check in was pretty quick. Dinner was still going on so we basically dumped our bags in the room and went to grab some food. The selection isn't great but there are a few familiar things if you're not in to experimenting with your food. They had chicken nuggets, fish fingers, beef slices, soup and then there was local foods like rabbit and different types of rice dishes. If you're a vegetarian then I'm afraid there won't be very much selection for you. The desserts were..interesting. Very tart mousse, a very odd tasting rice pudding, some kinds of very strange cakes. But the ice cream is always safe. Breakfast was ok. Three types of cereals, coco pops, corn flakes and muesli. Loads of meats and cheeses and fresh fruits are available too. I was…", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r504172463", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Great for the price!", "review": "Dear guest. We appreciate your feedback, and will take into consideration your comments and suggestions. Receive our apologies for any inconvenience during your stay, and we hope that, overall, you had a nice time in our hotel. Best regards.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r503945104", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Stay at your peril.", "review": "I have just turned from here with my 13yr old son (13th-20th July), with such a mixed bag of reviews I had no idea what to expect but we had no problems at all.  Room was very spacious, cleaned daily. Yes it was very dated but that didn't bother us as we were out all of the time. No air con but this is advertised in their hotel description when you book, ceiling fan was not great but done an ok job. Our room was on the first floor overlooking the gardens and ravine which was a great view, large patio area, I took earplugs after reading about the cockerels and yes there are lots but they didn't wake us at all and we slept til around 830 every morning which is usual for us.  The pool is not that big but my son enjoyed it and it was busy while we were there, it is very deep and not…", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r503772459", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Great value for money!", "review": "Dear guest. Thank you for your review. It´s a pleasure to know that you and your son enjoyed your stay with us. Thanks for choosing us, and we hope to see you soon in another occasion. Keep well, and best regards. ", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r502979119", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very disappointed", "review": "Room was dated but didn,t matter. Was there 10 days before sheets were changed. One day the dirty towels were hung back up. The next day the cleaner had no towels. The food was worse than basic. The roast beef was so undercooked the gravy was 90% blood. I found small snails in the lettuce. Some of the staff were very friendly and helpful. I enjoyed the cockerels.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r501732407", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "its basic, what you pay for", "review": "I tend not to go on other peoples reviews as every persons holiday is different, i cant slate the hotel as much others have. 1 review said you get dropped off at the bottom of hill which made me nervous as i was with my mum and she suffers with her knees, it was literally a 2 min walk to the hotel from were you get dropped off and wasn't half as bad as I thought. The hotel and rooms are really clean and the maids are lovely. Alot of people complain about the cockerels but i can honestly say i didnt hear them, i dont think ive ever stayed anywhere abroad that doesn't have cockerels.  I paid £365 for a week all inclusive including transfer and luggage so wasn't expecting much. The food aint great but you can make a meal ive had better but i paid alot more for it, i did have 2…", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r501711562", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "3star rating is a push", "review": "Dear guest. First of all we are deeply sorry that you have not enjoyed your holidays as we would have liked. We apologize for the inconvenience and we will try to improve on the issues mentioned.  Best regards.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r500512243", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Get what you pay for", "review": "Stayed at this hotel the end of June with my partner and a few other couples, only good thing o could say is that the rooms are clean and a certain few bar staff were helpful. Very outdated hotel with minimal choice of all inclusive food, food selections don't go together so if you enjoy curry with mash potato, fish paella and carrots this place is perfect. I enjoyed the wildlife outside our balcony doors except the cockerel that screams at you at 3am and gets louder every hour. All inclusive is on till 11pm but if you are at the bar at 22.50 you won't get served for another drink, entertainment was pretty much the same every night, I'll never be able to listen to despacito again in my life. Pool pictures are deceiving, pool is a lot smaller when you get there, jacuzzi doesn't…", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r499824770", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Wouldn't return to this hotel", "review": "Dear guests. We regret that your stay was not as expected. We will take your comments in consideration for future improvements. Thanks for your visit, and best regards.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r499699944", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Disappointed and waste of money. ", "review": "Stayed for a week last week. For what we paid we were happy with. We fly all over the world and often stay in 5 star luxury  This wasnt but we wanted a cheap week and that's what we got. Good was adequate, rooms were adequate. We were on floor 5 overlooking the volcano and the sea. Staff were fantastic and everywhere was clean. But dated but again it's what you pay. Only problem was that we landed in the south airport which meant one and a half transfer. Well done to all the staff. By the way all inclusive is only from 11am - 11pm other times you have to pay    ", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r499624020", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Best staff you could ask for", "review": "I arrived here on 5th of July, hotel and room were both amazing for price we paid. Unfortunately my visit has been cut short due to an incident between myself and my partner. The staff could not have been any better considering the situation and I really owe them a massive thank you. Also first holiday I've been on in ages where hotel cocktails weren't machine made for AI. Again thank you for your kindness and support. ❤️", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r499589802", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "My stay at hotel perla", "review": "Dear guest. It was a pleasure for us to attend you. Thanks for visiting us. Keep well, and kind regards.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r499169308", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Worst place I've been!", "review": "My stay at hotel Perla well the hotel was next to a deep dry river bed with lots of chickens and cockerels running about which you can hear early in the morning the hotel was ok quite old looking rooms where big the food was ok at first salads chicken pork pasta pickled rabbit taste a bit funny but after a few days it got a bit boring all inclusive starts at 11am till 11pm you have to be out of the bar by 12 which I thought was a bit early the drinks were ok but in a plastic cup lol the pool was small and deep not really suitable for small children on a night there was some entertainment dancing karaoke and some different acts which was ok staff where quite friendly and met some nice people there the hotel is on a hill and the sea front is about 20 min walk downhill the beach…", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r498754812", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Fairly nice hotel", "review": "Dear guest. We regret that some aspects of our services were not as you expected. We will take note of your remarks in order to improve them. Thanks for your visit, and for sharing your opinion. Best regards.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r498604937", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Awful food", "review": "I would never stay at this hotel again! To start the food is absolutely awful which is either served cold or under cooked. 3 couples survived on chip sandwiches purely because the food was so disgusting. The food didn't go together at all and looked like it had been reheated every couple of days.   The entertainment is the same near enough every night with the same Spanish songs playing I wouldn't advise staying in the hotel at night.   The rooms are completely basic, but clean normally overlooking the chickens which will start screaming at 3am and eventually get louder by 7am.  The lifts in the building are not structurally safe as they appear to drop and leave a trip hazard when stepping out the lift. It also states maximum 6 people in the lift , but a staff member screamed at…", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r496587505", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Lovely hotel but food terrible", "review": "The hotel was lovely in a quiet area only 15 min walk into the town all down hill it's quite a hard walk back up but taxi is about €4 . There is a free bus that takes you down into town from mid morning til 6ish in the evening.  The hotel is very clean in all areas the pool is small but great for a quick dip it's on the roof and also a higher roof terrace with sun loungers. The staff are friendly and helpful . Our room was clear and quite big with a balcony some toiletries are proved there a hairdryer and also a fridge which wasn't the coldest but enought to keep some drinks cool we popped to a local supermarket and brought some drinks as the bar shuts at 11pm we could sit on the balcony and have a drink they won't let you take drinks to you room from the bar. I found the beds…", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r495861544", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "It is what it is", "review": "Dear guest. Thanks for taking your time writing this review. We sincerely regret your disappointment and we hope that you had a nice holiday despite these inconveniences. Best Regards, ", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r495543226", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A bit remote", "review": "I'm going to be honest, as always. The hotel was lovely and clean and always kept nice. It's basic but just what you need on a couples trip away. Don't expect a wild night life. The area is nice just be prepared for a bit of up hill walking. Bus service was great and regular. Hotel staff were mainly nice. The only thing I can really criticise is the food in the hotel. The meat seemed very cheap, the drinks machine was rubbish and a lot of it was greasy. The chickens will sometimes wake you up.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r491997193", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Not quite a pearl!", "review": "Dear guest. Thank you for your review. We´ll try to improve on these points you mentioned. We apologize for any inconvenience. Best regards ", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r491534390", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "OK ", "review": "Was dropped off and walked about 100 yards up the road to the footbridge across the ravine to the hotel which led to the lifts on the 1st floor. The reception is on the 5th floor and was met by a rather rude male receptionist, After booking in we were give 2 door cards but only one card for all inclusive, I asked for another card for my partner but was told only one card per room. While I was talking to receptionist another  guest came up and talked in Spanish to him, even though I was still talking he blanked me and talked to guest, when I said I was still talking, both of the ignored me and carried on talking. The one card  created problems as my partner likes to lounge by the pool and I like to sit in the bar, sometimes. So it was a matter of looking for each other to get the…", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r490181498", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Much better than I anticipated", "review": "So we booked that place last minute, at lunch to stay there that night. We'd been staying on a resort down on the south coast for a week, but had the last 2 nights free to go wherever we pleased. The hotel was fantastically kitsch, with decor from the 1970s, but very fetching for it. The real highlight is their ravine garden, really beautiful flowers and plants - totally unique. Half of the corridor to our room was a rock face!!! Wicked, like walking in Echo Base on Hoth. Breakfast was included, really good. Big buffet selection - I was happy with 3 types of egg, bacon, cheese. (Proper), wife was impressed with their 6 types of salt and 10 types of olive oil. Really great.  There's a lovely pool and sun-deck on the roof, with great views of the mountains and down to the sea. It…", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r489214682", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Girls break ", "review": "Dear guest. We appreciate very much your review, and it makes us happy to read that you enjoyed your stay in our house. We can only be proud receiving such nice comments, and we can only say....may the force be with you, always ! ;)", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r488654321", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Extremely poor hotel all round", "review": "Just came home from spending 5 days and 5 nights here at the Perla hotel Tenerife, some good points. Some bad but overall it was OK! Firstly the area (if you haven't been before). It's super far from the airport (1hr 30 drive) in a bus to Puerto de la Cruz, and then a taxi back from the centre. (We were lucky that a tour bus had loads of room left and took us for cheap). The bus is €13.55 taxi is roughly €5. Many operators do not have transfers here, as it's so far away! The town itself is very quiet - 5-10 min walk into the town, you have things like MCD, ice cream parlours, touristic shops, in the evening a few discos open (we have just come back and it's low season so not much was happening AT ALL, however from what I've heard that doesn't change much!), we visited a nice…", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r488428451", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Disappointed", "review": "Dear guests. We appreciate very much this feedback, and are grateful for taking your valuable time by writing this comprehensive review. We regret those aspects that were not as you expected, and we want you to receive our most sincere apologies. Overall we are glad that you enjoyed your stay in our island. Best regards. ", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r487056049", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Quiet Holiday in the Sun ", "review": "Just returned from this hotel, food was cold all the time so was unclear how long it had sat before being put out, only hot thing was soup, when I complained they pointed towards the queue for a small microwave to re-heat the food, and quality is poor.  Entertainment consisted of Spanish music for the elderly Spanish clientele and the hotel is full of Spaniards between October to end of May due to Spanish government. Hotel reminded us of 1970's, from the decor and furnishings are from the period, both barmen we saw were extremely miserable towards anyone not Spanish- I tried to chat to some of the Spaniards as I like to get along with everyone but was cut dead most of time. We won't be going back to Spain in future. Lager was OK but all inclusive local spirits were only fit to…", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r485896630", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Awesome place to stay", "review": "This place is great for food and staff  brill go all inclusive they serve your wine by the bottle not glass.  The location is good, and theres a free bus to the front.  Hire a car from plus cars at the airport, no credit card just debit and no deposit we paid only 89 euros with full insurance cover for 7 days.  Awesome", "date": "January 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r484943164", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "dont go", "review": "Dear guest. we appreciate your feedback, and are happy to read you had a pleasant stay in our hotel. Thank for choosing us, and best regards.", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r483731299", "sub_review": {}, "travel_purpose": "", "rating": 2}, {"title": "The worst hotel ever", "review": "chips with xmas dinner food terrible chips with everything new year dinner was a bit better, but entertainment rubbish for new year had to pay for drink after 11pm thought they might of give us a couple of drinks to take the new year in but no room wanted a face lift infact whole hotel could do with one, very rude staff on reception ", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r481446580", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Holiday review ", "review": "Dear guest. We regret that your stay was not as expected. I suppose that you had booked in all inclusive. This service ends at 11 pm daily. After that time ( even in Christmas ) all drinks are payable. You should have this information in your travel documentation. Friendly regards.", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r477783517", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Average. Random. Stuck in old ways to suit the older generation", "review": "We arrived around 9pm no food or drink available the hotel was very dated the rooms where a mess we asked for a double room we got two single beds we told the reception promised to move us they moved us into another twin room with the bed strapped together using a towel  The lift is dangerous we stayed in this hotel one night and moved into a different hotel with no refund nothing not very helpful staff no entertainment we were all inclusive but bar stops serving at 10 although we couldn't get a drink at 9pm  The food is disgusting ", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r476184083", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "great value for money", "review": "good clean hotel.staff are very polite and helpful.food and restaurant was lovely.we enjoyed a good relaxing holiday and will book again.not so good for children.great views from sun loungers on the roof.pool was fine.", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r475720381", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good Week", "review": "Dear guests. We appreciate your feedback, and also wish to welcome you again in the next future. Kind regards.", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r472952573", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Great", "review": "Excellent hotel based on cost. Exceeded my expectations. Food was very good and no complaints. All inclusive holiday. Cockerels others complained about could hardly be heard within the rooms and certainly not during sleep.  Staff were all polite and helpful.Service was good at all times. Rooms were clean and were kept clean by the excellent cleaning staff. Would recommend but set your expectations at the right level for the price you are paying. This is not a five star hotel but a good holiday hotel.", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r472834561", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Well..", "review": "Dear guests. We are pleased to receive your objective opinion about our hotel and our services. Thanks for choosing us, and we hope to welcome you again in the next future. Best regards.", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r472339939", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Good relaxing week", "review": "Went for a week with my fella really enjoyed it room was big and spotless also hotel. Food was not great though not much choice and not to my taste. Most people looked like they were enjoying it. The Cockerels didn't bother us at all. The staff are really good. Fella went to look for a shop in the middle of the night and got lost the receptionist took me to find him👍👍👍👍which I greatly appreciated. It's a 5-10 minute walk to the town centre. Apart from the food I loved it.", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r472133765", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Average ", "review": "We were a little dubious with so many negative reviews!  We had a room on the road side and didn't hear a single cockerel the whole time! We had actually bought ear plugs just incase!  The bar staff were at times quite grumpy and rude but other times nice! The restaurant staff just seemed ran off their little feet but helpful if you could get hold of one!   The food was ok - always found something we could eat, not the best quality but was fine! I think is depends on expectations- we didn't pay much so weren't too bothered!  We had a hire car - we went out each day touring the beautiful island and would take the bread rolls, cheese and ham from breakfast and make a little packed lunch for the day.   The room was dated but spacious and clean. We didn't even use the pool or sun…", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r469697838", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good Staff, OK hotel", "review": "Dear guest. We appreciate your objective opinion of our hotel, and are glad that you had a pleasant time in our island.  Best regards, and looking forward to see you soon again.", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r469354082", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good hotel, but it lacks 'something'", "review": "The hotel runs a shuttle into town that finishes about 6-7pm, otherwise walking into town is ok but uphill back is a challenge. As a holiday town, there seems to be little going on. We went into town on a Friday evening and it wasn’t pumping at all, boring in fact. Maybe we were too early? All the attractions were at the other end of the island. So you have a couple of choices, rent a car, take the 2hr coach ride. We did the latter and were on the coach as long as we were on the boat [to see dolphins and whales]. If I were to go again, I’d book a hotel to the south of the island for sure. The island itself was very clean and looked well maintained; roads seem good too.  The hotel could do with some money being spent but its ok. If you think budget hotel, not luxury, you’ll be…", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r468845129", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Amazing calm hotel", "review": "Dear Guest. Dispite the lack of entertainment, we hope you enjoyed your stay in our resort. Thanks for visiting us. Best regards.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r467931913", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Lovely", "review": "The transfer coach -or any coach or bus for that matter- cannot drop off at hotel so we had to walk a short distance , in the dark, its not made very clear that reception is on the 5th floor, so a group of us wandered around with cases on the ground floor like lost souls- well I guess we were. Eventually we found reception, check-in was very quick and easy. Our room was on the bottom floor, a little concerned about security, we asked reception about a safe to deposit our passports etc, we were quoted a ridiculous price, plus a deposit, so we declined and had to carry our passports everywhere with us. We stayed one week and overall quite enjoyed the stay, but, we found the food rather bland and tasteless and despite being AI we ate out a couple of times to get tasty food. The…", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r467179900", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good Holiday", "review": "The staff on reception where very help full and very good with a wi-fi problem.There is a 10 euro charge for one week for one tablet/phone/laptop,the wi-fi  speed is very good. The staff in the restaurant we all very happy and help full. The food was very good although not a vast choice there was always something tasty available. The food was served at a good temperature. As mentioned elsewhere there is noise from the local cockerel chorus but you soon get used to it Value for money was very good. We hired a car from the South airport and it was an easy drive to the hotel. There is a sign in the bar saying no card games allowed. Overall well recommended.", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r466826263", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Nice time ", "review": "Dear guest. Thanks for your recommendation. We look forward to welcome you again in the next future. Best regards. ", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r466589833", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "You get what you pay for", "review": "We had very nice experience. In my opinion we get exactly what we paid for. Food was tasty .It is very nice that you give bottle of wine or beer with the meals I still remember one waitress who always smile and was very polite to us .Many people was smiling and happy to help and give advise Is look like you care about entertainment for tourists ,I saw a lots of nice live concerts during my visit. Room always clean and tidy. In our opinion you should have free wi-fi for quest.For the future think about something small for kids; )greetings for Kiko very nice to meet this funny guy.", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r464293709", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "holiday or hell", "review": "Dear guest. We appreciate your comments, and are happy to read that you had a nice time in our hotel. Your suggestions will surely help us to improve in the next future. Kind regards.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r463104917", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Short break", "review": "Just returned from a week away with friends to celebrate a birthday. The food was basic but of a decent standard and all of us managed to find something to eat at meal times. The rooms where a nice size cleaned every day and the sheets and towels changed but the mattresses were a little uncomfortable but you get used to it. The hotel staff on a whole were friendly and very helpful and the bar staff even more so especially Pablo who put up with us every night ", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r462293120", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Lovely.", "review": "Here currently and loving it. The cockerels don't bother us and the location is pretty nice. The only downside is the beds. The bed is super hard and not good on my pregnant self's back lol. Everything is super clean and there's a good selection of food at each meal. we have enjoyed each meal so far. Reception is also very friendly and very helpful! ", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r462015021", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "I like it !", "review": "Dear guest. We regret the inconvenience with your mattress, although we have recently changed all the mattresses of our hotel. I hope our reception has arranged it to help you in this issue. Best regards, and thanks for your visit.", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r459963631", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Happy days", "review": "I feel happy and relaxed after 4 days at Pearla Tenerife. Lovely loction. Great view from  the roof. Perfect short break for me and my dauther .Very nice staff in a restaurant.  We  will never forgett roosters :))", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r459961926", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Would love to visit a third time", "review": "Dear guest. Despite the inconvenience with the roosters we have near the hotel, we are happy to read that you had a pleasant stay. Best regards.", "date": "January 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r459691473", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Short stay", "review": "Was I guess a little concerned with some negative comments. Great hotel all staff were excellent and if you asked for anything you recieved. Beer good and 3 meals a day c'mon how can anybody moan at that plenty of choice too. Was not just fish and chicken as others have commented, pork, roast beef and red wine at lunch and dinner. If the cockeralls bothered you just drink more free beer and sleep through it.", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r458276960", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "SO FAR SO GOOD!", "review": "Been here 2 days and it's beautiful! Weather is promising for Feb visitors! All inclusive local beer is amazing as is the local vodka! Entertainment of the evening hosted by Yanira is amazing and she tries to get everyone involved! All bar staff are incredible already know what I'm drinking as if I was in my local pub! All other staff are so polite and lovely. Defiantly a place I would come again 10 more nights to enjoy in this hotel ❤️ ❤️", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r457523880", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Short trip", "review": "Dea guest. Thanks for your nice opinion. We hope you enjoy the rest of your stay, even more than the first 2 days. Best regards.", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r456850908", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "One week in January, all inclusive", "review": "Just enjoyed a short break at this hotel very clean spacious rooms  food OK  excellent customer service  a bit out of town but 5 euros in  a taxi be prepaired for early morning weakening call from the chickens would recommend for a cheap break", "date": "January 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r456190144", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "80s timewarp hotel complete with cockerel chorus", "review": "Dear guest. Thanks for your opinion. We hope to see you soon again. Best regards.", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r454127777", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "My time", "review": "Hotel was fine. Staff were lovely, rooms clean. Only problem for me was as a vegetarian there were only two main meal times in the whole week where a vegetrarian option was offered. Ok, salad, chips...olives...but nothing else on main course. Even the soup was fish or chicken. Ok, if not a vegeatarian, and otherwise, a good value hotel, good surroundings, friendly staff.", "date": "January 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r453739321", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Bridging the winter gap", "review": "An all-inclusive deal for some winter sunshine and warmth. The hotel was fairly busy but the staff, we found, were attentive and obliging at all times. We arrived from Tenerife South airport on a transfer but had a walk of about 200 yards to the \"Bridge of the Rumbling Suitcases\" as large vehicles can't drive up there. Not a problem. A meal was there for us by reception which is on the 5th floor! Don't panic!! There are lifts. The room was functional with a view across the \"Ravine of Cockerels\" to some vibrant and colourful vegetation. The free-range poultry is everywhere in the area and the birds roost in the trees around. We never saw any cats so these may be the local equivalent of pest-control!  The pool and lounging areas are wind-protected and the views are great. The pool…", "date": "January 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r453295871", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great for families... except you can't have inflatables in the pool", "review": "Dear guests. We really enjoyed reading your review. Thanks for these nice comments. We hope to see you again in the next future. Kind regards, and keep well.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r449720485", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Very friendly hotel", "review": "We loved staying here.. the walkway from the road in to the back is a bit like the i'm a celebrity bridge so it was fun and one day we could see loads of goats walking in the ravine below... it was really nice!  The food is of excellent quality and lots of choice although the waiting staff only tend to offer to bring you one drink as they sit you down.  Pool area clean and there is entertainment in the evenings although a bit limited.  Children weren't allowed to take inflatables in the pool any bigger than arm bands so that could be a problem for some.  Rooms clean and aircon is really good.  Lots of roosters around the property so if you want total peace and quiet in the morning in particular this may not be the place for you but it just blended in to the atmospheric sound for…", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r449312852", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Dont do it!!!!!!", "review": "Dear guest. Thanks for your nice review. We regret that you had this inconvenience with our pool rules, but we have to respect all guests, and inflatables can be a bit annoying for the rest of clients. Overall, we are happy you had a nice stay, and will look forward to welcome you in another ocassion. Best regards, and have a happy year 2017.", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r448825243", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "\"Shambles\"", "review": "Great small hotel, staff are very friendly and helpful,  food is average, the hotel is clean would definitely stay here again, only bad points are the Cockerells in the morning but you get used to it, it is about 15 minutes walk downhill to the town which is steep but they do provide a free bus, I think some of the bad reviews on here are very unfair and looking forward to coming here again  ", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r448653881", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Fantastic-o !!", "review": "This was a very good holiday - we went there July 2016 (myself and partner in our mid 20's). There was a good mix of ages, mix of music to suit all.  The view from the balcony was nice. Was good quality for the price. The main town was close - couple of mins away. Cars are quite cheap to hire.  Would have been good to ave air con though. Receptionist David made us feel very welcome.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r448596538", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "poor", "review": "Dear guests. We are glad you had a pleasant stay in our house. Thanks for your opinion, and have a nice year 2017.", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r448460558", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "2nd stay was even better", "review": "This hotel was not what it said on the tin....  Pampers to the spanish.. caters for the Germans... English last. All inclusive is restricted from 11-11 with no snacks available during the day... unless there are a few pastries left from breakfast.. no kettle in the room  shock horror!!!   Entertainment is very poor for English as we were referred to often.  We went for our wedding anniversary... and regretted it... If we had the funds we would have booked elsewhere within hours of arriving. Some staff nice but not all... The two highlights re hotel are... the rooms were spotless so thumbs up to the cleaning staff and there was a bidet which is a personal thing of mine.  The boiler had a routine maintenance so no showers for two evenings... water went off at 9am . We will never…", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r448416360", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "The type of hotel that does not even ask you if you had a good stay, because they know nobody does!", "review": "Dear guest. We regret taht your stay was not as expected. However, all the agencies we collaborate with, have an exhaustive All Inclusive description. It's schedule, and what's included. We have no kettles in the room, but if you had asked at the reception, we usually have available (upon request and availability).  Refering your problem with the shower, i can only send you my most sincere apologies. I am sure that our staff has done everything possible to fix this problem asap. Best regards, and have a nice 2017.", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r447699779", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Mr Ian Ibbitson ", "review": "Stayed 15 nights for Christmas and New Year with my wife as we enjoyed the Perla last year at the same time. The staff at reception were very friendly and helpful as last time.   We were happy with our room (425) which was large and clean  and our beds were very comfortable. We'd asked to be next to the barranco (ravine) and knew to expect the sound of the many cockerels that start at around 4am. All part of the experience for us but others mights want to ask for a room on the other side of the hotel.  We were all inclusive but only took breakfast and dinner and were happy with the choices and always found something good to eat. The Christmas and New Year dinners were really good and even better than last year.   The hotel is in a very quiet area about 20 minutes walk from the…", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r445844784", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Disappointment", "review": "We were expecting for something else after we 've seen the pictures. Awful smell in the hotel. Old and bad equipped. Internet wi fi didn't work in the room, even if we paid for it. We 'll never come back!", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r442177758", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Winter Sun - A little Jem", "review": "Dear guest. We are deeply sorry that you have not enjoyed your holidays as we would have liked. Please, receive our apologies for these inconveniences. Your review will be directly redirected to the management of the hotel. Best regards.", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r441307135", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "fantastic holiday", "review": "Returned last week after a lovely 9 day break, the Hotel is in a quieter area of the town (cockerels excluded!) Our room was spacious and very clean.Staff are helpful and friendly. there is a variety of food to suit all tastes  - beautiful selection of breads and salads, It was great to have long set meal times eg dinner 6 - 9. Very accommodating features such as if were going to out all day you could request a picnic lunch or a late supper if you let them know the previous day. Hope to return.", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r439694735", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Awful", "review": "Dear gust. Thanks for your review. We are glad to know that you probably will return to our hotel. That is our best achievement. Unfortunately, the cockerels are in a natural spot, and are part of the local fauna :) Best regards.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r435906303", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Cock A Doodle Doo", "review": "just came back from a two week holiday with my partner ,the hotel is in an excellent location only a 15 min walk to the center or u can catch the free bus from the round about very handy ,the staff is very friendly and helpful , the food is very good and the all inclusive bar very good, loved the swimming pool and the sunbeds which are located on the top of the hotel all in all i can,t fault anything about this hotel i would return any time ", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r435011611", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Time together", "review": "A relatively small hotel in a quiet area of the town catering mainly for senior couples. Small outdoor pool and rooftop solarium were the best features-and the free bus into the shopping centre. Staff were friendly enough,but for evening entertainment you wanted to go out unless of course you enjoyed football or boardgames. Disappointed with the food selection..The basic fayre very rarely changed and I even  found myself eating chicken nuggets for an evening meal one night.Our all -inclusive wasn't exactly that-try to get water between 10.am(breakfast finishing and 11.am(all inclusive starting)-cheaper to walk to the local shop and buy there. The hotel and rooms are tired and in our room the bathroom ceiling tiles in disrepair,but the maids kept our beds made and supplied fresh…", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r434646075", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Short but sweet stay", "review": "Dear guests. We appreciate your feedback. We will take note of your comments, in order to analyze future improvements. Thanks for your visit.", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r434226319", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "brilliant", "review": "I'm rating it 3 stars because that's what it is. The hotel was very very basic but had nothing to fault therefore its standard and the upkeep and cleaning service was very good. The staff were on the whole very friendly with the occasional moody bloke. The buffet was very good and was often a good variation of food. Breakfast was always a fry up however and the options for vegetarians were limited-just fruit and bread. The entertainment was poor and consisted of just one or two ladies trying to get people to dance in a very small area. Overall if you are looking for a cheap and cheerful stay I would recommend, if you expect it to go above and beyond then you'll be disappointed!", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r433698149", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Paddy murphy ", "review": "Dear guest. Thanks for sharing your opinion. We aprreciate your feedback, and are happy to read that overall you enjoyed your stay. Kind regards.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r432204323", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "we will return", "review": "Had a lovely week 23rd October food very good drinks not watered down best all inclusive i have stayed in staff friendly, room just for shower and sleep sofa bed was a bit lumpy needs a new mattress but i put the blankets out of the  wardrobe on top of mattress did the trick slept well chickens not a problem entertainment not very good young girl tries hard but she needs to research what the British like music wise y m c a bit dated more Spanish fun than British although there were more Brits staying there that week Pueto del la cruz lovely place hotel only ten fifteen mins walk there is a free bus which we got going back as bit uphill walk also taxi was cheep we liked pueto more than south clean green less crowded but each to his taste", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r432143703", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Wouldnt return", "review": "I found reception rude from the day we arrived to the day we enquired about our pick up time to take us to the airport home. The long haired reception guy just raised his eyebrows and shrugged his shoulders because he didnt have our info. We found a web address and checked ourselves. Areas around the hotel clean but needed updating. Beds were all ways clean. (Thank you to the maids. Great job). Lovely and quite at night, when the entertainment had finished. Karaoke was so bad you had to laugh!!! The cockrels didnt really csuse a problem because i had ear plugs :).All inclusive  not until 11am. The reason people choose this is to be able to get a drink at any time. Hmm food not really that good. Seemed to have meat but nothing that actually went with it, unless you had fries.…", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r431536328", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great hotel for couples", "review": "Dear guests. We appreciate your comments, and we thank you for your visit. However, our All Inclusive schedule and content is clearly specified in the descriptions we facilitate to our agencies and travel suppliers. Best regards.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r431269383", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "What a Perla Poo", "review": "Smashing friendly hotel. Great food , very clean all areas. Swimming pool not suitable for children. All the staff could not do enough to make your holiday.  Yanra kept us all happy with her evening entertainment.  ", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r431183658", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Great Holiday nice hotel", "review": "Dear guest. Thanks for sharing your opinion with us. It's a pleasure to receive your comments, and we look forward to welcome you soon again. Kind regards.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r429431191", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very Enjoyable Holiday", "review": "We stayed at this hotel for 10 nights in October 2016. Our daily routine began by the morning vocals of the cockerels at about 4-5 in the morning and if we weren't woken up by the cockerels it was by the huge amount of ants crawling all over us. But I can't complain about free alarms? Who wants to relax on holiday? I loved the gaping holes in the bathroom tiles, it was so good to see that the maintenance hadn't spoilt things by making unnecessary repairs. I loved eating Wednesdays freshly made breakfast and actually eating it on Friday. On the second day I broke my tooth on a staple in the food. They gave us a bottle of champagne to say sorry but this doesn't make up for it.  We took the long trip in to town on the free shuttle, which was driven by a furiously angry man who…", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r428408297", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Great Hotel", "review": "For a 3* hotel this is great value as the food is good. The rooms are clean and spacious. The staff are very friendly.  If I go back to Puerto de la Cruz I would easily stay here.  It's a bit of a walk to the sea front but there is a courtesy bus laid on. We never used it as the exercise walking back up the hill was very useful, due to the nice food and drinks at the hotel 😊", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r428205653", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A really good stay", "review": "Dear guest. Thanks for staying with us. We work hard to make our guests happy and appreciate your feedback!", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r427831536", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Not bad but wouldn't return", "review": "We had an excellent two weeks here. I don't know why some people feel they have to misrepresent this hotel, as much of the negative comment is, in my opinion, totally untrue. So to put some things into perspective....We had good food for the full two weeks with plenty of choice each evening (we didn't lunch here even though we were AI). Food was never cold. There were vegetables available every sitting. There was a different home-made soup each day. Admittedly, the second week, some of the dishes available were the same as week one, but this is to be expected. I would estimate that each night, there was a choice of at least two meats, sometimes more, together with fish or pasta etc. There was always fresh fruit available.   Breakfast was good with all the ingredients for a \"Full…", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r427817210", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Honest and hopefully accurate review!", "review": "Dear guest. Your suggestions will be very useful for our future guests. We are glad you had a pleasant stay with us, and hope to see you again soon. Thank you for your opinion ", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r426666047", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Very acceptable, we'd come again.", "review": "The hotel is very clean and just up the hill from Peurto de la Cruz town centre, where all bars and shops are so location quite good.  The bed's were 2 singles instead of the double ordered and rock hard, never had decent sleep for the entire week.  The food was quite good, good choice and tasty, came with beer or wine at table.  The staff where friendly enough but hard to deal with at times.  Worst example was we where attempting to get the pack lunch for days out as part of all inclusive.  My mrs went the restaurant and reception over a few days and was at each request sent back and forth between the two being to to ask the waiter/receptionist for it, we just gave up.  Bar and entertainment basic but good.  It was impossible to get any water on the all inclusive outside…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r423655463", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Holiday", "review": "Lovely hotel, staff very helpful, polite , rooms cleaned daily . Comfortable bed . Entertainment fun to watch children, unable to join in unfortunately. Yanira the entertainer tried hard to get all involved. Quite hilly around hotel, taxis reasonable to get around also free bus into town", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r423272242", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Bit disappointed", "review": "Dear guest. Thanks for staying with us. We work hard to make our guests happy and appreciate your feedback! Kind regards.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r422116918", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "We had a lovely relaxing stay here, hotel was very clean, staff very friendly and helpful", "review": "Good points  Very clean hotel and area Pool clean but small and very cold Always something you could eat Quiet area Free bus to sea front Staff friendly and helpful Drinks good   Bad points  Many rooms very noisy – cockerels, early morning deliveries etc.  Food rather repetitive and never hot No entertainment except bingo and a poor disco Pool very small and quite deep Sun loungers up a level from the pool Nothing to eat between meals except pastries from 4 – 6 pm.  Information said “kettle in the room” but there wasn’t.  The hotel is in need of some updating but was very clean and in a nice quiet area.  It is a 3 star but only just.   The hotel is on a hill and has a lot of steps inside so not suitable for anyone with mobility problems.  When you arrive you will be dropped at a…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r422107296", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "\"Food always cold \"", "review": "Dear guest. Thank you for your visit and your comments. We will take advice of the issue with the temperature of the food, and i will forward this information to the Food & Beverages Manager to fix this as soon as possible. Receive our most sincere apologies. ", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r421820219", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Don't believe all youread", "review": "when we arrived we was a bit apprehensive about being dropped of at the roundabout, and no clear instructions how to get to reception. once checked in we found the rooms to be basic, patio area to be small, but hey this was a cheap get away. the location is not to bad its a 15/20 min stroll into town, walking up is a bit more challenging but overall the hotel was very clean the food was good for a three star, and the Bar staff was great, all very welcoming, didn't really like the bar closing at 11pm but i guess they have to have some cut of time, all in myself and partner had a comfortable stay. this is really a adults hotel i do not personal think its child friendly, as lots of steps and the pool is not suitable for children. But thank you Perla for a very enjoyable stay. your…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r421772650", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Clean but would not return ", "review": "I understand that this hotel was part of a deal and therefore we had not paid a lot for it but unfortunately, Hotel Perla was not up to scratch in my opinion.  Firstly the positives  The hotel was kept very clean. The rooms were cleaned daily and the communal areas and dining facilities were well maintained.  The staff were very pleasant. We had a translation issues a couple of times but the staff certainly tried thier best to make our stay a pleasant one!  We were all inclusive and the drinks service at the bar was good. However, it was a little annoying that you could not recieve drinks until after 11am.  This is the first all inclusive hotel that i have stayed in has had this policy. I certainly wasn't after alcohol at this time but as me and my friend are quite early risers…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r419475552", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Don't believe all you read", "review": "Dear guest. We regret that your stay was not satisfactory. In any case we will take note of your remarks and try to improve the issues that you`ve detailed. Thank you for your opinion. ", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r419384409", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "A nice friendly clean hotel", "review": "Well how can I explain this hotel. Stayed for a week sept 8th-15th 2016 and in this hotel that was to long. On first arrival we was allocated room 101 which lasted for about 5 mins, after entering the room I soon made my way back to reception demanding a Room change to which I was told the hotel was full but within a few minutes a room was found on level 2. I'm sure every new arrival gets allocated that room to see who doesn't complain. The rooms - where to start here, noted in the description air conditioning but the only air con was a ceiling fan which squeaked all night long and was full of dust just simply awful. The beds have seen better days and the pillows were just terrible. Balconies very small just very dated in the decor and not maintained to and kind of standard.…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r419131868", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent Value, Good Food, Nice Staff", "review": "Dear guest. We regret that you stay was not as expected. We will take note of your remarks. However, we want to inform that there is no description where it is detailed that the hotel has air condition. There is a ceiling fan in all rooms. Friendly regards.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r418187958", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "dont trust", "review": "we stayed at the hotel perla last week from the 6th -13th September What can we say about the Hotel Perla Tenerife? To start with the staff were fantastic. We arrived just before midnight on the 6th and David who was on reception was great. Once we were checked in, he opened up the restaurant for us so we could have a bite to eat. From there the staff continued to be great. They were all friendly and the cleaning staff cleaned our room daily we have no complaints what so ever about the hotel. Staff deserve a massive raise!!!! Food wise, we aren’t looking for full English meals every day so the food was varied as well.  The food on offer was good with such items as veal and rabbit being local delicacies included Beer wise. It was cold, so it was good in the 30+ degree heat. One…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r416734687", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "No upgrades availiable", "review": "Just arrived home from this hotel today and when speaking to the receptionist we were told there was no room upgrades so don't get sucked in and pay for one. There is no room with pool view. Hotel is clean and basic but on the plus side can get a sunbed at any time of day. Food good and the usual choices but I would say this hotel is not suitable for anyone wanting nightlife or disabled people .lost our I pad thought we d left in room but when got home and rang up no sign of it, mystery!!  The staff are all very friendly and try their hardest to accommodate . Over a hundred steps if try walking back up the hill, but a lovely tapas bar on way up if you need a drink. And not forgetting the cockerels in the garden be prepared to be woken early", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r416514606", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "A totally unique and truly wonderful experience", "review": "Dear guest,  we apologize for the misunderstanding about the pool view room up grade, because as you said it doesn´t exist, and we as hotel dón´t offer it to our partners. We will have to find out were is this wrong information comming from.  Kind regards,  ", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r416029829", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Worst holiday ever", "review": "You will read a variety of reviews about this hotel what I will say is I write fair reviews.  If you are willing to go with the flow and embrace the experience you will totally enjoy this hotel. The reception staff and restaurant staff are wonderful and you will automatically know who George is as he is friendly and funny. They will make you feel welcomed and are very polite.  So the food each day is a discovery to see what is out you can be guaranteed fresh fruit  along with a cooked breakfast / croissants and pastries lunch is salad and some hot dishes which vary and dinner is the same there is soup offered with both lunch and dinner. All is of a good standard maybe not cooked to the way everyone cooks however the food is kept hot and replenished when required. Drinks during…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r415727522", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Have learnt a lot of lessons", "review": "Dear guest,  we really appreciate the way you have shared your impressions.  We hope to see you again in Perla Hotel Kind regards. ", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r415409340", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Hotel perla puerto de la cruz", "review": "Do not stay at this hotel if you are English and prepared to be treated badly and rude by staff and the many Spanish people who stay in large groups every week end , stayed here with my partner in late August bedding wasn't changed every day, towels were folded to look like clean but on opening was dirty from the day before, the food was appalling slop, and many people was ill , one morning got up for breakfast went to the half eaten tray of bread for toast and found it had been turned up side down to hide the furry mould on the bottom ate out 9 nights of our all inclusive two wk stay. Drinks were fine first two days then got less and less and weaker and weaker and was rudely asked when are you leaving you drink too much by bar staff ,Spanish greeted with smiles chat and served…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r414729935", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Holiday", "review": "I read all the bad reviews and all the good reviews with this hotel and I always reserve judgement until I have experienced the hotel myself. I must say that I wish I had taken more notice of the bad reviews as I have never experience such a bad hotel. I paid my travel company for a room upgrade only to be told by a very rude receptionist that there is no such thing as a room upgrade? I was expecting a birthday cake for my daughter as pre-arrange... No such thing... Late check out... Only if they have a room... Or I will have to wait the 13 hours before I fly in reception!!  Rooms very old and dated. Fridge doesn't work, toilet doesn't flush, tv makes a piercing loud pitch noise and the best is the beds smell of urine...  I complained and asked for an upgraded room ( although I…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r412869548", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Quiet week away", "review": "On arrival at 3am I was a little shocked to find that transfer buses can't get with in a 5 minute walk up the hill. But once you've worked out the buzzer and through the broken English you need to find a lift and get to the 5th floor to check in. But after that apart from having 1 plug socket in the room witch the TV used the staff sorted an extension cable for us very quickly so the wife's hair straighteners could work. Happy days  The hotel was very clean as there seemed to be cleaners everywhere, the food was limited but what was on offer tasted great. The swimming pool was small and deep it was too small to chill out when kids are try to dive in everywhere. Nothing much of a nightlife unless you love karaoke. All the staff were good and helpful and I've got to say a big…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r411742847", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Clean and Quiet , fine for a short break and somewhere to crash !", "review": "Dear guest. Thanks for your comprehensive review. We are glad you had a pleasant stay in our hotel, and we will take advice of your remarks in orden to continue improving for the coming future. Friendly regards.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r410559384", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Best hotel in this residential area", "review": "We stayed for 4 nights in August and found the hotel to be clean, quiet and a pleasant enough place to crash. We didn't spend any time at the hotel during the day or evenings as we were down in the town exploring or at Lago Martianez (a must visit!) and the evening entertainment looked rather limited and a bit dull for a couple in their late 20s.   We ate breakfast most mornings and it was fine and we had dinner their once which again was perfectly edible. The all inclusive beer was nice too !   Its a nice easy 15/20 downhill walk to the beach/strip of restaurants and a further 10 to the busy town square. We enjoyed this walk every day and it's under 4 euros in a taxi for the uphill return leg.  In summary I would recommend this hotel to people wanting somewhere to crash who…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r410112006", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nice hotel", "review": "Dear guest. We appreciate your comments and we are glad to read you had a pleasant stay in our hotel. Thanks for choosing us.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r409850055", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Fab holiday!!", "review": "Had a fab time at the perla tenerife. Was worried as had read all the negativity in reviews on here.  All the hotel staff were very warm and friendly reciprocated by the four of us...my husband, daughter (24) and son (17) and myslef. Food was good with lots of choice, even for the vegetarian in our group...again we had been worried about this due to reviews read, but really had no need to be. Rooms and hotel were kept very clean daily, towels and bed linen changed very regularly. Yes it was cloudy at times...That's the nature of the north of the island if you do your research you will know that. Yes the hotel pool is one the smaller side but still it's a clean pool with ample seating. If its the pool scene your after, a 20-30min walk to town and for 5.50 euros you can have…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r409703222", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Holiday", "review": "Dear guest. We appreciate very much your kind review. It`s a pleasure for us to read such comments, and for sure it will help us to continue working this way. Of course we will continue improving, but this is really a boost to our efforts. Kind regards.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r407939997", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good family holiday!", "review": "We booked this hotel 3 weeks before departure on an all inclusive basis. The hotel is in need of updating but is, however very clean.  It was quieter than we expected for August which was a pleasant surprise. For the money paid we couldn't fault the  quality of food there was plenty to choose from and the salads were excellent.  The 12 hour 11-11 all inclusive package in our opinion was perfectly adequate and we appreciated the bar closing at 11. For the younger clientele who moaned about this, they should have checked the hotel before booking!! However the downside were the moaners of which there were plenty and the appalling  table manners of a significant number of the clientele .The hotel had a dress code for meal times  which required  smart/casual dress for dinner. It is a…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r407347889", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Hell in a hotel", "review": "Dear guest. We regret that certain details of your stay were not satisfactory. We sure will improve with your suggestions and opinions. Thank you for your visit and best regards. ", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r406981468", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Enjoyable week in clean, well run hotel", "review": "Service was good from start to finish especially Jorges the waiter although all the restaurant staff got to know us and acknowledged us every meal.  There was a good range of food available every meal time. Suited our palates! There are packed lunches available if you want to go out for the day. Cleanliness was brilliant.  Liked the sun terrace being slightly away from pool as you could chill out. Pool was lovely and clean. Amazed at comments about pool not child friendly. It may be deep but there were plenty of children in there. We didn't see a double standard from lifeguard. It was when the play became too boisterous that the lifeguard stepped in.  The evening entertainment was on a small scale but that suited us as we wanted a quiet holiday. In the evening we sat outside by…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r406591420", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Excellent Weekend break...Superb Service.", "review": "We were two families staying there for a weekend. The service received from the Hotel Staff specially mentioning the service they gave since we were vegetarians and they took that extra effort to serve us vegetarian food out of the regular menu.  The hotel is at a quite location. You can be at peace inside the hotel, at the pool or at the solarium.  The Sauna was not working.  The things that need attention :  1. The rooms need air conditioning in the hot weather. The ceiling fan does not serve its purpose. Thanks to a pair of fans we bought locally in the city.  2. The Sofa bed is really very very bad for a person suffering from back-pain.  3. The mattresses should be changed. We got one good and one bad one in our room.  4. The pillows should be changed. They are really flat…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r406042223", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Good value for money", "review": "Dear guests. Thansk for staying in our hotel. We appreciate your comments, and we will take advice of your suggestions.  Best regards.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r405166100", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Very clean and overall had a good holiday", "review": "We have just returned from a 10 day family holiday here. Based on our experience, the good points are: Clean Great staff- very helpful, hard working and friendly Nice quiet location Food will keep you alive, but very little children's choices Wine with meal was a whole bottle 👍 Bad points All inclusive does not start until 11am and ends 11pm on the dot then bar closes The pool is as other reviewers have pointed out deep. There is no shallow end. The small children's pool was about the size of a paddling pool- it is also located on the sixth floor on a roof terrace Sun loungers are situated well away from the pool on a panoramic terrace. Nice views but again with children could not use loungers whilst children splash around. Go to lago martianez in the day- fabulous for kids!…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r404281944", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Wouldn't go back", "review": "Dear guest. Thanks for staying in our hotel. We will take advice of your comments, wich will sure help us to improve. Friendly regards.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r402010017", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "This really isn't a bad hotel", "review": "We have just back from a weeks stay at La Perla. We had an enjoyable time and met some lovely people.  My son thoroughly enjoyed himself.  The rooms were big and clean.  The food could be better. More choice for people with allergies, i.e wheat. Also extend the all inclusive drinks for before 11 and maybe until midnight. An all inclusive band would be much better as we were asked for our pass all the time.  I recommend maybe they introduce some children's entertainment and more activities. Thanks a lot for a very memorable holiday.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r401904943", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great 2 weeks holiday.", "review": "I have very little to complain about the staff are helpful and friendly the rooms are clean and pleasant and all made for a great holiday. If I had one complaint its that the wifi kept dropping out but didn't upset my holiday. I would recommend.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r400507598", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "What a blast", "review": "Dear guest. Thank you for your recommendation. We will take advice of the issue with the wifi to solve it inmediately. Receive our apologies for this inconvenience.  Thanks forr staying with us, and we hope to see you again soon. Friendly regards.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r398462829", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Basic, Pleasant but not for us again (as a family).", "review": "To be fair had a great 7 nights at the Perla with my friend.......heads up to Pablo and Francisco for putting up with us,they were brilliant.   As for the hotel its very clean rooms are cleaned daily which is very good, now to the food,to be fair it wasn't that bad I just prefer to go out for an evening meal but lunch will keep you going........I have travelled many different places and met many interesting people,but, Tenerife and the perla have been brilliant met some really good people and really did have a great time..........going back next year", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r397215151", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Worst hotel in the world", "review": "Dear guest. We are grateful for your comments. It´s a pleasure to reach your expectations during your stay with us. See you soon. Kind regards.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r395533121", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "You get what you pay for!!", "review": "TripAdvisor   We read a lot of reviews about this hotel just after booking.  Is it suited for families? We would say no.  However it wasn't as bad as we thought, the rooms are basic, cleaned daily and the staff do what they can to help, but we wouldn't stay again, here is why.  The wife and children are Vegetarian, the first meal we went too even the plain broccoli and plain cauliflower had ham mixed in.  It seems they put ham with everything, even the VEGETABLE PALLEA (advertising vegetable) had pork in.  So meals initially were a problem.  However, the staff were very helpful and did start providing food suited for vegetarians.    The pool isn't really suited for kids.  There is a jacuzzi (never on) which they class as the kids pool.  The pool itself has no shallow end.  The…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r392582712", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great company", "review": "Spent 10 days here at perla and had a great time! Met some fantastic people and a mix of languages! The staff are super friendly and are happy to get you whatever!  Yanira who does the entertainment is great and so lovely, and you'll never be bored! Quite impressed for saying its a 3 star hotel, nothing is ever too much bother!!!  Would recommend for a quiet break :) ", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r392282827", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "4 star quality at a 3 star hotel", "review": "Dear guest. We appreciate your feedback and recommendation.  Kind regards.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r390908793", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Well worth the money - remember how cheap it is!!", "review": "Really enjoyed our stay here, the rooms were big and very clean and the food was very good compared to other three star all inclusives, they have a pool with a jacuzzi and sauna and a sun bed area, and lots of different drinks were available (but no cocktails) entertainment was okay but we were told that the hotel doesn't really get busy until August so there is probably a lot more to do then. The free bus service to the town is very useful, also really easy to get to the beaches and Loro parque. There is also quite a few shops and restaurants around. All the staff were really friendly and helpful, can't fault them. The only downside for us was that there is no air conditioning in the rooms, they have a fan but even with that on and the door open it was still too warm.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r390024365", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A pleasant off-peak break", "review": "Dear guest. Thank you for your nice review. However, we apologize for the inconvenience and we will try to improve on the issues mentioned. Best regards. ", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r374895337", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "My spring holiday", "review": "We visited the Hotel Perla at the end of June and were a little apprehensive after reading some of the reviews prior to our visit. However, that was soon put to rest on arrival.  Our flight had been delayed so by the time we arrived, the All Inclusive program had finished for the evening. We went to our room (which was basic but very clean and spacious!) and then popped to the bar where the barman (Diego) gave us some water to take to our room after we had bought a round of drinks.  The hotel is located in a very pretty residential area and as some of the reviews mention, has a predominantly Spanish clientele. However, we were not made to feel different or isolated because of this as some of the reviews suggest. I actually speak Spanish and can tell you that a little goes a long…", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r371989636", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Try to avoid the place", "review": "There is only one plus of the place - nice and helpful stuff.  The food was plain and cheap. Remember, always look at the ketchup ;) If the management saves on ketchup, it will try to save on every other food products.  The carpet was dirty and stained. The furniture were dirty and wore out. I saw holes in blankets.  The hotel is in the middle of nowhere. You need to spend 5 EUR for taxi to get to the beach or walk 30 minutes.  The hotel was full of retired people. We were literally the only one couple with a kid.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r371187614", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Could not recommend", "review": "Dear guest. Thanks for your comments. We regret you had these inconveniences in our hotel, but let me inform you that we have a free shuttle bus wich drives mondays to fridays the way between the hotel and the shopping center \"Martianez\", wich is close to the beach and the sea water pools. And yes, we have many old people now, but this is a normal circumstance in these months. The rest of the year we have all type of clients, including young and middle age people. Thanks for our visit, and overall we hope you had a pleasant stay. Kind regards.", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r366004250", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Overall very good", "review": "This is the first time I've written a bad review. Hotel staff are lovely but that is it. The first room they gave me was 2 doors down from the bar on 6th floor. I was moved to 5th floor then when I complained. Beds rock hard bad enough to hurt your back, the town is a very steep hike back to hotel, not what you feel like after going out to eat because food so bad at hotel (im not fussy at all but this food is bad and what you can eat is cold even after re-heating in microwave).  Beautiful place to visit but pick another hotel.", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r365467831", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "would not go back", "review": "Dear guest. We regret that certain details of our Buffet were not satisfactory. We try always to satisfy most of our clients, and most of them are pleased with the dishes we offer. Anyway, we thank you for your comments, and we gladly accept any suggestions to improve. Thank you for your visit and best regards. ", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r365084350", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Wouldn't recommend", "review": "Just got back from here today. It was a lovely stay. Hotel spotless and rooms cleaned everyday. Staff were friendly and knew most of the English language they can understand you well.  Pablo on the bar was brilliant very welcoming and could have a good laugh! but there was another member of bar staff that was miserable one in particular. Food wasn't great but it was as expected it's 3 star not 5 just remember. Breakfast lots of choice...lunch and tea mire Spanish style but they try to put English dishes on aswell. They get a lot of Spanish staying there so they have to cater for both I suppose. We got some good days of hot sunshine whilst we was there bit of rain though. It's a 15min walk to bottom of hill to beach shops and resturants. Plenty to do. There are excursions to go…", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r362802210", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Honeymoon ", "review": "Looking forward to staying from 25th April on our honeymoon mixed reviews but mostly good see you soon is there kettles in rooms were both very young at heart 61 and 58 so should suit us well .just hope it's hot then x", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r362216884", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "4 star service for a 3 star Hotel", "review": "Dear guests. Thanks for choosing our hotel. At arrival you can ask for a kettle at recepction. They usually have, but it is upon availability. I hope you get a sunny holiday. These days have been a bit cloudy, but with a mild temperature ( betwenn 17 - 22 Cº during the day ). See you soon. Kind regards.", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r359954436", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Deceiving Hotel", "review": "I stayed here for a week with two friends and I have to say it surpassed my expectations in some ways and in other its wasn't any less than the 3 star service you'd expect.  I wouldn't recommend it for younger groups as it was more for the senior type, however, we made a lot of friends there from all parts of Europe.  I also wouldn't recommend it for those with physical inabilities as the walk to and from the beach front was like an mountainous trek every time you walked it (and all up hill on the way back).  Due to flight complications we didn't arrive to the hotel until mid-night (as apposed to 8pm) and as we gave our names and received our All inclusive and room cards, the reception staff informed us that a plate of dinner was saved for us if we were hungry, which was an…", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r359875449", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Easter Break", "review": "Dear guest. Thanks for choosing us, and for this nice and comprehensive review. We hope to see you soon back again. Kind regards", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r359126271", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "the bridge was wierd", "review": "Was a bit anxious before me and my friend after reading the mixed reviews. Would not of changed it for the world. We arrived and thought oh no, what have we got ourselves into. You get dropped off at a roundabout and need to walk up to the back entrance of the hotel over the bridge in the \"jungle\" as I liked to call it. We followed the signs to reception and then got stumped, luckily some people were passing by and told us to get in the lift and go to level 5 for reception. Check in was quick and easy. Safety deposit box is 30 euros in total but you get 15 back at the end. It's 10 euro for wifi for a week, very hit and miss if desperate get it if not do without. The room was clean, and basic, we had clean bedding, got spare pillows out as one does not seem enough, a little…", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r358290331", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Better than expected", "review": "We've just got back from here and had a lovely time. We had read very mixed reviews so were unsure what to expect. However the staff were great particular mention going to Kruger, Darwin and celia who were excellent. Always smiling and happy to help. Yes the cockerels were a bit noisy but didn't really bother us. The pool was warm but sadly the Jacuzzi was 'kaput' so they said! The food was fine and the drinks were fine.  ", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r355512045", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Help", "review": "Dear guests. Thank you for this review. We are glad you had a nice stay in our hotel, and we hope to welcome you in the next future. Kind regards.", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r355411856", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Superb!!!!", "review": "Ho not a review but I can't find an email address for hotel my girl friend has booked here this week I was unable to join her but have now managed to do so .I have got same flight out she has paid for the room how much more would it cost for me to stay the week she has booked all inclusive . ", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r354837579", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely Break", "review": "Good afternoon. I am not able to give you our email address through Tripadvisor, but you can find our details if your search us at Google, and type our Hotelchain name ( Gema Playa Hoteles ). There you can find the contact details for Hotel Perla Tenerife. Best regards.", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r353036432", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Hidden Gem", "review": "had best holiday ever!!! Rooms basic, but do u go to holidays to spend them in rooms?? staff wonderful..Especially Bar boys- Pablo was the best!!!! Food - never left hungry... simple and tasty.... Thank you!!! We will be back!!!!!", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r352880822", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "interesting", "review": "The hotel was generally clean and the staff were helpful and friendly. There was a small swimming pool under cover which kept it a bit warmer and a very nice sunbathing area with views over the town and of mount teide However, the beds were rock hard , the dining hall was a little too small and the food was always luke warm or cold. The lift felt a little unsafe, although we never had any problems. The location was good in some ways and bad in others. It was very quiet as it was away from the main town but without a car there was very little to do because it was away from the town. The hotel seemed to be geared for German tourists and there were a large number of German pensioners staying who seemed to all now each other so it was difficult to get to know anyone but maybe this…", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r349672213", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Not Good", "review": "Dear guests. Thanks for this review. Wwe´ll take note of both issues you mentioned about the bed and the Buffet, nad solve them as soon as possible. Best regards.", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r349608290", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 1}, {"title": "Extremely Average", "review": "first the hotel was very basic unless the curtesy buss turned up it was a long walk into Puerto de la Cruz there was no entertainment food forget it landed on the 3rd floor at the back and all night long all you could hear was the squawking of the hens had very little of the \"all inclusive\" It was just a bed for me although the week was a present i would never use it again", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r349177677", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Some great aspects but small things let it down ,but overall good.", "review": "Dear guest. We regret that your stay was not as satisfactory as you expected.. Thank you for your opinion. ", "date": "January 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r346835302", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "staff", "review": "Positives: Friendly staff, nice sunbathing area, generally clean, very quiet, 10 minute drive to Puerto De La Cruz, large space for clothes. Building: Lifts are interesting (very old, cranky), dining hall is too small, no heating, swimming pool is too small, sauna was not working, wifi not working, no signs to hotel so had to get a taxi to instruct us where to go, must have a car to get around as in the middle of nowhere. Rooms: Beds are extremely hard and uncomfortable, shower has no power, bath is the size for a child, handles on doors aren't straight, balcony shows a wall with no view what so ever, patio doors don't lock, the ''duvet'' was like a curtain, pillows are long, flat cushions which are uncomfortable, pillow cases weren't cleaned, just turned over. Food: Luke warm…", "date": "January 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r346228279", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Average", "review": "Hotel was clean and well maintained. The only two things that we didn't like are unfriendly restaurant crew (except one woman) and english breakfast every single morning (we were expecting some local meals). Paid WiFi available only in reception area due to poor signal. In conclusion - our stay was good but we will definitely not come back to this hotel.", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r345647392", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Beautiful Surroundings", "review": "Dear guest. Thank you for your opinion. We apologize for the inconvenience and we will try to improve on the issues mentioned. Greetings ", "date": "January 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r345376726", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Really enjoyed our fist time at the Perla", "review": "Although basic, the hotel is set in beautiful grounds with just a 15min walk to the beach. The hotel is exceptionally clean and the staff were very friendly. This might have been enhanced because we made an effort to communicate wherever possible in their language. They genuinely appreciated that. I'd definitely stay here again, in fact I'm already looking into re-booking. If you like beautiful landscapes, scenery, architecture and people - the quiet life - choose here. If you want to party, head south.", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r336519576", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Walking is good for you", "review": "Dear guest. Thanks for this nice review. We are looking forward to welcome you in your next visit. Best regards.", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r330749762", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Holiday last min due to sharm cancelling", "review": "Christmas and New Year holiday with my wife now our 9th time in Puerto de la Cruz but the first at the Perla. It is a good distance from the centre of town but not too far. We walked down and back (sometimes again after dinner) almost every day and I'm not the fittest. The quiet area and location beside a barranco away from main roads and crowds suited us perfectly. The cockerels in the barranco are noisy and can start as early as 4am but after a couple of days we were used to them and now were back home we miss hearing them!  Very friendly and helpful staff made us very welcome. Our room was very clean as was the rest of the hotel. The small fridge in the room was useful. Really great shower and the beds were very comfortable.  We were all inclusive but only took breakfast and…", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r329713005", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Ok hotel bad rooms 101 to 104", "review": "Hotel ok. Very difficult to find in residential area in a one way system. 10 mim walk down hill to a few bars which were closed sat and sun. Foods fine generally able to find something. Rooms large and clean. Our wardrobe did smell fusty so couldn't hand clothes in it. We didn't have a fridge or any chairs in room, the room chairs had been moved to the terrace. Not good having fabric chairs outside when it rains. Do not stay in rooms 101 to 104 these rooms are at the front of the hotel and there is a 30ft high stone wall 10ft from the patio door making the rooms permanently dark. All inc for drinks runs out at 12pm on the day of departure which they didn't tell us about. ", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r328846090", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "very good service at low prices", "review": "Dear guest. We´ll take note of your comments, and we regret that there have been some aspects of your stay that have not been satisfactory. It is our intention to improve day by day with the suggestions and comments that our clients make us. However, let me tell you that all information relating to all inclusive service, as well as schedules are given to all guests at their arrival at the hotel. Thanks for your visit, and best regards", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r328831697", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Basic average hotel", "review": "part of the way, allow me to evaluate. hotel clean, cozy. helpful staff. very good selection of food at 3 * hotel. quality thick juice, coffee, cappuccino, chocolate, various liqueurs in the all inclusive. On the beach, or you can go shuttle bus. hotel in comparison to the price / quality is welcomed. ", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r327568284", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Holiday ", "review": "Dear guest. Thank you for your kind comments. We hope to see you soon shortly. Best regards", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r325580313", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Average/good depends what you paid!", "review": "Was a little out of the way and certainly nothing like the photos. The only good thing was the cleanliness, it was spotlessly clean, This is the reason I have rated as average. Lack of Air-con can make it a bit stuffy in the rooms. Food was ok, quite basic, breakfast & desserts were very repetitive All-inclusive was a bit of a waste for us as we spent most of the time in town where the food and drink is very cheap and much better than what is on offer in the hotel. 99% of the staff are very helpful and friendly, this is let down by 1 grumpy barman who never smiled or spoke during the time we were there. Everything seemed to be a chore for him and he certainly wasn't meant to be in the 'entertainment' business. Beware of the 11pm finish for all-inclusive. We were in the queue…", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r295020350", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Quiet holiday", "review": "The hotel perla Tenerife was a little of the beaten track but really friendly place but mostly Spanish who were really nice just couldn't understand them .we went all-inclusive some of the food was Spanish but there was something for everyone to eat the pool area and the bar and bar staff were funny and helpful .not far from the town which was really good for food or get a coffee and do some people watching would go again even thou me and my friends were younger   .", "date": "February 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r288928199", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "tig and freda", "review": "Just had a month over easter and it was brilliant. Hotel was very clean, towels changed every day and sheets changed every 3 days. Staff were friendly and very effiecent.As long as you don,t mind walking the scenery is breath taking, well worth the the money.2 down points no dark rum and no HP sauce apart from that one of the best holidays wev,e had.", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r268462137", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Don't pay for all-inclusive don't go there at all", "review": "Worst all-inclusive experience in my life  Awful place. .. Not worth money I have paid .. Only staff there is kind and helpful  Restaurant and room service doing great job  Guest age 60+ Drama drama drama", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r267726243", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Don't go there worst hotel posible", "review": "I would not recomend this hotel, not even to my enemies.We went there for easter this year and picked the hotel because of ''kids club'' facilities advertised.:         - No kids facilities whatsoever in fact the place is a focal point for very old age pensioners from Spain France and Austria          - we got coned by cheap all inclusive deal but if you want a coffee at 10 Am tough luck couse restaurant is closed and bar openes at 11 am. If you dare go back in the breakfast area you get cautioned. and most off all very bad food. All breakfast meaty products are so bad you can smell the plastic inside from a mile. All the alcoholic drinks you ever heard off you have to pay as included in all inclusive was only cheap no name (e.g. i couldn't finish one pint of beer). Coffee was…", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r266119111", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "A really nice place", "review": "After reading some of the reviews I was a little apprehensive about this hotel, but they were all dispersed on arrival. The staff were helpful, pleasant and friendly. The room was bigger than expected, was very clean and comfortable - cleaned every day. The Hotel sits North to South so one side gets the sun in the morning the other in the afternoon, so you get the sun in your room for half the day. The rooms all have a small fridge but no kettle (we took a travel kettle, which for Brits' is essential!!). A good sized bathroom. The hotel is in a quiet location out of town, but there is a shuttle bus every hour (not Saturday pm or all day Sunday). We enjoyed the walk into the town (about 25 mins down hill) coming back is uphill so unless you want the extra exercise is something…", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r258920318", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice friendly clean hotel", "review": "Just had 10 nights at the Perla and it was an enjoyable stay.  The staff are friendly and helpful (which they weren't in the last hotel I stayed in at this resort) and the buffet food generally good (desserts could be better but there's plenty of ice cream!).  The room was cleaned daily and the maid set up the clean towels in the shape of two swans on the bed most days, a nice touch.  It felt like the staff enjoyed their work and wanted us to have a nice stay.  We had a second floor room overlooking a ravine where the dreaded cockerels roam.  These caused us no bother at all, in the event, but the one noise-related thing I would comment on is that the walls / floors / ceilings are paper-thin so you might want to take some earplugs!  Thankfully most of the clientele are of a…", "date": "January 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r251335380", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "dont go two weeks before christmas", "review": "first of all you couldn't fault the cleanliness, the rooms are average but do have bath and shower although bath very small ,no one spoke much English and this was the Spanish and German holiday time so music was all foreign I didn't mind that as I was in Spain. alcohol was very cheap and wine not drinkable, the pool was freezing and the Jacuzzi  the food was just ok for a cheap break  ,although no one told us there was a tv lounge we found out off people on the way home apart from us no one in the hotel was under 65 and that's being kind but all in all staff did try and help and cleaners could be more kind", "date": "December 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r250306571", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Great Value, over-delivers vs price and star rating.", "review": "Being a Regional Sales Manager for 4 globally branded boutique style hotels in London,  I was pleasantly surprised how this halfway-up-the-hill  hotel  offers a great deal  and excellent value for money.  It's best features : The staff << could not do enough to make me feel at home and welcome, even the housekeeping staff were friendly and greeted, and the restaurant and bar staff were always there and knew after a day whet I liked and wanted.   The food is plenty and varied, on the departure date the continental side was ready at 530am to allow us a breakfast before departing early.  The food qualty is good for a 3 star hotel, the evening with local cuisine and Rabbit dishes was really nice and tasty.  The all inclusive element meant a reasonable selection of deinks including…", "date": "January 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r250187491", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "tig and freda.", "review": "Have been here a few years ago and it was very good, it was clean, tidy, friendly and the food was axcelent. The only fault i could find was they did not do dark rum (ron negro) which is rhe same price as other cheap spirits.I have booked again for march for a month so having dark rum will make the holiday perfect.", "date": "February 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r249827607", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Shoot the cockerels and sack the dj.", "review": "All inclusive stay three rooms, family stay over new year.  Breakfast excellent, lunch ok and dinner usually very varied.  However. You may only have beer, tap water or unmarked (awful) wine by the bottle in the restaurant. You may NOT EVEN TAKE A COFFEE out of the restaurant!  Only CERTAIN DRINKS ARE ALL INCLUSIVE. Coffee included, cappuccino you pay! Tiny pots of cheap ice cream included, ice lollies etc you pay! Cakes at 4pm in the bar, these are the Danish pastries left from breakfast covered in a tea towel on the bar. Do not expect afternoon tea! The pool area is great but the sunbathing is on a different level so you can't relax and let the children swim. But the lifeguard is there.  THE DJ. SERIOUSLY NEEDS SACKING!!!!! 7 nights full bar and no one on the dance floor!…", "date": "January 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r247299741", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Value for money 3Star in lovely Porta de la Cruz.", "review": "Ten Day all inclusive christmas break. The hotel has undergone a refurb and was clean and tidy.Rooms cleaned daily. Midsize hotel,arrived on my birthday to a bottle of champagne and basket of fruit, and a fourth floor reception side room with full ensuite,with bidet. The food was diverse,bar was on the 6th floor adjacent to a small pool,setting perfect for older discerning couples.....Cakes served in bar at 4.00pm....Sunroom with small book exchange. Fantastic sun terrace above.Weather was perfect,all sunshine....with a fantastic view of Mount Tiede...snow glistening on the upper slopes. Porta de la Cruz a lush well laid out town,the spanish use it as one of their favourite resorts. My other half,would go back for second helpings....... The town is modern and plenty of shops and…", "date": "December 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r246616329", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "PLEASANTLY SURPRISED", "review": "My sister and I spent a week at the Perla and were not disappointed. Food was lovely, house wine very reasonable at 5 euro a bottle/2 euro a glass so we did not feel ripped off as we have on occasion at other places. Our room was clean and spacious. It is not in the town centre but we sometimes got the free bus into town or walked. I would recommend this to couples and groups but not for families. The town PDLC has something for everyone but we loved to get on a bus and discover the little villages in the surrounding area. It can be great fun as we had to attempt to speak spanish or mime. The Botanical Gardens is near to the Hotel which is worth a visit. A good selection of shops quite near too. This Hotel is not recommended for anyone with mobility problems but we were…", "date": "March 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r206070557", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "very enjoyable holiday", "review": "Just returned from 10 day holiday at Perla. The hotel was just as we expected, did not disappoint. It is, in my opinion a 3 star budget hotel with a good reputation. I The staff are pleasant and helpful. The rooms are spacious and clean, with linen changed regularly. We stayed all inclusive and found this to be good value, the alcohol and mixers were of a good standard, no complaints at all. The food was plentiful, slightly limited but there was always something to suit everyone. At lunch and dinner we were given a bottle of wine. There was beer , water , juices on tap. Egg and bacon at breakfast was well received. Lots of fruit, veg and salad. Deserts were a bit unimaginative.         The hotel is favoured by the Spanish, and we enjoyed a few evenings watching guests who were…", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r204363031", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Honey moon ", "review": "The rooms are very much basic but depending on where your room is the hotel offers lovely views.  The rooms are kept clean every day. The food is pretty much the same everyday except for dinner they may have rabbit, shark or octopus on. At dinner and tea you get offered a bottle of wine or beer if your all inclusive which is nice. The staff at meal times are very welcoming and helpful. The bar doesn't open till 11 if you're all inclusive and you after pay extra for cocktails and other drinks which is a shame.  The bar holds the entertainment on a night at 9 pm let me stress this isn't for young people at all the entertainment carters for the oaps. Outside the bar there is the pool area which is very deep with some lovely views, on the roof they are sun beds to sunbathe again…", "date": "March 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r200558222", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Lovely", "review": "Stayed for 7 nights in march, no complaints about the hotel, food or staff. Hotel was clean and maid service everyday. Food was hot and there was always something for everyone. Staff was always friendly and willing to assist. There was entertainment nightly including bingo, disco and live music. Hotel is situated a good walk away from town but they do put on a free bus to and from. This hotel is more suitable for older couples/groups, we went away for a break and some sun and that is exactly what we got. Would I go back yes deffo. Loro Parque is a must. ", "date": "March 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r200110297", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Birthday Treat", "review": "ROOMS  Spotlessly clean for our whole stay but just a little basic.  FOOD  Food option were really good a varied.  BAR  Was all inclusive so prices i'm not sure about  Overall is was a really good place to stay and the service was spot on.  I was asked if i would go back and without a doubt i would.  20 minutes walk from the town but a free bus service MON to FRI and SAT morning are provided.  The cleanliness of the hotel was great.", "date": "March 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r200088361", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very Spanish - good clean accommodation", "review": "The hotel is situated around 20  minutes walk (set in the hill) from the beach/centre. Good points: hotel very clean, staff pleasant, good budget accommodation, food was ok, bar area nice, pool area well maintained, plenty of sunbeds on roof terrace. Primarily caters for Spanish customers.  Bad points: unsuitable location for those with mobilty problems, the hotel is set a good 20 min downhill walk to the beach area (which means uphill return!), the pool area is on the 6th floor, sun terrace is on the 7th floor and reception is on 5th floor. there are 2 lifts, but we took the stairs (many!) if you have a room on the ground floor there is a constant thoroughfare of suitcases and other guests coming and going. The clientele were generally elderly people. There is no childrens pool.", "date": "March 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r199683639", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Typically Spanish - a breath of fresh air", "review": "I am not going to repeat what other, better, writers have written.  The Hotel Perla is off the beaten track and is a realistic 15 minutes DOWN to the town in Puerto.  The whole of Puerto de la Cruz is hilly.  You are either walking up or down, don't go if this is an issue for you, head to the Southern resorts.  There is a regular free bus from the hotel and back throughout the day all day from Monday to Friday and Saturday morning.  The slog back up the hill (and the several stairs involved) are good for the thigh muscles!  The Perla is authentic to what it is - a 3 star hotel in Tenerife (the key is it is in Tenerife, not Skegness or Bournemouth).  The entertainment is Spanish (eventually the disco does include some English songs but not until the last half an hour or so), and…", "date": "March 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r199636106", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Off the beaten track", "review": "A quiet hotel, a good 20 minute walk from the promenade. All inclusive package was good value for money. Breakfast either hot or cold, plenty of choice. Cereals, yogurt, bread/toast all freely available and always topped up. Lunch and dinner were casual, again, plenty to choose from. Spanish food predominant but always chips/fries and new potatoes. Wine/beer offered with each meal, Water was always available. Entertainment is for the more elderly, but dancing is encouraged. Rooftop pool and sun loungers are both fine! Staff are friendly and approachable.", "date": "February 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r196178186", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good for a 3 Star Hotel", "review": "This hotel is built on the side of a Barranco (valley).  This means that the first three floors and part of the 4th are below street level and therefore rooms on the street side of the hotel have very limited views (usually a wall).  Bearing in mind the amount of time you spend in your hotel room (apart from sleeping), to many this is not a problem.  The other side of the hotel looks across the Barranco. Because of this construction, reception is on the 5th floor (level with the road).  Some Agents however drop their clients in the housing estate on the other side of the Barranco which involves a walk across a bridge to the hotel (100 metres) and leaves you on the ground floor searching for reception.  The hotel is clean and the rooms are cleaned daily to a good standard. It is…", "date": "January 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r194996327", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A verry good all inclusive hotel", "review": "We had the pleasure staying in Le Perla this Christmas and new years holiday. The food was good, rooms clean,people friendly. Everything worked very well. When we decided to stay at the Le Perla we were conserned about some of the rather bad reviews . But it showed out that these people must have been staying in another hotel. We recomend this hotel.", "date": "January 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r194829306", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great holiday!!", "review": "Myself and my partner stayed in this hotel October 2013 for 1 week. We have 4 kids between us so the lack of children (on our child free holiday) was fantastic!! It isn't suitable for kids as others have commented................but I would take the time to find that out before i booked so who is actually at fault?? I found the staff pleasant enough, English not fab but its not England. Hotel was clean and tidy. Rooms had new towels and were cleaned to a very good standard every day. Yes the Hotel was a little run down, not smack next to the beach etc but it charges budget prices, what do people expect these days? Want 5 star?? Pay 5 star prices. Food was lovely, yes a little repetitive but lovely all the same and I managed to have something different every day. We really…", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r192336761", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely Hotel, everything you want for 3 Start!!", "review": "Some of the reviews for La Perla are ridiculous, I mean it is a 3 start hotel and some people want 5 star.  Me and my boyfriend have just come back from a lovely weeks stay, we paid £299 for 1 weeks all inclusive (hotel, flights and transfer) and I can say I was dissapointed.    The staff were very friendly, hotel is very clean the maids are in every day there is no mess around the pool or sunbathing area.  As for the moody/angry barman everyone goes on about you must have been rude to him as we had no bother had a good laugh with him and he was very helpful.  Yes there wasn't many english in the hotel, but for me that was nice, if I wanted to holiday with english I would stay in england!!  The restaurant was lovely, and at first I was worried being all inclusive incase I didn't…", "date": "December 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r187520898", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "good value hotel", "review": "this was a last minute booking and i was a little concerned by some of the reviews! however on arrival all i can say is what a lovely friendly hotel this is. The food was delicious although some may say not alot of choice but there was definately something different to try each night. The waiters were friendly and the walk to the beach and town is lovely. This is a place i would stay in again.", "date": "November 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r187157055", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Pleasant short stay", "review": "This hotels is small, very clean and very Spanish orientated. I went with my wife for a 4day break and we enjoyed our stay arriving on 22nd nov.  the hotel is situated on a hill, the whole area is hilly, but didn't bother us at all was a 15 minute walk down to the centre and beach, which is a lovely area with lots of restaurants and shops, instead of the steep walk back up to the perla hotel we got taxis which general costed between €3-5. After reading a lot of reviews about noise, eg cockerels we never heard a thing!  The hotel rooms are clean and spacious, the restaurant small sometimes at breakfast there's a short wait for a table but not a problem, the food was excellent although not much choice what were out we really enjoyed, the staff in the restaurant speak very little…", "date": "November 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r187108089", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Improvement required", "review": "We visited this hotel for an all inclusive holiday for one week.  We arrived at night ourselves via a hire car so we could get around the attractions and sites of the island.  The hotel did have reasonable and clean rooms, which were cleaned each day to a high standard.  The staff were very helpful in the bar and on reception, especially the barman with the glasses. Now for some constructive feedback, the entertainment was aimed at Spanish holiday makers, German, English, Polish and other nationalities were ignored which was very poor considering the hotel is trying to gain more trade during low season.  The meals were monotonous and there was not much change or variety which considering the food on offer there could be improved with an inspired chef.  The policy of putting…", "date": "November 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r184848880", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "So Lucky it was Shut", "review": "We booked into this hotel from Aug 24th to the 30th and we got a call from our agent to say that unfortunately the dates that we had booked were no longer available and the hotel was shut. We usually go four star with a gym and all inclusive but we thought we would go cheap and if it was no good we would eat out, and walk a lot as we read reviews which said it was on a hill. We were told they could move us to another hotel which was a four star near to the beach with no extra cost we looked at the hotel and thought this looks a lot better and would have been nearly double the price so we took them up on their offer. The hotel was The Gran Hotel Turquesa Playa if you want to read my review later. When we were on holiday we kept thinking about what the other hotel was like and why…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r179368303", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "noisy hotel", "review": "great little hotel, me and my girlfriend met some great people there, the bar man was a un happy bloke, the staff were excellent, the food was great, only prob really was the noise, if not the bloody cockrell, the people leaving for home in the early hours of the morning shouting and dragging there wheely bags over the tiled floor, you can imagine,ok its a bit of a walk to the beach, but I like walking , you get to see other places you might miss. I would go again... it was November 2011 when we went", "date": "November 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r173780937", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "perla hotel tenerife", "review": "we just recently back from staying in perla , was a lovely hotel clean and friendly . my only fault is the food it were hit and miss but plenlty full . there are a few cockrels around as others have stated but they not that loud . the hotel is not good for familes with small children as there no animation tea or facilities for them . you get clean towels and bedding everyday rooms are dated but very clean all in all we enjoyed our stay and would go back if wanting a quiet holiday again .", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r168144759", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Winter Sun", "review": "Got a shock when dropped off at the back and directed to Reception on the 5th floor arriving at the 5th We were on street level because hotel is built into the cliffside, food superb staff friendly, rooms large and airy, its quite a way up the hill but 4 euros in a taxi cures that prob. Town itself is lovely with lots to do if it takes your fancy", "date": "February 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r166364765", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Natural life surround", "review": "Bad is tuff and sunbads are old not comfortable. Pool is very small and bit far from centre, high hill to walk back to hotel. Bartender xavier is the best and funny. Plenty 60ts 70ts songs playing in the bar,and 90/ costumers very old. Overall if you like natural life plenty chickens, goats, birds and lizards around the hotel.", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r164821344", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Review March 2013", "review": "Hotel is average, generally clean but a bit dated. Rooms are adequate but again need a face lift, very small TV in room and bathrooms look tired Beds are not great, mattress need replacing  Food in restaurant very bland and poor quality, not much variety, but plenty of it  Pool area pleasant enough, Overall for approx £25 pppn quite good value   I would give the Perle Tenerife overall 7/10", "date": "March 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r156241155", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "perla hotel", "review": "we booked this holiday all inclusive at short notice. overall it was value for money. the food was average, most of the staff were very good for service. there is one guy on reception who was just an ignorant pig. the hotel is on a hill, if you cant walk far or have a problem with walking this is not for you. tenerife is full of hills and slopes", "date": "March 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r156131912", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Amazing", "review": "I will remember these holidays till the rest of my life. All the staff was fab, very warm and helpful people! Food was nice as well, nice local wine, good entertainment, bit to short, only couple hours! Bar man which you all taking about is very nice. They treat you the way you treat them. Will be back for sure.", "date": "March 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r155902973", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "holiday on hill", "review": "The hotel has a good position, quiet area, high above the hospital, and is located on a hill. We used the car and we not went to town on foot once. There is a mini bus that goes to a hotel to city but we did not use it. We took the car right at the airport, Orcar car, and we were pleased. We returned the car at the airport so we had all the time available. In front of the hotel is always place for parking on both sides of the street, and there were no problems and everything is free because this is place for  private villas and no traffic policeman. It's a lot easier for us where we fit car at night. Reception is open 24 hours, they're really friendly and willing to help with advice, but be sure to ask about everything you've heard and what do you plan to visit. Then they will…", "date": "December 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r151299548", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great hotel!", "review": "We loved this hotel. It is family run and has a happy atmosphere. Our room was very large, clean and comfortable, with a good sized bed, bathroom, fridge, balcony over the garden. The pool and sunbathing area were quiet and very accessible, with views on Teide on one side and the town and sea on the other. It's in a residential area above the town and cleverly planned not to spoil the landscape. The restaurant is very good, the food ample and varied. We'll be going back!", "date": "January 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r150753007", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "NEVER AGAIN", "review": "well what can we say  apart from dont waste your money on this hotel  not near the beach  not good for families with children  food poor  entertainment very poor  staff very rude  the pics are not  any think you like what it is  no mini bar  no coffee and tea in rooms  no air con no kids pool  no sauna  no second bar or second pool  and the tv room what a joke  and what every you do if you do book ask for a room at the front of the hotel not the back otherwise you will be awake most of the night from 2 am with cockerels  the rudest bar staff   ai stops at 11 pm and the bar closes by 11.45 every night sharp  we can g on and on   we have loads of pics but only putting a few on here just showing a few things  it took them 7 days to fix the socket and 10 days to move rooms  just be…", "date": "December 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r149938343", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "fat  chips  golden  girls", "review": "we   arrived  3  twirlies   Oct  15  th  to  29th  Had  a  fantastic 2 weeks .We  are  nice  to all the  staff  and  they could  not  do  enough ,If  you  asked  for  any thing  it was  there  Even  make  a little  effort with  the spanish .THEY  LIKE  THAT  .These  people  who  complain  i cannot  understand .Yes  they  eat  a lot  of  fish  that  is  what  they  do .The  salads  where  lovely  if  you  ate nothing  else  No  its  not  for  children unless they  can  amuse themselves . and  not  spoilt  brats  i Met  2  lovely  boys  and  a  girl  .every  day  they  did  a  family  adventure ;We  loved  having  some  lovely  youn  people .So  enjoyed  theire  company .Made a  great  change  from   oldies  fighting   after   the   hp  sauce  Yes  do  not  go  there  with  a …", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r144236630", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "a holiday is what you make it!", "review": "My fiance and I have no complaints about the hotel whatsoever! Our room was very clean and tidy. The food was very good and you always find something for yourself! we didnt really have any complaints about the food at all!! All staff was very friendly, all barmans were having a laugh with us every day! even the fat one (well he wasnt fat at all, big ish but not fat) was pleasant and happy so I dont know what people are on about.If u r nice to them they will return nice behaviour!  The cockrels are not that noisy what people say!! we could barely hear them! we even were feeding cute little things :) Entertainment was good, especially Dj who played every other night! . There is a free bus to town but we never used it because it was a nice walk and we had a chance to burn some…", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r143861849", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "try for yourself", "review": "saw many mixed reviews,and im glad i went,would defo go back.its high up in the mountains,the views are amazing,quite a trek back up,but there is a free bus or the taxi is about £3.50.im a fussy veggie,and i stuffed myself continually!!, the place is clean and tidy,nothing fancy,but not there much anyway,the room had a washing machine!! fridge and radio,balcony quite small,staff are friendly and helpful,the evening bar man was brillant!!.entertainment had 3 nights of a disco good choice of music,1 night a man singing and playing piano,good but not my thing,a animal night,one night without and didtnt see the other. night.yes there are cockrails and hens and there babies and i loved them!! and fed them,its apart of spain.puerto del la cruz is a great place to visit,beach is…", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r143769288", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great Value", "review": "IHad a great time at this hotel. And for the price think it’s a bargain. Food variety was limited but quality was good. Hotel was clean and staff very friendly and helpful. Walk to town is not as bad as people make out. But it is a steep climb back. I walked most days and on a night were beers made that difficult got a taxi, which was very cheap (less than 5 euro)", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r143556445", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Hotel in a nutshell", "review": "The hotel was like retirement home, the food was fish every day so we had to eat out even though we were all inclusive.The pool is freezing steps are slippy and coming away from the side also the jaquzzi does not work and you have to pay 10 euros for the sauna. The barman that everyone complains about is a miserable rude and strict member of staff and wont let you have more then one drink at a time and even told off a child for having ice cream. All inclusive does not start until 11am (not even a glass of water to take my tablets) before that you have to pay and it finishes at 11pm. If you have a late flight home your gonna be starving and thirsty as all inclusive is stopped at 12am when you check out your room leaving you for hours on your last day with nothing to eat and drink…", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r143344317", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Enjoyable", "review": "Myself and my partner and my 7 yrs old daughter were there last week for a week,  on arrival we were very late 10.30pm,  and the staff had kept us a salad back for our tea which i thought was really good of them,  the hotel we found was clean and tidy,  there was always hot water .  The food was good was always plenty of choice and something for everyone,  the staff apart from one fat barman i could not complain about,  (the fat barman is a horror and should not be in the hotel businesss,  as he is very rude and argumentative)  the roosters well yes they do go on but you get use to it.  My only problem was they did not have a childrens pool as i found the pool very deep for my 7 yr old,  overall i would go back as staff were friendly and helpful,  food was good,  the maids were…", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r142965467", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Beware the fat barman!!!", "review": "My husband and I have just finished our 2wk A.Inc break at this hotel,The hotel was pretty basic but the staff were very friendly,hotel and rooms very clean,not an awful lot of choice in menu tho,also you couldnt get a drink outside the breakfast room before 11a.m thats when the poolbar opened,even for a cuppa or water,the bar closed too early too,11pm..or 12pm if you paid.There were 3 bar staff,2 were lovely guys but the fat one was a little Hitler,his manner to almost everyone stank,you would dread his shift.(no need for it manners cost nothing)should,nt be in the job with his attitude..there was a free bus to town but stopped too early,not too much of a prob as taxis were cheap,around 3-4eur but if ordered from hotel rec it would double!!The town was very pretty but too hilly…", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r142121252", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Lovely weekend", "review": "Me and my daughter have just spent a long weekend here. It was lovely, all the staff were friendly. The reception staff were always polite and helpful. Rooms were clean and comfortable. It was a bit out the way but the hotel run a regular shuttle bus down to the town. It's ideal if you want a quite lazy holiday. The only thing I would say was annoying are the roosters, but they do'nt go all day. All in all it was a enjoyable weekend.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r141930321", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "had a very relaxing holiday", "review": "i was dreading going to this hotel when reading reviews but once i was there thought it was good , our room was very clean and the maids were excellent. the food was good you coud always find some think to eat. pool was great . yes two bar staff were not very happy and but i didnt let that spoil the holiday. there was a free bus that took u into the town that ran all day but the walk was ok as well. the only thing that i didnt like was not much entertainment at night and the cockrels were noisy.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r141001887", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "The worst hotel we have ever been to", "review": "Bar staff and reception staff rude and not pleasant. Fat guy in the morning at the bar was the worst. he shouldn't work with people at all. We never saw him smiling. On last day told us we have to pay for drinks when we had all inclusive. Stupid rules about not getting drinks before 11am. Roosters were horrible, waking you up at 4am. Restaurant staff was very nice. Food was horrible, no choice and everything smells the same. Loads of cockroaches outside. It was 5 of us in twenties, there was no one else in our age. only old people. We wouldn't recommend it to anyone.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r140940456", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "i had a lovely holiday :)", "review": "after booking my holiday, i came on here to read some reviews and was a bit upset and thought - what have we done!! im 26 and my partner is 31 so we were on a holiday to relax and just enjoy ourselves. In terms of the hotel its self - i liked it, our room was very clean and the maid came in everyday to make the beds and change the towels ect - we never encountered any maids and were in the room at different points during the day which was good.. the staff didnt seem to speak alot of English but i didnt find this much of a problem and were all friendly enough.. i had to see a doctor over there and the man in reception was very helpful and called the doctor to come and he came to our room to help, if it wasnt for the man in reception we would have been stuck!! the drink was good -…", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r140585095", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Was nearly put off reading reviews, wish we listened", "review": "They do not show you the hotel is surrounded by a 100m gully, full of roosters that will wake you up at 6am if the noisy cleaners don´t do it before.  We were all inclusive, and in our mid twenties, and the food wasn´t great and not up to standards although breaksfast was perfect daily as full english served.  Hotel is clean but very dated.  All in all if you like peace and quiet, then don´t come here.  Not recommended!!! The pictures you will see don´t give the full idea of what the resort is like and what surrounds it.  The only good thing was when requested we were given a kettle.  We would strongly advise people not to stay here, as we didnt listen to the reviews and are now regretting coming to this resort.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r140315370", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Mike from London the Man threatened with the pool cue", "review": "This certainly isn't the best 'all inclusive' place to stay.  The pictures the Thomas Cook rep showed me must have been taken with one of those magic cameras.  The hotel needs refurbishing top to bottom. Pool area dangerous for kids, no shallow end. The hotel is high up the hill and there is no safety railings to stop anyone falling over the edge.  Our room was old fashioned but the maid was friendly and cleaned it every day.  The beds! well where do I begin? you sat on the end and they tipped up, the springs dug in you they were right passion killers.  Food was real rubbish same most days leftovers used up that evening or next day very limited choice.  The crockery was chipped and cracked.  The staff in the restaurant were pleasent. If they ran out of vodka at 9pm then you had…", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r139506679", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "DO NOT GO OR... WASTE YOUR MONEY", "review": "Me and my husband are actually here right now and felt the need to warn people off coming here, we still have 4 nights left from our 10 night stay and we are discusted. The staff are completely rude and moody, its the bar and reception staff, they go mad at you in spanish then ask normally whats wrong in english and NEVER EVER smile or say thankyou or hello. No aircon in rooms, just a ceiling fan which isnt at all that good it just blows hot air around the room, the rooms are dirty, urine on bathroom floor from previous occupants. The food is just, well.. terrible! I am 28 weeks pregnant, so as you can imagine i have to watch what i eat for obvious reasons and they do not label any of the food bar from maybe one dish.. its highly repeatative and is always ùse ups from previous…", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r139277679", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "dont treat this as an all inclusive resort", "review": "as an hotel its average,  no aircon apparantly in any of the rooms however the fan was sufficient for me.  quite a poor location,  to far up the hill. its a pleasant walk into town but but quite an uphill hike back!  the only pool is small with no sun loungers,  just half a dozen plastic tables with chairs.  the food average but felt cafeteria ish.    the bar closes at 11.00pm and the beer is served in little plastic cups,  the type you get at kids partys.     puerto de la cruz is a very picturesque resort,  very relaxing atmosphere,  the staff in the hotel were pleasant i just wish i hadn,t booked all inclusive", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r138006349", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "best 10 days of my life!", "review": "i went with my friend and were we a bit worried about going when we read some of the reviews! but we were pleasantly suprised! our room was perfect size with a balcony also a good size, the only bad thing that the pillows were a bit crap & there will loads of cockerels out side our room, but you get used to that, and made it fun by cockodoodledoodling back :) breakfast was superb! very tasty.. lunch and dinner would variey.. some days good, some days bad.. the fish was the best part very fresh and the salad was very fresh including the fruit. drinks were good, but they could have more of a variety on the spirits. and you couldn't get drinks until 11. so if you are like me, an early riser, i advise you stock your fridge up the night before. in other reviews people complain that…", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r137986003", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Beter Than Expected!", "review": "After reading the reviews of this hotel i was rather worried about what we would be greeted with on arival to the hotel! i have to say that within 30 mins of arriving i had totally settled down, the first thing we noticed was how clean the hotel was, secondly the reception staff were very nice and assured us that someone would be on reception 24hours if we had any problems! This was reassuring.   We got our room key and found our room on the 1st floor, it was massive, very clean and had everything we needed. Once we were unpacked we found our way to the bar and being all inclusive were expecting the drinks to be small/watered down which is what other reviews have suggested. We found the complete opposite, drinks were great, tho very strong as they dont measure the ammount of…", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r137344159", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "3* who you kidding!", "review": "I am aware of the saying ‘’You get what you pay for’’! Well I don’t think we even got that! This must have been one of the worst holidays we have had in years. If it was not for the great people who were sharing our hell I think we would have packed and left. The place it’s self was clean and some of the staff were obliging but apart from that it has nothing and I repeat nothing going for it. Do not spend your hard earned cash going here as you will be so disappointed. The pictures that you see must have been taken in the 80’s as it does not reflect what it looks like now. They Spanish staying there are allowed to do whatever they like and they get first preference even if the barman is halfway through serving you he stops to serve them. One threatened an English guy with a…", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r137251869", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Would never come back here", "review": "Well for a start they lie throughout the write up of what's in the hotel, it has a outdoor swimming pool that's it! The spanish food was terrible! If u like english food then your getting chips and bread rolls. All inclusive but you don't even get a drink of your choice its selective drinks only and the spirits are there own brands, the vodka made me ill so couldn't even drink there. So I may aswell have not been all inclusive as I was eating and drinking out so cost more anyway! They have a 12 o clock at night curfew (go to your room or we call police) or go out to the small town which has about 2 nightclubs! When you get home you'll be hearing cockrels squealing in your sleep! The entertainment was electrifying and by that I mean shocking and some nights no entertainment! The…", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r136040866", "sub_review": {}, "travel_purpose": "", "rating": 1}, {"title": "oh my days!!!!!", "review": "oh my days, this place is a disgrace. the bar man hits on u, the receptionist tells you off for talking etc after 00.00 the food is awful i.e squuid, boney fish, turkey that was grey not white. most of the utilities didnt work, the jacuzzi, sauna, bbq, there is no supermarket at the hotel although it says there is. to be fair this hotel was more like a hostel than a hotel. ate out more times or lived of chips but even they were cold. if it wasnt for the people we met there i would have prob cried to go home it was so depressing, needs a total face lift and there is lizards everywhere, freaky little things.  WHATEVER YOU DO, DO NOT GO THERE ITS A WASTE OF MONEY, ive had cheper all inclusive with brill service food etc for less money, will not make that mistake again!!!!", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r136023158", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "wont be going back for definate", "review": "just come back from this all inclusive joke if the cockrels dont get on your pip the being followed by cctv whilst sat by the pool till the alloted time will all inclusive is a joke at this hotel nothing allowed before 11am all to bed at 00.00 or the police may be called and youll get arrested for trying to have a good time  food very poor dont do the fried hotdog sausages   not really into rabbit  and if your a fish lover your in heaven   dont get me wrong the staff are very friendly maid service is good entertainment is very dire and poor  you need to be as fit as chris bonnington to get to the hotel one taxi driver got lost  over all i thing the holiday reps should go and take a look at this place think it got three stars from a lucky bag", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r135724346", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Scouse TRUTH", "review": "Hi there there is no garden,no indoor swimming pool, no childrens pool, no spa tub, no air con in rooms and no satelite tv anywhere and the wifi goes off every 10 mins. All inclusive means spanish breakfast,lunch and dinner snacks from 4pm untill 6pm are leftover pastrys from lunch and ice cream pots all other snacks eg crisp lollyices ect you have to pay for. Alcohol is served from 11am - 11pm the bar area is closed at midnight and everyone must go to a club or back to there room and there is no noise allowed after this time or the police are called (this means no laughing,no talking no nothing) pool is closed at 6pm also there is a sauna,bbq pit and jaccuzi but all dont work, we spent all our money on food due to all the food not tasting very nice the only concillation is that…", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r135485731", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "OK but if anything goes wrong its awful!!!!!", "review": "Rooms big and clean but there is NO air con just a ceiling fan that moves the warm air around!  Very ltd food just your breakfast,lunch and tea, pastries from breakfast is then availble from 4pm.  Your not allowed in the bar area next to the pool in wet/damp swimming clothes and you have to wear foot wear all the time.  Our veiw was lovely over the valley but with several cockrals crowing even before dawn puts a downer on the view lol.  Food again was OK very same/same and had some very upset tummys on most days?!!  Had a french couple who argued very very loudly most nights and even went round offering \"cake\" but even after complaints by most gusets they were still there!!!!  We were booked in until the end of the 24th ( our coach picked us up at 11PM) but they asked us to…", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r135337929", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Eat out", "review": "Hotel Perla disappointing. Basic hotel clean but now in need of a bit of tender loving care. Food of very poor quality. Meals were either cold or lukewarm. Some days meals from the previous day were on offer again including Paella !! Many of us suffered stomach upsets so be prepared with a supply of Imodium.", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r133736895", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Won't be going back.", "review": "Stayed here with my boyfriend in August last year, August being a peak month and should be sunny.......no. Puerto De La Cruz is a horrible location if you want sun, don't come to this bit of tenerife, go to the south. The location of the hotel is terrible, it looks like a prison camp from the back. It is really far from everywhere, there is a bus available but it just takes time. We were looking for a beach all day, it was nowhere to be found. We went both sides of the hotel, nothing. We found a dock, that's the only thing you can find, it's terrible, horrible colour of the sea and the actual sea looks dangerous. The rooms, are a decent size. The TV, just spanish channels, except english news (which I might be fussy but were going to another hotel which has ITV, BBC and so…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r132582234", "sub_review": {}, "travel_purpose": "", "rating": 2}, {"title": "The world's your oyster", "review": "So long as the sun shines, Puerto de la Cruz is a far better destination than the package tour nightmares on the South coast.  The old town retains character and because it's a 'proper' town and not just a resort, it has a good variety of shops, cafes, bars and restaurants.  The Atlantic rollers make for very exciting swimming and wave watching.  Try a swim at high tide in the small, oldest harbour near the Lido.   Ah yes, the Lido.  Cheaper than hiring a sunbed on any beach, it's got excellent swimming, loads of room and top sunbathing places.  Stay all day for E3.50.  Sold.  The Perla.  Built in a residential area it's hard to find, especially arriving by car.  It's a good, easy walk downhill into town via the rear access bridge.  The walk back is also easy if you're…", "date": "January 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r124490910", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Perfect for a Holiday on a Budget!", "review": "My boyfriend and I (in our mid-20's) holidayed here at the start of August 2011 for a week and we had a great time!  It was a last-minute holiday and we were on a budget, so the Perla was the perfect choice for us.  Don't expect a posh or modern hotel, it is very basic and randomly the reception is up on the 5th floor! But it was clean and going all-inclusive saved us SO much money, we could eat and drink to our hearts content =) We didn't spend too much time in the hotel, you can get free buses into the town & beach but we couldn't find it, it was only a 20-30 minute walk though and some good exercise!  The pool isn't too big but was lovely to go for a dip and there is a pool table next to it too which we spent some time on.  Our room was on the 3rd floor and mainly quiet…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r123908356", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Eat out", "review": "our holiday was 3 weeks 13th Dec/3rd Jan.in that time we had dinner 4 times,my advise is take extra cash for meals out.The rooms were very clean the cable TV consisted of only one English channel.When we arrived we were given a room on the 1st Floor,there are 6 floors the reception is on the ground floor and that is the 5th floor, so as we did not want to face the wall which was 8ft  away we asked to change rooms and were given one for 2 days facing the garden on the 1st floor, then we moved to the 6th floor that was fine until the entertainment (if you can call it entertainment) started at 9 O'clock on the 6th floor in the bar.We rented a car for the whole of the holiday,but if  you wanted to walk out for a drink in the evening forget it, you are to far from the bars and life…", "date": "December 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r123110863", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Disappointed!!", "review": "My husband and I spent our Xmas week at the Perla, arriving on 24th December and leaving on 31st.   We were dropped off at the back entrance as the front road is too narrow for coaches, etc.   We were a bit confused at first because the back entrance is actually the ground floor corridor and we had to take the lift up to the 5th floor where the Reception is.  The Reception is a bit shabby and very busy (mostly with people waiting to complain).  The Receptionist seemed like a very cheerful guy and very helpful  -  that is until I complained about something, then he became rude and arrogant.  We didn't get a mini-bar as listed in our hotel details but we did have a small fridge which was useful for water, juice, etc.  The food was terrible and we ended up  going out for meals…", "date": "December 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r122528580", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 2}, {"title": "Excellent value for money", "review": "There was three of us who went away to this hotel on 2nd October for a weeks All Inclusive holiday.  We arrived at 2am and the receptionist was very helpful and spoke good English.  I found all the staff helpful during our stay. The waiters were very efficient and had a good laugh with them.  I dont know who all these rude staff are as I didnt meet any of them.  The maids do start early and a bit noisy but we got up quite early anyway.  The rooftop pool was very clean but deep everywhere so only go in if you can swim ! The food was ok, I didnt stop eating so it couldnt have been that bad.  I found the wine at dinner quite enjoyable !! All in all in my opinion it is a very clean friendly hotel, food ok, drinks great, swimming pool good, views amazing, rooms big and light.  The…", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r120385402", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Didn't Enjoy", "review": "I guess you get what you pay for! Nothing felt special about this place, the food, the staff, the room, the facilities it was all so basic. The place lacked any nice/friendly atmosphere. You want to feel like going on holiday is a treat, but i'd rather of been at home.", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r120153046", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Don't believe the photos!!!!", "review": "Myself and a friend stayed at the La perla for 1 week this October - the photos do not reflect this hotel. The staff are beyond rude  -aside from a nice spanish woman that works the bar through the day. The evening entertainment consists of a man on an electric keyboard or DJ Don Juan  - who does not play to everyones tastes shall we say. The food is awful - the salad is fresh daily ( I think ) but don't b suprised to see the mornings bacon and nearly raw sauaage chopped up with pasta for lunch and tea!! The hotels photos honestly have no bearing on the ' restaurant' food. The wine comes in a bottle with no lable and tastes like paint stripper. The roof top terrace is nice for the sun worshippers with good views however the beds are old and worn and do not sit up. The room was…", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r119866564", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Ok, if you get a good deal!", "review": "Just leaving the hotel just now after a 6 day trip, What can I say!!!  First of all the hotel is one of the cleanest I have stayed in, the food is reasonable ( a lot of people unhappy with standard and ate out!)  The staff are the most dour (sad) faced people who I have ever encountered in hotels in my life!!!! They will go out their way to be unhelpful!!!  The 6 days we had there were amazing as we met up with some fellow scots some english and a fab group of French which was the true making of the holiday.  If you struggle with inclines and stairs this is definetly not a place for you, neither for kids as the pool is very deep.  On the whole the holiday was rather poor- please also note your all inclusive finishes at 12pm on the day of departure and not when you get picked up…", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r119558236", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "good food,poor entertainment.", "review": "the food was very good,the entertainment was poor.There was no rep on the day after arrival,in fact it was several days before a rep appeared,there was then even a rep on sunday.The weather was good until the final day,then there was a spot of rain.There was no details of the hotel in the room,reception number etc.There was a good view of mount teide from our room and the sea from the other side.The roof top was great for sun bathers,complete with sun beds.The so called digital tv had only two english channels,cnbc,both the same.", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r119547485", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Chilled out!", "review": "If you are expecting 4* service & aminities this is not the palce for you. However I have just come back from a lovely destressful holiday & it was bliss!   Rooms are clean & hairdryer & toilatries are very good. Food samey, but very fresh. Bar staff & waiters are great.  If you are happy to just get away and do nothing except chill this is a great option. Great value for money!!   Please note the reception is on the fith floor & not the ground as we were expecting ha!", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r119474125", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "It only got better!!!", "review": "Have just returned from Tenerife. My first day was not good,but after 3 days I was able to change rooms. The hotel was rather nice, I was on the 5th floor at the back overlooking the birds and goats! Was peaceful.For a three star the food was very good. Im fussy so there is ALWAYS some foods that I never touch. But the salads, white fish, pasta,rice,chicken and pork were excellent.Unfortunately for my waistline, the chips were magnificent! The soups were thick hot and tasty, For the strong willed there was fresh fruit and yoghurts.I was good at breakfast time and stuck with yoghurt and rolls.The mini bus was good, the taxis back if you were truly lazy were 3euros! I loved the swimming pool, and I even went undercover on the top in the solarium. The staff were very good, and…", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r119211772", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "It's only a 3 star!", "review": "We returned from a week at the Hotel Perla on the 25th of September. Although we had a relaxing week and recharged our batteries, the hotel didn't live up to our expectations.  The first dissapointment was the food. We chose this hotel because of the earlier reviews on this site saying the food was very good but it was cheap, processed foods like chicken nuggets, burgers and even the vegetable rice that looked like it was out of a packet. The salad bar was nice but chips were on the menu twice a day every day. The breakfast to be honest was awful, the scrambled egg was very watery, anemic hot dog sausages and over cooked beans. We ended up eating out two or three nights even though we were staying all inclusive.  The hotel was very clean but the maids are really eager to get…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r118815806", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "hot hot hot!!!!!!", "review": "We stayed in this hotel for a week from 22nd sept 2011 to 29th sept 2011 the weather was cloudy the first couple of days but you still got sun burnt. The rest of the week the sun was shining :-). Food was the same practacially all the time if you like chips and salad your ok. Puddings didnt varies jelly ice cream and mouse everyday!!!! entertainment was rubbish unless your in your 60 plus. Pool very deep not for kids. All inclusive is not what it states you get ur 3 main meals and what they call snacks is only from 3.30 till around 5 which consistes of dry couissants and cakes from breakfast time no other snacks are avaliable at any time ony ice cream. Drinks are avaliable between 11am and 11pm not before or not after!!! it states on there web site they serve cocktails which is…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r118769748", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Very good relaxing holiday", "review": "Me and my partner had a lovely relaxing holiday and the food was fantastic and very clean rooms everyday and the hotel was very clean aswell.thay only have one deep pool that its not for kids and this hotel is not a place for bringing kids cos there nothing do for them.it only for couples or people on there own and don't worry if u are cos we got talking to loads of English people and even ken who was on is own while we was there.if your going here don't worry if u think u come to a hotel with nothing around cos at back of hotel there a foot bridge u can cross that brings u out to shops and food places and bar and if u love up hills walking u can get to town or u can get free bus from hotel what take u there.we only found on notice board in reception area near sofa thay have…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r118509704", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "good hotel but weather let it down !!!!!", "review": "Four adults went to this hotel , my partner and I and my son and his girlfriend.We had to request a room change because we were given a room in the basement which was clean but had a wall for the view. The reception were very understanding to move us all when I advised them that it felt damp and it was making my asthma bad.Once moved the room was very clean and we had a fab view with balcony towards Mount Teide.The food was fresh but not particularly varied but we all had plenty to eat during our stay as all inclusive.The pool was small but perfectly good enough for us but it was very deep no real shallow end !I would recommend the hotel but if you are a sun worshipper then think again!!!!!! as the clouds linger on the top of the mountain all day. We recommend Loro Parque it was…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r118488488", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "goodclean hotel", "review": "just had a lovely two weeks at perla. we were all inclusive,and the meals we had were very good for the price we paid .Our room was at the front of the hotel and we had a lovey view of the sea it did look much closer than it was. the staff were very good our room was cleaned every day by the same lady she was lovely  Had plenty to eat and plenty to drink . the pool is smaller than expected and deep but still very nice when the sun gets too hot.only problem it is on a hill and takes about 15 minutes to walk down into town but much longer to walk back up better to use the free bus or get a taxi All in all a very good holiday and very good value for money", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r118379470", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good for the price", "review": "Me and my boyfriend (both of us early 20's) had a lovely time at this hotel.  We paid very little for it and it was just what we paid for.  The rooms were basic but clean, the food was limited but you could eat something everynight and the majority of the staff couldn't do enough to help you.  The hotel is located about 1km from the sea front and the beach, it takes about 20mins for a leisurely walk down, there is also a free shuttle bus and a taxi is 3.50.  The evening entertainment is non existent but there are so many nice bars on the front that we didn't find it an issue.  The main down side of this hotel was the bar staff, playing cards was forbidden and they enforced this rule.  They were often rude, stopped serving before 11pm and wouldnt let you have a soft drink or…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r118113882", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "You get what you pay for", "review": "We had a good stay at this hotel nice room very clean plenty of food and drink.The bus to the center was a god send as taxis varied from 2--5 euros one way,the walk down was OK but unless you are fit don't walk back !!!.We would go back to this hotel but looking at the other reviews I koow what side/room to stay in.", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r118108012", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Well worth the money - great value", "review": "Just arrived back from Tenerife, hotel perla was very clean the rooms are quite basic, very friendly staff, food was always fresh and we always found something we liked to eat.  Overall great value for money!! Drinks were really good too !! With very good measures if u had spirits! all in all great hotel !! Hotel was approx 20 mins walk from main centre/sea front beautiful area very pretty but very hilly !! Lots of resturants/shops/cafes - would definately recommend.", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r118104589", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Lovely location, basic hotel.", "review": "We arrived at the hotel just before Midnight, and was dropped at the rear of the hotel by which can only be descrived as Big Brothers gate! We pressed all the buttons on the intercom as there were no instructions and was eventually greeted by a voice, who buzzed us in. We entered the hotel to be confronted by a long corridor with no sign of the reception - we had to ask a couple who were coming along the corridor where we should go. Eventually we found the reception on the 5th floor and checked in, the guy at reception was very helpful although his English was basic. He showed us to the restaurant where they had provided us with a simple cold meat salad, bread roll and jug of water. After this we found our room on the 4th floor overlooking the Dry River bed that you hear so much…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r117972803", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Basic but has everything you need!", "review": "We arrived at the hotel just before midnight and checked in. We had 4 rooms on the 1st floor. They were clean, but the terraces had a view of a wall.  We went to the bar to get water for the night at 11.58pm and were greeted by the bar man mentioned in the other reviews- he served us but begrudgingly. By this stage we weren't feeling very positive about our hotel!!! However, the next day we asked to change rooms and the receptionist was superb. He changed us to rooms on the opposite side of the hotel with lovely balconies.  The bar staff were fine.  Yes, one of them is serious, but will chat if you're friendly with him.  The rooms are basic, but clean, and the housekeeping staff were great.   The food was good- plenty of choice, and wine with each meal. The restaurant staff were…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r117877641", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "We wont be back", "review": "The hotel is quite a distance from the main shopping/tourist area although there is a free hourly and prompt bus with a friendly driver. The staff are very friendly and helpful. The food was acceptable. The hotel at night was noisy due to guests leaving via our ground floor corridoor. The photos do not represent the current hotel as its in need of refurbishment. The rooms are clean but basic. The entertainment consists of a non speaking DJ who plays music from the 50-s to the 80s three nights week and a Spanish singer/ keyboard player twice a week. The German and Spanish guests loved it as they could waltz the night away.There is no entertainmnet during the day. This hotel is not suitable for children as theres nothing for them to do and some of them got bored and started to…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r117820028", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great place and great value for money", "review": "My boyfriend and I booked an all inclusive stay for 1 week here. The hotel itself is immaculate and the food is very good. We usually eat out at least a few times even when all inclusive, but had no desire to do so as the food was varied, plentiful and always fresh. The rooms are basic but clean. Unfortunately the beds are quite uncomfortable and my boyfriend has a bad back so he really struggled. There are lots of loungers at the pool - no need to do the usual holiday thing and get up at the crack of dawn to reserve one with your towel. They are situated on a different level to the pool, which I thought was great (it was lovely and quiet with no kids about). Please beware though that although it is a very cloudy part of the island, YOU WILL GET BURNED. I fell asleep for an hour…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r117390270", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "We'll definitely be back", "review": "Very clean hotel with friendly staff.  We were \"all inclusive\" which was good value.  Easier to walk to the sea front then expected, although there was an hourly minibus 7 tmes a day. Unfortunately it had a habit of not turning up, so we learned a short cut to walk which only took 15-20mins.  Quite a small pool on the roof near the bar.  Sauna (but this was extra) Beautiful views of the ocean and volcano from the hotel roof.  Plenty of sun beds, but in February it wasn't too busy so I don't know about the summer months.  Food was plentiful with ample choice, except for desserts.  Yogurt & fruit every day!!!!  Lots of fresh fruit particularly at breakfast and plenty of wine with meals when all inclusive.  This was useful as we were never told what other drinks were available with…", "date": "February 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r117286767", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A good holiday", "review": "Our first all inclusive holiday and found it to be good value for money. The staff were very friendly, food was ok (just not all our taste) plenty of it and freshly cooked. No problems at the bar in getting drinks, bar did close at 11pm for all inclusive, but by then most appeared to have had enough to drink!!   Room was cleaned every day and there was no problem with cleanliness at all. Pool was small for the size of the hotel. Mixture of nationalities there, the brits were the loudest!! I would not recommend taking small children here, there is nothing for them to do except play in the pool and you need to watch them as the pool in on the roof of the hotel and no english safety standard rails, children need to be over 10.   The location is very hilly and the town is not as…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r117098659", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "It was great!", "review": "When I first arrived at the hotel, I thought that it was not going to be as great but I was proved wrong. I arrived at the hotel with my family at around quarter past 10 at night and by that time the dining room was closed so we did not get a meal. But because of that the reception gave us a free meal on the day we leaved as we were half board. Generally the food was tasty, as there was a variety of salads and dishes. The staff were very friendly, especially the waiters. Most of them knew english, but I was able to interact with them as I knew a bit of spanish. It was quite funny, ended up having a picture taken wth them! Our rooms got cleaned every day and we were provided with new soaps and shower gels each day. The hotel is not near the shops which many people would like to…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r116751540", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "More than happy with this hotel especially for he price!!!", "review": "Just returned from spending a week at the Perla n found all the staff helpful and friendly!  have to say that simian has covered much about the hotel already and our experience of the place was much the same although we did travel to Loro Parque (simian didnt do parks so for info only) . Loro Parque was a very good day out and we purchased the Twin Park ticket so as we could also experience Siam Water Park. Loro is a must see especially the orca, dolphin and sea lion shows, absolutely fab n well worth watching, Orca show has you laughing and is a good show and if you want to be kissed by a sea lion then i suggest you sit to the left farest side 2nd row back, fortunately i was sat on very front but did have the sea lion right next to me while he wet kissed the lady who was sat…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r116649222", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Couldn't ask for more", "review": "I am one of those people who spend hours looking at reviews for hotels before I commit my hard earned money and time to a holiday.  I was relatively pleased with the previous reviews I had read about the Perla and so I though my wife and I would enjoy out time there.  We were looking for a fairly quiet place with good food and not too many drunken 'kids' partying at all hours.  I think we found exactly what we were looking for here. Our transfer took an hour (we were the only people on the transfer bus, so no other drop offs), which was quicker than we expected and we were dropped off by a bridge that went across to the hotel.  We entered on the first floor and made our way up to reception on the fifth floor.   The original room we were given was perfectly nice but the view was…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r116514726", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "terrible hotel.", "review": "miles away from anywhere, no entertainment, bar staff very rude apart from one young man who tried to make up for the others, wouldn't allow cards played in the bar, had to sit outside, pool area horrible with loungers on a nother floor up a ladder that looked like it belonged to an aircraft. only good thing was the food which u could have plenty of.  all inclusive ends at 12.00 on the day u leave even if u dont leave tii 8 in the evening. would never go back or recomend this hotel. beds terrible too.", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r116378257", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Excellent value for money", "review": "Rooms cleaned daily and fresh towels every day.  Really relaxing holiday.  Staff were very friendly and helpful. Food good and varied, hot and lots of it. Branded soft drinks - pepsi, fanta and 7up included in All inclusive deal.  Quiet location, just a 20 min walk to the town or get the free bus from the hotel.  Would def. go back to this hotel.", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r116230378", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Not What I was Expecting....", "review": "Where to begin! Not the most horrendous experience... but yet not the best! The cleanliness, general appearance, waitering staff, reception staff and other guests were all beyond satisfactory. As for the Bar staff... Quite easily ruined the holiday! During the day they offered no entertainment... not even a smile! It was rather shamefull on the hotels behalf that they allowed the most miserable bunch to be on the bar. My other half and i went all inclusive and i can assure you we paid for the holiday, which as far as i'm concerned is generally how an all inclusive holiday works, yet they begrudged us every drink that  they gave us and even had the cheek to ask us when we were leaving! We were having a few quiet drink and playing cards most of the week with a few couples we met…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r116209503", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Do not go to this hotel, staff were very rude. made our family holiday hell.", "review": "its like a prison, cant do anything, not a hotel for children.....we were all really ill so had to stay in bed for 2 days, could not even bring a bowl of soup to room for my sick father. Do not book this hotel if u have children or want to enjoy yourselfs!!!!", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r116180571", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Reasonable standard not as advertised", "review": "The hotel itself was to a reasonable standard, its staff were friendly and helped for an enjoyable stay. The food was good and the menu was varied. The room was small and not to the standard portrayed in the pictures on their website. The bed was very uncomfortable and would recommend going all inclusive to allow you enough drinks to overcome this issue. If you are hoping for a peaceful break this is probably not the hotel for you as it has very thin walls and very noisy cleaners. This hotel would benefit some money being spent upgrading the facilities in the rooms to bring it back to the 3 stars it advertises.  To no fault of the hotel Northern Tenerife does suffer with a lot of cloudy days even when the South is basking in Sunshine.", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r116065243", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "We liked it, but would not go back!!", "review": "Hotel was fine, a few faults (no a/c in the bedrooms) but on the whole the staff were very attentive. The only thing reason they did not get 5 stars is the attitude of the bar staff.....One barman in particular (a big, no neck ugly bugger) who should be no where near people trying to enjoy themselves. He seem to think the all inclusive bar was coming out of his pocket...would only serve you when he was ready and very rude when he did.......We would never go back until he's gone!! What a shame", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r116059387", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "very clean hotel", "review": "My friend and I stayed there for a week at the beginning of July to relax after finishing our degrees! And relax we did!   The rooms are basic...but you don't spend time in them anyway! My friend said her bed was a bit hard, mine was fine but I can sleep anywhere!   Food was good - huge salad selection, and ALWAYS fish on (I don't like fish so some nights it was a bit boring because there would often only be one meat option). And deserts are the standard \"non- English\" deserts that we always moan about abroad!   The area we were really disappointed with. There is not much to do unless you have the cash !!!!! It is a cheap hotel and holiday but when you get there to actually do things it will mount up. Other holidays I have been on you can just walk places and there is so much to…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r115955531", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Great value for money hotel!", "review": "We've just got back from a week's stay at Perla, and don't really have a bad word to say about the hotel. The decor is a bit dated, and there are a few odd bits (like the reception is on the 5th floor, and the pool on the roof terrace) but the hotel is clean, the food is great and the staff are helpful. The only bad thing was the other guests - on our last night we were kept awake by people shouting from balcony to balcony at 1am, but this isn't the hotel's fault.   The food is a buffet service, and there was plenty to choose from. As someone with a wheat intolerance I usually struggle abroad, but there was plenty of salad (always fresh), two or three meat dishes, sides e.g. canarian potatoes (scrummy!) and a fish dish. There was plenty of choice for pudding as well, with fruit,…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r115809935", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "on the whole an excellent trip", "review": "Rooms- cleaned daily and immaculate, non smoking and altho i am a smoker i prefer a room not to smell, good size with a fridge and safe(deposit req) views not great but not an issue Staff- absolutely amazing, very willing and friendly Pool- small and deep loungers on the roof upstairs ideal for the sun(when it comes) be careful of the metal stairs as they are very slippery when wet Food- again amazing, well cooked and different daily Entertainment- this is where the hotel is a letdown...Pedro on his keyboard!!! and a disco, which to be fair if you dance(like we did) it can be a giggle no other entertainment and bar closes at 12.00 dead on so its either bed or town as there is nowhere else to sit. Best advice to give is hire a car and do some sight seeing as it can be…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r115662122", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Very good with no complaints", "review": "Just got back after a fun filled week. If you're boring and are planning on sitting in the Hotel all week then don't expect too much.   There is plenty to do in the local area if you have a little imagination or even more if you don't mind sepending a few pennies (water park, zoo, island tours etc...). I advise that you hire a car, it works out cheeper; 18euros a day for a for kia which is the lowest level and fuel cost half the price as mainland europe.      I was impressed with the food and drink (beware alchol is watered down, when you get on it down town you realise quickly realise how smashed you get). Wide variaty of food, although some people complained of upset stomachs, I survived.      Staff are polite and helpful. If you tip they become even more so. Rooms are cleaned…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r115565425", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "What a cracking time we had!!", "review": "We had a week in this hotel, I have never had so much fun on holiday, full of Geordie lasses, and many others!! We had a great time watching my partner fall out the jacuzzi, Sally fall down the stairs and me being blind drunk, the portions were great and plenty of beer flowing, well there was till I showed up, the reception staff were fantastic & the waiters at the dining was really helpful (except the women with demencha who asked for our card EVERY time!! I went to this hotel allergic to fish, I come back anorexic! There was plenty... Of fish to choose from and the chef makes a great onelete! All in all, it was amazing!!  Thanks amazing friends & thanks Perla Tenerife!!  All the best, Jamie & Emma x", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r115084203", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Brilliant value for money", "review": "We are a couple in our 60s and liked the atmosphere: very pleasant and relaxed. There was a wide variety of nationalities and everyone got on fine. The hotel staff are very friendly and helpful. The hotel itself is situated in a quiet residential area and there is a regular minibus to the town centre, from which you can walk to the beach. A variety of facilities are in easy reach and I noticed an unusually large number of tennis courts. The weather is cloudy and if you want sun, catch a bus to the other side of the island or hire a car. The local temperature hovered around 65 fahrenheit most of our stay, which made it pleasant for strolling around. We recommend the botanic garden just up the road. The orchid garden down the hill was closed for renovation but reopens on July…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r115074768", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great hotel!", "review": "We stayed in this hotel for one week and have 2 rooms.  ROOMS: - clean, big with balcony and TV. Safe is very small and not suitable for netbook and is for 15 EUR per week.Beds were quite comfortable. FOOD: great! - especially canarian quisine was delicious, however international was perfect, too. Wide selection. Beverages are free only if you have All inclusive SWIMMING POOL:  quite small but nice. However I prefer sea ENTERTAINMENT: 2x per week live music with piano player - great!!!, 3x per week disco - the same rythm all evening - not very good STAFF: very friendly, helpfull and able to communicate in english INTERNET: Free and reliable WiFi at reception and bar. PC with connection to internet at reception, but paid (not sure how much) PARKING: at the street, no problem to…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r115005284", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "basic but very chilled break!", "review": "Just returned from Hotel La Perla in Tenerife after a 10 night stay, Me and my boyfriend ages mid 20s, we struggled to find a hotel in tenerife with good reviews, however after reading a few we decided to book up, first of all the journey from the airport is about an hour and a half so make sure you have tranfers, otherwise you will pay a fortune, once you get to the hotel it is strange layout with 6foors the reception being on the 5th floor and bar and sunloungers higher, hardly any english people mostly 60+ couples who speak spanish, no daytime entertainment and evening entertainment was all spanish. Drinks and food however can not fault breakfast the usual fry up,fruit and toast,lunch and dinner meat veg and chips and during our stay the food was only repeated about 2 or…", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r112710354", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Wow Where Do I Start", "review": "When I booked an all inclusive holiday I didnt realise it would be an all inclusive!!!!!!  Holiday at this Hotel. How can I put it. The Bar Staff are (Very attentive to your needs).  If You are a Women that has been cheated on, dumped or divorced then this is the place for you to have some fun!!!!. Age is not a problem as all is catered for.  If you are looking for somewhere that is children friendly this is not the place for you. All entertainment is in spanish so if you dont speak spanish then you will be bored. Young couples should stay well clear.  you could mistake the hotel as a retirement home. This Hotel is for Spanish people going on their holidays.  Where the Hotel is situated you dont get much sun and very overcast indeed.  All in all, the hotel is very clean, food is…", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r111556218", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "ABSOLUTELY FANTASTIC - COULD NOT FAULT IT", "review": "We have just returned literally 24 hours ago and would go back today - had a fantastic 10 night stay and the staff were so friendly.    The food was amazing, never stuck for choice - no day time animation but we had 4 or 5 discos while we were there and danced the night away - loved it.", "date": "October 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r84319064", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Nice Place", "review": "After several business trips in the UK and the resulting over night staying with all the typically English problems like untidiness, high prices for nothing unspeakable food, now a holiday trip to Tenerife. What a surprise only a 3 star hotel with good food, quiet atmosphere, friendly service and a fair price. Thank Goodness for the hospitality in other European Countries. Gives you the good feeling of being treated as a valued customer. Thanks Perla Tenerife. When we go back to Tenerife it will be the Perla Tenerife again.", "date": "October 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r84093659", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "you get what you pay for", "review": "although it has three stars,  it really is one maybe two stars.  very basic..............food not good   bad beds   nice town thank goodness..............you certainly get what you pay for.................after the third day wanted to return home", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r79954262", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Great value stay at the Perla Tenerife", "review": "We had a great value 2 week all-inclusive stay at the Perla Tenerife - me, my wife and our daughter (41,41,4).  The hotel is well out of the way, about 20 minutes' walk from the seafront.  If you want to spend loads of time on the beach, the distance will get to you.  There is a free coach running approximately 7 times a day from the hotel to the centre of town, and that's a very useful service, but not quite the same as being in the centre of things and doesn't run in the evenings.  All of that said, the location is quiet and relaxing - whereas most of the town centre hotels are quite noisy.  We found the food fine - but if you are fussy, you will get bored on a two week stay.  The bar gave generous measures and no silly rules about one drink per person at a time or anything…", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187481-d529061-r75770021", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}]