[{"title": "Be careful driving in to drop off or pick up luggage", "review": "We stayed for 10 days and hotel was lovely. The breakfast was great and staff was nice. But I received an expensive ticket for driving in to pick up our luggage when we left. I was in the square for 5 minutes maximum as the suitcases were already downstairs. Apparently you are supposed to have a receipt from the front desk but they did not inform us or give it to us and now I'm being asked to pay a large fine for driving in plus a fee from the rental car company for processing it. Eur 150.", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r715586052", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "we stayed at this lovely hotel for 11 nights", "review": "the hotel was absouletly  lovely ....the staff were lovely...danielle..renato could not do enough for us...reception staff to.the hotel is so clean ...maid very freindly to...we got the room that was adapted for us...food was lovely ...service was first class.we will be going back next year ..best hotel in the square...fab location", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r711211089", "sub_review": {"Location": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Hotel on the Magnificent Lake Garda", "review": "Dear Angelina and Ian, it was really nice to have you here! We are glad you appreciated the service provided by our staff, thank you for your kind words. We really hope to host you again soon. Kind regards. ", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r706710321", "sub_review": {"Location": 5, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "Half board - take care", "review": "Set in the old part of Riva del Garda, the hotel offers everything the holidaymaker could want, close proximity to the lake, right in the middle of everything, excellent rooms, splendid food. Not perhaps all the immenities of a 5 star but more than sufficient. A group of us all said how good everything is. Lovely people as well !!", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r691813741", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Three night stay", "review": "Dear Desmond, we are glad you had a nice stay at our hotel. Your feedback encourages us to work even harder in order to offer to our clients the best holiday experience in Riva del Garda. We look forward to hosting you again. Best regards ", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r682265286", "sub_review": {"Sleep Quality": 2, "Rooms": 3, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Lovely Hotel", "review": "We have just returned from our second visit to this lovely hotel.  It still has the original features of an old palazzo but with all the modern conveniences.  As we found before, the food was excellent with an extensive buffet to start with, followed by two further courses each with a choice of three dishes, and then a dessert; all were delicious!  As for the staff, without exception they were all friendly, welcoming, and at the same time efficient.  A special mention must however be made about Danila, in the restaurant.  Her warm and friendly personality made our stay more special.", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r674597842", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Unwanted experience", "review": "Dear Martha, It's nice to read that you liked our hotel so much that you decided to come again! We're incredibly grateful for your continuous patronage, thank you. We're also happy that you appreciated the customer service provided by our staff, making our guest happy is our top priority. We will surely refer to Danila your kind words, she will be pleased. We hope to see you again soon.  Kind regards,", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r641945877", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "nothing evceptional", "review": "My wife is a doctor and 4 months pregnant, I'm a consultant and we have a two year old son. We both work 12 hour days and this was our first vacation in 4 months, a two night Christmas stay in a 4 star hotel. It was not enjoyable.  On arrival, both receptionists watched on as we struggled to navigate the entrance steps and enter the non electronic door with bags and baby buggy in tow. Common decency went amiss.  We booked and paid for a matrimonial superior suite, what we got was two single beds pushed together in a room slightly larger than our sons bedroom. The single bed itself was too small and my feet hung out over the end, I'm only 185cm, average for a Northern European. The mattress quality is such that you can feel the springs digging into your spine as you try to sleep.…", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r633094632", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Just a little more", "review": "Dear Anthony,  Thank you for taking the time to share your experience, we truly appreciate our guests' feedbacks. That said, we regret to read that your stay was so unpleasant, we're sorry. Our goal is to provide the perfect vacation experience, but it seems that in your case we failed. We spoke at length with our reception manager to better understand the situation and to prevent similar occurrences from happening again in the future. We would like to point out a few things:  - You booked a Superior room, that is significantly smaller than a Suite. You also forgot to tell us that you were travelling with a child and made a reservation for two adults only. At any rate, we were more than happy to provide an extra bed for your son at no cost.  - Our reception manager was really sorry to hear about your discomfort, so she offered a free upgrade to a bigger room, but you refused. We honestly did our best to accommodate your situation but even in our Suites, we don't have king or queen size mattresses. Our matrimonial beds are made pushing together two twin size beds. It was simply not possible for us to fully satisfy your request, and for that, we owe you an apology.  - It's really unfortunate that you didn't receive enough assistance. We strive to provide excellent customer service and, in fact, our clerks were glad to help you with your luggage. If you visit us again, please, feel free to tell us about your every need.  We look forward to welcoming you back soon, we're sure that next time we'll be able to make it up to you for this negative experience.  Kind regards,  The management ", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r633050040", "sub_review": {"Value": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Why was my room like a cave?", "review": "we stayed there for 3 days at the end of october this year  we were on the top floor and couldnt se out the window unless  you knelt on the floor  there were no tea and coffee making fascilities  in the room  apart from these two things the staff were very helpfiul  was near to the lake  and shops", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r627333458", "sub_review": {"Value": 1, "Location": 2, "Service": 3}, "travel_purpose": "Traveled solo", "rating": 2}, {"title": "Perfect location with lovely staff", "review": "We've had a wonderful stay in this hotel.  The hotel is in a perfect location in the centre of town which was so handy to everything. The room was lovely large and spotlessly clean. There was good WiFi however the downside was that it was very warm and the air-conditioning had been turned off. We had to open the window which meant we were woken by outside noise The staff went out of their way to make our stay good. The breakfast was an amazing selection and you could have as much as you liked. As we were on half board we had to select our evening meal at breakfast, but at least we could plan our meals for the day There was always.a pasta in the meal which was lovely followed by a main meal and desserts. It was a case of waddling out with the amount of the food a available We…", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r625045480", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely location, super staff", "review": "Dear dawnecallender, thank you for taking the time to share your feedback, we really appreciate it. We're glad to read that you had such a pleasant stay, your kind words made our cooking and service staff happy. By the way, it's unfortunate that the room was so warm that you couldn't sleep with your windows closed, during the last few weeks the weather has been really unpredictable! We're sorry for the inconvenience.  We hope to see you again soon.  The management", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r624513316", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely hotel in a fantastic location", "review": "We recently stayed at the Hotel Portici for a Riviera tour. From the moment we arrived the staff were pleasant and helpful.  Although we were staying as a tour package the food was excellent and plentiful.  Most of the usual breakfast items were available on a self-serve buffet style.  The hotel is on a lively square that opens out onto Lake Garda only a few steps from the front door.  The harbour is where the lake steamers leave for tours as well as ferries to other lakeside towns.  Our room was spacious and well appointed.  Unfortunately our room was on the west side overlooking the side alley, so no view - but the upside was no nighttime noise.  The bed was comfortable, but quite firm.  The hotel is constructed from three buildings linked together, so the lifts are quaint(?),…", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r620966815", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A Place to Relax", "review": "Dear Nigel, thank you for taking the time to share your experience! The staff was blown away by all your compliments, you really made our day. We hope to see you again soon, you would love our rooms with a view over the square.   Kind regards  The management", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r620759526", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A nice stay", "review": "To our surprise on our arrival we were told we had been upgraded to a suite and, sure enough, we were shown to a suite with a lovely lounge, large bedroom and very well equipped bathroom.  It was quiet, spacious and a lovely place to relax in at the end of the day.  The staff were very helpful and friendly.  The hotel is in the pedestrianised part of Riva, surrounded by beautiful old buildings and piazzas which were a joy to walk in.   Overall a really lovely hotel with a fantastic atmosphere and we can't wait to return next year.  The food was excellent, the best we have had in Italy for a long time.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r615994688", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Beautiful location ", "review": "Stayed here for a few nights as an anniversary getaway.  What a stunning location right on the river.  Walking distance to everything.  Hotel staff couldn’t have been more accommodating.  Room view was beautiful and the room Was modern and clean.  Can not wait to visit again.", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r609750299", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "good hotel in a great location - very nice staff", "review": "Dear Luke, thank you so much for sharing your experience. We're glad to read that you appreciated our stunning location and how friendly the staff is, customer satisfaction is our main goal. We hope to see you again soon!  The management", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r604335869", "sub_review": {"Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great location!", "review": "We ended up in a room at the back of the hotel, rather than on the square as we had originally planned - this was our fault, not the hotel's problem. Although we were given the choice to move, we chose to stay in our first room - it was considerably bigger and quieter, so there is a tradeoff - if you want a view, you may get a smaller room. And, if there is a party in the square, there could be a sleeping issue. The staff could not have been more accommodating. All in all a great stay, We will return both to Riva del Garda and to the Hotel Portici.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r592943708", "sub_review": {"Sleep Quality": 4, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "hotel", "review": "Dear guest, We are pleased and proud to understand that you had a pleasant stay with us. Hoping to have the opportunity of welcoming you again we’re sending our most cordial greetings.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r587975113", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good Hotel", "review": "Hotel Portici is well located being just off the main piazza and literally a minute from the lake. We had a very spacious room with the bathroom at the end of a long corridor. The shower was the kind you hook up on the wall - not an overhead shower which I would have preferred.   The room was basic in terms of furnishing but very clean.  The bed was firm but comfortable. There were plenty of hangers for our clothes and the wardrobe also had some shelving. There was a safe and a fridge with complimentary bottled water. There was also good air con.  We had a partial view of the square below and were not disturbed by any noise outside. The rooms must be well insulated because we did not hear any sound from any neighbouring rooms. There is a lift though it's rather slow.  The…", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r585225726", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fantastic staff", "review": "This is a very conveniently situated hotel at the back of the main square. It is functional, modern and very clean. The big plus is that single rooms have a double bed in them. Plenty of storage and very modern bathroom. It is a shame that if you are on half board you cannot have an allowance towards the a la carte menu. The food on half board is adequate and plentiful. The staff are really helpful and happy. The bar and lounge area could do with a revamp, it's a bit functional. The bar prices are very competitive.", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r581084401", "sub_review": {"Value": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Just great", "review": "Dear Mrs. Helen, thank your taking the time to share your experience. We work hard to meet our guests' expectations and we are always happy when we succeed. We hope you will visit us again soon! Kind regards from Riva del Garda, the Management and the staff ", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r580057867", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Would stay again - get the breakfast included.", "review": "Very pleasant small hotel, centrally located in a beautiful Riva DG. Comfortable room, nice wellness area, very good food and hospitable staff. My recommendations! Parking was well organised nearby and with fair price.", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r579926218", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "The lakeside square", "review": "Dear Jovan, thank you for your top-score review. We are very pleased to read such a positive feedback. We sincerely hope to welcome you again in the future. Kind regards from Riva del Garda, the Management and the staff ", "date": "December 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r554547219", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great location, not so great food", "review": "Lovely hotel, great location, parking can be complicated however. The room was well equipped and clean. Nice view onto the square. What we loved most though was the breakfast. Never seen a buffet breakfast like it. Totally worth getting out of bed for.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r542702365", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good room, good location, shame about the dinner", "review": "This is a very good hotel extremely well located in Riva del Garda.  The staff were all extremely helpful, the room comfortable and a good size, and the hotel very clean.  The breakfast buffet was large and varied.  The only downside was that as a guest you could not eat in the outside restaurant, which had a very wide menu, but had to meat in the internal restaurant from a very limited menu.  In addition you had to choose from that menu the night before.  The dinner main courses were generally poorly presented, lacked flavour and several guests in my group decided to eat dinner elsewhere even though we had paid for half board.  A great shame, and I would have been happy to pay a higher tariff to be able to eat dinner in the outside restaurant.  I'd strongly recommend this hotel…", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r534113258", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Half board misery", "review": "Very good location and very pleasing and helpful staff.Rooms OK but need to upgrade unless you want to look out at a wall. We chose this hotel because of the dining outside in the Piazza. Unfortunately  this al fresco dining was not allowed to residents on half board. We were put in a somewhat dingy crypt of a room that had no windows. Perhaps this would have been OK if the food was excellent but it was plainly awful. It was the worst food we have ever experienced in our many trips to Italy .There was no Italian cuisine at all.", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r525762843", "sub_review": {"Value": 3, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Very friendly place", "review": "I am an ageing single traveller without a car so didn't use the garage or the wellness suite. So was a little apprehensive about how a traveller, not using those facilities, would be accepted. I needn't have worried, everyone bent over backwards to be of sevice from mike the night porter Mike, to Adrianna, Julia, & Valentina, the receptionists, to all the other staff. Room cleaners, Bar staff, Catering staff, etc. For a single person I was surprised at my room, it was huge with a big bathroom & cleaned very efficiently everyday. The food was great. Breakfast was buffet style-continental or English(eggs & bacon) & took up a full small room of it's own with it's choices. You had to order your evening meal, if you wanted to eat in, at breakfast. The choices were great, especially…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r520125313", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Lovely hotel let down by food for residents", "review": "Booked this hotel with a tour holiday company. We arrived about 10pm after our flight was delayed, to be greeted by very pleasant reception staff.  We had previously been warned that we had missed dinner and that there would be a cold buffet waiting for us. This consisted of a plate of ham with some sort of pickled vegetable and a dry roll. Every morning we were given a menu from which we had to choose the next days dinner.... a bit like being in hospital! Trouble was that the food going to the general public in the outdoor restaurant looked wonderful.... very different to that for the residents. This was a shame as the waiting staff were excellent. On the positives, the room was great and a generously sized bathroom with very good shower. There was always hot water and clean…", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r508381527", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Lovely hotel, perfect location", "review": "We thought the hotel was very nice. It is located on the perfect spot in the central, super short to walk anywhere really.  The car park is close to the hotel, only 3 min walk and when arriving and departing it is possible to drive all the way up to the hotel for the bags.  We borrowed bikes from the hotel and went to \"the beach\" which only took about 5 minutes.  The room was basic but very nice and clean.  The breakfast was very good with many options and the coffee was actually good! The staff is so helpful and nice so overall we were very happy with our stay in this hotel. ", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r508104538", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Recommend!", "review": "Great hotel in the heart of Riva del Garda. Only 5 minutes bike ride to a nice beach there.  Spacy and clean rooms which are cleaned daily. Breakfast buffet is very good and diverse. The staff is very helpful and friendly. ", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r508104108", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Loved this hotel", "review": "Great hotel in a central position. Staff excellent, couldn't be more helpful and friendly. Rooms cleaned daily with fresh linen and towels. Breakfast was great with plenty of choices. Only minor comments would be the room was quite small for 3 adults, no tea/coffee facilities and there was no iron in the room, these are very minor observations.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r500311644", "sub_review": {"Location": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Nice hotel, good location", "review": "We thought this was a very good hotel.  The location close to the old town square, lakeside, ferry, shops and restaurants is perfect.  Free WiFi was available throughout the hotel.  Our room was good, with air conditioning, comfortable beds and a good bathroom.  Breakfast is excellent with lots of choice and the opportunity to eat outside is available. Evening meals were fine, nicely presented and with a very good salad bar. Drinks prices were very fair. The service was excellent throughout our stay with a special mention for Danila, you would be lucky to meet a more pleasant waitress. We would be happy to recommend this hotel.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r500280976", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Amazing Spa!!", "review": "I took my time in selecting the hotel we'd stay at in Riva and I'm confident I made the right choice.  Reception staff were a little hit and miss at times to be honest (we paid €10 per day for parking without being told on the original booking form / confirmation that that was the case - slightly misleadingly presented costs therefore) but the hotel was good otherwise.   Excellent spread for breakfast (including prosecco!), spacious junior suite (shame about it being two single beds pushed together), lovely cleaning staff and gorgeous health and wellbeing suite. The gym was tiny but functional, however the relaxation room, sauna, steam room, salt room, \"experience\" showers and hot tub were awesome. The centre was closed for a large chunk of the day though, which was rather…", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r493014790", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely Hotel in Downtown", "review": "Great hotel at a great location. Wonderful & friendly staff. Very big and spotless rooms. Very comfy beds. Free WiFi. It has parking for a small fee. They offer an amazing breakfast full of options and its included, they have juicers, a citrus juicer and a high speed juicer...I'm in heaven!! Big bathroom with massage shower, I'm in heaven again! We are here right now and we are loving it.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r487614885", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Stayed one week in May", "review": "The room was very basic which is why I have only given four stars.  No chest of drawers very small room no tea or coffee making facilities.  On the plus side the staff are fantastic especially night porter Mikkala who was helpful way beyond his remit.  The location cannot be bettered right in the centre of things on lake shore.  The food was good plenty of it especially their splendid breakfasts and evening salads.  Never used the spa.  Would return but would want a better room than we had (208)   Cleaning excellent.  Evening wine prices very reasonable.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r485585360", "sub_review": {"Sleep Quality": 4, "Rooms": 2, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "City Centre Hotel with Good view of the Lake", "review": "Dear Jennifer, thank you for your review! Our hotel has different kinds of rooms, from basic classic rooms to suites: you can choose what fits the best for you. In Italy is not common to have tea or coffee facilities in room. In any case, our room service is working 24h and we can bring you anything you want. Hope to see you again! Kind regards from Riva, the Management ", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r477076348", "sub_review": {"Value": 4, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Awesome hotel!!", "review": "As this is my second time of visiting Riva Del Garda , I do know what to expect. I was taken back by the closeness to the harbour the hotel is situated and the professionalism shown by the staff. The draw back is that there is no usual balcony and the windows on the top floor is only very tiny and there is only one lift for both  quest and staff to use. The food is of good standard  with generous buffet salads etc. There is a slight slope walking from the dinning tables to the  adjacent room where you are expected to go and get your breakfast and salad  and it is few yards away.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r462677873", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely Lake Garda", "review": "My girlfriend and I spent 2 nights at Portici in October. It is an awesome hotel and spa located right on the main square. We has a corner room with amazing views. The staff was friendly and helpful and their restaurant had fabulous pizza! There is parking nearby, which helps as the hotel is right in the centre of town. A great find for us!", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r429396028", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A week on Lake Garda", "review": "Hotel Portici has a wonderful position for Lake Garda visitors (but no lake views from most rooms), excellent,  hard working, helpful, cheerful staff, modern, spotlessly clean bedrooms. Sounds good? Oh dear, the food was a real let down! Evening meals for those of us on half-board were at best indifferent, and only bearable because of the fine help-yourself salad buffet. How we envied the casual diners who had the a-la-carte menu in the public restaurant. As for breakfast, this was only bearable because of the enormous range of food offered buffet style. Worst was the bacon (limp and unappetising), scrambled egg (ok if you're there early before it goes hard). Worst of all however was the coffee - unbelievably awful - and this in Italy, famed for its wonderful coffee. However, we…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r420328400", "sub_review": {"Value": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "There by default but a nice surprise", "review": "This was not our first choice but as it was the only hotel the tour company had with a single room (without a massive supplement) we went for it. It was only after we booked it that I looked at Trip Advisor reviews and was a little concerned. Based on the reviews and because we like to try different restaurants we all agreed pre trip to not take advantage of our half board basis and eat out every night (more of that later). On arrival a very speedy check in and up to our rooms. Our single companion is a delightful gentleman of 86 years and it was great to have the lift and his single room was excellent. Our room was a lovely surprise very roomy, modern and clean.No view to speak of (room 208) but as we only use it to sleep in it was no issue for us. The location is excellent and…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r417915513", "sub_review": {"Location": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Perfect location", "review": "Located in the main square in the old town close to all the restaurants and bars and to the waterfront. Riva is beautiful. The room we had in the restored old part of the hotel was huge and comfortable but with no views - other than from a skylight to the top of the mountains. The breakfast needs attention - you have to collect it on a tray from a hot unventilated room at the back of the hotel with no proper refrigeration for the food, and the breakfast coffee was the worst we'd had in Italy.  The reception staff were very helpful. Swimming in the lake was wonderful and we also had a boat trip to Malcesine which is beautiful. We have rated it 'good' because of the location and helpful staff.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r414875137", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great location, avoid half board ", "review": "Dear Guest, thank you for your comment, but let us clarify two points about it. First, at breakfast you can order italian espresso or cappuccino, american coffe or german coffee free of charge. Second, refrigeration for food in our dining room -and all the HCCP norms- are 100% respected: we do not accept any speculation about that. Kind regards from Riva del Garda, the management", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r410730628", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Perfect location, modern, clean and great food.", "review": "Great location, easy parking (in a pedestrian only area so parking 5min walk from hotel). Clean nice room (good house keeping) pleasant staff. We enjoyed the spa.  Unfortunately let down massively by very poor food served as an evening meal for half board guests. Half board guests are served in a dingy back room which is a real shame given the lovely pavement setting for the hotels main restaurant. We had 3nights at the hotel and I was served fish that was not fresh on the 2 nights we ate at the hotel. The first time it just smelt really strong, the second night the monkfish was grey, gelatinous and inedible. I'm not sure how this was achieved but it really was awful. Both my partner and I took 1 mouthful and left the rest. The starters and desserts were also poor but the salad…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r409881059", "sub_review": {"Value": 4, "Location": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very good and nice. ", "review": "Very good and nice Hotel. When we arrived at their parking lot,  they send us a person with a sort of golfcar to pick us and our lougage up to the hotel (+/- 400m distance). We had a Junior Suite room of +/- 35 sqm,  clean and with the right temperature. People who work their are very gentil and ready to help you with any question. ", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r409092208", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Nice hotel in a good location", "review": "This hotel is situated in the old quarter of Riva Del Garda  just 50 or so metres from the Lake front.  The rooms are modern with TV and good bathroom facilities and more than adequate as a centre to explore Lake Garda.  The hotel restaurant serves a range of fresh dishes with an emphasis on local produce although when busy can be a little slow at dinner. Breakfast is self service with a huge array of things to choose from. The staff are friendly and service is very good both in the restaurant and front desk. We enjoyed our stay and would go back.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r400040329", "sub_review": {"Location": 5, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Hotel Portico: excellent. Riva delGarda: excellent.", "review": "Thank you Mr. Trevor, we are glad to hear that you enjoyed your stay with us and we look forward to have you again as our guests! Kind regards from Riva, the management", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r399999657", "sub_review": {"Value": 4, "Location": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "So Nice.", "review": "For the third year in succession my wife and I have stayed at the Hotel Portici and have just returned from spending 10 days there. Everything was excellent.  Particularly outstanding was the service in all parts of the hotel, whether at Reception, in the Restaurant or the Servicing of our room. At all times service was very friendly, helpful and efficient.  The service from Reception was fantastic. They arranged transport for us from Verona Airport to the Hotel and back, booked trips for us and provided information, which we requested on several occasions. Especially friendly, helpful and efficient at Reception, were Daniele and Giulia, whom we saw mostly. However on the few occasions, when we saw other staff there, the situation was just the same.  There was a wide choice of…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r398653551", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Beautiful, clean, friendly ", "review": "Dear John, it is very gratifyng for us read such a good words, thank you very much. It was a pleasure to have you as our guest again, you were also very kind and polite! If you're traveling to our area gain soon, don't hesitate to call us. Kind regards from all the staff, the management ", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r395456936", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great Hotel", "review": "Great hotel, good food and friendly staff.  The hotel is near the lake behind a building but gets the sun at the front for nice breakfasts in the morning.  They also offer free hire bikes for cycling around the town/lake which was great.  I would recommend it. ", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r394973524", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Disappointing room", "review": "Dear guest, thank you for giving us such a good rating and for recommending our hotel to other travelers. We also wait for you again! Best wishes, the management", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r394818684", "sub_review": {"Location": 3, "Rooms": 1, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "A good start to our summer holidays", "review": "Just got back from a week at this hotel and we were extremely disappointed with our room. It was just a few feet from a wall and very dark and oppressive. This was our second visit to this hotel but we will not be back!", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r390937270", "sub_review": {"Sleep Quality": 4, "Rooms": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Week in lake garda.", "review": "We stayed at Hotel Portici for 3 nights at the start of our holiday tour through northern Italy and Croatia. The hotel is ideally situated on the Piazza on the edge of the lake with all the shops and restaurants within easy walking distance. Parking is close by. The hotel is clean and the staff friendly, our room was modern but still with the charm of the age of the building. The only let down is the food which was bland and just not what you would expect in Italy where simple ingredients become spectacular.  We had booked half board but were so disappointed after the first evening meal we decided to skip the other two evenings for something better in town.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r386882280", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Lovely small boutique hotel!", "review": "Great location of the hotel. The Hotel was very clean, the staff was very friendly, the evening meals was a let down, cheap, stodgy, used leftovers for the buffet the following day. This is not 4 star rating on the meals. The spa was great.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r385134990", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great location right on the piazza", "review": "Excellent location, right on the piazza, with stunning views. Nice rooms, good breakfast with a huge selection. Walk to shops, restaurants, and the water front. It's clean and offers a nice robe with slippers. It take up two connected buildings, so it's chopped up layout makes it confusing to find your room. Parking is in a garage across the road, with a maze-like route to the hotel. They offered free bicycle rental vouchers but we did not try them. We did use the ferry boat discount, which is a great way to see the lake.  Good wifi. Some rooms have good view of piazza and others none, so ask about the view if it's important to you. Same with room size.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r375113085", "sub_review": {"Sleep Quality": 4, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Good hotel and great staff", "review": "The hotel rooms are clean and modern. Good housekeeping service.  The lift is slow-I can get up three flights quicker than the lift.  The staff are charming and helpful, without exception.   The quality of dining was a pleasant surprise.  The breakfast choice is very good indeed.  Dinner too is good, but was not always my ideal choice. Having said that, well cooked and nicely presented.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r371168879", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very Nice / 9.5", "review": "We stayed for a week with a tour group. Room was very nice. Bath was clean and modern. We were between seasons so the AC was not available. Could not control room temp except to open the window. (Not so good.) TV selections are limited to local languages, Italian and German. Two English stations are not good. (Disappointing) Staff was very friendly but a little slow to respond to requests. Spa was clean and nice. Group meals were from limited menu but food was good and served well. Breakfast was good with a wide selection", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r367673215", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice SPA, big and comfortable rooms but poor food", "review": "I was there for 4 days at the end of March. Members of staff were polite and nice but often missing at the bar or on the terrace when you feel like a drink. Spacious rooms, great SPA but food at lunch and dinner was... not interesting. But the breakfast buffet is unavoidable.", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r367538995", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Positive feelings", "review": "I spend in this hotel one night. The room was very nice and big. I was suprised with the value that it offers. The service was freindly and proffessional. Breakfast could be better, but it is not the most important ;)", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r358743624", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Convenient place to stay in Riva del Garda", "review": "Stayed here for several days while touring northern Italy with Trafalgar. This is a friendly, pleasant hotel with decent food and services. Conveniently located in Riva del Garda with easy access to local vendors, restaurants and sites of interest. Staff was helpful and surroundings were pleasant and well kept. Lots of nice strolling in the area.", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r348514270", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great Location and Nice Hotel", "review": "We went to this hotel for a family wedding and the location, decor and room were all really good and exactly what we needed for the few days we were there.  The price was reasonable and the staff were all very friendly and helpful with everything we wanted.  Only thing with not too much option was the breakfast but there was more than enough choice and was in line with what you would get in any other hotel.  The view from our room was really good and overlooked the main square at the front.  All in all a good family stay.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r323619575", "sub_review": {"Location": 5, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Lovely room", "review": "We booked a superior room which was well worth the extra money, very nicely modernised, top floor so nice & quite. Free wifi very good. Continental breakfast not so good but it seems to be the same where ever you go in Italy, still found something to eat though. Overall, impressed & would recommend this hotel.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r320315099", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Center of Riva del Garda", "review": "Nice big room overlooking the main square.  Wellness area  a bit different from other places - but nice.   Beds are to hard.  Bathroom is good - but  towel warmer doesn't work during summertime.   Breakfast could be much better  -  also the service.  Lots of nice restaurants in area and not so expensive.", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r320192143", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Superior room turned out to be a box with disabled facilities", "review": "Paid extra for a superior room but it isn't big enough to swing a cat. Can't reach the coat hangers (too high), view of offices, weird disabled toilet - need a box to climb up to sit on, 2 single beds shoved together. Food is good, if you get there early in the morning before it has all gone.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r317336418", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Nice hotel, great position just off the main square but let down by poor food", "review": "My wife and I stayed in this hotel for 8 nights in early September on a half board basis. The hotel itself is comfortable and the staff very polite.  Check-in was very quick, although were not told about the reciprocal arrangements for using the swimming pool in another hotel or of the free use of the wellness suite and had to specifically ask about these later on in our stay. Our room was very spacious if a little dark, as the windows looked out on to a wall some 4 feet way.  The main problem was the poor quality of the food. Instead of being able to eat in the main restaurant area outside and have a daily allowance against the standard menu there, we had to have our meals in a separate room inside the hotel from a different set menu. The menu looked enticing at first, with…", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r312579480", "sub_review": {"Location": 5, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great Location", "review": "We stayed at this hotel for a total of 5 nights. We were on a tour of the lake district of Italy. What a great location. You are right in the midst of everything, shops, restaurants and a wonderful view of the lake and mountains. What more could you ask for. Breakfast was quite good with plenty of choices. We had dinner there one night which was quite adequate. The only negative I had is that the elevators are very slow, and we ended up taking the stairs more often than not. I would recommend this hotel.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r311046085", "sub_review": {"Sleep Quality": 4, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great locatiob", "review": "Hotel Portici has a fantastic location in the main square, although direct view to the lake is obscured (at least my room's was). It's close to all the good restaurants, stores and cafes but also just a short walk away from the museum.   My room was clean and comfortable with a newly renovated bathroom, a television and the beds were congenial. The service was also very good, the staff were helpful and sympathetic.   They also have a private, super-secure parking just a minute's walk away which was very convenient. It did cost though, about 15€ per 24 hours.   The hotel's greatest fault was for me both the restaurant and the breakfast. The breakfast had several problems; it was located rather peculiar in the back of the restaurant, it was quite the walk to one's table. To…", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r310861901", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Excellent location", "review": "Wonderful stay at Hotel Portici. Rooms were reasonably spacious and very clean, ours had a view of the main piazza. Reception staff were friendly and helpful. Didn't get a chance to visit the spa so can't comment on that.   Good breakfast offering, pretty much every taste catered for.  Excellent location in Riva, just off the harbour area. Easy walking to many bars and restaurants in the evening. Would recommend.", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r309187036", "sub_review": {"Location": 5, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice hotel with a great location ", "review": "Peaceful, central location, really friendly staff speaking good English, delicious breakfast, even Prosecco was served! We had a junior suite, which was really huge (a special offer when booking direct to the hotel), also garage near the hotel and a locker room for bikes. ", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r308984911", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great location!", "review": "We loved the location of this hotel in the pedestrianised square of the old town. The lake, sites, harbour, bars , restaurants and little shops were right there and there was a great atmosphere as we stepped out the door. No busy road outside, just a few service vehicles around 7 in the morning. Our double room was clean and comfortable with double glazed windows and air conditioning if we wanted to turn in earlier than most Italians! Breakfast provided a wide range of beverages, cooked meats and eggs, cold meats, cheese, breads, pastries, fruit, yogurts, cereal and even prosecco! We were on half board which is served in the inside restaurant, with white stone arches. It is a fixed menu but with four choices for each of the three courses plus an extensive salad bar. Drinks are…", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r305826703", "sub_review": {"Location": 5, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Perfect Portici", "review": "We stayed three nights at this perfectly located hotel in Riva del Garda. Close to the port, historical area and restaurants. The staff were always friendly and helpful; such an important feature of any hotel. We appreciated their advice re restaurants, trains, ferries and taxis, and of course Lake Garda attractions . Our room was very good and quiet. Breakfast buffet had ample options. Thank you to the staff for a very pleasant stay. ", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r288858346", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great location with superb breakfast", "review": "The Hotel sits at the piazza next to the harbour with plenty of outside restaurants nearby. The double room was clean, well equipped and reasonably prized. The breakfast was outstanding and possible to enjoy outside.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r286377596", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Heavily recommended!", "review": "Friendly staff, big room and good breakfast. I'll heavily recommend Portici. The downsides were that our room had no view at all, only the wall of a building next to is. On the other hand, why stay in the room when you can just go downstairs and you're by the lake Garda anyway.  If you are coming by a car be careful and don't drive to the hotel or you'll probably be fined because of the Italian tourist traps that they call zones of limited traffic. Google that before you rent a car in Italy. Portici has a nice garage but it costs extra.  Anyway, a really great hotel in overall. I'd definitely come again! ", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r286168615", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "H.U.G.E. Room", "review": "A great hotel in a beautiful location, right in the centre of Riva, next to the clock/bell tower. We were given a suite, comprising of a lounge with 2 settees a 32\" TV, a dining area with table and 4 chairs, large double bed room and W.C. with 3 piece suite. Food was of a good standard and drinks were competitively priced. Although no pool on site, guests have the use of the pool at the Europa, which is a 2 minute hop away on the waterfront. All in all no complaints and would be happy to stay again anytime.", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r284147859", "sub_review": {"Value": 5, "Location": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A great stay in Portici hotel", "review": "The hotel is located in the heart of the old city. The hotel looks great and has a unique style. The room is very spacious and clean. Breakfast is great. The staff is friendly and helpful. The parking lot is located several hundred meters away and costs 7 Euro per day. A huge plus are the complimentary amenities such as the sauna (wet, dry, salt), jacuzzi etc.. Also the hotel's restaurant was absolutely great- very nice food, service and a 10% discount for hotel guests.  A minor minus is the need to climb about 30 steps to reach our room, after reaching the correct floor by an elevator. Very recommended in the bottom line!", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r283344585", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very nice stay", "review": "Hotel has excellent location in historic center and has a parking place nearby, 600m away by foot. We had junior suite and it included spa. Spa was very nice, sauna, turkish bath and jacuzzi. Romantic stay. Room was nice, only minus was the floor: seemed old (?) and was cold even it was july. Breakfast was good, including prosecco.", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r280980889", "sub_review": {"Sleep Quality": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely hotel at the heart of the city", "review": "I had an opportunity to stay at 5 hotels in Riva before. Hotel Portici is one of the best for short stay for 3-4 days. It' exactly on the central square. The staff is kind and helpfull. They have special parking for the guests (7 euro per day). Nice and clean rooms. From our window we could sea the tower and the square. There is one good restaurant just in the corner, next to the Portici pizzeria.  The breakfastes are the best in Garda: a lot of kind of cheese, meat and bread. You can make fruit and vegetable freshes.  Next time I'd definitily like to stay there. ", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r280646803", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Good Location, Comfortable, Clean, Quiet but...........the food is poor", "review": "The hotel was very well located just off the main square and close to the lake.  The rooms were clean and had obviously been refurbished very recently.  Although close to the main square the rooms were generally quiet except when the rubbish collection was being carried out in the mornings.  Staff were generally polite and helpful although the head waiter was generally sullen and obviously did not seem to like the English.  Italian visitors got a much more friendly reception.    Meals were generally of poor quality and the staff seemed to need some training.  I have never been in a hotel where customers were served by course rather than by table, worse than that, we were served by individual items in a course so one person on the table might recieve their starter but others who…", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r280452443", "sub_review": {"Value": 3, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Nice Hotel in a good location", "review": "We stayed here on Half Board status with a travel company. It was then used as a base to travel around the Lake, The Dolomites, Venice and Verona. It is situated off the main square so is quieter than the ones on the harbour front. Although we did have a sports festival on one night, with bands and entertainment. The hotel has kept its old world look with a modern interior. The rooms were spacious, clean and the AC worked. The staff were friendly and welcoming with check in / out fast and efficient. As we were on Half board meals were taken in the inside restaurant. This could have done with a décor update as the walls of bright white and a few old photos were not appealing. The meals were from a set menu daily. Good choice of 4 starters, 4 mains plus a dessert bar and a salad…", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r279470576", "sub_review": {"Location": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Charming hotel with a good location and friendly staff", "review": "We stayed at the hotel for 3 nights in May 2015. The hotel was located in the heart of the city close to many shops and restaurants. The staff was very helpful and friendly. Breakfast was a typical European breakfast with many items to chose from. This is a definite recommendation for a beautiful location, clean hotel and wonderful experience.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r275192510", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Good location, friendly helpful staff", "review": "We stayed from 11 to 18 May 2015 and were delighted by its location in the middle of an old town, close to the beautiful lake. The rooms had been recently refurbished and the meals were excellent: four courses each evening with a choice of four items The staff were very friendly and helpful and most spoke good English.  Cycling is popular in the area and there are several designated cycle routes.  Our only negative comments are that the hotel was not allowed by the town authorities to switch on the air-conditioning so we needed to keep the windows open which let in some noise from restaurants around the square.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r274337025", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Conveniently located hotel", "review": "Stayed in room 201 as the only two rooms with balcony were not available. The following morning offered balcony room but very satisfied with the room they had chosen for us.  Only a short distance to the ferries and our favourite gelaterio! Staff always welcoming and took time to chat especially Elena on reception who spoke perfect English. On our last night despite the rain there was a very good live band which my husband and I sat under cover outside listening to them until the finished at midnight. Perfect end to our holiday. Nice small clean and central hotel. Would have no hesitation to book here again but on a room only or bed and breakfast basis and for two weeks not one.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r272932196", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Charming Well located hotel", "review": "Situated one Piazza back from the Lake, with views from the upper rooms, This hotel built apparently in the medieval times has had a chequered history, at one time being the city bordello.  As befits buildings of this age, the rooms were not huge, but well appointed comfortable clean and well serviced. The staff were at all times helpful and friendly.  Al fresco dining , so popular in Italy is extended to breakfast also, and the food for breakfast was sumptuous and beautifully laid out.  The lift is a little cramped, with easy access to the lower floors, though lower floors equals no lake view.  So you need to assess what it is that is important to you.  We had no negative comments to make here, and having stayed 5 nights, have no hesitation in recommending this charming hotel…", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r234011875", "sub_review": {"Value": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Clean, Quiet and Friendly", "review": "I spent 5 nites here as part of a group tour of N italy.  It is a pleasant if unremarkable hotel, WELL-LOCATED for local sightseeing on foot and CLOSE TO THE PIERS AND DEPARTURE POINTS  for both lake cruises and public buses. Although rated 4 stars it lacked the more upscale touches I would associate with such a rating so think more like 2.5-3 US stars. There was one SMALL, SLOW ELEVATOR/LIFT to serve 5 floors plus 5 sub-floors. FREE WIFI IS AVAILABLE THROUGHOUT. As an unsuccessful substitute for a double/queen bed, two firm NARROW SINGLE BEDS, though separately made up with bottom sheets and all-in-one duvets, were pushed together. The smallish flat screen TV did offer one or 2 channels with non-news programs/films in English along with BBC and CNBC.  BREAKFAST included hot…", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r232902788", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "First visit to Lake Garda", "review": "We loved our holiday in Riva and especially the smaller more intimate atmosphere of this hotel. Our room numbers were 201 and 202 which was the larger with balcony overlooking beautiful Piazza 111 Novembre. Don't tell anyone but some evenings we carried out the bedroom chairs onto the balcony and enjoyed aperitif and digestif whilst listening to the fantastic musicians and singers!  We even heard a male choir perform at one of the bars by the ferry dock. Remember to check the advertising boards and get the receptionist to translate if required. The museum  staged a free open air concert evening with choir. All the staff were very pleasant, helpful and never too busy to take time for a little small talk. The dining room has a lovely vaulted ceiling which could be a renovated wine…", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r230864796", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Cosy, good location, good food", "review": "Spent 5 nights here as part of a tour. A very clean hotel. Newly refurbished spacious room. Seizable bathroom and shower. Elevator. Window faced an inner courtyard, not the lake. Quiet. On the main piazza at the edge of the lake. Easy walk to many shops and restaurants. Free wifi, not always there but good enough.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r230410000", "sub_review": {"Value": 4, "Rooms": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Wonderful staff.", "review": "We stayed here just over a week ago and enjoyed our stay very, very much. The hotel is only a few yards from the lakeside and is right in the heart of the Old Town. We were allocated a suite (room 214) when we were only expecting a double room. The bathroom was spotless and included a bidet and a power shower. This room is at the side of the hotel and although there was no view it was extremely quiet. We didn't mind not having a view because we spent most of our time out and about the beautiful town of Riva enjoying all the cafes and bars and the nightlife, or in the bar of the hotel.  We found the food very good with a good choice on the menu. My husband is a fussy eater and I was worried that he might not like the food but he had no problems and enjoyed every meal. A salad bar…", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r230259250", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good hotel let down by the kitchen.", "review": "Newly renovated 55room hotel situated at the periphery of the largest piazza in Riva, and adjacent to many restaurants, cafes, bars and shops The ferry terminal is about 300yds away and this whole area is pedestrianized, but be carefull of the numerous bikes! We booked a suite(room111) which had a surface area in excess of 800sq feet - the size of some two bedroomed flats! As a result the furnishings looked a bit sparse but there was of course plenty of storage space, and the bed was very comfortable. The bathroom had a fancy shower but no bath. The reception on the English speaking channels of theTV was virtually non existent - surely this could be corrected. We had no real critiscism of the breakfasts - I quite like tinned fruit! Dinner was a different matter. Those of us with…", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r230051231", "sub_review": {"Sleep Quality": 4, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "If only the evening meals were better...", "review": "The positives first: the hotel is in a great location (it's only a 30 second walk from the main entrance to the lake, a couple of minutes to the ferry and the square, Riva's shops and so forth are on the doorstep); it has been tastefully refurbished recently and the new spa is excellent; our room was at the back of the hotel (we had requested a quiet room and that's what we got). It was very spacious and comfortable; the hotel is kept very clean; the staff are wonderful - especially the hard working and ever cheerful Ivano, the restaurant manager, and Danila the smiley waitress; Stefano the extremely helpful linguistics student on reception and also the young lady on reception whose name we didn't catch.  So why the low rating? Well as others have said the food was not 4*…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r225307333", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Hotel Portici,", "review": "Cannot agree with the recent disparaging reviews. We have just returned from a thoroughly enjoyable time. Delightful hotel with lots of Italian charm and character. Ideal location right by the square and corner of the lake. Rooms recently refurbished to a high standard. Beds were comfortable and linen changed every day. 4 choices of evening meals which were plentiful, well cooked and presented. The waiter, Ivano was very professional and courteous and the head waitress, Danila was extremely efficient and attentive. When she smiled, the room lit up!. Plenty of food at breakfast. Lots of cakes but not too much hot food. Would have liked another hot plate with beans and mushrooms.  Sky TV would be a good investment as we couldn't get an English  news channel to watch. The lounge…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r225081727", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Top tip only stay bed and breakfast", "review": "We stayed half-board for a week, the breakfast was fine but the evening meals were terrible- powdered egg omelette every night was one of the 4 choices. The staff are friendly and the rooms modern and clean.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r223369984", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Right where the action is!", "review": "We loved our stay at the Portici Hotel for several reasons.  Our group was picked up in a little golf cart by a friendly driver and taken to the hotel, because the hotel is located in a pedestrian zone - perfect.  Our arrival took a couple of trips because there were six of us and lots of luggage.  The staff at the front desk were extremely helpful and friendly - on every shift.  They looked up things for us on the internet, guided us to the music conservatory to buy tickets for a performance, and helped us in so many ways - always pleasant!   The rooms were spacious, beds great, sights from the window wonderful, quiet and clean.  the location is perfect - short walk to shopping, lakeside, castles, hiking, museums, restaurants, laundromat, and ATMs.  The hotel has an agreement…", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r221621768", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good position but....", "review": "Just returned from week long stay. Booked half board and that was a huge mistake. From hotel and travel company's description and photographs we were expecting to eat outside in the lovely square. However, the dining room for residents was a cold internal room (no windows) and we were given our table which we had to sit at for the whole week! I spent every evening looking at a white wall and fire extinguisher! Very poor quality food which we had to chose the day before and it was served plated like in an old peoples' home! The meat was over cooked and very dry, the vegetables were frozen and watery and the potatoes were a mush! We didn't really want to eat meat and veg in Italy but other second course choices were equally poor. We asked if we could eat outside but were told this…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r221604791", "sub_review": {"Location": 4, "Rooms": 2, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "one week stay - So Very Disappointed with the hotel", "review": "wow what a big disappointment - first evening we arrived after dinner had been served were told to take luggage to room and return for meal, which we did. Staff seemed very put out and we ordered from menu, then we waited and waited and kept being told we had to wait for everyone to be there, about one hour later dinner was served, the vegetables of courgettes were a watery mess and ice cream was sorbet. Veal was over cooked defiantly not what you expect from a four star hotel.Before you put your cutlery down the plate was removed even if other people hadn't finished. We thought we would try a second night as we were half board well the peas were over cooked from a tin? definitely not fresh and the desert of creme caramel was served in a plastic dish like infants get!! the ice…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r220739293", "sub_review": {"Location": 4, "Sleep Quality": 2, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Great place to stay!", "review": "Location is right on the main square. The staff was friendly and helpful. The restaurant menu food was yummy. The free large breakfast was fantastic! Had almost everything, scrambled eggs, bacon & sausage, cold cuts, pastries, cereal, fruit and desserts. Very impressive. Definitely a 3 or 4 star rating in American terms. Free bike rentals.", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r220461492", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Really Nice Hotel", "review": "Room was Very spacious, clean, comfortable, two seater convert into sofa bed, fridge and safe deposit box. but no coffee/tea facility. Our room was over looking the square, in fort of the Municipio,  quite near to the Lake, luckily we arrived that's day, Music festival celebrated at Riva de Garda, just in front of the hotel. The hotel has own Restaurant and other Restaurants nearby, very good restaurant is Leon D' Oro, just 2mins walk from the hotel,price is reasonable eg just 1/2lir wine for 7euro, beer is 4.50euro, seafood with spaghetti is 16 euro, really delicious, but bread and cover for 1.5euro. Hotel staff are very nice, helpful. Express boat and other boats run between Riva to Desenzano, about 3-4 mins walk. we really enjoyed that trip.", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r218209066", "sub_review": {"Value": 4, "Rooms": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great stay", "review": "Lovely hotel in a great location.  Parking involved a walk but very secure so peace of mind not worry about leaving the rental in a dodgy public car park.  The room was very nice and we were upgraded on check-in to a room with a balcony overlooking the square.  The staff were very friendly and nothing was too much trouble. If staying in Riva again will definitely return.", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r215309612", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A most enjoyable stay", "review": "This review has been dictated by Mrs Dawn Page who recently stayed at the hotel for a week in May. A delightful place to stay with an ideal central situation in Riva. The room was spacious and very comfortable, spotlessly clean and serviced. The staff were wonderful and very friendly and helpful. I enjoyed the food which unusually was not all buffet a pleasant change from many hotels. I would happily stay at the hotel again when I next visit Lake Garda.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r209850174", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Just returned", "review": "We arrived back in the UK 2 days ago after a week's stay at Portici. We stayed in a suite which was spotlessly clean, lots of space and plenty of wardrobe space! The staff are wonderful and very helpful, nothing was too much trouble. The location is great, central to everything. The only negatives I would say is the bar area has no lounging chairs, it feels like a waiting room; although the hotel is supposed to have satellite tv, we didn't have one English speaking channel which was a bit disappointing. Would definitely stay here again. In a nutshell too many positives outweigh the couple of negatives.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r207313478", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great place to stay...close to lake, restaurants and shopping!", "review": "This was out first trip to Riva and going on a bus trip from Germany, the reservations were made for us.  We were pleasantly surprised with this hotel.  The bus dropped us off in front of the hotel, only allowed off season.  The staff was very friendly, helpful and spoke English well.  The rooms were so clean and our window overlooked the piazza below, where people would gather in the evening.  The lake was close and we strolled along it every night before having a cocktail and dinner sitting by the lake.  There are lots of stores around the piazza and great shopping near the hotel.  The continental breakfast at the hotel was not the greatest, neither were the dinners, eatable, but not worth writing about.", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r206649875", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "One of the best places to stay in Riva del Garda as long as it is not tourist season", "review": "Great location just a few steps away from the lake. Helpful staff, secure and convenient parking for Eur7 extra and decent hotel bicycles at no extra cost. It might be noisy weekends and in high season, but midweek, off-season, it can't be beat.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r205114511", "sub_review": {"Value": 4, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Delightful Hotel Portici", "review": "We really enjoyed our stay in this very welcoming hotel. It is situated in a lovely little piazza a stone's throw from the beautiful waterfront. It was relaxing to sit outside with a glass of vino and watch the world go by.The room and bathroom were spotless and A/C was very welcome. It has been completely refurbished and has added a Wellness Spa which will surely get it a 4 star rating. The standard of food was excellent and catered for various tastes. Staff were really helpful, pleasant and obliging. A delightful  hotel with a personal touch on service.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r181492052", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Good value 3 star hotel", "review": "We travel a lot and this was our first visit to Lake Garda. The hotel is in a great location in the corner of a Piazza, just back form the water's edge. There are numerous restaurants all within an easy walk. The hotel is refurbished and the rooms, although a bit small (we only had one chair at the desk - no space for another one) are very clean. The 'double bed' was 2 singles pushed together. The bathrooms are well equipped with plenty of space for toiletries. I liked the fact that we had a walk in shower, rather than one over the bath (although the bathroom was small - so no space for a bath in any event). I would have liked a mirror over the desk, where there was a plug point for hair straighteners - but no mirror! The breakfasts were the usual fare. The sweet stuff…", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r180771219", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Wonderful Holiday", "review": "Just returned from a 7 day holiday in the Portici Hotel. Room was fantastic, overlooking the Square, lovely to sit and watch out from our bedroom window. Large room, very comfortable beds and seriously good shower!  AC in room was very muchg appreciated. Couldn't ask for more, 4 star standard. We were half board, breakfast was either continental or hot scrambled eggs and bacon, plenty of variables with fresh fruits and choice of types of bread rolls and sweet bread. Dinner was varied with a choice of four courses each evening.Staff were friendly and very willing especially Ivono, maître de of the restaurant and Giulia on reception who could not have been more helpful. A wonderful experience, we will be back!", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r179508198", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A 3star hotel with 4star quality", "review": "I was in this in this hotel 3years ago when it was just about 3star quality. Now that it has been refurbished and air conditioning fitted its as good as any 4star hotel. The food was good, with a good selection of local wines at a reasonable price. The staff are very friendly and helpful. My twin room was huge, with plenty of wardrobe space and kept spotless throughout the holiday. Being close to the lake ferry and the shops its very handy for lake travel and for the ladies to do their shopping.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r179302156", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely room, little spa to relax, good breakfast", "review": "Our room was upgraded, but judging by the quality of the hotel as a whole, we're sure any room will be great here. Comfortable beds, good showers, very very clean. The little spa was a welcome extra that we didn't know the hotel had when booking.  The breakfast was very very generous and had a wide selection. The kind and courtious staff made it all the more lovely to stay here.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r178385027", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Had fab lunch here", "review": "Didn't stay at the hotel, went to Riva for the day and just stopped here for lunch. Had a quick look at the menu before we sat down and it seemed to tick all the boxes and it did! Great pasta and our friends had a lovely salad. A good find. Toilets were spotless.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r177909441", "sub_review": {"Value": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Very good stay", "review": "Stayed 5 nights at this hotel. Part of a conference held at the congress. Excellent room facing the main plaza and lake. Beautiful location -- a bit loud at nights with all the activity in the plaza but closing the windows and drapes blocked out most of the noise. Excellent, friendly, responsive staff.   Tip: I got my hotel through the conference operator (Rivatour) -- however it might be worth giving the hotel a call directly first to find out rates -- their rates were cheaper than any of the online options (tripadvisor, kayak, expedia) including Rivatour. Wish I had known a priori -- could have saved some money!  Overall the experience was excellent am planning to visit again soon.", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r175026419", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Excellent hotel", "review": "I stayed in this hotel for a week in July. It is very clean and nicely redecorated to a high standard. I travelled as a solo traveller with the travel department and I would not hesitate to recommend this hotel to other travelers. The hotel is on the main square, nice and central but quiet at night.", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r174982519", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Perfect Location", "review": "Stayed here with the Travel Department. The hotel is excellently located right in the main square and close to the port.   The bedroom was very clean and modern, as was the bathroom. We were very fortunate to have a balcony overlooking the square. Although it could get quite noisy, when the doors were closed it was no problem.  The food at the hotel was very good. There was a good selection for breakfast though some fresh fruit, rather than tinned, would have been very welcome. Although selection for the evening meal was limited the food was tasty.  The staff are excellent here, very friendly and helpful. Overall, a great hotel with a perfect location. Would recommend!!", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r171690973", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "The Good, The Bad and the UGLY", "review": "The Good:  Jiuliana at the front desk was the most accommodating and helpful person you could ever imagine.  She treated us like royalty.  Jiuliana answered all our questions. Nothing was too much trouble for her.  the Hotel also upgraded us to a suite, from a regular room.  We truly appreciate it.  The Bad  I made it very clear to the hotel staff that my wife and i had to leave the hotel promptly at 430am to catch a flight out of Milan. Since the parking situation is a logistical nightmare (see below), we asked if there would be someone at the front desk at 4:30 am to watch our luggage while we went for the car and to return our deposit on the parking lot gate card.  Despite continued assurance, when we went down at 4:30 am, sure enough, NO ONE was at the front desk.  We rang…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r171674105", "sub_review": {"Value": 4, "Location": 1, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Two nights stay", "review": "Beautiful old building very close to a square on the port of Riva Di Garda with a typical Italian Garden restaurant with a view on the tower of church and to the square. Rooms are reconstructed suprisingly in a very modern style. We had one double bed and a sofa that could be rearranged into another double bed and the room was very big and spacious. Waiters were very nice and complaisant and the kitchen was also good. Only one problem occured when we found the hotel we didn't know where to park and how to take our baggages to the hotel so I recommend to go directly to the sqaure in front of the hotel even there is ban of traffic and then to park the car to their private garage. Riva Di Garda itself is one of the most beautiful cities in Italy I have ever seen, you can even go…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r171295559", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Welcoming hotel in a gorgeous Lake Garda town", "review": "My wife and I stayed in this hotel as part of a group trip. The hotel is located in a very old building in beautiful Riva Del Garda and has been extensively refurbished. In very high temperatures, the room air-conditioning worked very effectively. The room was a fine size, consisting of twin beds, one chair, plenty of wardrobe space, plenty of plugs and lights and a very spacious bathroom with an excellent shower. Bedclothes were changed frequently during our 5 day stay, usually while we were at breakfast. There was a room safe provided at no additional;cost. A flat screen TV was also provided with mainly local channels, but also three English speaking channels, BBC World, EuroNews and CNBC Europe. It had a wooden floor. There is a small lift to all floors.While the hotel does…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r168617425", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice hotel in a great location", "review": "Stayed here as part of a group trip.  The staff were very friendly and helpful all week. I very much appreciated them opening the bar for me to get a bottle of water after it was meant to be closed! Our room (twin beds) was very clean and spacious and had a big bathroom and good storage.  The bottles of water in the mini-fridge when we arrived were very much appreciated. The outside terrace area was nice and local wine was delightfully cheap at €6 for a half-carafe.  Food was tasty and breakfast had a good variety.  Location in the centre of Riva beside the harbour and boats is perfect.  Few minor problems: the safe in our room was broken and did not get fixed despite us asking about it twice.  Staff were quite rigid on times and seats but that was presumably because we were…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r168085179", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "E & J MOONEY", "review": "Just arrived back from the most wonderful holiday at Riva Del Garda.  We stayed at the Hotel Portici on the 2nd floor and it had a balcony which looked over the square where there was quite a bit of enterainment, it is just a stones throw from the lakeside.  The room was lovely and nothing was too much trouble for staff and the food was very good.  It sounds funny but the food was very Italian, as most people know you can go places and have english food which I do not like to have when abroad. I would stay at the HOTEL PORTICI anytime, thank you.", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r165725169", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great hotel. lovely staff", "review": "My husband and myself spent a wonderful week in Riva de Garda and stayed in Hotel Portici recently and I would have not hesitation in recomending this really lovely little hotel to anyone.  The hotel in itself is very centrally located and only yards from the Lake.  When we arrived the room we were allocated was on the 3rd floor and whilst it was a lovely room it was too far to climb for someone like me  who will  use elevators (claustrophobic).  I asked the girl on reception if there was any chance of being shifted to another room and although the hotel was fully booked she rang me back within 10mins and offered us another room on the 2nd floor which was much more accessible.  Within 10mins she herself arrived at our room and helped us move to the new room.   The staff in the…", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r164305765", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 3, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great Hotel in a great destination", "review": "The hotel was just great! Meticulously clean, friendly and multilingual staff, it was a real pleasure staying there. We just loved the well equipped wellness centre, which was included in the tariff. When we return to Riva, we won't bother enquiring at other hotels - Portici was really everything one could ask for.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r162547658", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Peaceful and relaxing break", "review": "We have just returned from a wonderful holiday at the Hotel Portici! We were part of a party with the Travel Department. The location of the hotel was in a small square, it was like a film location it was so beautiful. Our room was overlooking the square, and we were lucky enough to see a fantastic firework display when we were there. The room was lovely, spotlessly clean and a large ensuite. The double-glazed windows cut out all outside noise (which was minimal). The staff went out of their way to help us and everyone was so pleasant. We were on a half board basis; the breakfast had a good choice (buffet style). the evening meal had to be ordered the previous evening, with salad to start, pasta, main course and dessert. Choice were a bit limited, but we always got enough to…", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r160290881", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Perfect base for an Italian adventure", "review": "Just returned from an excellent holiday in Riva Del Garda- staying at Hotel Portici. The hotel made a very comfortable and clean base for us.  The refurbishment which other reviewers have mentioned is superb- the room was spacious, beds comfortable, with air conditioning and incredibly clean. There was more than enough space for our luggage, and the bathroom was so clean and modern!! The room also comes with a fridge, which is handy for keeping bottles of water / wine nice and cold.  Our room was overlooking the main square, but since the windows were double-glazed and the room had air-con, noise wasn't an issue.   We particularly LOVED the hotel's food, and the service from the waiters was great.  All the staff were so friendly and their English was very good, we had no…", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r141330095", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "portici", "review": "My husband and I are just back from riva del garda 15-22 September - hotel excellent I would have rated it a 3/4 star - rooms fantastic, very clean, waiting staff v friendly and reception staff had a great command of the English language and very helpful and friendly.  Would have no difficulty in reccommending it to a friend.  Very well situated. Good walks and a great climb to Santa Barbara, very pleased at signing the book at the Grotto!!  Ballymena, Co Antrim", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r141073978", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good location, nicely refurbished", "review": "The location of this hotel is perfect being situated in the centre of the town, close to the lake. The rooms have been recently refurbished to a good standard with excellent bathrooms and plenty of storage space. The only downside was, for us, that the beds were too hard. The breakfast fine and there are so many restaurants within easy walking distance that it is not necessary to eat at the hotel.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r138386277", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 2, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "great stay !", "review": "perfect place to be in riva de garda ! friendly personal, perfect location,new rooms, good value for your money! greets to the very helpful receptionist. breakfast better than expected (usually italien breakfast is very simple ) . will Come back ! lovely hotel ", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r138354588", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 5}, {"title": "Fantastic Hotel", "review": "Staff are great, Hotel is very clean the rooms are real nice and the beds are comfy the food is great and the area is right on the Lake shore, I will be going back to this hotel with my wife and family.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r137692421", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Pure paradise", "review": "Great hotel in the best location. Service was a bit slow but this is only to be expected when the food is good and prices are reasonable. The poor waiters were always busy and worked very hard. Well worth a visit. ", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r135044725", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 3}, "travel_purpose": "", "rating": 5}, {"title": "Excellent holiday", "review": "I spent a super week early May.  The hotel has been completely refurbished to a very high standard. Our rooms we excellent, staff were very helpful and pleasant at all times.  The location is perfect right on an esplanade on the water's edge.  I have no hesitation in recommending this lovely hotel.", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r132428280", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Great holiday.", "review": "Myself and two friends had a super week at this hotel in Riva Del Garda. The holiday was with the Travel Department. The hotel has recently been totally refurbished. Our rooms were as requested, next to each other. We were on the top floor with only our two rooms there. The lift was brand new as was the carpeting on the stair. My room was a single, but with a double bed, large TV, fridge and lovely large shower in the en-suite. The rooms were serviced every day and fresh towels supplied. Breakfast was super, dinner was ok chosen the evening before. The staff were all great and very helpful and cheery. The location was terrific just of the square overlooking the lake. Would travel with this company again. The tour guide was first class, the excursions included were great. All in…", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r130105430", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "HOTEL PORTICI", "review": "This hotel has been renovated and was very nice indeed.  The rooms were very clean and tidy and the bathroom we had was spacious and clean.  The food was plentiful and their was a choice each day.  I have food allegies and they understood this and went out of their way to make me food that I could eat, they were very helpful indeed.  The staff were very friendly and helpful, I would certainly stay there again.  West, Belfast", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r130098808", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Great Location", "review": "I actually stayed at this hotel for my honeymoon in October 2010, bit late on giving it a review now.  The Trip was with the TravelDepartment, Everything was excellent about the whole trip and the locations which you went on your daily tours.  the Only issue we had was the hotel, the first room we went into seemed to be from Butlins from the 80's there was bad stains on the carpet and with it being our Honeymoon this was not a great start. but the hotel stay where very helpful along with our tour rep and after viewing 2 other rooms we ended up in one of the Apartments which are part of the hotel.  It was excellent probably more suitable for a Family or 2 Couples, Large living room area with dining room and cooking facilities, the Living Room area had a large double Sofa Bed type…", "date": "January 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r121851267", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "NICE HOTEL PITY ABOUT THE FOOD, EAT ELSEWHERE", "review": "The room we had was clean and tidy and well serviced. but the food was very poor. From day one, the evening meal was of a poor drab quality (see photo). Our opinion fell on deaf ears and we did not get the respone from the tour operater we required (Inghhams). I will never book with Inghams again. The best way to describe the breakfast was ok. The staff were thin the ground and not very attentive. We eat out at other nice establishments for about 30 Euros including drink for two of us. Plenty of other places to eat in Riva Del Garda. Resort and area very good stay.", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r121828777", "sub_review": {"Value": 1, "Location": 4, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 4, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Fabulous Historic Position", "review": "We stayed at this Hotel for three nights as part of a Seven cities of Italy tour. What a fabulous position just off the Square which looks down the picturesque Lake Garda. Close to pretty shops,traditional cafes,and restaurants. The food was fairly good and the staff were pleasant. The rooms were airy,beds comfy with crisp cotton sheets and a small bathroom with shower. Towels changed daily. Carpets a bit stained but did not put us off at all. We thought it good value for the price paid.  A large co-op  just up the road selling reasonably priced goods ,lots of fresh fruit .  Pretty walks,beautiful churches. We were dissappointed that we had so little time to look around due to our busy agenda and are planning to return sometime in the future.", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r119674173", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely location", "review": "Situated in a square close to the lake and nice bars and restaurants plus well located for some really good shops.  Good quality rooms with lovely views over the square, very clean, food pretty good, service left a little bit to be desired.", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r119398166", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Ideal location - B&B best option", "review": "We stayed at this hotel first week of Sept on a half board bais with The Travel Department. Hotel location ideal, very close to ferry boat and bus.  Restaurants and bars nearby.  The rooms are simply furnished but clean and towels changed every day, beds made etc.  Our room had little in way of storage, my husband lived out of his suitcase for the week although not all rooms were the same.  We had breakfast and evening meal inlcuded in our package.  The breakfast was fair enough, cereal, fruit, yoghurt, boiled egg, ham and cheese to choose from, sometimes brown bread, sometimes only 'cardbord when toasted white bread' and some mornings croissants which ran out and were never topped up even if you down for breakfast by 8.30 at the latest!  There was only one toasting machine for…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r118152875", "sub_review": {"Value": 3, "Location": 5, "Rooms": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great location, basic hotel", "review": "I have to agree with Canaryson about the hotel. I had a problem with one of the mattrasses in the room but it was soon replaced by helpful staff.   We found the restaurant was chaotic, on the evening we arrived we were asked for our choices. The waiter had to ask a few tables 3 or 4 times what they wanted before he delivered our food. One evening one of the choices was pork, when the waiter said that pork was off we asked him what the replacement was. After 5 minutes of confusion, the pork was reinstated on the menu. The menu also often had local fish on it, which the waiters could not describe, and we didn't know what it was. The waiter attempted to serve me the pork on a cracked plate. On our last evening there, the restaurant was supposed to open at 7pm, we waited till it…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r116557803", "sub_review": {"Value": 3, "Sleep Quality": 3, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Clean, comfortable and friendly with the occasional 'Fawlty Towers' moment!'", "review": "This is the third time we have stayed at the Portici and, as usual, the staff were very friendly and helpful, the (refurbished) rooms were clean, well appointed and well looked after and the hotel contained an interesting mix of guests - not just package holiday-makers. As the Riva International music  festival was on a large number of the guests were members of the World Youth Orchestra and their music maestros - it was wonderful to be able to listen to concerts in the various piazzas through the town on various evenings. Food at the Portici was fairly standard (3 courses plus salad bar) but there were a few issues with service on one evening when the head waiter was not there and the waiter and waitress who were did not seem able to agree on anything - this led to long waits…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r116068263", "sub_review": {"Value": 4, "Sleep Quality": 5, "Cleanliness": 5, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "charming quirky hotel (except for restaurant service) food good though!", "review": "booked this as a last minute package through inghams. Requested a high floor with front view-- and got it. For what we paid, we got an amazing deal. The room was large, clean and comfortable,with a great view out over the piazza 3 Novembre, and the housekeeping was good. Relative to the price, the food was good (breakfast was a cold buffet but perfectly adequate).  As one would expect from a hotel of this type situated in the \"old town\" the main evening meals were Italian orientated, and always served hot (three courses plus a salad buffet), and they were always good. Thats the good bits, the only thing that lets it down is the very slow service in the restaurant in the evening, although to be fair, it depended a little on which \"crew\" were on duty on that evening. To sum up a…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r115609655", "sub_review": {"Value": 4, "Sleep Quality": 4, "Cleanliness": 5, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "It was good but simple adjustments could make it very good.", "review": "The food was good but the addition of fresh fruit and juice would have made it great.More staff are needed when the hotel is full to avoid delays in service.House wine served in carafes looks better than the assortment of jugs that are used.The restaurant staff are efficient and pleasant but there are not enough of them.We loved the Italian feel of this hotel and would stay there again", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r113231214", "sub_review": {"Value": 4, "Sleep Quality": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "great location", "review": "good hotel,good food,good location right by the lake side and on top of shops", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r82757008", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A gem", "review": "We stayed here for three days at the end of sept. whilst on a seven cities tour of Italy booked with Newmarket travel, who were excellent. Just a quick detour, this seven cities tour is good value but not for the faint hearted. Well over two thousand miles covered in the week! I went as my wife wanted the holiday as her birthday gift, but I really enjoyed it! Back to the Portici, It is a nice little hotel near the lake and in the town of Riva. Our room was some sort of apartment and very large, with a fridge, tv and safe. It is only a three star hotel but it was generally very clean throughout, the food was good and the staff friendly, we would stay there again! In fact we are thinking of going back to the area sometime in the future, I would be happy to book this hotel through…", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r82209479", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Wouldn't Stay Here Again", "review": "The Lake Garda area is beautiful and I would definitely go back but I would not stay at the Portici Hotel there.  The room was small and plain, not even a picture on the wall.  There were TWO SINGLE beds MADE UP AS TWO single beds.  Not at all conducive to a couple wanting to sleep together.  The bathroom was very small with no counter space to put things.  No bathtub, just a very small shower enclosure which in my estimation would not accommodate a very big person.  The shower doors closed right on your face with no room to bend over or turn around.. and I am not big.  Nice powerful hot shower but the drain was inadequate and flooded the entire bathroom and the area into the bedroom after only  2 or 3 minutes.  The food (we were on half board) was not great.  For a country…", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r82168665", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 3, "Rooms": 1, "Cleanliness": 3, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Lovely hotel in a lovely location.", "review": "My wife and I stayed at the Portici for one night in early August while attending the international music festival.  We booked through on online agency and got a great room including breakfast. The hotel is slap bang in the middle of Riva del Garda, directly opposite the small port and the bell tower. The location is idyllic and totally charming. Breakfast was good and exactly as expected in Italy with a choice from a buffet and served coffee and tea etc.  We did not have an evening meal at the hotel as we chose to eat out. The restaurant looked charming and we noticed how busy it was with locals in the evening.  This is usually a good sign! Our room was a good size and we were lucky in that we had a balcony. The hotel only has two such rooms. The room was clean and modern in…", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r78087328", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Don't Get Lost in this Maze!", "review": "Hotel Portici was very nice. I stayed there a couple of weeks ago for just one weekend. The hotel is located in a small little town. Lake Garda is right across from the hotel and there are pizza shops, gelato bars, shopping all in walking distance. Everything is right there for you. And the little town area seemed nice, and safe, too.  I checked into the hotel later in the evening. The lobby area is very small. They gave me a key with (literally) a 5 pound weight attached to it -- I guess its so you don't steal it or lose it. The elevator was so tiny and very slow, thus, I had to carry my heavy suitcase up a lot of steps. Not fun. My friends and I searched for the room for probably about 15 minutes. The rooms are in no particular order and the hotel is like a maze. It was very…", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r75814060", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 2, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Excellent Hotel and Resort", "review": "But don't travel with Newmarket Travel, we experienced problems on most day trips, no Aircon and too tight an itinery on the coach.  We had to pay an extra £20 (2x £10) at the Airport (E Mids) for non reg at baggage check-out, although we had done so with Nmt on-line, which we have since recovered, although the person at the end of the phone was offhand and accepted repayment without checking for a ref (does that tell you something ? ) several other passengers had the same problem, second Hotel again, another alternative, for the last 4 nights out of 7 was at Cinciano Terme the san Remo nice people but still in the 70s (a feeling of decadence about it. Both places are very nice, and the places we visited will always be in our memory Rome, Sienna, Assisi, Venice Florence and…", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r70818504", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great Location, Basic Hotel", "review": "Booked this holiday through 'The Travel Department'  who were great, especially our guide Laura, she was very knowledgeable and helpful and gave us lots of information as we went on our tours of the Lake, Verona and Venice. The hotel is in a fantastic location, very quiet at night, but very basic. Breakfast is good especially the croissants, but the evening meal (which you must order the night before and eat at a certain time) is not that great.  You get a choice of salad which is basic, pasta which is the same every night but with a different sauce, meat (one small slice)and potatoes followed by a nice dessert (but never ice cream). If you accidently spill sauce or wine on the tablecloth it is not changed for two days. Water and wine are charged at 2 euro. Rooms are very small…", "date": "May 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r66363464", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "", "rating": 3}, {"title": "Very basic & very clean,", "review": "Very basic hotel with no seperate lounge area for residents, to the point that on the night of the  \"gala\" evening, it was stopped at 10;00pm because they needed to set up the tables for breakfast, Breakfast was basic continental style,while dinner had to be ordered the previous evening, only one serving time, with few staff, (who were very friendly & helpful) which lead to slow service,so if your partner had ordered something different from you either your's or their meal would be cold by the time the other meal arrived, This said the hotel is in an ideal location and is spotlessly clean", "date": "May 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r65953787", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 5, "Service": 3}, "travel_purpose": "", "rating": 3}, {"title": "Bring back Antonio", "review": "Great location and nice hotel. Service down on last year and food would be best described as poor (sloopy mashed potatoes and meat first night and no veg.) Morning coffee is instant variety! Head waiter and staff much better last year. Overall not to bad as plenty of reasonably  food options in town including 3 supermarkets..", "date": "May 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r65562782", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great week and excellent value for money", "review": "Stayued at Hotel Portici in trip with Travel department. The Hoetel eas excellent and staff very helpful and friendly. Good breakfast which set you up for the day and the  evening meal was varied and very acceptable. The three tours which were included were very good value and our tour guid Antionette was very informative and helpful. Riva is an excellent resort with plenty going on lively nightlife, good bars and entertainment each nigh at various venues. All in all an excellent weeks hiloiday and good value", "date": "August 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r39675520", "sub_review": {"Value": 5, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Hotel PoorFood Great place", "review": "Hotel Portici is located in a fantastic place in Riva - close to the ferry port, bars and restaurants and being in a pedestrian square no traffic noise.  Lots of entertainment reasonably priced and even free concerts in the museum.  We had an apartment rather than a hotel room which was basic, but very spacious and had a full size fridge which proved very useful.    Breakfast was good with alot of choice.  We stayed half board as that was the only option available on the last minute deal - food was very poor.  Very little choice on menu, restricted times to eat ( you choose your food 24 hours before and it is obviously cooked for 7pm whether you are there or not, as was often cold and dried out), powdered soup (I know this because I could see lumps of powder in it), one evening…", "date": "July 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r34718251", "sub_review": {"Value": 1, "Location": 5, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "room for improvement", "review": "just back from riva ,stayed in portici hotel, guide who left us to hotel very helpful,  on arriving rooms very plain but clean. breakfast filling more than enough to set you up for the day. evening meals now thats another story,  overcooked salmon no taste ,  loads of salad, but after two nights gets boring, no vegetables all week , but on last nite dinner good, pity they didnt serve this type of meal during week. had to go out one of nites to a resturant along promenade, meal top notch, now the food at front of hotel was lovely to look at it ,but we were in back of resturant eating school dinners, Maria pia, our guide was wonderful we left italy with so much knowledge of  their country, big big hoorey for maria.", "date": "June 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r33859943", "sub_review": {"Value": 2, "Location": 5, "Rooms": 3, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Could be better", "review": "I spent a week in Riva Del Garda.on Lake Garda, organised by the Travel Department. There were three coach tours in the price, around the lake, Verona, and Venice. All in all the holiday was good value for money. The trips were well organised. The location of the hotel was excellent. The hotel cleanliness was also v. goood.  The one major criticism of this package was the food.  There was very limited choice i.e choice fo two starters/main meal.  The food order had to be placed the day before.  The was also no flexibility with meals times, food was served at 19:30 sharp and the group had to be seated at this time.  The was also compulsory allocation of seating at the tables, each couple was placed with another couple (unknown to them) and they eat together every night. Not the…", "date": "April 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r29159364", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Holiday on Lake Garda", "review": "I spent a week in Riva Del Garda.on Lake Garda, organised by the Travel Department. There were three coach tours in the price, around the lake, Verona, and Venice. Our tour guide was a man called Martin, who did everything he could for all our travelling companions. He was very pleasant, cooperative, knowledgeable, and helpful in every way, altogether a real nice guy. We stayed at the Hotel Portici,a very good place to stay. The staff were extremely pleasant and courteous, the hotel itself was very clean and comfortable. My only criticism of it would be that the food, whilst being fairly good the menu was somewhat limited and for a few extra pounds on the holiday price it would have come up to the same standard as everything else in the hotel. An example would be, one night we…", "date": "September 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r21346115", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "'Perfect Location'", "review": "Just Back From 'Riva Lake Garda, and have to say it was a great holiday.  I booked my holiday through The Belfast Telegraph, (Travel Department) and it was very well organised, everything ran perfectly.   A special word of 'Thanks' for giving us a wonderful guide called 'Maria Pia' she could'nt do enough for us.   I found the hotel basic but very clean.  We had fresh towels everyday and bedding changed once a week. Rooms comfortable and cosy. The food was quite good, especially if you are not into italian food, i found that i never left feeling hungry, there was always something you could eat.( for me it was the salad, it was delicious, loads of it) Most of the staff was very good and helpful,  The hotel is a perfect location for restaurants, shops,etc, and the lake is right in…", "date": "September 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r20610735", "sub_review": {"Value": 4, "Location": 5, "Check in / front desk": 3, "Rooms": 3, "Cleanliness": 5, "Service": 3, "Business service (e.g., internet access)": 3}, "travel_purpose": "", "rating": 3}, {"title": "room for improvement", "review": "Just back from a super week staying in Riva. We booked our holiday thru\" The Travel Department\" and I must congratulate them on the way they handled everything ,from the smooth arrival to our departure. An extra special mention to our guide for the week \"ANNALISA.\" She was incredibly informative, polite and put herself out to please eveyone, a million thanks to her for the energy and effort she put in. Now as far as The  Portici goes, its location sells it. The reception staff are very accomodating and helpful. The waiting staff however are less so, abrupt on occasions, even going as far as clicking their fingers to get you to hand over your dishes when finished instead of going round the table to collect them. Meals can become repetative, but do improve slightly as the week…", "date": "July 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r20101699", "sub_review": {"Value": 3, "Location": 5, "Check in / front desk": 5, "Rooms": 3, "Cleanliness": 3, "Service": 2}, "travel_purpose": "", "rating": 3}, {"title": "Loved the Hotel Portici", "review": "Lake garda - Hotel portici - Riva  Riva is a beautiful place surrounded by mountains and the hotel was a stone's throw from the lake.  We stayed here half board for 1 week as part of an organised tour The room was quite spacious, had all the  necessities and was kept very clean.  The dining room staff in particular were very friendly and we had great craic once they got to know us. I am not a lover of Italian food but I never came away hungry.  I would have no hesitation reccommending this hotel .", "date": "July 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r19850620", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "perfecto portici", "review": "2 weeks for the price of 1 meant to wonderful weeks spent here. Traveling on my own all staff without exception were kindness itself. rooms and common areas spotless bright and cheerful. Asked for fan(pevious contributors recommendation) and also slept with windows open (room 110) enjoying cacophony of street sounds(all quite by midnight) others didnt even bother with a fan.Food on half board option fine and tasty ,but bigger portions are given when HB booked independently. To be honest if you are a couple on a package use the HB option as a backup and go and sample all the wonderful romantic restaurants in Riva. Riva is a fabulous place as is Lake Garda can't wait to go back.", "date": "August 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r19410289", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "spotless but basic", "review": "Booked a holiday with the travel department to Lake Garda and Lake Como. Hotel Portici was our first stop in Riva. The hotel could not have been positioned in a better place... its on the main square surrounded by restaurants and cafes. The hotel looked spotless from the start and did not disappoint as the stay progressed. The dinner was NOT what one would expect in italy therefore we didnt eat in again!! however other people in our group said it did improve. The room was small however it had a great view. It was cleaned to a very high standard every day, however although it sounds picky... the towels were [--]... just drying and no more.  Overall i would say the hotel was basic but ideally located and spotless, so can't really complain!!", "date": "July 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r18575912", "sub_review": {"Value": 4, "Location": 5, "Check in / front desk": 4, "Rooms": 3, "Cleanliness": 5, "Service": 3}, "travel_purpose": "", "rating": 4}, {"title": "Ideally situated", "review": "Hi..Just come back from staying at his hotel and like other reviews I found it to be basic . The rooms were cleaned and bedlinen changed daily.There is no  air conditioning but if you ask at reception they will give you a fan. The breakfast was good..ie tea, toast, cereal, yogurts, juice etc and the dinner was at 7.30pm. It was ok..you always get pasta for starters, then dinner...service could be a bit slow and you could have as much salad as you want with it....then dessert. This hotel is ideally situated close to Lake Garda and shops.", "date": "July 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r18184034", "sub_review": {"Location": 5, "Check in / front desk": 4, "Rooms": 3, "Cleanliness": 4, "Service": 4, "Business service (e.g., internet access)": 4}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Mixed Fortunes", "review": "The hotel is in a perfect location, just yards from the lake and two minutes from the quayside where boats to a number of various towns and villages can be booked.  The hotel itself is very basic but spotlessly clean with pleasant staff.  The food left much to be desired unless you happened to be Italian!  My major complaint, which none of the other reviews have mentioned, is that there isno air conditioning which made sleeping almost impossible.           John and Alma Brough Ballymen", "date": "July 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r17759341", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "room, yes. meals, no.", "review": "I attended a week long conference at Riva del Garda and stayed at Hotel Portici 24/5 - 30/5/08.  The room (4th floor) was spotless, spacious and comfortable. But. Do not stay on a half board basis. When staying half board you are forced to order from a limited, inferior menu. No salads, not a fresh ingredient in sight. Just congealed, stodgy stuff, slimy gnocchi, dodgy salmon. When ordering prosciutto you will get boiled spam ham so be sure to ask for \"parma ham\" or \"crudo\". Breakfast was a similar nasty affair: tinned fruit in syrup! Egg boiled beyond its critical mass. At least the coffee was good. And the wine! So, if you like your meals bland/generic - Portici is the place to eat.  If you enjoy authentic and fresh, then book your stay on a room only basis.", "date": "May 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r17642011", "sub_review": {"Value": 3, "Location": 5, "Check in / front desk": 2, "Rooms": 4, "Cleanliness": 5, "Service": 2}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "friendly portici", "review": "This is a small hotel, but suitable as a base when visiting the area. Although it is basic, it is very clean and is right on the waterfront. The bedrooms are thoroughly cleaned daily. All of the staff are very friendly and helpful. There is always a very good and jovial atmosphere around the place. Evening meal time was at a set time for everyone (thankfully breakfast was not and we could have a lie in), as a result service in the restaurant in the evenings could be a bit slow at times, despite everyone having chosen their meals the evening before. We would go back. WGT Newtownards", "date": "June 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r17068730", "sub_review": {"Value": 4, "Location": 5, "Check in / front desk": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 3}, "travel_purpose": "", "rating": 4}, {"title": "great portici", "review": "Stayed in Hotel Portici for full week great time good food  clean ro oms and friendly staff perfectley situated for young and old.a minutes walk to great views of lake garda  will go back again philip +julie newtownabbey May 2008", "date": "May 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r16619183", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Excellent stay in Hotel Portici", "review": "We have just returned from a weeks stay in the Hotel Portici. This hotel is in an excellent location in the old town square of Riva, close to the harbour, shops, bars and restaurants. We stayed in a room on the second floor, which was a fair size and was spotlessly clean. The hotel staff, without exception, were friendly and extremely helpful. As we were in a coach trip we stayed half board. The food was fine, but quite small portions and not a great deal of choice. Overall, this is an excellent hotel in a spectacular location!", "date": "May 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r16427943", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 4}, "travel_purpose": "", "rating": 5}, {"title": "Excellent stay!", "review": "We have just spent a week at the Hotel Portici and really enjoyed our stay. Our room was on the 4th floor overlooking the square and with a view of the snow capped mountains. We were just beside the lift but I know some other rooms could not be reached by the lift so bear that in mind. The room was spotless with very comfortable beds and a wet room rather than a shower room which suited us. We were with a coach party and the food was just satisfactory but we didn't starve. Riva is a beautiful resort with lots of places to walk and I could have spent my week there rather than on our included excursions to Venice and Verona which frankly were both disappointing.", "date": "May 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r16282946", "sub_review": {"Value": 4, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Delightful!", "review": "This hotel is very simple, and spotlessly clean.  Food was great and the location was perfect.  The down side is the small lift does not cater for all the floors where bedrooms are located, but we were fit and even fitter when we left! There is no communal area for guests to locate to except the Bar and Restaurant areas,  but we spent no  time in the hotel during the day and in the evenings we were located in the Bar!", "date": "September 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r10069993", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 3, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "A quirky, highly enjoyable establishment - squeaky clean, great food", "review": "I was very taken with this establishment.  It's perfect for a place like Riva del Garda, where you spend as little time as possible indoors, but when you do, good food and drink are crucial.  The staff were wonderfully friendly and helpful (the dining room supervisor led us in a stirring conga line through the hotel after dinner one night) and the standard of housekeeping is exceptionally high.  We were on half-board, and I thoroughly enjoyed all my meals, even the breakfasts, which are not usually a positive feature in Italian hotels.  It's not the Cipriani, folks, but if you want a good, clean room with excellent plumbing and a firm mattress, helpful and friendly staff, and a top-notch restaurant and bar, all at reasonable prices, this is the place for you.  I enjoyed this…", "date": "September 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r10058168", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 3}, "travel_purpose": "", "rating": 5}, {"title": "Very authentic Italian", "review": "Hotel Portici has a lovely setting within the main Piazza in Riva del Garda.  we had a lovely relaxing holiday, very picturese by the Lake.  As we were with a group the food was not what it could have been.  we did eat seperately one evening nad the food was very good.  Riva is a magical place can't wait to go back.  Liz Jones ", "date": "October 2002", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d551459-r5631462", "sub_review": {"Value": 4, "Location": 5, "Check in / front desk": 4, "Rooms": 5, "Cleanliness": 4, "Service": 3, "Business service (e.g., internet access)": 3}, "travel_purpose": "", "rating": 4}]