[{"title": "Do not have dinner here!", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "November 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r723798919", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Restaurant review ", "review": "We had dinner here, but the food was very disappointing. It didn't look like the pictures in the menu at all! The chicken kebab was dry and without flavour, the curry had almost no meat in the sauce and the döner was way too little (like for a little child). The rice was very dry. We were still hungry when we finished our plate.  The waiter couldn't do anything. We couldn't even get a coffee for free.  Do not go here for dinner! You pay too much for a bad meal.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r708219714", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 1}, {"title": "Don't come here", "review": "The only positive is the absolutely lovely waiter. He couldn't do enough for me. I would give him 5 stars.  The food was barely edible. I ate half of my chicken shish. At least that's what it was supposed to be.  The owner and a friend(?) were at another table and treated the waiter like a servant. Absolutely disgusting display from them. Hope the owner reads this and thinks about how he treats people.  It's a rare day that I leave a negative review, but it's warranted. ", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r704239586", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Worst hotel ever.. DO NOT GO", "review": "Worst food that I have in Istanbul. Please avoid this place.! They will try also to cheat you on the bill. The have a big menu but when you ask for something they say it's not available.... They became very angry when I ask for bill.  ", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r702917170", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Disgusting!", "review": "We had the worst experience ever in this hotel .. I book two room  before my trip and paid all the money upfront.. however, when I reached the hotel 4 am in the morning ( 6 adult and 2 children ).. the receptionist opened the door only to say that he had one room .. the rest of the rooms are all full . The room he showed to us was very (very ) small. When I asked him about my second room,, he said I should wait until 7 AM... I told him that the room doesn't fit us all, we are a big family and the room is very small ...he said there is nothing he can do ... after back and forth , he said he will give us a room in a nearby hotel ...I said ok .... next day .. I asked him to give me my second room inside the hotel... he said .. there is no room available.. I said .. ok let's keep it this way .. one room in this hotel and second room in other hotel.. Surprisingly, when we went out and come back to the hotel . We found out that the second hotel removed our belongings to a third hotel without telling us .. they went to our rooms .. took our belongs .. and send it to a third hotel ...  It was my worst experience ever.. my advise   1#Do not go to this hotel 2# Do not pay money to hotel upfront when you're  booking hotel in Istanbul.  Good luck…", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r630438661", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Great staff and tasty breakfast", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r525274944", "sub_review": {"Value": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "The only value of this Hotel is its location", "review": "This hotel was recommended to me by a local person. The staff was friendly, but Sevim was absolutely wonderful. Ask for her when you come. The breakfast was so tasty, and the tea was delicious. I enjoyed a glass of wine while sitting outside before a game that I wanted to watch. The hotel is so close to the Hagia Sofia, the Blue Mosque, and other landmarks. I will come here again.", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r515778239", "sub_review": {"Value": 4, "Sleep Quality": 3, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Wonderful hotel and food that felt like home", "review": "The only reason to book this Hotel is its location, it is very near to Hagia Sofia. Breakfast was very very poor, everything what we wanted was chargeable (juice, turkish coffee..) actually it was not a breakfast it was just for snacking (also bread and tomato was old). Stair is narrow, it is hard to rise up. WiFi connection is bad at 4 floor. We asked for room cleaning and staff gave us tattered towel.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r381665241", "sub_review": {"Location": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "\" historic hotel\" \"historic city \"", "review": "The owner was very welcoming and friendly, had a fantastic sense of humour. Breakfast was really great,olives , tomatoes,cucumbers ,different choices of cheese and fruit, sweet biscuits and bread. Even though we were not in season, the owner set up the roof top terrace just for us. The localisation of the hotel is walking distance to the blue mosque and you can even walk to the grand bazar. The roof top terrace has an amazing view of the blue mosque and of the marmaris sea,where you can chill and relax. The lentil soup is excellent. The rooms were clean and serviced daily. There was a bar fridge,  towels and a hairdryer in the rooms.  Really good value for the price of the hotel.", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r344628396", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Nice hotel and frıendly Nora!! ", "review": "Thank you so much for being one of the best memories  we had in historic city \"Istanbul\". The good thing I noticed when I firstly entered  the hotel is the warm welcome we had, we felt like we know the hotel's team from centuries. It was so nice to be there. We spent ten days. They were memorial and we didn't even had the feeling of regret to book  in this hotel because for me it was like being in my sweet home. ", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r324804174", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Good price, great location, friendly staff", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "December 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r315968354", "sub_review": {"Sleep Quality": 5, "Rooms": 2, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "hotel", "review": "We spent here a week. The room was clean and spacious.  The only bad thing was that in front of our window there was a wall (pick a higher floor!). But terrace was really beautiful, with a great view of Blue Mosque and Marmara Sea. The location is just perfect: really close to the best attractions, ideal for tourists. The staff was very friendly and helpful and the breakfast was very good.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r296987516", "sub_review": {"Location": 5, "Sleep Quality": 3, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Value for money.", "review": "it  is a very nice hotel with a very nice view and really nice service and free parking and very close to agia sophia about 5 min by foot ... i dont think you can find something better in sultanahmet ask the battler for anything you want he is a very gentle guy and he speaks good english.", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r279831957", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great location, helpful staff!", "review": "Value for money. Very hospitable and welcoming. Located in a nice area, ideal for tourists. Felt safe. No problems at all. Could have booked in very polished places nearby but did not want to.   Recommended.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r276301540", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Don't stay here!", "review": "We stayed there for about two nights, it's in a wonderful location. Within walking distance of the blue mosque and other tourist sites. A restaurant is downstairs, where they serve breakfast ( which is pretty good ). There is a very small bakery close by as well where you can buy reasonably cost water bottles before heading out. The staff was very helpful we needed a car to take us to the airport in 30 mins. It was hard to find someone to do that without giving 3 hours notice but the staff did not stop ( even walked down the street looking for a car service that wasn't already booked to take us. We were able to make it to our flight on time because of that.  They really go out of their way.", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r276255656", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Decent hotel at reasonable price and awesome location.", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r273431338", "sub_review": {"Location": 5, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "STAY AWAY PLEASE!!!", "review": "Location just next to Aarasta Bazaar and 5 min walk from SultanAhmad Street, The Sunrise Hotel surely offers a decent value for money.   Rooms are clean, spacious and well equipped. Staff is friendly and helpful (i must highlight that in general i share this opinion about most of the Turkish ppl i interacted with during my visit). We were travelling with our 2YO and staff in the hotel was quite helpful with our requests and needs.   There are large number of restaurants just next to the hotel (including one within the hotel, which offers decent options of food). Also, there are quite a few grocery store nearby for small/minor things that one may need.   Overall a decent hotel with reasonable price, aptly located close to SultanAhmad street.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r272484466", "sub_review": {}, "travel_purpose": "", "rating": 1}, {"title": "Very central", "review": "Having travelled a lot during my life & comin across some nice & some not so nice hotels, I have to say this was the worst place ever, it was run by some roguish guy who seemed to be there morning, noon & night with no change of staff, & very bad management, never have I experienced such nasty attitude the rooms were tiny & unkept & when I complained the rooms hadn't been cleaned, I was told his housekeepers had been admitted to hospital, so that was that, next day at breakfast time we asked for milk for the tea & I was pointed towards the coffee whitener because he ran out of milk, there was a nasty foul smell coming from the bathroom, his solution was to light an incense candle & keep it in there, the stairs were very narrow & steep, I advise all please stay away for the sake…", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r272391432", "sub_review": {"Value": 3, "Location": 5, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Fairy Tale", "review": "Rooms are small. Not the best. Its ok for just to sleep. Hotel is outdated. Rooms are only cleaned when asked.  If you have a room at the top, beaware there is no lifts in the hotel.  The plus point of the hotel is that its very centrally located. Its 2 mins walk away from blue mosque, 5 mins walk from the nearest tram stop, 10 mins walk from topkapi palace and grand bazar. 5 mins walk away from the main restaurants.  Breakfast is very limited.  If looking for a cheap hotel which is centrally located, and just going to use hotel to sleep, this hotel is perfect.", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r263448401", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Hotel dream", "review": "The Sunrise Hotel is conveniently located in the heart of the historic old city of Istanbul and next to Blue Mosque ( Sultanahmet Camii). The hotel is furnished with the best of contemporary interior design and offers first quality hospitality and service.  The rooms are spacious comfortable and perfect to relax after along day of sightseeing, shopping or business. Each of them is equipped with the modern amenities today’s travelers have come to expect and provides our guests with all requirements", "date": "December 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r244359290", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nice", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r240933298", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great manager and excellent location", "review": "A nice and friendly hotel. The manager and housekeeper are nice and friendly which makes you feel comfortable immediately.  We went on a 8 night holiday trip which was a bit too much, as it rained everyday.  The hotel is located in one of the best parts of Istanbul. Close to the Blue Mosque, Grand Bazaar, Arasta Bazaar, the Palace etc.  If you're looking for a low budget holiday, I recommend The Sunrise hotel.  It's clean, friendly and easy to get by most touristic attractions.  ", "date": "November 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r239442223", "sub_review": {"Value": 4, "Location": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "Worth your money, friendly staff and comfy stay!!\"", "review": "Thanks for your comments. Sunrise hotel will always continue to do best for its guests. Best regards...", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r236972680", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Excellent location", "review": "Great location, walking distance to all main attractions. Nice, clean rooms with good beds. Very helpful and friendly manager, assisted us with all our needs. Good restaurant underneath the hotel which served a  god breakfast. Would definitely recommend this hotel.", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r236972064", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "A real family hotel", "review": "Thanks for your comments. Sunrise hotel will always continue to do best for its guests. Best regards...", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r235146648", "sub_review": {"Value": 4, "Sleep Quality": 3, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "It was perfect and amazing hotel !!!", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r234875018", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Salam Hasan ", "review": "I stayed in this hotel last month for three nights with my friends. Everything was really perfect.  First of all the staff was very kind and helpful espcially Mr.Ilhan who always helped us .They are always ready to help their guest and they always recommed decent places.The hotel is just walking distance from blue mosque,  hagia sophia , basilica sistern etc. That's why the location of the hotel  very convenient for all their guest.  By the way they have a restaurant which is under the hotel and open late hours , you can have lunch,  dinner or some drink all the time and here also Mr.Ilhan helped us all the time . I am very glad to say this things about him because he is very friendy and hospitality.  Sunrise hotel is recommendable for all people and if I come back to Istanbul I…", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r234653976", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great location", "review": "Thanks for your comments. Sunrise hotel will always continue to do best for its guests. Best regards...", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r233708826", "sub_review": {"Value": 4, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Relax and Enjoy", "review": "Romantic hotel, Very good location very near to historical areas, price is good, the room was perfect & good service.wifi available strong signle in the room, the stuff was very nice & helpful, special thanks to mr. Ilhan ", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r233557455", "sub_review": {"Value": 4, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Majid", "review": "Thanks for your comments. Sunrise hotel will always continue to do best for its guests. Best regards...", "date": "March 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r229064631", "sub_review": {"Value": 4, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "well situated", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r228444564", "sub_review": {"Location": 5, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "amazing..home away from home!!", "review": "This hotel is very well located, not so far from sultanhamet. Rooms are clean and comfortable, the breakfast is good and the staff is kind. The only disadvantage is that the stairways are narrow and at a steeper angle.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r223752901", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "It was a amazing vocation ", "review": "The staff is number one!i travelled with my elderly mom..she did not mind the steps..the staff was caring with us, specially Ilhan-Budak..the cleaning\\cookllady..the big bosss..all amazing human beings..always with acsmile..the room was perfect..and the location awsome..will go back...wifi available in the outside cafe, which was perfect for turkish tea, raki or a nice col beer. Food was very good. All attractions (blue mosque,ayasophia,cistern, main bazaar) all walking distance.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r222493983", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Cheats and Liars", "review": "Thanks for your comments. Sunrise hotel will always continue to do best for its guests. Best regards...", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r215400720", "sub_review": {"Location": 3, "Rooms": 1, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Very good hotel with incredible Bosphorus view", "review": "I stayed in the sunrise hotel for a week,  specifically I loved the restaurant and trace,  rooms are wonderful so, I will be in Istanbul next year again,  I honestly should not that I will stay at the same hotel again ", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r212506238", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Terrible, unsafe hotel run by shady, rogueish management", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r211455658", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Good hotel for such a price", "review": "Wanted to share my experience at Sunrise Hotel in detail so that you never make the mistake of booking this hotel, however attractive the price and location may seem. I was booked at this hotel for 3 nights in May 2014 (had a confirmed online booking, and my credit card was duly swiped 3 days prior to arrival). Upon arriving at the hotel (the reception looked cramped beyond belief), the manager told us that our booking was cancelled since they couldnt manage to swipe the card properly. Despite showing the card confirmation that my account was debited, he refused to budge and even refused to hand over the \"payment declined\" slip. I mentioned that my emails the previous week asking for room confirmation were not answered to which I was told \"we receive so many emails everyday, how…", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r204876497", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Spectacular", "review": "We have to declare that the situation did not take place like our guest tells. First, as a hotel management we have right to take money before arrival of our guest . Moreover. this guest had non refundable reservations and we did not take any money from our guest because his credit card did not have sufficient limit to pay room price.SO that, we cancelled his reservation and sent an e-mail to him about cancellation. PLEASE DON'T MIND THIS FALSE COMMENT which is written by an instant anger.", "date": "January 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r201583860", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "The best location and hospitality.", "review": "I've stayed in the Sunrise Hotel with my family for nine days. Although the hotel was full upon arrival, despite having booked two rooms and having to stay at another hotel in the neighborhood, the hotel employees made up for it during the rest of the week. The rooms were a good size and the bathroom had all comforts needed. The room was properly cleaned every day and the breakfast was basic but just what we needed. The location is perfect for exploring Istanbul with several highlights and the tram-station in close proximity. Also the neighborhood has several excellent restaurants for both lunch and dinner. The roof terrace view is spectacular and great for relaxing after a busy sightseeing day. Employees are polite and helpful for whatever question you have. The call for prayer…", "date": "March 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r201433082", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "The right place to stay", "review": "Thanks for your comments. Sunrise hotel will always continue to do best for its guests. Best regards...", "date": "March 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r199886328", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Lovely Hotel, Great Location!", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "February 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r195617765", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Perfect", "review": "We stayed at Sunrise Hotel near Sultanahmet in Istanbul for 10 days in February. The hotel was really great for our stay. Centrally located, you will have no problem walking to nearby attractions such as the Blue Mosque, Hagia Sofia, and many more. The tramway is also very close. The rooms are spacious and clean with a modern bathroom. The staff is very friendly, helpful, and always on-hand day or night.   The property is rather small, and there is no lift/elevator. Our room was on the 3rd floor, so it may be hard for someone who has trouble with stairs. There's a lovely rooftop deck with a great view and a quaint restaurant on the bottom level. I will make sure we always stay at this hotel during future trips to Istanbul.  This property is really great for the price. We were…", "date": "December 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r187281901", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Great first experience", "review": "Thanks for your good comments. It was good experience for us, hosting you in our hotel. See you.. Best regards....", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r179338031", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Ideal location", "review": "I stayed in this hotel with the best comfort and great feeling of being on a fantastic holiday. Clean room that was made up everyday with a lovely view of the sea. Ercan the owner of the hotel was extremely helpful and hospitable. The sunrise team are a true credit to the holiday hotel experience. Not only did we feel very safe being in an unfamiliar environment but all the historical sites Blue mosque, Hagia Sofia, Topkapi palace, Grand bazaar, spice market are all walking distance and never needed to get a taxi. We walked in and out of hotel at late hours but felt very safe with complete peace of mind. This hotel also has a lovely terrace with the most unique and breath taking view of the Blue mosque and Stunning views of the sea. The cutest coziest little restaurant that one…", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r177368628", "sub_review": {"Value": 4, "Location": 5, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Great place in a lovely neighborhood.", "review": "Thanks for your good comments. It was good experience for us, hosting you in our hotel. See you.. Best regards....", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d567678-r169914166", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 4}]