[{"title": "Quiet get away", "review": "Loved staying here, it was so clean, personal and friendly. Staff very helpful and made sure stay was relaxing.  Would definitely recommend. Rooms cleaned every day and towels changed. Delightful breakfast full of cooked, cold, continental foods.", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r724997497", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "BQ Amfora Beach Hotel  Lovely", "review": "Rooms are not very large but enough space. Very clean and modern .  Great shower. Staff are friendly really enjoyed are stay so much. Going back in June for 10 days. Like the area. Plenty of path ways for long walks or cycle routes if you  wish.We went in October it was warm enough and the area was quiet which i really liked. If you want nightclubs on your door then not the place for you.", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r723719696", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Fabulous *****", "review": "Excellent stay here with my husband. The location is perfect and just a short walk to the beach. The entire hotel is immaculate and cleaners are meticulous about attention to detail.  We had a beautiful suite with two huge TV’s (although we didn’t switch on so not sure what channels are available), a huge walk in shower, mini fridge and safe. Breakfast was amazing. Everything you could think of was available and omelettes (with plenty of choice for filling), pancakes etc. all made fresh to order. All varieties of breads, pastries and fresh fruits available. Hot choices such as bacon, sausage, tomatoes etc. A choice of cold meats and cheeses. My favourite was the fresh smoothies and there were even bottles of white and rose fizz on ice available. The quality, service and ambience were top class. Would visit again and would recommend.…", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r723283387", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very Good hotel", "review": "We had a very Good time in this hotel, also got a bottle of champagne for my birthday which was really nice.  Good cleaning service and also very tasty breakfasts, loads of things to choose from.  We would definitely stay again.", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r722360463", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "5 day break", "review": "Excellent hotel. Spotless. Breakfast was super. Rooms a tad small but no problem also bathroom DEFINITELY could do with a shelf in it. Great position (for the beaches AND Palma itself) although aircraft noise could be an issue sometimes", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r721803561", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Our first time in Mallorca and the hotel was excellent!", "review": "I have no real complaints about the hotel, yes the rooms are a bit small but we were hardly in the room so it didn't matter. The aircon did have a mind of its own sometimes, but luckily the weather wasn't too hot, I'm not sure the fridge worked, but again we only kept water in the room. The room was kept clean, and the TV channels were good. We ate in the hotel bar a few times and the food was excellent, in fact we had our best meal on the island in the hotel! The pool was very cold, but nice as it wasn't over crowded so had a good swim a few times. All the staff were very friendly and the breakfast buffet was fantastic, the freshly cooked eggs and pancakes were amazing and I probably ate way too much while I was there. If we were to go back to Mallorca we would definitely…", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r720906984", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "We have stayed for a week at the BQ Amfora Beach Hotel in Can Pastilla Mallorca in October 2019.", "review": " Arrived early on a Sunday and had not expected to check in. However, it took a long time and I asked several times when the room would be ready. They promised to call when the room was ready. At 3pm I went to the reception when we heard nothing. Then the room was ready. The room was disappointing as it was extremely small to be a double room in a 4 star hotel. Missing hooks to hang clothes. Clothing storage was enough for just one person. The safe cost 21 Euro for one week.  The balcony was also small and needed to store their suitcases that barely fit in the room.  In the bathroom there was no storage for toiletries etc.  Enough of the negative and the positive was that there was very good cleaning in the rooms. Clean and nice in the hotel. The breakfast very good. Staff very…", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r720078448", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Great hotel!", "review": "I booked this through ba.com and took a gamble based on the tripadvisor reviews. Proximity to the airport in a taxi (15 euros) was 10 minutes - super quick.The hotel was great. The single room although small had a large balcony and lovely bathroom with powerful shower. All mod cons in the room with nice touches like GB channels on the tv stations and good air-conditioning. The rooms were cleaned every day and kept spotless. The breakfast was fantastic - really well stocked with a huge variety to choose from including a hot plate with fried eggs and omelettes to order. the only niggle in the room was that the fridge didn't keep things that cold but was big enough for me in terms of holding bottles of water, juice etc. Also there were 12 hangers which, again for me, was fine.…", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r718822673", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Delighted with our second visit", "review": "This hotel suits us well. Quiet & comfortable with welcoming and friendly staff. The food for breakfast at the Amfora and for dinner at the Apollo were excellent, with plenty of choice - though the labelling of food could be improved. .It is convenient for the harbour,  the town, the beach and coastal walk to Palma. The bus to Palma  and the airport is close, The only minor issue was that the fridge in the room did not work, I did use the swimming pool, it was very cold! We love this area and hope to return to the Amfora in the Spring.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r717940724", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Great Find", "review": "A lovely clean hotel with  friendly efficient staff . Very close to the airport....which cost 15 euros by taxi (minimum fare) or 5 euros per person by public transport . Only a short walk from the beach and a host of restaurants, bars etc . Large choice of food for breakfast which was excellent. Our room had a very pleasant small balcony, which I think all the rooms have . My only criticism would be that the room was quite small....fine for a short break but for a longer stay I would have wanted slightly more space . However we would definitely return as we really liked the hotel ,town and surrounding area .", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r717883217", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Very close to beach and airport", "review": "Very nice staff og good and clean rooms. The hotel was not a big overcrowded hotel, and that's something we prefered. All in all a very good and pleasent stay at Mallorca. I'm  sure that we will return some day or another ", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r716574743", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Lovely New Hotel", "review": "We stayed here for 3 nights last month, we booked Bed & Breakfast. Good price, excellent value. Clean & modern hotel. Loved our Room, just as the Photographs, lovely en-suite with Walk In Shower With large white fluffy bath sheets & Toiletries. AC worked perfect. Choice @ Breakfast was ample, even Cava & Fresh Orange. Chef cooking eggs, omelettes, pancakes etc to order. Central for Restaurants, Bar & Beach. We will definitely stay here next time. Thank you, Andrea & Olaf X", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r715983733", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nice and clean hotel with good location", "review": "Good location, close to beach and airport. Easy connections to public transport. Clean room and good breakfast.  Pool area rather small but sufficient for a morning swim or a few hours relaxation.  Few minutes walk to the beach boulevard and the beach. Taxi to airport 5 minutes. Good variance of food nearby from street kitchens to seafood or steak restaurants.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r715921385", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Good Hotel", "review": "Position: Very good. 10 minutes to beach, 5 minutes to bus stop to Palma, shops and restaurants in the neighborhood.  Parking: there is no parking slot at hotel, parking in streets around is possible Room: very small rooms – it is hard to find place where to place and open the luggage, clean, balcony. (Equip: safe, hair drier, TV, Aircon, freeWiFi-good)  Beach: sandy beach 10 min. walk, very long, soft sand Breakfast: good, rich choice, coffee-average, juice-dispenser  Staff: friendly and warm (good English)  Baggage room: it is possible to keep the luggage there and have a shower even after check out. Rent a car recommendation: We were very satisfied with company “Wiber”, 10 mins from the airport by their shuttle bus to/from the airport, good prices and perfect service Overall:…", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r715726980", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Frengler", "review": "Super hotel service right in top room very small  Best hotel so 1000 Stars for you Very central good restaurants in area Staff at The hotel 200 % top and know kids Great pool and restaurant  Breakfast Best in The area", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r713830259", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Clean yet small", "review": "Room was really tiny, hardly room to set out our suitcase. However it was extremely clean on arrival and cleaned to the same standard daily. The entire hotel was really clean. Pool area needs music to create some atmosphere.  Breakfast was average; smoothies tasted like water, omelettes and sausages not cooked enough.  Bar snacks were nice. Short walk from the shops, restaurants and beach. Only took 5mins in taxi from the airport, charged €15.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r712053339", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "3 Stars max!", "review": "Hotel and room was clean, cleaning ladies did a great Job. Booked a double room for single use, I could not see how two people could stay in this room. The room was just big enough for one. The Safe can only be used for a fee of 3.50€ a day. Never have I stayed at the Hotel that I had to pay for using a safe, this is supposed to be a 4* Hotel. The Place is really catering to the massive tourist loaf of Mallorca. Breakfast is Buffet style, Lots of Fruits out of the Can, Vegetables in the omelette where cold and raw. Great selection of bread and Pastries.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r711238601", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Great for a short stay", "review": "Very clean, although a bit souless, this hotel is up a side street, which means it has no sea views, or any views at all really, but more importantly, it is absolutely impossible to park a car any where near it. Our room was absolutely tiny - literally the sideways shuffle to get down the side of the bed. Having said that, the staff were friendly, and as many have said, the breakfast was very good indeed.  We only stayed one night, having arrived at Palma Airport late in the evening, and it is very close indeed to the airport - great for the plane spotters. NOTE - Do not accept Booking.Com's kind offer of €25 for an advance taxi to this hotel - picking one up at the airport cost €14!!", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r709377809", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "relaxing holiday", "review": "Lovely modern clean hotel with everything you need.Good food,great drink prices and really attentive staff.A lovely pool and terraced area outside with parasols with some evening  entertainment .Would definitely recommend.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r707159091", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great place to stay", "review": "Staff was super friendly and hotel was really nice.  It's about a block from a beach cove and a block and a half maybe from the open beach.  Lots of restaurants depending on ur budget to eat at.  They had great breakfast options. If your doing public transportation there are several bus stops at the end of the block, 1.50€ to ride.  Definitely recommend.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r706820861", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely stay as usual ", "review": "Third time stayed here and great as usual . Great proximity to beach & bars . Breakfast is excellent ,coffee could do with some improvement. Rooms are a tad on the small side but adequate for a long weekend . Will return no doubt .", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r698647890", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Comfortable and relaxing ", "review": "Stayed 5 nights.  Emailed to advise our approximate arrival time and we were given a room a few hours before normal check in- brilliant!  Room not a bad size - larger than some others in Can Pastilla.  Plenty of room for our packing cubes.  Bed really comfortable and bathroom n9t a bad size either once you get used to size of shower.  Lovely thick white towels.  Hairdryer was good for a hotel one.  Close to where we love in Can Pastilla for restaurants, beach and drinks at the Aquamarina Hotel after the beach and after dinner.  Breakfast was always good.  Great coffee and we sat at the side each morning and there were windows looking over green scrubs.  The breakfast area is well laid out, modern and bright.  We loved this hotel and will go back.  ", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r697530963", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Absolutely brilliant", "review": "Could not fault this hotel. It is extremely clean , literally a 5 minute drive from the airport and a five minute walk from the beach. Pool was lovely and clean and managed to get a sun lounger every day without any problems. The snack bar does nice food and cocktails for a really reasonable price and the breakfast was delicious with loads of choice every morning. Rooms were quite small but cleaned every day, air conditioning was great and the balcony was lovely with sun most of the day. Would not hesitate to visit again or recommend to others ! ", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r697145335", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "The best hotel 💕", "review": "The best holiday what I had in this summer!!! The staff was sooo friendly, the room was amazing. We will come back next summer definitely! If you ho to Mallorca, this is the best choice! The breakfast was sooo nice! Thank you so much for everything", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r696465281", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Quiet and close to everything", "review": "Quiet location but close to beaches and restaurants. Clean rooms and efficient staff. Good breakfast selection.   Lovely bike ride to Palma. Close to water activity hire.  Perfect for long weekends as close enough  to the airport for 10 minutes taxi transfer.", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r693121620", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Beautiful hotel, amazing and friendly staff!", "review": "Clean and beautiful rooms, good food, amazing breakfast! Perfect place with pool for holiday. Pool is very clean! Staff is amazing! Positive vibes, 10/10, very friendly and  helpfull.  We are coming again for sure :)", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r692025196", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "A great hotel, would definitely return if in the area", "review": "Currently staying at BQ Amfora Beach and it has been brilliant.  Can Pastilla is quite a quiet resort but that's what we wanted. A nice, relaxing holiday. The hotel is situated on a quiet street a few minutes walk from Cala Estancia beach and a little further to long stretch of Platja Palma. There are lots of bars and restaurants around the area. If you want to visit Palma city the 15 and 30 buses serve close by and are frequent and cheap (1.50euro each way).  The hotel itself is clean and modern. Our room is on the 4th floor and we cannot hear any external noise. Other reviews mention small sized rooms. I cannot speak for other rooms but ours is perfectly adequate even with twin beds instead of a double (that was our only gripe but we accept many hotels do not always provide…", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r690977913", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Overnight stay", "review": "We stayed here after a delayed flight into Palma. The night manager was really helpful and the guy couldn’t do enough for us after such a long day. Room was perfect and spotlessly clean. Good breakfast and there is a selection for every taste. The front desk staff were super helpful when we needed help with a problem. Only downside is car parking. I had to park 4 blocks away. ", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r689878293", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Perfect In Every Way", "review": "We stayed here for 4 nights and couldn’t fault it at all. 5 mins to a little coved beach or a bigger one just past the Marina on the front. The hotel had parasols and beach mats outside the entrance for guests to use, which we did daily, this was a nice touch. Breakfast was plentiful and something for everyone. We arrived late so the buses had stopped otherwise we’d of used this from the airport but literally 8 mins in a cab for 15 euros. All the staff are friendly and very helpful. The rooms are very clean as is the whole hotel. We are outside in the seated area next to the pool one night and this was excellent and reasonably priced. We will definitely stay here again.", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r689055200", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good Stay for Your Buck", "review": "Hotel was 6 minutes away from the beach, which was a lovely walk. Located in minutes from a SPAR which was handy for bottles of water. Room was clean, a little small but decent for what you paid. Breakfast was a lovely, help yourself to a variety of food and drinks! Pool was okay, played some good music. Overall pleased with the stay :)", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r688869139", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Very clean hotel", "review": "I had booked for 4 nights at this hotel with bed and breakfast board. The hotel was very clean , very helpful staff and polite  The room was clean everyday and the beds very comfort. All the rooms had a balcony and mine had a view to the pool. The breakfast was amazing....a lot of choices. The beach is only 5 min walk. There is a bus stop close to the hotel as you are coming from Palma airport and also to go back to the airport. The ticket for the bus to go to the airport costs 5 euro and same price from the airport . It takes only 10 min drive from the airport to Can Pastilla. We definitely recommend this hotel...and it is very quiet.", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r688802375", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Super nice hotel close to the beach", "review": "I went there simply for one night before catching my flight as it was conveniently at 5 mins from the airport, so I didn’t have very high expectations but it was a great surprise !  The staff is very friendly, the rooms are modern and clean, we even had a violin concert by the pool in the evening, really nice. Special mention to the breakfast, extremely complete, with pretty much anything you can imagine. I decided to take a walk to the beach in the evening and it’s literally at 5 minutes so you are almost on it without the evening noise to sleep. Highly recommended !", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r685646435", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Perfect holiday from start to finish", "review": "Just got back from this immaculate hotel. Literally couldn't fault it. Modern throughout, decent WiFi and fridge in room. Short stroll to the gorgeous coved beach with crystal clear water. This is a quiet resort but still has a great stretch of bars and restaurants. Definitely not a roudy holiday,so if you're after some life this probably isn't the resort for you. There's a burger king and KFC close by. Hiring bikes is a must. We hired from Rollerking,a lovely German gentleman with very reasonable prices. €6 for two bikes for two hours. Plenty of time to get to Palma to see the beautiful cathedral. Use the little bike track all the way. the hotel booked us a taxi to the airport and it came within minutes for €12. Fantastic place with great people. No noise whatsoever in the…", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r683263248", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Worth every penny ", "review": "This hotel was just perfect for us, playa de Palma just about 3min walk. Bus stop 1 block away, service and breakfast were amazing. In case you’re only for the weekend the bus is only 1 stop from the airport. ", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r683034273", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nice place if you have an early departure from Palma Airport", "review": "Nice place if you have an early departure from Palma Airport. The hotel is new and modern. The breakfast has everything. The pool is a little small. It is adults only - so no children. Parking is hard to find.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r681461762", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "We felt the difference between 3 star hotels in this area", "review": "Last time we visited Mallorca we were staying in Arenal in a 3 star hotel. At that time we thought it's quite OK. Out thoughts changed as we walked into Amfora Beach end of this May. The room is quite small, but suited us 2 people completely. Walls aren't very thin, sound isolation is good. We almost didn't hear airplanes when the balcony door was closed. Plenty of space to hang clothes and store little things in drawers. Cleanliness is outstanding. The hotel and rooms didn't have any strong smell of chlorine that we had experienced in other hotels in Mallorca. Everything I chose to eat for breakfast was very tasty, starting from live cooked pancakes to fruit smoothies. The swimming pool was quite chilly for me, we were told that it's 18 degrees C, but the look of itself pulled…", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r681279964", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Wannebe 4 star", "review": "How this can be a 4 star hotel is a mystery.  Rooms are extremly small, and very limited with places to store your cloths. In the bathroom it's nowhere to put your personal items or hang up even the hotel towels. Toilet sqeezed in the corner and not possible to sit straight.  Aircon stopped working. Wifi is poor.  The staff dont really care for spesial needs like allergy, poor or no knowledge at all.  Cheap poor quality breakfast in basement with no view. (Why not use outdoor area?) Poor cofee machines making thin awfull cofee and they dont know how to make prooer cofee at the espressomachine either. The best things to say abot this place is that its clean and the bed suited my preferance. Location is ok, close to the beach.   Pooltowels 20 euro...deposit.. have som faith to…", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r678466191", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "This was not our first visit to a BQ Hotel and it will not be our last.", "review": "My first impression was positive. Staff on reception were polite and friendly despite it being around midnight when we arrived.   The room itself was small and basic but it did the job. It was pleasingly clean. The air conditioner is not set to cool in April so I asked for a fan and was pleased to find that they had one which they provided.  This is a nice touch.   Personally, I disliked that the toilet had no lock on it. This could be off putting to some people. The wall for the bathroom is an obscured glass but you can see the faint outline of those inside it if they are near to it.    We had breakfast there. They have a good selection of breads, cereals, fruits and meats. They do however, fresh fried eggs upon request. They had bacon and sausage but not every day and…", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r676298194", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Holiday in Mallorca", "review": "Really nice hotel in quiet street with balcony. Very good location, few minutes (about 15) from/to airport. Breakfast was every day very good with smoothie, fruit, eggs, salami, ham,...  Can Pastilla is great for walking, running, cycling and it is not too far for trip by car (Palma, Formentor, Sollér, Valdemossa,...) We can recomand bike rent @berganibikes and car rent @hipercar. It was great holiday! ", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r675007475", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great hotel", "review": "The atmosphere at the hotel was quiet and relaxing, though sadly we overlooked an apartment that could be noisy at night. The breakfast and dinner were excellent, with lots of choice. My only criticism was of poor labelling of food - eg there were 4 bowls of yogurt available at breakfast, but no label to say what type they were.This could be a problem with people who had dietary issues, or lead to wastage.  Rooms were modern and adequate. The location was good, near the harbour, a beach and a conservation area walk towards Palma. Bus stops were nearby. We were unaware on booking that dinner was not served at our hotel, but at a sister hotel about 7 mins walk away. We were ok with this, though not when it rained! The food was worth the walk though!", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r674153735", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great place", "review": "Great location - close to the beach with heaps of restaurants!  Breakfast was delicious with a great selection of yoghurts, fresh fruits, pastries, warm foods (eggs, bacon, sausages, pancakes ect), breads, coffees and so on. Only complain about the breakfast was the staff making omelettes and pancakes. One person was in charge of this station and she was SO slow. Only taking one order at a time, it would easily take 20 min to get an omelette - there was two heating plates and enough room for two people to take charge of this.  Rooms were clean and with enough room for two people - bed was very comfortable with great pillows.  Pool-area was great as well and staff was paying good attention to people ordering drinks and food.  Staff in the reception need to get a lesson on…", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r672452158", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice adults only hotel close to the beach", "review": "Good location, only 300m from the nearest beach. Friendly staff. Rooms are small, but very clean and modern. Air conditioner in every room ( and it even worked :) Breakfast was good. Restaurants and grocery stores nearby and bus stop only 150m away. Storage for rental bikes. Street is one way, so very quiet neighbourhood. Only the departing airplanes may disturb.", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r672444792", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "A very nice hotel.", "review": "This hotel is well placed for the coastal path which is yards away in one direction and the local bus which is also close in the other direction. It is also close to two small supermarkets, shops and restaurants. We walked to Palma (5 miles) the first day and took the bus back. The bus is cheap at 1.5euro or 1euro per journey with the 10 ticket card which can be bought locally.  The hotel is clean and the staff are friendly. The lady who was cleaning the room is very efficient.  The breakfast is excellent. The freshly made tortilla is very good and there is a large variety of hot and cold food. The breakfast staff were friendly and attentive.  The large double bed in the room was very comfortable. However, the rooms are small. There is a narrow gap between the bottom of the bed…", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r671914456", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Perfect hotel", "review": "We've just returned from a 4 night stay and couldn't fault it. It is spotlessly clean and the staff are very friendly and efficient. The rooms are quite small but perfectly adequate with very comfortable beds, the bathroom was spacious. Breakfast was delicious, an excellent choice of hot and cold food, smoothies and even cava! A special mention to Pepi behind the bar and also the gentleman who also served drinks and was in the restaurant at breakfast time, both very friendly, the drinks were very reasonably priced too. Would definitely recommend this hotel.", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r671337544", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely staff, rooms miles to small", "review": "Couldn’t fault the staff, had the best daiquiri ever here! Breakfast was good, although slow to replenish supplies. The staff and cleanness of this hotel cannot be faulted, however I would not stay here again due to the fact the rooms are to small with absolutely no storage apart from an open wardrobe with approx 12 hangers and pot holes for other bits and bobs. Pool area for sun beds in low season would be fine, forget going high season, you would be packed in like sardines. ", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r669850860", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Lovely hotel with fabulous breakfast and friendly staff", "review": "We stayed for 4 nights before Easter and enjoyed being here. As other's have experienced, the taxi driver drove to the wrong BQ hotel as there are two close together in Can Pastilla. Check in was smooth, rooms are small but ok for a couple, very modern and clean, buffet breakfast was fantastic with a wide range or food and drink. Beach is a few minutes away and the promenade on Playa Palma (from S'Arenal to Palma) is a lovely walk or cycle in either direction, as this hotel was perfectly placed in the middle of the two. Recommended!", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r669345423", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Loser!", "review": "We arrived at this hotel after midnight due to a delayed flight. When we arrived there were 8 people on line to check in, and only one employee. I felt sorry for this elderly employee because he was so overworked. Evidently  they did not think about putting on an additional employee due to the holiday (Easter) week. It took us an hour to check in. When we got to the front, finally, my requested room was given away. I got a room on the first floor, rather than on a high floor. The gentlemen working the desk said he coudn't change my room because the computer was not working. Wow! The room is ridiculously tiny. There is room only to pass between the bed and the bureau if you stand sideways! There is absolutely no storage space, so if you make the mistake of going here, pack…", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r668160643", "sub_review": {}, "travel_purpose": "", "rating": 2}, {"title": "Very good but tiny room", "review": "Dear customer,  Thank you very much for your opinion. At BQ Hoteles we like to read each of them, as they make us feel closer to our guests and more able to meet their expectations in a future. We are very sad to hear that this time you did not have a good experience staying at the BQ Amfora Beach Hotel.  Going into your comments, as you confirmed you arrived at midnight, but unfortunately not all clients tell us their arrival time, and obviously we only have 1 person per shift, specially during the night time. We are sad to hear that you didn´t get the requested room, anyway we never confirmed it, we always depend on the availability and do our best to satisfy all clients.  I also want to inform you that all our rooms have an  standard size, around 15m2, I´m sorry that you felt it was a bit tiny.  We are happy to read that you loved our breakfast, this is one of our key points at BQ Hoteles, excellent food and service is a must.  Despite your negative comments, we really hope that you give us a second chance and will be happy to welcome again at one of our BQ hoteles.  Thanks again for your comments !  Your sincerly!  BQ Hoteles ", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r667798746", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice hotel.", "review": "Pros: Great location for restaurants, bars, beach Quiet location Spotlessly clean  Modern Comfy beds Pleasant professional staff Excellent breakfasts  Plenty of sun beds   Cons: Very tiny hot room Air con not switched on yet Wi-fi terrible  ", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r632363450", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "4 star hotel with 5 star qualities", "review": "The staff was very kind. We checked out in the early morning, because my flight is very early. The staff arranged for us to have breakfast at 4:30, so I could use breakfast so early! Although simple breakfast, it is enough. There is a bar on the first floor and the decor is good. I checked out at five o'clock, and asked the staff to call the taxi to the airport, and the taxi came in three minutes. Take a taxi from the hotel to the airport at 15 Euro. The only downside: this hotel can't connect to Wi-Fi quickly. It's too bad. It's so difficult to connect to Wi-Fi. It can't be accessed for a long time. I finally can use WiFi, but it’s a turtle speed Wi-Fi😢, I can’t upload photos at all, I hope the hotel improve. The hotel and the room are clean and comfortable, the air…", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r631285628", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fabulous hotel ", "review": "Very clean modern room five minutes walk to the beach. Very helpful staff and the food and drinks at the bar were great value. Highly recommended. 30 minutes bus ride into Palma where you can get trains or buses all over the island. Bus stops only a few minutes walk. Small supermarket near to hotel and loads of bars and restaurants along the beach. Great location.", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r630715914", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great hotel, well located with easy access to both the beach and town", "review": "Stayed for a long weekend in October 2018, is well situated as it is an adults only hotel which is both a Close ( 5 minutes) walk to the beach with an assortment of local bars/ restaurants or a 20 minute bus ride into Palma town. The staff where great and nothing was was an issue to resolve. We have already booked to go back next year, we look forward to seeing you all again then.", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r630233204", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Brilliant", "review": "Perfect location 100m from the beach ... lovely staff and beautiful breakfast. Totally relaxing adult only hotel. Rooms comfortable and clean , no complaints.  Pool area clean. Drinks really good value. Definitely recommend.   ", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r627786457", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Perfect Location, lovely hotel & staff", "review": "We stayed at this hotel for a long weekend in October and it was a great location just a few minutes from the beach and restaurants etc.  The staff were all so friendly, kind and helpful.  Room and hotel areas were spotless.  The rooms are small but perfectly formed.  Good size balcony and powerful shower.  Couple of negatives - no mirror over the dressing table so only option is to use the dryer and apply make-up in the bathroom which gets very warm as there is no air con in there.  The safe is under the hanging space which isn't very big anyway, so long dresses curl up over it.  However, there was enough space for long weekend but anything over a week I would struggle with storage, but then I don't travel light! Prices in the hotel for food and drinks were actually cheaper…", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r627719040", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely hotel and food faultless", "review": "Stayed for 7 days in September 2018 in a room with double bed on the 2nd floor. Room itself was too small for 2 adults due to the layout. We have stayed at this hotel prior to its refurbishment and the refurbishment is fantastic. Modern, airy and staff excellent.  We stayed bed and breakfast and could not fault the food. Plenty of choices for all.  Rooms were spotless and the air conditioning was welcomed.  Not far to walk tot the beach and the bus stops were regular for Palma. We are looking to stay there again for sure but will see if we can book the larger rooms that they have next time.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r625360453", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great!", "review": "Nice, clean and modern hotel with best location! Everything in walking distance, also a buss stop so you can visit palma easily. Breakfast is superb! Only bad thing is pool location- sun hits the pool only in afternoon, but that didnt bother us that much. Lovely and helpfull staf 😊", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r623685030", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Interesting but lacks proper air conditioning", "review": "My wife and I stayed at this hotel and the first room we were given had deficient air conditioning, the temperature remaining around 25 or 26oC. We complained and were given another room on the first floor, where the air conditioning was better but not perfect. The room is quite small. Otherwise, it is close to the beach and several restaurants. But I believe you can find something better for the same price.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r621339981", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "very happy", "review": " Dear customer,  Firstly we thank you for reaching out to us on Tripadvisor to share your concerns related to your recent holiday with us at BQ Amfora Beach and apologize that you felt your experience did not completely meet your expectations. Your feedback is really important to us and we will be making sure your remarks are bought to the attention of the appropriate management so they can share your comments about the areas you highlight in your review.  With warm regards,  BQ Hoteles. ", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r620631329", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely relaxing stay", "review": "Modern hotel and great location.  Very short walk to the sea and at the nice end where the harbour is.  We didn't sit round the pool and this area is quite small, but did sit outside to get a drink which was nice.  Rooms quite small but they were comfortable, modern and the blackout curtain was fantastic.  Small fridge in room and safe, but couldn't use it so think we needed to pay for that.  We had a balcony and could see the sea - the rooms nearer the swimming pool wouldn't be able to see the sea.  There is the main block and a block over the road.  Were in the main block.  I guess it doesn't make much difference but not sure.  Would visit again.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r618900888", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Miss", "review": "My wife and I were looking for somewhere to take a short three night break.  So we ended up here.  A lovely chilled out atmosphere close to the beach and the main area of Playa de Palma if you wanted to go out and eat.  The hotel menu was limited but good value for money and well prepared.  Both food and drink were more than reasonable so if you were spending a lazy day or days by the pool then you were well catered for.  Breakfast is a buffet affair with pancakes, fried eggs and palettes available on request.  The buffet catered to the British and Germany palates as they appear to be the main nationality of the guests.  Now Brits don’t worry.  You won’t come to the pool and find sun beds covered in towels :-)  The sun breaks over the pool around midday and that’s when it gets…", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r616024856", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fabulous 2nd Stay", "review": "This was our second visit to BQ Amfora beach after staying 2 years ago. We returned as our first visit had been perfect, 5 night stay, and this time we stayed for 6 nights. No regrets, absolutely fab hotel. Rooms are small, but beds very comfy, and enough hanging space for clothes for a week. Fridge and safe included in the room, although fridge could be colder. Bathroom and shower all amazing, although no room for wash bags in the bathroom, and not a lot of shelf space in the room. One thing I would like to see is a mirror in the bedroom above the dressing table for us ladies to do our hair and make up! The bathroom had 3 mirrors ! Please put one in the bedroom Amfora Beach. When hubby was in shower and using bathroom I was unable to get ready to go put for dinner and then…", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r615941783", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fabulous Property & Great Staff", "review": "Having picked this property for a quick two night stay I can honestly say the whole experience was Four Star Plus..  On arrival we were greeted by the receptionist called Michelle who made us feel welcome & although early we were allowed to check in to room 207 just after midday.  The room at the back of the property was quiet and although compact was well maintained & had everything you could desire as in AC , UK TV Channels plus a comfortable bed.  Breakfast was an array of foods being hot & cold with a great selection of dishes for all parties plus all the staff we encountered during our stay were happy & content.  In fact we liked it here so much we have booked to return again in October for three nights and its just nice even in September too feel welcomed like a guest and…", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r615306738", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely Stay - As Always", "review": "Lovely comfortable, clean hotel .  Staff very friendly and helpful.  Superb breakfast. As other review say the rooms are not large but have everything in that you need, superb bed and kept immaculately clean - due to the great location and fantastic beaches you will definitely not spend a lot of time in your room!  We've stayed here for the past three years and will be back next summer.  Thank you for a lovely holiday.", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r614079877", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great Stay", "review": "Lovely comfortable and clean room, not the biggest room however but we weren't there to stay in our room! Lovely staff, friendly and attentive - really nice stay. Breakfast was extensive but typical continental, as the clientele was mainly German but even the guests were friendly, so helped have a really pleasant stay, would definitely return.", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r612682876", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great weekend stay", "review": "Loved the hotel, very clean and modern, yes! the rooms are on the small side, but we only wanted a base and what a great one this is. Beds are super comfy too. Hotel is literally 5 mins away and if you turn left at the seafront you have the whole of Playa de Palma beach in front of you, stretching all the way to El Arenal. Staff are friendly and helpful and Christina ? I think was very helpful in helping us change room as we did not want to be on ground floor. We were there to celebrate my birthday so the bottle of bubbly left in the room was a lovely touch and really appreciated. Also loved watch ing planes take off in the distance, and the noise is very minimal. Great stay and would recommend.", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r611648874", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good hotel but doesn't feel 4 stars.", "review": "PROS: - Location: close to the airport and the public beach.  - Breakfast: very nice breakfast full of sweets and savoury food, coffe (even espresso is included) and a chef that cooks for you what you prefer - omelettes, pancakes etc. -Staff: friendly and welcoming, everyone we met was able to speak several languages and was eager to help.  CONS:  - Room size: way too small !!! I was not expecting such a small room. It is hard to move inside and is very narrow - Room Cleaning: room cleaning has not been consistent. Some days we had toiletries refilled some days not. Also never through out my stay I had the flooring cleaned and by the end of the holiday it was uncomfortable to walk barefoot as it was filthy   Overall I would go back as the general experience was ok but I wouldn't…", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r608982475", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Very good, small and not that expensive", "review": "We got a room for 3 and that had just enough room for 2. Beds were ok.  Service was generally good. AC works.  Liked the breakfast very much and the restaurant has an upstanding price value. You get quality food cheaper than in any other restaurant in the area. So I recommend to use the restaurant.  Pool area is a bit too small and there aren't enough sun beds. One isn't allowed to reserve one but the hotel guests dd so and staff allowed that. We didn't get sun beds. So we had to go to the beach and sand was literally everywhere..", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r608803321", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Couldn’t be happier", "review": "Currently on a ten night holiday at this hotel with my partner. I couldn’t be happier with the place. Everything is spotless from the rooms to the communal areas. The staff couldn’t be nicer and are always very welcoming especially the cleaners who always share a smile and always seem to be very happy despite the fact they are working.  Breakfast is your average holiday breakfast with hot and cold food and fresh fruit and cakes and pancakes.  The menu at the bar for during the day sells the nicest of pizza at such reasonable price! Soft drinks are €1.80 which is a lot better than other places I have visited. There is a little supermarket two minutes from the hotel too if you wish to buy cans etc.  The pool itself gets sunshine around the back of twelve and it is there till late.…", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r608312413", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Do not go here...", "review": "174 euro for a prison cell, looking out at a wall... tv not working... blanket do not have cover..... Ants in the bed.... I am very grateful that it is only for one night..!!!  If you are handicapped do not go here... we are put in the room af the handicapped, more like a prison cell then a hotel room... ", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r607491347", "sub_review": {}, "travel_purpose": "", "rating": 1}, {"title": "Nice break", "review": "Dear Betina,  First of all I want to thank you for your personal opinion, we apologize that you didn´t feel comfortable in your room, it´s very strange as we constantly have these rooms occupied and never received such an opinion, anyway we will take a look and of course consider your words. Unfortunately you don´t mention if you reported this issue to our staff, which always have a perfect solution to everything, in this case we could have given you another handicaped room.  Once more we regret that you had to experience this situation and hope to be able to welcome you again at BQ Hoteles and give you the stay you deserve.  Have a nice day!!  BQ Hoteles", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r603427419", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Beautiful hotel!", "review": "I visited the beautiful BQ Amfora Beach in July with my partner for our anniversary. We arrived very late at night, and the hotel staff made check in very easy. We arrived at our room on the 4th floor to find a bottle of fizz in our room with a personal message, which was a lovely touch. A slight issue with our air con was quickly rectified and we were given recommendations on where to go for food given the late hour.  The hotel is situated on a quiet residential street around a 5 minute walk from the beachfront. There is a small shop at one end which sells liquor and snacks, and plenty of restaurants and bars on all sides. A taxi from the airport took around 10 minutes due to the traffic system and cost €15. There is also a bus stop nearby if you arrive during the day.  The…", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r603212042", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Loved every minute", "review": "Went for a 4 night break for my birthday end April/begin May and it couldn’t have been nicer. Hotel so modern and bright, lovely room, very modern shower room, everything spotlessly clean. Great breakfast buffet and lovely modern spacious dining room. Staff extremely friendly and helpful and work very hard. Can Pastilla itself is a lovely resort, clean and not rowdy. Excellent promenade, can walk for miles, one way to Palma, the other to Arenal. Very handy for the airport, less than 10 minutes, planes don’t bother that much. Easy to catch the bus into Palma for the day, not far at all. Oh and bottle of Cava waiting for us when we got there and on my actual birthday we got another, thanks very much!! If there’s one thing to say, it would be that we would have liked a little…", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r601987972", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great location, clean, good breakfast. Great experience", "review": "The room and bathroom were very clean. The room were equipped with safebox (paid separately), fridge (empty and not very cold but fine), hairdryer, toothbrush, toothpaste. Our room were a bit small. The breakfast was great, though foods were not labled. Great location (300 meters from a nice beach with plenty of good restaurants). Just two stops from the airport (less than 10 minutes). Friendly and helpful staffs who know english well enough.", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r601006136", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Perfect", "review": "Perfect girls weekend away. Rooms clean, comfortable and stylish. Food was amazing and the food/drink prices are very reasonable. Sun reaches pool/lounges around midday but only a short walk to the beach.  Service from all staff was fantastic. Definitely will visit again. Thank you BQ Amfora!", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r599896667", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Lovely Hotel - Hope to Return!", "review": "We were lucky enough to enjoy a four-night break in Can Pastilla in the second week of July. We stayed on a bed and breakfast basis - and given the quality of the breakfast, I would recommend this.  We arrived at the BQ Amfora after an evening flight. The check-in was painless and the receptionist provided a map and other information about the resort. All of the communal areas were very clean, the staff were always pleasant and it was clear that there were other guests who had stayed previously and returned.  Our room, despite being on the smaller-side, was completely adequate and spotlessly clean. The beds were comfortable - although pushing together two single-beds to make a double is never ideal! We also had a lovely little balcony, over-looking the pool, which was nice.  The…", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r598799834", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very good all in all, would return", "review": "Lovely boutique hotel in great location 5 mins from beach or bus stop to Palma. Arrived too early for room but they had a luggage room to store case and a men’s or women’s toilet and changing room where we could freshen up till the room was ready later which was really handy. Everything is spotlessly clean. Fairly small pool area with not many beds which were all reserved very early so you would have to have moved fast however we prefer the beach. Room was quite small but nice size comfy beds and a balcony which overlooked the pool. Only a couple of comments: there is no mirror in the bedroom at all so is a bit awkward if someone is already using the bathroom, not much storage but ok for the 5 nights we were there. Could have done with a shelf in the bathroom but I managed!…", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r597941286", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely Hotel ", "review": "We thoroughly enjoyed our stay at this hotel. The rooms are perfectly adequate in size, very clean and the beds are comfortable, to hire the safe for a week it cost us €19, there's a hair dryer in the bathroom, the air con worked well we had a decent sized balcony. The only thing lacking for me personally was tea/coffee making facilities in the room but it certainly didn't spoil the enjoyment of my holiday. All the staff work very hard and are extremely pleasant, polite and helpful. We loved the breakfast, the food is superb with plenty of choice and we couldn't fault it. The hotel is in an excellent location just a 5 minute walk to the beautiful beach. Also within walking distance to plenty of bars and restaurants. It was really quiet at night and we didn't hear any noise from…", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r597541061", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very nice break", "review": "I lovely hotel at a reasonable price.  The rooms are very small but the use of space is remarkable.  The whole place is kept to a very high standard of cleanliness. Staff are very helpfull and always cheerfull.  The breakfast was amazing definatley somthing for everybody. The pool area is not very big and only 32 sun loungers is definatley a problem but the hot tub is a nice little touch.  The bar drinks and food were reasonably priced and the menu was good. 10 minutes from the airport and a short walk to the beach perfect for a shirt break.", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r596402130", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice Clean Hotel but small and lacks character", "review": "Stayed here for 8 nights in June on a B & B basis. Got a very good deal through Alpha Rooms so I did not have expectations that the hotel would blow me away. The hotel is small and split into two blocks opposite one another on a side street about 5 minute walk to the beach, so location is pretty good. There are no views to speak of and the surrounding area is residential. Expect a lot of noise from planes taking off from the airport. The pool is extremely small with a small hot tub. The sunbed area is also small and merges into the outside dining area which has a bar inside next to reception. The hotel is very modern and clean and the staff are very friendly and efficient. Cleaners where also very good. The rooms are pretty small with very limited wardrobe space and the walls a…", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r594228446", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Delightful", "review": "Dear Mark,  Firstly we thank you for reaching out to us on Tripadvisor to share your concerns related to your recent holiday with us at BQ Amfora Beach and apologize that you felt your experience did not completely meet your expectations. Your feedback is really important to us and we will be making sure your remarks are bought to the attention of the appropriate management so they can share your comments about the areas you highlight in your review.  With warm regards,  BQ Hoteles. ", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r593700394", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "great place", "review": "nice hotel very friendly and clean. only a stroll to the beach where you will find lots of bar and restaurant. good place to stay and a great breakfast.bar area and terrace good with table services large screen tv.by reception aerea.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r591443059", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Great 8 night stay!", "review": "Dear guest,  Thank you for your nice opinion!  BQ Amfora Beach Hotel team thank you for your time writing this review and for your words about us! This is a strong motivation for us. We will be delighted if you would visit us again.  Thank you very much for choosing our hotel for your Mallorca stay!  Best regards from BQ Hoteles ", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r590624429", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent", "review": "This hotel is modern and we had a nice balcony with garden-view. It was located in a quiet residential area but within walking distance to the centre/the beaches. When we arrived at the hotel the reception staff gave us a room in the first floor. From the terrace we could only look into some tall trees. We asked for a room in the upper floors when we booked, and we telled this to the man in the reception. He asked us to contact the woman in the reception the day after. We explained all this again to her,and luckily she checked the system again and found a room in the third floor for us which we was pleased with.The breakfast was good!", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r590254848", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Amazing 10 night stay! ", "review": "Dear customer,  Thank you very much for your opinion, all the hotel team strive to make our customers feel at home with a high level of quality and service.  We will be happy to give you a warm welcome on your next visit.   Greetings  BQ Hoteles ", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r589830331", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Just a few tweaks would make it ideal but beware unexpected charges", "review": "Lovely hotel, very clean & airy. Nice rooms, maid service and clean towels daily. Epic breakfast, including a made to order pancake / omelette station. Extremely helpful staff, go there again? Oh yes, in a heartbeat.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r589031395", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent stay", "review": "Booked direct with the hotel for a 3 night stay, the hotel had been recommended by a family member. Check-in was quick and staff very friendly, we requested a top floor room and upon arrival room was clean compact and had everything we could need for our stay. Breakfast was excellent, wide variety of anything you could want, including sparkling wine. Exceptionally clean restaurant and tables cleared and cleaned almost immediately that they are vacated. The hotel bar is very reasonable priced with food and drink excellent quality. Just a short walk from the hotel is a variety of shops and bars. Upon check out there is a free shower room available for use and bags can be left securely. Overall a first-class hotel thoroughly recommended", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r587659832", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great service , great hotel", "review": "Dear friend,  Thank you for your nice opinion!  BQ Amfora Beach Hotel team thank you for your time writing this review and for your words about us! This is a strong motivation for us. We will be delighted if you would visit us again.  Thank you very much for choosing our hotel for your Mallorca stay!  Best regards from BQ Hoteles ", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r586902180", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Relaxing mini break ", "review": "Staff couldn’t do enough for you & the food was very good & well priced Rooms were cleaned daily & as other reviews said small but adequate - could have done with a mirror in the bedroom over the dressing table Breakfast was brilliant - chef cooking eggs etc  Very near beach - 3min walk  Pool nice, not massive. Towels provided & lifeguard  Sun hit the sunbeds late morning, early afternoon  Beach costs approx 16€ for 2 beds & a brolly  Cab cost min €15 from airport even though journey short", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r583082326", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Best hotel I have ever stayed in ", "review": "Dear Claire,  Thank you very much for your opinion, all the hotel team strive to make our customers feel at home with a high level of quality and service.  We will be happy to give you a warm welcome on your next visit.   Greetings  BQ Hoteles ", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r582708055", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Clean and friendly", "review": "I shared a room with my sister. Side view with a little balcony. Would repeat what all the others said. Really clean modern hotel. We got a taxi 15 euros from airport. Dropped off at wrong BQ hotel taxi driver assured it was right. So we ended up with a short walk. Annoying when we paid 15 euros for a 5 min drive. Got bus back so straight forward.  Hotel 5 mins from beach where we spent every day. 5 .35 a day per bed. Much prefer beach as I didn’t really like the layout of the pool. It didn’t get sun until around noon and felt too oppressive liked the vibe at the beach better. Great snacks all well priced. Fab breakfast. Plenty to choose from. Small bedrooms but for 5 nights perfect. Wish there had been a bit of entertainment in the evening the whole resort was quiet so we just…", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r582626262", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Small room with thin walls", "review": "We stayed at the hotel for 6 nights and were given a room on the first floor. There was a small bathroom with shower cubicle (just about big enough) and a comfortable double bed with enough room to walk down each side and along the bottom but no more room than that. In addition to this there was a small fridge, and a unit containing 2 or 3 shelves, 2 small drawers and a hanging rail about two feet wide (no doors on any part of the unit apart from the drawers). Had we been staying for 2 weeks I have no idea where we would have put our clothes. The room was advertised as being soundproofed but it was anything but. We could clearly hear the room next door’s TV - and they didn’t have it on loud - as well as hearing whenever they used the shower or flushed the toilet. That, allied to…", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r581495247", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "spring weekend", "review": "Dear Guest,  Thank you for staying with us! We take great care to make our guests' stay as pleasant as possible; however, we note your comments and hope to provide a better experience on your next stay.   Best regards .  BQ Amfora Beach Hotel. ", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r581390936", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great stay, very clean Hotel ", "review": "great location close to airport, city of Palma and the beach, clean room, lovely breakfast we especially enjoyed the pancakes and the fruit, good coffee , nice poolarea (to cold because of season). nice beach, nice staff. close to bus-stop in to Palma city,", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r581173779", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nice & clean", "review": "Dear Cecilia,   Thank you very much for your nice opinion!  We are very happy to hear that you had a good experience staying with us at the BQ Alcudia Sun Village Hotel and that you recognize our efforts for our valued guests!  Looking forward to welcome you again very soon! With warm regards,  BQ Hoteles. ", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r579910966", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "The friendliest staff in Majorca", "review": "We've stayed here for an entire week and we can only recommend this place. It's very clean, the room we had had a small balcony, the staff was very friendly and attentive. Breakfast buffet was very good. Although Can Pastilla is not really top notch, the location was for us still very good, as Palma is not really far away and you can easily access the entire island.  This hotel is simple, but really recommendable.  ", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r578851635", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Good Choice in C'an Pastilla", "review": "Had a five night stay in early April and BQ Amfora was a good choice.Well located in a quiet residential area.Room was small (104)and rooms 001-004 have a terrace that looks  on to the sunlounger area  not the most private of terraces.Very good and varied breakfast choices.Unless you are a really early bedder aircraft noise not a concern at night.  Bus stop for Palma just take a right outside the hotel followed by a left turn at the bottom of the road then approx. 100 yards on opp side of road is bus stop.  Palma is a nice city with a lovely old town, nice shops and of course the Cathedral and nearby Arab Baths are worth a visit.   C'an  Pastilla Crystal Church and attached museum was interesting .Cuban restaurant near front in C'an Pastilla was great value and big portions.", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r578648739", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely hotel.", "review": "Dear customer,  Thank you very much for your nice opinion!  We are very happy to hear that you had a good experience at the BQ Amfora Beach Hotel! We wish to welcome you back very soon and return to enjoy a memorable experience with us, we will strive to please and surprise you on your next visit.  Greetings from Mallorca!  BQ Hoteles. ", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r576594559", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Super hotel to stay on your holiday to Can Pastilla!", "review": "This hotel was a perfect base for us. We were visiting family in Majorca but wanted to maintain a degree of independence. The rooms are small, but very clean and very modern. The breakfast was varied and well presented. The staff were all very friendly and very helpful. The bus service was within easy walking distance, ideal for visiting Palma. The local restaurants were a short walk away. Definitely stay again.", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r576214481", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Perfect stay!", "review": "Dear friends,  Thank you for staying with us and sharing your experience. We are really delighted with your feedback about our staff and our service, and we are very happy to hear that you had a good experience at BQ Amfora Beach hotel.  We hope to be able to welcome you again very soon.  Best regards from BQ Hoteles. ", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r575897427", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good hotel", "review": "Lovely modern hotel. Spotless. Staff warm and friendly and go out of their way to help any way they can. Breakfast bar amazing! Choices galore! Downside the horrid coffee machine in the breakfast room...worst coffee ever!!!! But.... upstairs proper barista coffee available from the bar. Nice meals/snacks. Good prices on food and drinks. We had a room with balcony over looking the street which I enjoyed immensely as I could see different architecture and flora/fauna. What else is there to say....will go there to stay each time we go to Can Pastilla!", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r575696624", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Clean & Modern", "review": "Stayed for 4 nights for my birthday. The whole hotel is clean, fresh and modern and this applies to the rooms too. Although not that large, there's enough room for a few days or maybe a week's stay.  Good selection of English TV channels, mini fridge, powerful shower (with a frosted glass window into the bedroom).  Very comfortable beds and pillows.  Breakfast was decent, plenty to choose from. One improvement I would make would be warm plates near the hot buffet. The food cools down so quickly when using cold plates.  Bar and snacks very good and good prices.  Location good, 2 minutes to the beach, and supermarkets, bars, shops all around.  Would definitely use again.", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r575234877", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great modern hotel ...R215", "review": "Dear Philipp,  Thanks for your contribution. We are very glad that you enjoyed the breakfast at the hotel, therefore we would like to welcome you on your next visit to the Island, until then…   Best regards from all the BQ Amfora Beach team. ", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r574919714", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "lovely short break", "review": "Stayed here in late April for 5 days B&B ...had a great time. It's a very modern hotel, nice clean white walls, very smart interior, bathroom was spotless and the shower was powerful and hot. Nice toiletries supplied. Bed was very comfy. TV channels separated into language, brits are well catered for here bbc1/2 itv1/2 an some foreign channels you can change language setting to dub back into English. I was in main hotel and rooms facing road got the sun at 3pm onwards, i was on the balcony from 3 till 7 enjoying the sun, pool was below room and was cold at this time of year but the sun loungers were very comfy. You could get bar service from the sun loungers which was a nice touch.  Breakfast plentiful and delicious. Show cooking was available, again nice touch.  Will stay here…", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r574339183", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Amazing Stay", "review": "Dear Simon,  Many thanks from all the BQ Hoteles team for writing a review, we appreciate your assessment and we are pleased to know that we got you to enjoy a great experience with us, daily goal of all professionals who make BQ group.  We wish to welcome you back very soon and enjoy again a memorable experience with us, we will strive to please and surprise you on your next visit.  Greetings from Mallorca! ", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r573432583", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Holiday ", "review": "Got the 21 bus from the airport , took 15 mins, drops off at end of the road ( stop at Hotel Linda) 5 euros each. Hotel is clean and bright. All staff are friendly and helpful.Room was small but everything you need including a small fridge ( no tea making facilities in the room ). Well equipped bathroom with brilliant shower. Breakfast was excellent with everything you need to set you up for the day. Food and drink prices in the hotel are very reasonable. Hotel is 200 yards from the sea front and beach.Will be back.", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r573141739", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Blown away! ", "review": "Clean, tidy and well presented rooms. Shower is powerful and hot. Breakfast spread is guaranteed to set you up for the day. Bar is VERY cheap. Staff are lovely. Finally, the staff must’ve noticed on my booking info that it was my birthday and I came back after a long day out walking to a chilled bottle of fizz! Amazing! Thanks.", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r572271709", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Not bad ...", "review": "Dear Tony,  Thank you for staying with us and sharing your experience. We are really delighted with your feedback about our staff and our service, and we are very happy to hear that you had a good experience at BQ Amfora Beach hotel.  We hope to be able to welcome you again very soon.  Best regards from BQ Hoteles. ", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r571884918", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Fabulous Adult Only Hotel", "review": "Stayed 4 nights over the Easter weekend . Arrived early and room wasn't ready so we dropped luggage off in the room provided ... ask at reception for the key .. and we went for a drink down by the harbour .  Returned an hour or so later and room was ready . We were in the main hotel building there is an annexe building over the road . Our room was round the back of the hotel and to be honest the view from the balcony left a  to be desired  . I know this is nothing to do with the hotel but the building we over looked had a garden so over grown it looked like scrub land . Also a lot of the locals keep dogs shut up in apartments / flats all day , once one starts barking it sets the others off . This could get on  your nerves .  Back to the room .... We knew they were on the small…", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r571402075", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "BRILLIANT HOTEL AND EXCELLENT VALUE", "review": "Dear Jill,   It has been most pleasing to read that you had such a great time in our hospitality at BQ Amfora Beach and we want to thank you for sharing it with others. The fact that we were able to provide you with such a wonderful holiday experience is extremely satisfying and we will continue working hard to achieve this every day. We try to think of everything to provide our guests with a perfect holiday. Once more, we thank you for sharing this perfect review of our hotel and we hope that we will be able to serve you again in the future.   Best regards  BQ Hoteles. ", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r571083948", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Brilliant stay ", "review": "My husband & I stayed here for a long weekend over the Easter weekend on a B&B basis and we could not have asked for a lovelier hotel.  From checking in with Michelle on reception, through to checking out in the early hours with a different member of staff, we could not have asked for a more friendly bunch.  The staff make this hotel, they always have a smile and like to have a little chat.  The cocktails are fabulous too and cheaper than outside of the hotel which is extremely unusual!  We also ate here a couple of times for lunch and dinner and again, the food was fabulous and half the price of outside of the hotel!  The hotel is so clean and tidy.  The rooms are smaller than we're used to, but have everything you need, including a mini fridge.  The hotel is also well located,…", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r570840932", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Would definitely recommend!", "review": "We stayed here for five nights over the Easter break. Amazing value. Rooms are comfortable and spotlessly clean with bright and fresh decor. We had breakfast each morning and what superb choice! Eggs, omelettes and pancakes could be freshly cooked to order. Excellent friendly service from all staff. Pool area looked great although the weather wasn’t quite warm enough to try it out. Hotel is located in a side street and therefore there isn’t a sea view but the seafront is only a 200m walk away.", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r570707406", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Brilliant hotel great service", "review": "Dear Sarah,   Thank you very much for your nice opinion! We are very happy to hear that you had a good experience staying with us at the BQ Amfora Beach Hotel and that you recognize our efforts for our valued guests!  Looking forward to welcome you again very soon! With warm regards,  BQ Hoteles. ", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r570152642", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fantastic place to stay", "review": "We checked into this hotel prior to 2pm. We knew the room would not be ready but just wanted to drop the bags off. The young lady on reception went out of her way to get us in a room that was ready. She was professional..friendly and very helpful giving us all the information regarding breakfast times..wifi codes etc. She is a real asset to the hotel. We parked just outside on the street. I would imagine high season you may struggle for parking. We walked into Palma on the coast road...a long walk but flat and very beautiful. The breakfast was good. Great coffee and the best orange juice we had on the Island. The rooms are small but clean and the showers are amazing. English channels on the TV. Close to the Airport so if you have an early flight definitely stay here.", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r569864096", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "great location.unbelievable breakfast", "review": "Dear Keely,  Many thanks from all the BQ Hoteles team for writing a review, we appreciate your assessment and we are pleased to know that we got you to enjoy a great experience with us, daily goal of all professionals who make BQ group.  We wish to welcome you back very soon and enjoy again a memorable experience with us, we will strive to please and surprise you on your next visit.  Greetings from Mallorca! ", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r559748609", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Excellent hotel, great location", "review": "Stayed here for three nights, had a wonderful time.   Location is pretty good, only a two minute walk from the sea and a plethora of markets and restaurants. The room was a bit small, but very clean and comfortable. Staff was very friendly and helpful as well.  Pool seemed fine but didn't get enough sunlight, and the jacuzzi was a lot colder than expected, so we didn't get to try either.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r541196542", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Beautiful hotel", "review": "Have loved my stay at this hotel. Stayed 5 nights end of October. Breakfast has been lovely with a great selection.  Rooms very clean and modern, even have plugs at the side of the bed!!  Recommendation- offer half board for the perfect package. ", "date": "November 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r537784211", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "The best Hotel ever in my life", "review": "Dear Rebecca,  Many thanks from all the BQ Hoteles team for writing a review, we appreciate your assessment and we are pleased to know that we got you to enjoy a great experience with us, daily goal of all professionals who make BQ group. We wish to welcome you back very soon and enjoy again a memorable experience with us, we will strive to please and surprise you on your next visit.  Greetings from Mallorca! ", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r537438376", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent holiday", "review": "We stayed 7 days in BQ Amfora . Very nice staff, very clean rooms,  quited area, good comunication in english , big selection foor for breakfast, everything fresh and nice.Very Good price for drinks, beer  , cofee etc.  Nice selection TV channel and free good WiFi , ...high recommended", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r536087906", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Lovely short break", "review": "Dear Damien It has been most pleasing to read that you had such a great time in our hospitality at BQ Amfora Beach and we want to thank you for sharing it with others. The fact that we were able to provide you with such a wonderful holiday experience is extremely satisfying and we will continue working hard to achieve this every day. We try to think of everything to provide our guests with a perfect holiday. Once more, we thank you for sharing this perfect review of our hotel and we hope that we will be able to serve you again in the future.   Best regards  BQ Hoteles. ", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r534783802", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely Hotel, Great Breakfast!", "review": "Me and my friend stayed here for 3 nights, we had a great time, this hotel is spotlessly clean in all areas, rooms are good and beds comfortable, breakfast was amazing with an excellent selection of cold and hot food, snack menu is also good and very reasonable also, staff are all friendly and helpful, hotel is also close to the airport and shops and restaurants all nearby, so overall we would have no hesitation is recommending the Amfora beach to anyone visiting this lovely part of Majorca would definitely return, Thanks for a great time 😀.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r534256237", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Absolutely brilliant hotel and service!!", "review": "We stayed here in early October and everything from start to finish was fantastic!! Reception staff were all courteous and helpful, waiting on staff were very friendly and kept everywhere clear and clean. Rooms are tiny bit small but perfect for 3-5 day stay. The location was 5 minutes from beach and 5-10 minutes within lots of bars and shops and restaurants and the beaches are immaculate and again 5mins away.,we’ve booked again for May!!! ", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r533983825", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely clean and bright hotel", "review": "Dear Darren, Thank you very much for your nice opinion! We are very happy to hear that you had a good experience staying with us at the BQ Amfora Beach Hotel and that you recognize our efforts for our valued guests! Looking forward to welcome you again very soon! With warm regards,  BQ Hoteles. ", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r532020619", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Comfortable hotel", "review": "This Hotel is adults only and as such is great for unaccompanied adults.The rooms are clean and bright with all you could need. The breakfasts are superb and there is such variety of fresh fruits and freshly cooked omelettes,eggs and pancakes. The hotel is just a quick stroll to the beach and all the restaurants", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r530968705", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Perfect for Airport Proximity", "review": "Dear Sally, Thank you very much for your nice opinion! We are very happy to hear that you had a good experience at the BQ Amfora Beach Hotel! We wish to welcome you back very soon and return to enjoy a memorable experience with us, we will strive to please and surprise you on your next visit. Greetings from Mallorca!  BQ Hoteles. ", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r528099037", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Beautiful structure, clean, with very friendly staff, in a great location!", "review": "Clean hotel in good position nearer to the beach than we thought which was a good thing. The most comfortable beds but the smallest room I have ever stayed in. Breakfast was excellent with lots of choice and the wifi was free and fast. Staff were friendly. Pool area although clean rarely got the sun which was a disappointment. Overall nice hotel to stay in.", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r527041432", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Wonderful break", "review": "Spotlessly Clean Great location Excellent breakfast Nice pool Staff friendly Great WiFi Bike shed available Luggage room.and shower available Toiletries provided Nice bar and reasonable priced food and drink Comfortable bed Powerful shower Nice balcony Rooms on smaller side but no issue for us as few day trip Safe did not work", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r520495641", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great little modern hotel. Everything you need for a quiet holiday", "review": "Dear guest,  Thank you very much for your nice opinion! We are very happy to hear that you had a good experience at the BQ Amfora Beach Hotel! We would be very proud to have the opportunity to welcome you back again in a future! With warm regards, BQ Hoteles. ", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r517363163", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "relaxing hotel", "review": "Stayed here in April. Gem of a hotel. Spotlessly clean, quiet and great facilities and staff. Only a few minutes walk from the harbour with lots of bars and restaurants. We stayed half board and I actually enjoyed the 2 minute walk to the sister hotel for dinner. It felt like you were eating out every night.   Definitely worth hiring bikes and checking out the coastal cycle paths. Some beautiful views.   So good we're booked to go back in October. Can't wait!", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r515298524", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Great hotel but very small rooms", "review": "Dear guest,  Thank you very much for your nice opinion! We are very happy to hear that you had a good experience at the BQ Amfora Beach! Looking forward to welcome you back again very soon! With warm regards, BQ Hoteles. ", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r514218380", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Lovely clean hotel amazing breakfast ", "review": "Was a lovely hotel, the staff was helpful and friendly. The room i had was the opposite side of thye road from the main hotel, It was a nice room, it was comfortable. The location was farther from the beach than i thought it would be. I booked H/B & DISSAPOINTED that i had to go to a sister hotel the BQ APOLO for my evening meal. The food was good, but wasnt really happy with that. Entertainment was good, overall had a good time.", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r513579950", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great hotel ", "review": "We've just spent a week at this lovely hotel. The staff were always very friendly and polite, the breakfast buffet was a veritable feast and it would be impossible not to find something if not all to eat and enjoy. The hotel is spotless and perfectly placed for the beach, bars and shops. Great experience for a first visit to Majorca. We will be booking again for next year.", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r513569593", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great location and spotless clean", "review": "Dear Carole, Thank you very much for your nice opinion! We are very happy to hear that you had a good experience at the BQ Amfora Beach Hotel! We would be very proud to have the opportunity to welcome you back again in a future! With warm regards, BQ Hoteles. ", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r509303197", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely clean hotel ", "review": "Just returned from  a 14 night stay. Really pleased, modern and the cleanest hotel we have stayed at. All the staff were friendly and helpful and the cleaning team were constantly cleaning everything, rooms, bathrooms, glass , balconys, toilets etc The location is 5 mins from an excellent beach with plenty of restuarants and I can say in all the ones we tried the food was really good. Probably a quieter resort but taxis and buses are available to Palma approx 10 mins away if required. The pool and terrace area is not massive but we had no trouble getting a sunbed and a dip in the pool when we wanted and it was nice not to have giant inflatables and kids screaming around when we wanted to cool down. The choice for breakfast was outstanding with panckes, Omelettes cooked to order…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r508462924", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Modern and clean Hotel close to Beach.", "review": "Dear guest, Thank you for this nice review! We are very happy to hear that you had a good experience at the BQ Amfora Beach! We would be very proud to have the opportunity to welcome you back again in a future! With warm regards, BQ Hoteles. ", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r505117613", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Clean and central", "review": "Chose this hotel based on proximity to the beach. The location is great. The beach is 200m away & there are plenty of inexpensive restaurant & bars nearby. The bus stop is around the corner for easy access to Palma de Mallorca. The pool and hot tub are clean & there is a lifeguard on duty for most of the day. They have evening entertainment most nights and the breakfast had a great range of hot and cold foods including an omelette/pancake station. The room had a balcony and was clean. The food was good too & cocktails were very reasonably priced. ", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r504904695", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Spotless gem of a hotel", "review": "Have just returned from 5 nights at this lovely hotel.  The location is superb turn left from hotel and it's a short stroll to beach turn right and a short stroll to buses into Palma and airport.  Small spotless pool with plenty of sunbeds.  Reception staff very friendly and informative. Rooms are small but adequate and again good shower and meticulously clean.  In fact cleaners appear to be cleaning every area of hotel all day and evening.  Breakfast is buffet style with fabulous choice and choice of cooked eggs freshly done.  Reception told us about entertainment and this is advertised with start and finish time though noise never bothered us.  Thoroughly recommended as is that area of Can Pastilla with lovely beach and plenty of restaurants.  Beach is very safe in a sheltered…", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r503432213", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Delightful short break", "review": "Dear guest, Thank you very much for your nice opinion! We are very happy to hear that you had a good experience at the BQ Amfora Beach Hotel! We would be also very proud to have the opportunity to welcome you back again in one of our BQ Hoteles! With warm regards, BQ Hoteles. ", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r503262443", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Relaxing break", "review": "Stayed on the 1st July for three nights.  Ideally placed for Palma. The hotel is situated five minutes walk from a small sandy beach, with shops bars and restaurants in close proximity.  The hotel itself was spotlessly clean inside and out  with a small pool and sun loungers.   It was our anniversary holiday and the Hotel thoughtfully surprised us with a bottle of Cava to celebrate.   The room was very comfortable if a little small with TV, small desk, comfortable beds  and a small balcony overlooking the pool.   The bathroom had a large walk in shower.   Breakfast was excellent with hot and cold buffet  with something for every taste.   Bar prices surprisingly good for a hotel with friendly staff.   Staff on reception very helpful.  The only minus point was aircraft noise due…", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r503063970", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very good experience.", "review": "Dear guest, Thank you very much for your nice opinion! We are very happy to hear that you had a good experience at the BQ Amfora Beach Hotel! We would be very proud to have the opportunity to welcome you back again in a future! With warm regards, BQ Hoteles. ", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r499384011", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Perfect few days close to Palma", "review": "We found the staff very helpful and always friendly . The rooms are compact but very clean and comfortable. It was lovely and peaceful on the evenings and just a few minutes walk to the beach. There are a lot of restaurants on the beach front , but if you go in a few streets will find little gems. We would definitely recommend this hotel and will be staying there again in the future.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r498874460", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Mini Break", "review": "Just returned from a 3 night stay. My husband and I stayed there last year and enjoyed our time so decided to go back. Location is great from the airport, close to beach and restaurants. Would certainly recommend and will be going back next year.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r497834536", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Birthday weekend away", "review": "Liebe Jane, Thank you very much for your nice opinion! We would be very proud to have the opportunity to welcome you back again in a future! With warm regards, BQ Hoteles. ", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r496068820", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Pleasant stay for one week", "review": "Stayed at the hotel 22/6/17 to 25/6/17 for a long weekend.  Negatives first any transfer bus drops you a couple of minute walk away from the hotel. Service out by the pool was really slow and lifeguards looked totally uninterested being there.  The rest is very good. Reasonably priced drinks and food at the hotel. Never ate there but what i saw looked good. The room is small but very nicely done, and we didn't spend much time in the room anyway. Shower was very powerful so good for waking you up and toiletries good. Lady on reception with glasses was very nice, spoke good english so made checking in easy. The pool and pool area nice and clean, and generally a couple of sun beds available. The hotel is also spotlessly clean, the cleaning staff do a great job. Wifi in room and…", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r495672784", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely stay", "review": "Ddear guest, Thank you very much for your nice opinion! We are very happy to hear that you had a good experience at the BQ Amfora Beach Hotel! We would be very proud to have the opportunity to welcome you back again in a future! With warm regards, BQ Hoteles. ", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r492844010", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "A great experience", "review": "Nice hotel in Can Pastilla, Mallorca.  + just 5 minutes by walk from the beach Cala Estanica or Can Pastilla + 10 minutes by taxi = 15 euro + 5 minutes from the bus stop. Buses bring you in Palma or S'Arenal + 5 minutes from various rental car companies + 5 minutes from the nearest supermarket + personal is very friendly and helpful. Speak various languages + breakfast is very reach and for every taste. Particularly pancakes that are made just in front of you. Delicious. + very cosy bar with good cocktails and big terrace. The snacks are also very good.  + the atmosphere at the pool is very relaxing and quiet.  + wifi is excellent + hotel is renovated  - no sound isolation. When our neighbors had a shower/wc we had a doubt whether it was in our bathroom or not. - the room and…", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r489361441", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "My stay", "review": "Just back from 12 night stay in anfora beach first class as normal,some changes all for the better,better waitress service better selection of meals and snacks by pool,bar prices cheaper than local bars a very relaxing and pleasant stay,more selection at breakfast only down side as I do not like eggs in first week only beans 1 morning when complained to Chorley at reception sorted many thanks all see you next may", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r489221758", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Good place for sea rest...", "review": "Dear guest,  Thank you very much for your nice opinion! We are very happy to hear that you had a good experience at the BQ Amfora Beach Hotel! We would be very proud to have the opportunity to welcome you back againnext May!  With warm regards,  BQ Hoteles. ", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r487964883", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Modern, clean hotel in a quiet area", "review": "Have stayed there in 2014 august , very comfortable and clean room, not big but clean.Personal was ok, The reception was not good at english. Hotel close to the aeroport and sea,beach. Also the bus station is near and u can get very easy to the city center, even by bike it takes 30 mins.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r487333219", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Another great stay", "review": "Dear Gana,  Thank you very much for your nice opinion!  We are very happy to hear that you had a good experience at the BQ Amfora Beach Hotel! We would be very proud to have the opportunity to welcome you back againas we have completely remodeled the hotel!  With warm regards,  BQ Hoteles. ", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r487089647", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nice clean hotel", "review": "Don't want to repeat what others have already said recently (very good information from Joanne)...  5 Euro by bus, but if you prefer the luxury of a taxi, it is about 15-20 Euros. Very close to the beach. If you are hiring a car from many hiring places around the hotel, beware, it is a nightmare finding a parking after your long day trip! We drove around nearly 10 streets for 20 mins before finding a spot a mile away! Hotel Management, please note: there are no hooks for hanging cloths! No where to keep own toiletries!", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r485364210", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice hotel", "review": "This hotel was for adults only . It was very well situated in a quiet street about 250yds from the beach and restaurants along the front.  When I stayed the restaurant was closed but there was food available in the snack back which had the addition of live music ... not raving ... just nice quiet music in keeping with the clientele.  Breakfast was very good with very helpful staff. Would stay there again.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r485265026", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very nice", "review": "Dear Mick,  Thank you for your nice opinion. We are very happy to hear that you had a good experience staying with us at the BQ Amfora Beach Hotel.  Looking forward to welcome you back again very soon!  With warm regards,  BQ Hoteles. ", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r483589758", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Wonderful hotel ", "review": "The breakfast was really good. Something for everyone. There was also cava. The nearest beach was only 5min walk. Room was clean and comfy. Wifi was good and staff was nice. Bus to the palma de mallorca took around 40min. ", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r479641571", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Not far from the madding crowds", "review": "Dear guest, Thank you for your nice opinion. We are happy to know that you spend a comfortable stay with us. We will be delighted if you visit us again.  Best regards BQ Hoteles ", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r479073652", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Mostly positive", "review": "A very clean and modern hotel which runs as adult only - perfect! The rooms are quite small but it was all we needed as a place to sleep and wake up to the most amazing buffet breakfast where there is a show chef waiting to cook you delicious pancakes, fried eggs and omelettes. The rest of the breakfast selection was good too, with a wide range of options. Considering it is included in the price of the stay I was really impressed. There is dining options on site and although we didn't eat here the food we saw looked good and it was at a reasonable price, as well as the on site bar. It's a pretty central location, within walking distance of restaurants and bars as well as the aquarium and only a short walk up the road to get a bus into Palma. My only critique was that we were…", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r478520470", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Super find", "review": "Just returned from a mini break at this hotel.  Excellent staff and cosy modern rooms. Lovely breakfast and reasonable bar prices.   What it lacks in missing a sea view makes up in the above...👍  Will definitely return. ", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r477259794", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Amazing in every way", "review": "Dear guest,  Thank you very much for your nice opinion! We are very happy to hear that you had a good experience at the BQ Amfora Beach Hotel! We would be very proud to have the opportunity to welcome you back again in a future!  With warm regards,  BQ Hoteles. ", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r475458117", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great Hotel - Beware of GOLDCAR", "review": "Great beds, great breakfast, nice pool and jacuzzi. Staff are very friendly and happy to help.   The location is ideal and is a few minutes walk to beach and one minute to the bus stop to Palma, however still manages to be a quiet street.  Couldn't fault this hotel and will happily return!", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r439171124", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great Hotel in a Super Resort", "review": "Dear Connor,  Thank you very much for your nice opinion in Tripadvisor.  We are very happy to hear that you had a good experience at the BQ Amfora Beach Hotel! We would be very proud to have the opportunity to welcome you back again in a future!  With warm regards,  BQ Hoteles. ", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r438305169", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent Hotel", "review": "Pro's Modern Hotel Good location Clean & Tidy Great Breakfast Value for money  Cons No sun till afternoon Parking    Really enjoyed my stay here. would certainly return without hesitation.  Beware of Goldcar  The charge you for insurance that you do not need...without offering the option to you. They hand you your contract at the same time as a map showing you where your car is parked. Don't sign the \"black\" screen that they ask you to.  Top Tip...Use a local insurance provider at home to cover you comprehensively for car hire. Should be about a quarter of what Goldcar charge.", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r435645768", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "very nice", "review": "in a quiet spot but 2 mins to beach & restuarants.very modern clean hotel with lovely staff.Comfy beds & great shower..breakfast very good choice.shower & towels available on leaving day if you have a late flight only negative..rooms small & no sun at the pool which is a shame as it`s lovely with a hot tub as well 5pm the sun comes around but not for long.", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r434519698", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice adult only hotel", "review": "Dear Guest,  Thank you very much for your nice opinion!  We are very happy to hear that you had a good experience with us! However, we will bear in mind all of your feedback and hope that next time we can offer you a better experience!  With warm regards,  BQ Hoteles. ", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r433681313", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Did not disappoint.  Excellent hotel.", "review": "Set in a quite side road which leads to the smaller beach and a few minutes to the much larger beach. The hotel is very clean and modern with a small pool and sun terrace area. This pool area is only really used in the afternoon as the sun does not reach it till after lunch. The rooms are small and it is impossible for two people to pass in the space at the end of the bed, you need to move to the side to let another person pass. The wardrobe area is limited too, not enough hanging/drawer space for two people unless you travel light.The bathroom is small but well designed and a good range of toiletries are supplied and replenished when used. My dislike was the glass wall to the bathroom and the sliding door, which because it met with the glass wall, stopped short of meeting…", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r432036662", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "BQ AMFORA Nice Stay", "review": "Dear Guest, Thank you very much for your nice opinion!  We are very happy to hear that you had a good experience with us! However, we will bear in mind all of your feedback and hope that next time we can offer you a better experience with larger size rooms.  With warm regards,  BQ Hoteles. ", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r430296301", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Really really nice hotel", "review": "This was our second stay in the hotel.  We were on the top floor of the hotel this time and the views were much better than on a lower floor.  We also stayed in the main part of the hotel rather than the annex across the road which meant the balconies were significantly larger.  The rooms also appeared to be a little larger.  The rooms were well appointed and maintained to a high standard.  There is a 32 inch television which gets among other channels BBC1 and 2, ITV 1, 2 and 4.  The rooms are quiet and there is an excellent range of toiletries in the well appointed bathroom.  The only thing the rooms do not have is a kettle and tea/coffee making facilities but these we had brought with us.  The hotel has a large breakfast room but apart from that the only food sold are snacks…", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r428082922", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "A wonderful stay", "review": "Very modern, very clean hotel with friendly staff. Situated in a quiet residential street close to all amenities and bus stops. Amazing choice at breakfast, something for everybody. The room was wholly adequate and had everything one could need. The only slightly negative comment I have concerns the lack of a shelf in the bathroom. All my bathroom items had to be placed on top of the toilet cistern. Free wifi works throughout the hotel and is strong and consistant. I would highly recommend this hotel to anybody. I shall certainly stay at this hotel again for my next visit to Mallorca.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r427820509", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Comfortable stay for a couple of days", "review": "Dear guest,  Thank you very much for your nice opinion!  We are very happy to hear that you had a good experience at the BQ Amfora Beach Hotel! We would be very proud to have the opportunity to welcome you back again in a future!  With warm regards,  BQ Hoteles. ", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r426046811", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "very comfortable hotel", "review": "Just back from a short stay in C'an Pastilla. Chose this hotel as it was in the vicinity of another id stayed at, cheaper per night, and looked more modern in the photos.   Upon arrival, received a polite and professional greeting from the young lady at reception. Everything I needed to know explained in detail.  Room was a double despite being a solo traveller, but think it might be a struggle for more than one person to feel comfortable in the rooms of this size. Was just about right for me.  Good portion of complimentary toiletries in the bathroom, including shaving kit, manicure kit, toothpaste and travel-like brush, shower gel and shampoo. Even a sewing kit was included.  Nice modern LED TV mounted on to the wall with a variety of channels in many languages.  Bed very…", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r425740837", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "\"pleasantly surprised\"", "review": "Dear Guest,  Thank you very much for your nice opinion!We are very happy to hear that you had a good experience with us! However, we will bear in mind all of your feedback and hope that next time we can offer you a better experience!  With warm regards,  BQ Hoteles. ", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r425011648", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Great  Hotel, Immaculately clean, loved it", "review": "Hotel is very clean and the staff at the reception desk is very friendly. The breakfast is also great, lots of choice and the waitresses are always welcoming. Once you've checked out you can even take a shower downstairs and the reception desk will provide you with clean towels. Only downside was the WIFI. We stayed on the 3rd floor and had bad reception. For the rest, a hotel that has thought about everything!", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r422091445", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Clean and Comfortable", "review": "Small rooms but bathroom good size - shower was great with plenty of free toiletries- bed comfortable. Planes going over constantly and pool area shaded until after 2. Breakfast good although coffee not great.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r419347558", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A gem hotel in the most unexpected place", "review": "Dear Guest, Thank you very much for your nice opinion!  We are very happy to hear that you had a good experience with us! However, we will bear in mind the quality of the coffe and hope that next time we can offer you a better experience!  With warm regards,  BQ Hoteles. ", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r418922167", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Quiet and pleasant hotel with excellent location but very small rooms", "review": "Easy to find hotel with excellent amenities. As previous reviewers have mentioned rooms are compact but spotlessly clean and very modern. The fridge in the room is a bonus. Supply of toiletries was a lovely surprise who'd expect toothbrushes and toothpaste?  Breakfast selection was probably the best we have experienced. Staff extremely pleasant and willing to help. Bus no 21 from airport at 5 euro takes you to Can Pastilla within an easy 5/10 min journey. Hiring a bicycle is a must. This gem of a hotel is in the middle of a residential area which we thought was good as it was away from the hussle of a busy resort.  On several nights there was various entertainment in the reception area which was something unexpected but good.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r417978413", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "good location, modern rooms, lovely staff & great breakfast", "review": "Dear Guest,  Thank you very much for your nice opinion!  We are very happy to hear that you had a good experience with us! However, we will bear in mind all of your feedback and hope that next time we can offer you a better experience!  With warm regards,  BQ Hoteles. ", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r417892873", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "great hotel", "review": "My husband and I were impressed with the quiet location on a residential side street, with easy access to beautiful but crowded Can Pastilla Beach (turn left from the hotel and walk two blocks for the posh end of the beach or turn right and right again past a few blocks of shops, cafes and bars to the larger centre of the beach). But the rooms are very small for two people. We did have a nice balcony (ask for a high floor). Other advantages--  Nice outdoor pool with very helpful lifeguard Excellent air conditioning Free wifi that actually works in the room Adults only (although I saw families with children clearly under 16, including on our floor, staying there) No noise from other rooms or guests Good breakfast buffet Easy access to Palma on bus 15 or 30 & to the airport on bus…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r417848544", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A hidden gem", "review": "The hotel is a 2 minute walk to the beach down the street, so impossible to get lost.  You'll most definitely need to go to the beach as the pool doesn't get any sunshine until much later in the afternoon and is very small.  I can't comment on the pool itself as I never went in. Bedrooms are very modern, clean and bright. A kettle would have been  nice but coffee served at the bar was excellent. Breakfast was extremely varied and of a very high quality, although I'm not sure who eats onion rings and broccoli for breakfast.  You also get a very extensive toiletry collection including toothpaste, toothbrush, shoe shine, shower hat along with all of the usual shampoo, shower gel and soap. The staff were all great, rooms were cleaned daily. All in all an excellent hotel. Personally…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r417023394", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice Middles class Place to stay", "review": "Not far from the Beach, 3 mins walk, 2 Buildings seperated by the street, recently re-opened after being re-built, all new and semi-design, nice deco but still a basic functioning holiday hotel with middle class standards, simple but clean and cosy, the food is good for the price the price is ok, what you pay for is what you get. no complaints, good economical stay.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r416620312", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Nice people", "review": "Dear guest,  Thank you very much for your nice opinion!  We are very happy to hear that you had a good experience at the BQ Amfora Beach Hotel! We would be very proud to have the opportunity to welcome you back again in a future!  With warm regards,  BQ Hoteles. ", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r416368450", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Well earned break", "review": "Just returned after a 5 night stay. Nice clean hotel. Nice room. Nice breakfast. Very helpful staff.(nice people) All in all a great place for a short holiday. Would definitely return. Cannot believe that trip advisor puts a limit on how many words a review needs to be. Its a good hotel in a good location with nice , friendly helpful people in a goos location. Try dragging that out to two hundred words without over elaborating.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r415753176", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Nice hotel", "review": "Dear guest,  Thank you very much for your nice opinion!  We are very happy to hear that you had a good experience at the BQ Amfora Beach Hotel! We would be very proud to have the opportunity to welcome you back again in a future!  With warm regards,  BQ Hoteles. ", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r414831987", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely place", "review": "We have just returned from a 3 night stay here. I travelled with my husband for his birthday.  The hotel is spotlessly clean and the staff are friendly. The breakfast is lovely, lots of variety. The rooms are very small but all you need really for a short stay. The hotel is in a lovely quiet location only a very short walk to the beautiful beach. The beach itself is lovely. Clean, shallow water.  Lots of shops and restaurants all at reasonable prices. Would definitely stay again.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r412886191", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Wouldn't go back", "review": "Dear Julie,  Thank you very much for your nice opinion!  We are very happy to hear that you had a good experience at the BQ Amfora Beach Hotel! We would be very proud to have the opportunity to welcome you back again in a future!  With warm regards,  BQ Hoteles. ", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r411717278", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good Location", "review": "Firstly the hotel is fine, details to follow, but the pool area is in full shade till mid afternoon - it was therefore really annoying to be told by the 12 year old lifeguard that no-one could move the sun loungers to the one corner of the pool area that did have a sliver of sun from late morning. No reason could be given, just that it was 'the rules' (hardly surprising then that the pool was empty, so no-one around buying drinks etc). The one saving grace was the lovely hot tub.  The hotel is clean and modern and apart from the above is perfectly fine for the price.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r408180733", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Welcoming staff, great location acceptable breakfast ", "review": "Dear guest,  Thank you very much for your nice opinion! We are very happy to hear that you had a good experience with us! However, we will bear in mind all of your feedback and hope that next time we can offer you a better experience!  With warm regards,  BQ Hoteles. ", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r400570747", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Perfect base for the Beach", "review": "I booked this hotel as required a hotel near to the airport and beach as away for a mini break.   The hotel was lovely and clean with friendly helpful staff. Read many reviews prior to booking and agree the breakfast is wonderful.   Room I agree is a little tight but it was bright, modern and clean which is far more important.  A lovely touch was the toiletries in the bathroom. Great to see a hotel supplying such a selection just encase you forgot something.   Will certainly be going back.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r400419838", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellente", "review": "Currently staying here Great hotel,very clean and fresh,good sized rooms Breakfast fantastic-caters for everybody Pool quiet -plenty of sun loungers Short walk to beach and restaurants Palma only 15 mins away-bus stop nearby So far a great stay ", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r400371341", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fab hotel", "review": "Dear guest,  Thank you very much for your nice opinion! We are very happy to hear that you had a good experience at the BQ Amfora Beach Hotel! We would be very proud to have the opportunity to welcome you back again in a future!  With warm regards,  BQ Hoteles ", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r399317170", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Bit ibis ish  but good location", "review": "Lovely stay at a fab hotel.  Short break, five days.  Lovely room on ground floor overlooking pool. Toiletries provided,great addition. Facilities were fab. Breakfast amazing, lots to choose from including Prosecco. Very clean, staff very friendly.   ", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r398587850", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very modern hotel", "review": " Dear guest,  Thank you very much for your nice opinion! We are very happy to hear that you had a good experience at the BQ Amfora Beach Hotel! We would be very proud to have the opportunity to welcome you back again in a future!  With warm regards,  BQ Hoteles ", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r398149197", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice, new hotel", "review": "Good  location, staff great, breakfast excellent. Very small  room (and shower!)(bring your kettle  if you want a brew in the morning!)  Beds comfyish but soft. Handy for bus  to palma and airport.  Feels a bit like an ibis standard but very clean and friendly. Pool area very small where beds are set out very close together and only gets sun later on the day. Plenty  of beaches to chose from ( would recommend  bigger one for breeze). Have occasional acts on at hotel but layout doesn't maximise on this as in the reception area. Limited sea view as off the front but other than that loved it!  ", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r395606259", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice Hotel... Small rooms", "review": "Hey,  We just came back from a 5 night stay at the hotel. There are some good points abs not so great points so I will be as honest as I can be:  Good Points: -The place is modern and very clean - it is a good location - 2 mins away is the bus stop that takes you regularly to Palma centre or the airport -we really liked the area. Close to beach and restaurants and bars and easily assessable to Palma too. -good variety at breakfast  Not so great Points: -The rooms are very very small. This is ok though but we were shuffling past each other a lot - the pool doesn't get the sun great. It's on the wrong side of the hotel so we literally never went in the pool area. It was so much sunnier on the beach. -at breakfast it is very hectic with mainly Germans. Which is fine but felt like a…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r390326453", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Loved it!", "review": "Dear guest,  Thank you very much for your nice opinion!  We are very happy to hear that you had a good experience with us! However, we will bear in mind all of your feedback and hope that next time we can offer you a better experience!  With warm regards,  BQ Hoteles. ", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r389057979", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Brilliant Hotel Fantastic Location", "review": "Stayed here for a long weekend and absolutely loved it! We arrived at 11.30am and didn't expect our room to be ready but it was. We were pleasantly surprised with the room which was on the 4th floor. The furnishings were lovely. The view was over the gardens of some private properties and you could see the sea. It had a fridge, safety deposit box and hair dryer. Storage was quite limited though and I think if you stayed for a week, you'd struggle a bit but for 3 nights, it was fine. The bathroom was great with a fab shower and there were loads and I mean loads of different toiletries provided. Breakfast was absolutely lovely with everything you could possibly want and the restaurant was beautifully decorated and light and airy. Beach towels are available to hire at 10 euros each…", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r387162814", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Small but very clean rooms, good location.", "review": "Dear guest,  Thank you very much for your nice opinion! We are very happy to hear that you had a good experience at the BQ Amfora Beach Hotel! We would be very proud to have the opportunity to welcome you back again in a future!  With warm regards,  BQ Hoteles. ", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r385020744", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Spotless, friendly and relaxed spot", "review": "We arrived at hotel early 10am and was told by the receptionist that our room was nearly ready and would we like to help ourselves to breakfast. This made a nice change and the breakfast was superb . The room was clean, modern and sleek and maybe a tad small but you dont go on holiday to spend all day in your room. Overall a great hotel with a great breakfast which included Prosecco", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r384820419", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great stay!", "review": "I was there with my boyfriend for 10 days and really had a great stay. Breakfast is really diverse and there is always a lots of fruits, beagles, and something for everybody. Our favorite were pancakes, which we had every day of our stay. Overall it is pretty clean hotel, I would give it a 4.5 of 5 points for that. Rooms are little small for our taste, it would be better if they were bigger just for comfort but as I said, it still was a great stay. Don't expect a big pool, it's not for swimming I would say, but just to chill or cool down. Staff was helpful now and there, but sometimes it wasn't the best service you could get. Would recommend and would come again there. Oh and wi-fi is really great :)", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r382688852", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Perfection!!!!", "review": "Dear Guest,  Thank you very much for your nice opinion!  We are very happy to hear that you had a good experience with us! However, we will bear in mind all of your feedback and hope that next time we can offer you a better experience!  With warm regards,  BQ Hoteles. ", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r379989525", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great hotel!", "review": "Everything about this place exudes perfection, situated just across the beach it is simply stunning. The rooms are spotless and spacious with a/c, hairdryer and too many extras to list. The staff are ultra friendly and helpful, the roof terrace is 'asombroso' and the buffet breakfast......just WOW!!!!! Fruit, assorted fresh breads, cooked foods and prosecco, yes prosecco!!! To put it simply if you are coming to this area it would be a crime not to stay here!", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r378530351", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Adult only hotel", "review": "Dear guest,  Thank you very much for your nice opinion!  We are delighted to hear you thoroughly enjoy the time you spend at our hotel, we really do appreciate your kind words.  We hope to welcome you back again soon, hopefully we can provide you with an even better stay!   With warm regards,  BQ Hoteles", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r377571138", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great location ", "review": "Nice hotel, clean room, helpfull and friendly staff, good location for beach and restaurants. Near several busstops and just a short ride from the airport. Breakfast is awesome!!!!!! Prices in bar and restaurant just somewhat higher then in normal businesses. If you need information ask Jimena, if you want to dance ask Juan.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r372405010", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Absolutely brilliant. ", "review": "We stayed here for several nights. And everything was excellent.. Good breakfast, great location.. Short walk to either beach or bus stop,  very clean, friendly staff.. And very helpful.. We arrived on an early flight and returned on a late flight.. On check in and check out the staff were brilliant.  Will definitely stay again ", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r371521970", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Superb booked again for October", "review": " Dear guest,  Thank you very much for your nice opinion! We are very happy to hear that you had a good experience at the BQ Amfora Beach Hotel! We would be very proud to have the opportunity to welcome you back again in a future!  With warm regards,  BQ Hoteles. ", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r368232217", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Fully renovated. Fantastic breakfast.", "review": "BQ is located near the bus stop from the airport and is some 300 yards from the sea.  The hotel is now adult only.  The hotel is made up of two parts the main hotel and on the other side of the road the annex (about 20 rooms).  All the facilities are in the main hotel swimming pool, bar and restaurant.  Entry to the annex is through a door which is opened using your room key.    The rooms are not large but are clean, comfortable and contain all the facilities you would expect.  The rooms are well furnished and the bathroom contains a wide range of toiletries.  The rooms in the annex where we stayed were very quiet and there was little or no noise from the corridors or neighbouring rooms.  There was some noise that came through the balcony doors, this was made up mainly from…", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r365734465", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Perfect for the price ", "review": "Dear guest,  We are glad you had an enjoyable stay!  We will love to have you back!  With warm regards,  BQ Hoteles. ", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r365423524", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Wonderful experience!", "review": "Completely renovated hotel. Small rooms but well designed and comfortable. Location in a quiet road, no noise from outside. Fantastic buffet breakfast. Nice and efficient reception staff, especially Mrs Mariela. Easy connection to airport with bus 21 (10 minutes, ticket 3 euros). Also easy bus connection to the center of Palma: 6 km, 1.50 euros. Bus stops near Hotel Linda, 3 minutes walk. ", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r363361440", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Wonderful place with friendly people", "review": "We stayed at this hotel for about 2 weeks in August 2015. Rooms are small, but clean. The balcony is also clean and big enough. We spent there some time in the afternoon, when it was too hot on the sea.  This hotel offers breakfast, which is good enough. Everyone can find something tasty: from fruits to pancakes. The staff is friendly and hospitable. The sea is 300 meters down the street. However, we found the beach that is 10 minutes away much better. It's long (7 km) and wide with a lot of cafés.  We enjoyed our stay and hope to get back again.", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r352947225", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Really pleasant stay", "review": "Many thanks for your nice opinion!  We are very happy to hear that you had a good experience staying with us at the BQ Amfora Beach Hotel! We are also looking forward to welcome you back again very soon and to provide you a good experience!  With warm regards,  BQ Hoteles.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r330778762", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "worthy for the price", "review": "This was just a short 2 nights stay. The hotel is some 7 minutes walking distance from the beach, in a quiet street. Recently renovated in a modern but not the cold anonymous design. Most of the guests were Germans (or German speaking) but that could also be depending on the season. The staff on the Reception is really very nice, including the kind night porter. Very professional, too. The rooms are rather small but they are comfortable. We were lucky to get a room on the highest floor. We enjoyed the breakfast as well - better than the usual Mallorquin standard with a good choice. If I would come back? Definitely! Any time!", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r313724776", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Will defo be going again ", "review": "Dear guest,  Thank you very much for your nice opinion! We are very happy to hear that you had a good experience with us and can't wait to have the pleasure to welcome you back again very soon!  With warm regads,  BQ Hoteles.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r313570567", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "New, clean and narrow hotel", "review": "the hotel is new or renovated, and it's very nice and clean. it has a bar, a pool and the rooms have everything you need. they're not very big but are functional and clean. it's not too far from the beach but it's near to the airport and a bus station which is about 3 min walk. the service is good, the bookings are usually with breakfast included which is excellent. only liability is that it has no parking space, and i might add that there is no wi-fi (at least last year there wasn't) and only one computer for internet surfing and slow connection. other than that everything was good", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r311410137", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Muchas gracias por todo!!", "review": ",Amazing stuff, great location in Can Pastilla  clean and quiet hotel, with tasty breakfast.  Under the circumstances we had - you were my savers!  Choli, Limena, Alejandro yi todo.. :)   !!El mejor gentes en Mallorca", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r309316456", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "If only the soundproofing was better...", "review": "Dear Karin,  Many thanks for your great opinion!  We are very happy to know that you had a good time staying with us at the BQ Amfora Beach Hotel and we are really looking forward to welcome you back very soon!  With warm regards,  BQ Hoteles.", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r309295093", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Holidays in August", "review": "We have just got back from our honeymoon. Stayed in this hotel for 6 nights. And I gotta be honest, even though the hotel is a 4 star, recently refurbished, clean, looked new, in a great location, but the soundproofing as BQ website states WAS NOT there. I could hear everything that was happening in the nearest rooms like flushing the water in the toilet, or someone taking a shower, and to make things worse, we had a neighbor who was coughing all night and every time he coughed, we woke up. In the next morning I went to the reception and asked if we could get another room, and we got it as there was one free. It was now in the 2nd floor and next to the stairs. We now could hear noises when someone was jumping the stair steps like a maniac, and there were many people doing that…", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r302326961", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Summer vacation in Mallorca", "review": "Dear Aigars,  Thank you very much for your opinion! We are sad to hear that this time you were not 100% satisfiyed with your experience at the BQ Hoteles. We will bear your opinions in mind and hope to have the opportunity to welcome you back again in a future to provide you the good experience you deserve.  With warm regards,  BQ Hoteles.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r296256920", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Relaxing Hotel", "review": "We were here this August. The hotel looks nice and clean. The double rooms are rather small but bright and looking nice. They are cleaned each day. WiFi and TV works perfectly.  The staff here is rather helpful and nice but there were few exceptions to this.  There is a good choice at breakfast which is good because some things are not really edible (scrambled eggs, sausages or coffee). There is some choice of food for lunch or dinner in the lobby bar but not very tasty. The swimming pool is nice and not busy at all.  All in all, the hotel is good for the price and I wold come back here or choose it again but I wouldn't rate it four stars. ", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r295231908", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Fantastic stay", "review": "Lovely place, very modern, super clean and very well located. Breakfast was great with much variety and attentive waitresses keeping the stock replenished and dining rooms clean. Nice little pool too although the majority of the sun loungers don't get the (summer) sun until the afternoon. Would definitely stay again ", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r294165893", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "4 star hotel?", "review": "Dear guest,  Many thanks for your nice opinion! We are very happy to hear that you had a good experience staying with us at the BQ Amfora Beach Hotel! We are also looking forward to welcome you back again very soon and to provide you a good experience!  With warm regards,  BQ Hoteles", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r288069834", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Lovely hotel perfectly located for a short, relaxing holiday", "review": "I stayed there for 2 nights. Good thing was that it was a new building and very close to the beach. Rooms were with balcony, sound proof and had comfy beds. but it was very tiny. Staffs were ok, but some of them were not so friendly. The breakfast was not something I would expect for the 4 star hotel. It reminded me of food from a school dormitory.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r288004002", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Lovely modern hotel", "review": "Dear Hyewon,  Thank you very much for your nice opinion. We are happy to hear that you had a good time staying with us but we hope to have the opportunity to welcome you back again very soon in order to give you our best.  With warm regards,  BQ Hoteles.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r287941934", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Cute renovated clean hotel", "review": "Stayed there for a week in the end of may. The hotel was perfectly located, very clean and beautiful. Juan the bartender was amazing and provided the best service possible and also the pool guard he was super nice! The only downside was that the rooms were smaller than we expected and that there is no restaurant at the hotel. Would definitely stay there again if i would return for a short visit in mallorca.", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r284189489", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Lovely Relaxing Place", "review": "I really liked this Hotel there was a relaxing atmosphere about the place. The Pool was nice and never to busy. The rooms were cleaned to a good standard and the bed (most importantly) was very comfortable and I will go back next year I liked it so much and can pastilla as a place. The Breakfast was very good lots of choice couldn't find any faults really..happy days", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r281371667", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Super", "review": "Dear guest,  Many thanks for your nice opinion! We are very happy to hear that you had a good experience staying with us at the BQ Amfora Beach Hotel! We are also looking forward to welcome you back again very soon and to provide you a good experience!  With warm regards,  BQ Hoteles.", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r281276266", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great deal!", "review": "Great hotel, not exensive if you book on time! The breakfast is great, rooms are cleaned everyday. The staff is friendly, willing to help. I recomend it! Nice small rooms with terace, tv...comfy beds and no noise at night!", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r281103437", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Fantastic hotel", "review": "Dear guest,  Many thanks for your great opinion!  We are very happy to know that you had a good time staying with us at the BQ Amfora Beach Hotel! We are looking forward to welcome you back very soon,  With warm regards,  BQ Hoteles.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r272291984", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "A gem of a place", "review": "Hotel is newly renovated. Rooms are a bit small but clean and bright. Cleaning is very good. The staff is very nice and willing to help.The breakfast is really good. A lot of things to choose. Everything fresh. When we arrived I was worried because of the noices from the airport, but at night they stop it. Really recommended.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580295-d571609-r266376757", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}]