[{"title": "Nice", "review": "Good value for the price. Free parking near the hotel. Clean room, I missed mini bar or fridge and storage shelf in the bathroom. Nice personnel, excellent coffee and good choices at breakfast. Just missing fresh season fruits (grapes, for example). ", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r718199158", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Perfect family hotel", "review": "Staff was very friendly, rooms clean, breakfast gorgeous. WiFi connection very good. Hotel is located on the hill, so You need go down to Torbole, but on bicycle is not a problem. Hotel has also bicycle storage.", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r714903687", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Beautiful stay at Garda Lake", "review": "We spent 6 days at Garda Lake resort. Staying in Nago-Torbole was very pleasant for perfect hospitality at the hotel Zanella and wonderful surroundings of this Italian village. The hotel is very old but is hold at good level of all services, is perfectly situated in ancient village. Staff was very helpful and kind, all hotel was very clean. Some defects as non-functional socket inthe bathroom wasn´t  so important.  The only question is why is called ECO. Breakfast was sufficient and dinner was absolutely  delicious. Perfect place for Italian holiday. ", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r708700969", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Excellent", "review": "Wonderful experience! Superior service, clean rooms and everything, friendly staff! We have already planned for our next fammily trip to go back there. Can't wait to go back to that wonderful Hotel Zanella. ", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r708036935", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "not worth 3 stars", "review": "rooms uncomfortable, way too hot and lots of noise from outside, no private parking nor private beach,  super mini balcony with rusted balustrade, dirty shallow swimming pool, no sun beds, not friendly at reception  ", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r705693020", "sub_review": {"Value": 2, "Location": 3, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Very basic hotel.", "review": "The hotel is very basic & dated. There was no wardrobe in the bedroom to hang the clothes,only a type of wardrobe with shelves. It does have ensuite, which is extremely small. To get in the shower you need to walk in sideways & you can hardly turn around in it. You also need to squash in beside the toilet to open the ensuite door. The hotel doesn't have air conditioning, while I was there it was extremely hot. The bedroom window has shutters, than curtains.  I did find the breakfast waitress had a attitude as she doesn't understand English very much. Even though the hotel states English speaking.  Breakfast was continental, which I noticed it's set out the night before. The pool area is clean, but don't have sun loungers only chairs. You not allowed to go around the pool area…", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r688178122", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 2}, {"title": "Lake garda saga trip.", "review": "Just back from a saga lake garda trip. The zanella hotel was rather dated to say the least bedroom very small but clean.The staff seemed uninterested( except for our lovely waiter).Coming onto the food to put it mildly this was very poor!Breakfast was the same every day with leftover food from previous nights dinner put out.Our packed lunch was uninspiring with again leftover food in it! Apart from dinner on the last night dinner was awful, we complained one night to be told that the fish was fresh and all the food was fresh...this was certainly not the case as all the vegetables were tinned or frozen.We enjoyed the trips out but as we were fully inclusive did not bank on spending much on food but this was not the case. Rather disappointed in sagas choice of hotel.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r679754398", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Average hotel", "review": "We stayed 4 nights on a package deal.  The staff were very friendly and helpful and the cleanliness could not be faulted. However, the front of house seem to go missing from time to time during the day, so help is not always available.  Our room was alright, but it was tight to walk round the bed. The furniture is basic but functional. We had a shower, no bath, in what was a very very small space. The shower was smaller than on a cruise ship so if you dropped anything, it stayed there until you got out. They didn’t have the wider range of bathroom essentials usually associated with 3 star hotels. There was no tea or coffee making facilities in the room and there was a €5 deposit to use the safe. Only 2 English news channels available RT and France 24, and the maximum volume was…", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r677307732", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Hotel experience", "review": "Nice and hospitable place to go to. Nice people and nice spacy rooms with a great breakfast. I recommend this hotel for families but also for couples. It has a convenient location within 5 minutes drive from Torbole. ", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r622121158", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 3, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "All inclusive except water", "review": "Fawlty towers makes this place look great. 3 days out of 4 we had no water in shower. All inclusive doesn't include tea coffee or water. Hotel owners make Basil Fawlty look like he has excellent customer service skills. Far better off going for decent half board rather than this shambles.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r616534554", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Big surprise", "review": "Random accommodation has become an unforgettable experience. Excellent service, staff access and delicious breakfasts. I strongly recommend this place, I will definitely come back again in the future.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r615502440", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Worst owner and hotel ever.", "review": "The most awful hotel there. First, when we were moving to the hotel - there was some accident on the road. And all cars stopped, as hotel is no 24/7 and receptoin works only to 00 - after 2h and 40 mins staying on road without any movenent i called to hotel and told them situation. They told they know and also no1 cant move out of hotel cause roads are blocked, but they dont care and if i will not arrive in time - they will charge money anyway. Ofc i could solve it with Hotels.com directly, but we arrived in time. Second, as i travel with car - parking is thing that 100% needed. This hotel is with free parking option. But he doesnt have it. They have \"garage\" for 2 cars and 5 euro per night and free city parking in 400-500 meters u should go with luggage, cause that \"garage\" is…", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r601592088", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Lovely quiet retreat", "review": "Hotel Zanella was a lovely friendly retreat in Nago, a few km outside of the more touristy area along Lake Garda. From Nago, there is a lovely view of Torbole and Lake Garda a short walk from the hotel. Nice pool, bar and breakfast. A bus will take you into Torbole if you don't want to drive or walk.", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r581066174", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Let down by Leger", "review": "We stayed here for part of a Leger holiday tour, I have to say disappointed was an understatement, the rooms were so dated and bleak, no mirror, no tea making facilities, hairdryer and air-conditioning didn't work, the food was terrible, often cold and inedible, there was a huge bowl of sweetcorn that was brought out so often it was congealed at the bottom, the bar area was dismal and uninviting, the barman didn't seem to want to serve half the time. All inclusive was very strange as you had to pay for tea and coffee! I have to say its one of the worst places we have stayed, ourselves and a few more people in our group would have gone home if we could.", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r526573394", "sub_review": {"Rooms": 1, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Great", "review": "I spent a wonderful time by the lake. The hotel and the service was really great. The reception could be more punctual, but it is a small drawback. I also think that air conditioning would be a big convenience, because of the weather and a noise outside. ", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r517287133", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Very nice hotel at a superb location", "review": "This was our 3th stay at EcoHotel Zanella. The staff is superfriendly, the location is close to the Garda lake but not too close so you don't have to worry about the big crowds at Torbole and Riva. Top location, we will certainly come again!", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r503821491", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Lovely stay.", "review": "Very friendly staff, very helpful from arrival to departure.   We misunderstood were to pick up a key for a beach cabin, however the young hotel manager arranged for a key to be loaned to us instead of going back to the hotel to collect it.   Breakfast was a good cold continental breakfast with some meats, cheeses, hard boiled eggs, toast, pastries, fruit, cereals and yogurts.   The hotel was in a little side street, however we did not hear any noise except the church bells ringing on the hour from 7am, but it was a nice way to be woken.  We will be going back to this hotel.  I am suprised at the bad reviews, because most people are complaining that this hotel doesnt have 5 star features...but that is because it is clearly advertised as a 3 star hotel. And it does this well", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r502683388", "sub_review": {"Location": 4, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "5 star service ", "review": "We were pleasantly surprised by our impromptu visit to Garda. We had a car, which is useful and the hotel were helpful at finding us free parking.   Instantly we were greeted by friendly staff and went to our room. Yes it was basic. But perfectly clean and was easy to keep cool. We read some previous reviews and took our own fan. Only a small one, but was all that was needed.   The breakfasts is basic, but enough for an average person.   Also the hotel had access to private lockable cabins on the beach. We drove each day paying 1,50€ per hour to park. The area had a very clean toilet and each cabin had two chairs and an umbrella. All for €5. The beds on the beach were €6 each and €8 for the umbrella and our things were safe whilst we went for lunch.   The owner of the hotel (and…", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r502559974", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Disappointing", "review": "Travelled with Leger on an \"All inclusive\" coach holiday. Arrived around 10.30pm after a very long journey & given a quick meal at a designated table.Room was very basic... 2 single beds pushed together to make a double bed & a camp bed in the corner. An old fashioned analogue portable TV which we couldn't get a picture on & an equally old fashioned phone & shabby wardrobe.No tea/coffee making facilities, no air conditioning or fans & no mirrors or clock/radio. Several people travelling with us asked to be moved especially those who had paid a £150 supplement for sole occupancy. Food very basic and samey, no entertainment on offer except a small shallow unheated swimming pool.\"All inclusive\" was limited to a few drinks & only available between 6-10pm & didn't include…", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r492510122", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Part of a coach trip", "review": "A truly wonderful family hotel. The staff and management were very helpful when I asked for a room upgrade. The food was basic, but good healthy fare. The hotel is situated in a very cute little village with cobble streets and reflects the old and the new of Italy. The restaurant staff were excellent! Lots of nice places to sit outside or at the pool. the rooms were clean and basic. I had a good holiday chilling out in this lovely village of Nago.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r489531369", "sub_review": {"Sleep Quality": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Beautiful", "review": "Rooms clean, the owner and family were more than helpful. staff Daniel and Monique and housekeeper did not k now her name or the chef but nothing i was to much trouble. The menu and food was excellent. Would not think twice about staying again thank you for a fabulous holiday. Will be back.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r432154973", "sub_review": {"Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "leger all inclusive staying at hotel zanella nago", "review": "We arrived very late after travelling all day, the staff were very kind and produced a reasonable meal very late at night. The room was spacious and very clean, beds and towels changed every day. We were given a menu to choose from every day and as a very fussy eater I found the variety very good, there was continental breakfast and plenty of choice. The staff were excellent and coul not do enough for us, the packed lunches were not very adventurous but there was plenty to keep you going.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r423319795", "sub_review": {"Location": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Friendly Staff. Great Food.", "review": "Stayed there as part of our Leger holiday. Nice wee hotel with great food. Nice beer too. Was the ideal base for our daily excursions. A big THANKYOU. Would stay there again. It was nice sitting round the pool having a wee blether and drink with other couples on our tour.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r418894822", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great family run hotel", "review": "This is a really lovely hotel run by staff that really care about customers. All the staff were very helpful, and couldn't be more friendly. The food was lovely and varied using locally sourced produce with ample portions. The rooms were spotless with a lift to three floors and a small pool to cool off in. Plenty of room around the pool with seating for drinks in the evening, although there is seating inside and at the front of the hotel.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r418108444", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "great time at hotel zanella", "review": "this is really a lovely hotel. very clean and oldy worldy. the staff were so friendly and it appears that they love their jobs as they were always happy. excellent restaurant on sight and great breakfast. just a few mins drive to amazing lake Garda. loved this place", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r401632391", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Cosy, Family run Hotel, Loved it..", "review": "Had a wonderful time...Friendly staff, always willing to help. Food excellent with a local touch...small pool set in court yard, tables chairs and loungers..rooms cosy, a little old fashioned but I liked that..food always freshly prepared with ingredients from the local region..A pathway can be taken down into Tarbole, a little steep in parts but spectacular views...Free bus pass is avalible ....Very enjoyable stay..", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r382129585", "sub_review": {"Value": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely family hotel with friendly staff", "review": "We stayed here with a leger coach tour on an all inclusive basis. All the staff were very friendly and couldn't do enough for us. Continental breakfast was lovely, packed lunches were the same every day but I enjoyed them and evening meals were beautiful", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r371485721", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Well run, friendly and some vegetarian choices", "review": "Comfortable and friendly hotel for a relaxing or energetic stay, nice pool, good service.  Able and willing to provide vegetarian meals which whilst not exotic are more than adequate for a stay here.  Away from the bustle of Torbole itself but that can be a bonus!", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r368422388", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Lovely staff , very basic hotel. Holiday very disappointing", "review": "Stayed at this hotel with LEGER holidays, last week, 3-7 th October2015. Clean basic hotel, NO TEAMAKING FACILITIES IN ROOMS.  Arrived after 10pm. Told to sit where stated for entire stay. Cold meats, COLDcarrots and green beans, and 4 chips meal on arrival. Most things out of tins eg fruit salad and peaches at breakfast. No plug in sink in bathroom, Staff very helpful and friendly. LEGER ALL INCLUSIVE, A JOKE . Packed lunches, dry rolls with meat or cheese, free drinks include beer,wine, cola,disgusting lemon drink. Tea and Coffee 2 euro s a small cup !! Definitely don't recommend LEGER COACH HOLIDAYS.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r318249283", "sub_review": {"Location": 1, "Sleep Quality": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Clean hotel lovely staff but disgusting food", "review": "Eco values admirable. Food terrible starving whole stay. First night cold carrots cheap luncheon meat and four chips...not been much better since. Braised beef in red wine sauce was actually packet meat in watery gravy  Tonight stewed disintegrated broccoli with powdered potatoes and the oddest quiche.....leger all inclusive rubbish. Lunch is dry rolls and cheese or ham. No spread or salad in sight. Would rather pay for drinks and get decent food. Cheapest food I've ever encountered. No decent Italian pasta in sight. Extremely disappointed 😞 ", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r316649773", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Really disappointing", "review": "Having read reviews before going to this hotel with Leger holidays I was looking forward to the break. We arrived late about 10pm and were treated to a plate of cheese slices and meat and wait for it COLD. Carrots very nice after nearly fourteen hours on a coach, we only enjoyed one meal at this hotel, I think the people who stay here are used to packet, tinned and frozen food, oh and the portions are very small they're what we would give our ten year old grandson infact. One night we ate out because we always felt hungry after our meal at the hotel.  The rooms really need some TLC, no mirror, no tea and coffee making facilities, no fan or air conditioning, the bathroom shower was a bit grubby and the towels need replacing, no plug in the sink, these are just a few things we…", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r313788002", "sub_review": {"Value": 2, "Sleep Quality": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Very basic but friendly hotel.", "review": "We too stayed here with Ledger for our holiday. We did receive a lovely, warm welcome. However, we do like our nice rooms but this was not one of them. It was not just that the room was very basic but for the shower cubicle to be covered in hair is totally unacceptable!! I have rated this hotel average and not poor as the meals were quite nice and the staff were very helpful in particular Patrick who was simply wonderful, nothing was a trouble to him. He made what would have been very boring evenings in the hotel much more enjoyable.I feel that this hotel is much more suited to the older generation in particular with this holiday company as they enjoy a free bar until 10 pm whereas we are prepared to pay for the drinks we enjoy and when the free bar ends.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r313780860", "sub_review": {"Value": 3, "Location": 2, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great place to stay", "review": "Just back for an 8 day trip with Leger holidays staying at Hotel Zanella Nago Riva del Garda. Basic rooms but excellent food and service.  We arrived at Zanella at 22:00 and were greeted by a complimentary glass of beverage - white or red wine, beer or soft drink. Into a very late meal of Soup followed by roast potatoes, carrots cheese and ham. Breakfast is typically continental - Ham or Cheese, Bread rolls Toast boiled eggs and cereals. Evening meals were absolutely excellent! With plenty of choices. All waiter served not a buffet. Rooms are clean but a little basic, TV was a small portable TV from the last century but we didn't want to watch TV anyway. Bed very comfortable. Be prepared to be woken by the 07:00 chiming of the lovely church bells! Didn't use the pool but it was…", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r313598062", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Absolutely lovely", "review": "We arrived during the evening and were welcomed with real warmth.  Our room was clean and the bathroom larger than we expected which was great as there were four of us in the room.  The breakfast choice was great and always being topped up.  Service as the bar and around the pool was brilliant and the staff were fantastic. The hotel position was wonderful and as a family we walked down to and up from the Lake everyday although there is a bus stop very close by which takes you down to the Lake.  The hotel has a supermarket literally metres away as well as a small but very modern bar around the corner and a few nice restaurants to eat in around Nago.  We couldn't recommend this hotel more highly and would definitely come back again.", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r305586182", "sub_review": {"Sleep Quality": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Lovely traditional Italian hotel with fabulous food", "review": "We stayed at this hotel on a coach tour of lake Garda Venice and Verona. The hotel was delightful. Our room had a balcony overlooking the pool and the herb garden where we watched the chef gathering herbs for the evening meal. The owner , his sons and Danny the main waiter /barman were friendly and professional.  Our trip was all inclusive . The food was excellent . Fresh regional organic produce cooked to perfection. I tried things I never dreamed I would and enjoyed every thing. The home made pasta was fantastic. My husband not normally a pasta fan ate it at every meal. The wine was lovely both the red and white. Beer and sparkling water was good as well.  We hope to return again next year.  This is not your normal package tour hotel but an honest to goodness family run Eco…", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r281082243", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Genuine italian hotel", "review": "We arrived very late after a long journey and was welcomed with a drink from the bar, hot soup and meal of ham cheese and chips. Our room was on the third floor overlooking the pool. Room was very clean, beds comfy and very clean linen. Bathroom was small but ok for us, shower a bit tight and difficult to manage as the wall bracket was loose, the handset leaked and would not stay in place also no shelf or anything to place shower gel or shampoo but the water was nice and hot.  Small basket of complimentary soap and shower gel available. Towels changed daily. Large mirror in bathroom, none in bedroom but this is a small family hotel. No kettle but that's normal for Italy, tea and coffee available at breakfast, can be bought at other times from the bar. All inclusive drinks now…", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r233819213", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "lovely hotel, fantastic staff and food", "review": "had a very warm welcome after along drive with leger holidays our room was large and comfortable with view of pool had wine beer and whiskey included food choice at breakfast and evening were great and all meals well cooked staff were very efficient not sure how they did everything would recommend taking travel kettle and sachets of what you like to drink hot and also mirror as only one in bathroom", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r231165429", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Relax in charming hotel", "review": "Hotel Zanella is full of charm.  The room we stayed in was delightful having duel aspect and being on the street side on 3rd floor gave us a wonderful view.  The staff were very helpful and went the \"extra mile\" to facilitate our needs, in particular when my partner was taken ill.  The cleanliness of the whole hotel was of a very high standard including the kitchen.  The restaurant menu did not give a huge choice but we were very happy with.  I would recommend and would happily stay there again.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r209606817", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "VERY FRIENDLY FAMILY RUN HOTEL", "review": "A 3 star hotel but has three things really going for it. The food is excellent very Italian with wine served in pots, the brothers who manage the hotel are nice guys, very helpful and seem to know what they are doing as does the rest of their team plus the draft beer is most excellent. Sure the towels are a tad thin but it is not the Ritz but it is value for money. The \" very basic \" review  2 miles from the lake is just wrong the hotel door to the lake side is 1.05 miles I ran down and back every morning during my stay  and if  fit and in kit you should be able to get back from the lake in 13 minutes. Coffee costs next to nothing in the bar so why would you want to drink it in your room. It is a good base for Lake Garda close to bus stop for those who can't walk the mile to the…", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r207013935", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very basic", "review": "Very quaint typical Italian hotel but - out of date bedrooms though very clean, there are no facilities eg mirror, fortunately we took our own travel kettle, towels are thin and worn.  Being 2 miles from the lake it's a long way down hill not very convenient.  Food was not very good little choice often cold OK if you like ham and cheese for breakfast and the packed lunch we had every day, Think Leger made a mistake choosing this Hotel I don't think they are equipped to cope with a lot of people very few staff but very helpful.  Actually travelled May 2015", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r205076681", "sub_review": {"Value": 2, "Location": 2, "Sleep Quality": 4, "Rooms": 2, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Good Base!", "review": "We have just returned from an 8 day Lake Garda Tour with Leger staying at Hotel Zanella, The hotel was Clean & Basic but we enjoyed our stay here. The only downside for us was the food. Neither my husband or myself eat red meat, on the first night we arrived late approx 9.00pm the meal that evening consisted of Soup to start which was cold, 5 chips! cheese & Ham, we told the waiter that we did not eat meat, he told us no problem and brought the plate out again with a different cheese added! We were not impressed but made allowances for our late arrival and hoped that the food would improve the next day. Breakfast was typically continental, it was ok, Dinner that night was a vast improvement everything was hot but meal size was very small, we asked for vegetarian and received a…", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r204975567", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Homely italian hotel", "review": "Great location with friendly and helpful hotel staff throughout our stay.  The food was good and better than expected with a varied choice at breakfast and evening meal.  The gala dinner on our last evening was fantastic.  The bedroom and bathroom were clean, we did however bring our own travel kettle etc. as I like an early morning cuppa and know that some hotels do not provide this in warm countries.  I could not fault this hotel which was situated in a quiet setting with a lovely courtyard and small swimming pool.  The church bells added to the charm.  I would definitely like to return - a lovely Italian hotel in a beautiful area, highly recommended.", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r201704205", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great Little Italian Hotel", "review": "Just returned from a week long break at this hotel with Ledger coach hoildays. It is small and welcoming hotel and the staff are very pleasant. Stayed with my husband and daughter in a double room with an adjoining  twin bedroom for my daughter. We only had a shower in the bathroom, would have been nice to have had a bath as well. Hairdryers were in the bath room and the only mirror. The breakfasts were simple continental style,with the usall breads and meats. We had evening meals included and where more than pleased with what choices we were given.We were supposed to be All Inclusive but we're disappointed with Ledger as we were limited to red wine,bottle beer,lemonade,cola and water. As i only drink white wine I had to buy this from the bar. Basics like tea and coffee were…", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r201275516", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Comfy family hotel in a quiet location", "review": "Spent few days at the hotel, rooms fairly spacious and very clean. Staff were very friendly and helpful, food was good and tasty. No tea and coffee making facilities which would have been nice in the rooms. It was noisy if we left the window open as we faced a main road and there are church bells few times a day. The pool area was nice and relaxing but pool only small. It was in a small village away from the main tourist area but there were buses into torbole and riva del Garda.  I would stay there again though.", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r201216160", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Wonderful Family Hotel in Garda Lake", "review": "Great location, great service in a familiar and cosy atmosphere. We loved the eco-philosophy and the breakfast made with love and eco-products. We definitely recommend it and would come back when possible! Hugs to the Detoni family!", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r187027382", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Beautiful weekend at the tip of Lake Garda", "review": "We spent 3 days at Eco-Hotel Zanella. The staff is really friendly and helpful, it felt like home. The room was nice and very clean with a balcony facing on the private garden. Although the pool is small and not very deep, it is relaxing to sit outside at the table with a drink and enjoy the tranquility that surrounds the Hotel.  It was fascinating to see how the whole staff is involved to support the eco-philosophy.  For breakfast the hotel offers a buffet with different kinds of organic food.  The beach is about 2 km from the house (that was not really convenient) but it is nice that the hotel has a private place on the beach with cabins and toilet. Also, the hotel is surrounded by beautiful mountains and there are several trails that arrive at the top of the peaks with…", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r130224831", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A quiet position", "review": "This hotel is situated 2 km from Torbole at the top of a steep hill. If you would like the quieter version of Torbole this would probably be ok for you. It was basic accomodation and the breakfast consisted of standard fare. Rolls, cold meats, cereals etc. This hotel was very popular with German and Italian tourists and the reception staff could speak these languages and also English. The pictures often include a picture of a private beach. This does exist but is deceiving because it is over 2 km away. Also the swimming pool is only about 1m deep and is quite small so if you are booking for beach and pool facilities then be warned! Having said that we stayed 2 nights and it was a pleasant enough stay. ", "date": "June 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1057206-d571739-r5333188", "sub_review": {"Value": 3, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "", "rating": 3}]