[{"title": "Fantastic place to stay!", "review": "We stayed for the weekend & could not have chosen a better place! The hotel is charming, a 16th century palace just a short distance from the castle. The owners & staff are welcoming & lovely! The chef is brilliant - food, wine & service excellent. A very homely atmosphere. It was Sabiote's Medieval Fiesta & we were in the heart of it. Fabulous weekend in a fabulous hotel! Would recommend it to everyone!", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080303-d574117-r579273049", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Tasty homemade diner", "review": "Here cooks the sister in law a nice Andalusion soup and fresh beans. It’s a very attractive hotel with a good room in the middle of olivehills near a castle. Breakfast is served at the table with eggs, toasted bread, juice, manchego. ", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080303-d574117-r576787283", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "a small family hotel next to a castle.", "review": "The rooms are fairly ordinary, but quite spacious,and the hotel has a real old charm character, with wonderful views of the patio, the castle and the mountains. The owner, Manolo, is really friendly and  extremely helpful. He showed us on a map how to drive to Ubeda, where to park there, and where to catch the tourist train or take the walking tour. His expert advice absolutely made our holiday, we could never have seen so much in a few days without his advice.  The staff are all friendly and helpful. Breakfast is a simple continental style, and we ate dinner in the restaurant twice in the 3 evenings we were there. Good local food at a reasonable price.", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080303-d574117-r436534804", "sub_review": {"Sleep Quality": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Manuel, the owner, gives great personal service", "review": "We had visited this small historic walled village a month earlier and met the owner, Manuel, at that time. He gave us a tour of the hotel and we stayed for lunch on the patio.   We returned in late September to spend two days in the area and the night at the hotel. As expected, Manuel, his wife and his small staff were on their game, providing us with congenial hospitality.  We decided to have dinner at the hotel as Manuel told us he was cooking his famous lamb dish. OMG! The lamb was extraordinary! He personally selected an excellent wine to accompany the dinner. During dinner he took time to visit each table of diners and chat with them.  The breakfast is the traditional Spanish bocadilla with choices of toppings, coffee and juice.  We left with a warm spot in our heart for the hotel, its staff, and, of course, Manuel! …", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080303-d574117-r424404734", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Wonderful atmosphere ", "review": "We stayed here on a deal with dinner included and it was very good. The food was very traditional which we enjoyed and makes a change from the usual.  The accommodation is quaint, clean and has all amenities.  The hotel is right next to the castle and we were allowed a look around for free in the evening, the views of the olive trees was immense. Never seen so many Olives! Nothing else in Sabiote so a car journey to Ubeda is the other option. ", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080303-d574117-r385860912", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Visit to my mother's birthtown. ", "review": "The owner family 👪 are the most friendly, kind and service minded I have ever met! They take great pride in their town Sabiote and this beautiful region of Jaén, Andalucía. This is our second visit and they opened up for us on their holiday. ", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080303-d574117-r384811302", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Anne &David Stevens", "review": "The owner was very friendly and most helpful.  He even suggested a route home to Alicante given the inclement weather. Would certainly like to return again to this charming and comfortable hotel. The hotel was was just a few minutes away from the information office and the castle which made things very convenient.", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080303-d574117-r348149812", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Pleasant stay in olive country", "review": "While we were aiming to visit Ubeda we found ourselves back in Sabiote, a small, authentic, white and very quiet Andalucian hilltop town. Sabiote is about 5 km North from its large and more well-known neighbor town. The road immediately under the old city wall near the old castle offered stunning, at least 80 km views of Andalucía. In the far distance several Sierras including the Sierra de Cazorla and the Sierra Magina were visble, more close by millions (?) of olive trees. The only industry you will notice in this part of Spain are olive oil factories.  We liked our stay in this old atmospheric palacio. Unfortunately, staff spoke amazingly little English while our Spanish was even far more worse, but as usual this was not a problem. The room was not luxurious but overall…", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080303-d574117-r323990155", "sub_review": {"Location": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A hacienda that managed to maintain its local charm.", "review": "I've stayed here for one day while traveling through Andalucia. The hotel is located in a quiet village (felt like we were the first tourists to ever visit as we were being watched by the local villagers), yet close to cities such as Ubeda and Baeza which are definitely worth visiting.   The hotel is more of a hacienda which managed to keep its local charm. It's being run by a family. Their English is not fluent but we managed to have some conversations using our bad Spanish and mainly invented kind of sign language. The rooms are big and charming with high ceilings. As it is a hacienda the windows are very small and you will not have a view. It also makes the room a bit dark.  We also had breakfast but the menu was already decided for us. We had juice, cake and a toast which we…", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080303-d574117-r281209072", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Best option to stay if you are visiting Ubeda, Baeza and Jaen", "review": "Palace of the XVI century very well set up as hotel. Clean and comfortable. Excellent restaurant (taste the oilve oil icecream). English enough to be hosted there (at least for non British like me), but not to talk on the phone. The staff are leaded by the family who ows the place. They treatment was polite and friendly. Sabiote is a pretty village of the Middle Ages. It is very interesting attending an olive oil tasting in the area (the hotel has information)", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080303-d574117-r267580517", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Relax en una ubicación privilegiada.\rChill out in a charming and convenient place", "review": "Nos alojamos en el palacio el pasado fin de semana. Ubicado en pleno corazón de Sabiote a tan sólo un paso del castillo, la iglesia y el recinto amurallado, disfrutamos de unos días de descanso y visitamos Úbeda y Baeza. Escogimos el lugar a través de un bono Smartbox que nos regalaron por lo que no podemos opinar sobre el precio. Es un buen lugar donde pernoctar y merece la pena pasar el día en Úbeda y Baeza y degustar la cocina local.  If you are looking for accomodation near Ubeda and Baeza and a place to chill out, don't hesitate and book a room at this hotel. Sabiote is a small hospitable and charming village with the largest castle in the region. It's worth visiting. The hotel facilities are spotless and the manager is kind.   There are many restaurants in Ubeda where you…", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1080303-d574117-r230595041", "sub_review": {"Value": 4, "Location": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "", "rating": 4}]