[{"title": "Would come again", "review": "I have only nice words for the Guya Wave Hotel. I had a pleasant stay with my husband in period - end of September beginning of October 2019. The room we stayed in was very spacious and bright. The rooms  and the whole hotel are clean. Friendly staff. Good food to everyone's taste. Great hotel location  for both those who love shopping walks and those who love the beach. Everything is simply accessible to you. Thank you Guya Wave Hotel. My family and I would gladly come again.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d584451-r716305851", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Fits younger party people", "review": "Younger adults/teens from Germany attend to stay here, and could be very loud and noizy at the pool area and at night.  Plastic sheets in bed (the plastic sound woke me up every time I turned in my sleep). Great breakfast and drinks for the all inclusive, but I wouldnt pay for the lunch, dinner, snacks for more than one day.  Great staff! Friendly, helpful, and funny! Very interested in making our stay as good as possible, I personakt think that we got special treatment as a couple and that the staff was tifed of serving drunk teenagers.  Great location in the middle of the beach and the harbour/city. Also totally ok to rent a car at the hotel!", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d584451-r689014741", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great hotel", "review": "Thank you so much for your comments that make us to improve every day. We take note of every suggestion you have written. Kind regards", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d584451-r688125292", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Guya wave", "review": "I stayed at this hotel for two weeks and I was pleseantly surprised by it. It has modern and spacious rooms with bright colours and comfortable beds. The food is fresh and it has enough choices so everyone can be satisfied. It has enough variability so it doesn't get repetitive during the stay. There is a nice outdoor swimming pool next to the garden. The visitors are mostly young and middle aged people from Germany. The staff is very helpful and friendly. It is a great value hotel and you can't expect better for it's price range.", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d584451-r672629838", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Pleasant stay at Guys Wave", "review": "Thank you so much for your comments that make us to improve every day", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d584451-r622905245", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Central location, great helpful staff", "review": "Spent a week using the hotel as a centre for hiking and cycling the area. The area is lovely with small bays and hills all around. Offered bike storage by reception staff, all staff were friendly and helpful. We never experienced any issues with rowdy teens and the few late night revelers were not too bad for noise. We took half board the breakfast and evening meal were very good with a chef on hand to cook fresh egg choice for breakfast and fresh meat / fish for the evening meal. Would recommend a stay here.", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d584451-r582024719", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely hotel, Value for the money and would stay again", "review": "Stayed at this hotel, Clean rooms, Spacious room, Food a good range and selection, I would stay in this hotel again Clean towels and bedding every morning Come and go as you please  Breakfast and dinner served at reasonable times,", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d584451-r527795452", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Noisy german youth-party", "review": "Dear guest, thank you very much for this review and the recommendation of our hotel. We look forward to welcoming you soon.  best regards  Guya wave Team", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d584451-r505355070", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Would stay again ", "review": "We booked this hotel with danish travel agent \"Spies\" under the notion of being a \"adults only\" hotel.   Nevertheless the hotel was full of german youngsters (15-20 years old) who was there to party (!).   The pool and our balcony was a no-go for us because of loud youngsters and their euro-techno / deutsche schlagers / arabic pop.   The hotel had a guard patrol the floors at midnight to close the parties - leaving the loud speaking for a couple of hours.   From 2.00 to 5.00 at night young people regularly comes home knocking on doors, screaming in the open areas on the floors and sometimes tuning up the music.   We cannot recommend this hotel - unless you are 18 and there to party? ", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d584451-r499250132", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Great location", "review": "Stayed here all inclusive on a girly long weekend , for what we paid it was great Value for money .clean modern spacious . All the staff were very good polite and hard working . The transfer was a little long but we knew it was going to be by reading previous reviews, it was well worth the transfer it took us approx 2 hrs from airport to hotel but just 1hr back to airport .The town is dominantly German to the point we were asked on two different occasions why we were there and not in Magaluf !! Apparently the English go to Magaluf and the Germans go to Cala ratjada  .At times The different German groups did take  over the pool area and set up camp with their too loud 80s style ghetto blasters ... once they had too much to drink they feel the need to clap their hands and sing…", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d584451-r496667000", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Average", "review": "Me and my friends booked this place because the photos advertised were great and the hotel was advertised better than it actually was, we paid for a superior room, which is the photo advertised at the top (and on the website), we don't believe we got a superior room because the pictures didn't match, there were multiple problems with our room and even though we complained multiple times nothing was fixed; the Air Conditioner didn't work, the shower flooded the whole bathroom floor, the bathroom door didn't shut- so we had to use towels to keep the door shut. The food here is very repetitive, nice! But very similar every day. This hotel and area is very German based which didn't bother us, it was nice to meet people from different countries, but there was no one English to talk…", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d584451-r495908511", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Good for the price. ", "review": "Me and three friends stayed a week (Sunday-Sunday). It was a cool hotel.  Was Kind of weird that we had to pay for the safe, remote to the tv, refrigerator and other things. We had all included, if everything where indeed included why pray tell dis we have so many other costs?  We only had one big problem, we where sitting on the balcony of one of our rooms and were playing cards. All of a sudden the hotel nighty came out and started yelling  and shushing us. We went down and where told that if we stay outside on the balcony he would call the cops. He then proceeded to tell us it is forbidden to be outside at night on the balconies. I was definitely flabbergasted. I travel a lot and also work at a hotel and have never heard such a thing. The next day I talked to the hotel…", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d584451-r489432058", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Great service, squeaky clean, new, attractive decoration!", "review": "My wife spent a couple of days in this newly refurbished 3 star hotel, just behind the main street. We tend to stay in 4 or 5 stars when we travel, but we're delighted by our experience here. The place looks brand new, (it isn't), the owners have done a great job of making the hotel bright and pleasant. I'd been warned that Cala Ratjada could be a bit \"lively\" in the evenings, but to the contrary, this hotel was a haven of peace! The guests were a lot younger than us, and predominantly German. The dining area and bar were relaxing, with excellent background jazz music. The buffet style meals were copious and fresh. The pool was impeccable, with plenty of sun beds to recover from the last evening, and prepare for the next!", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d584451-r488043762", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Spotless and very friendly", "review": "Stayed for a week Mid May 2017. Very modern looking interior ,clean Hotel. with very helpful staff. Superior room was huge, with separate lounge/bedroom. large shower/toilet etc. Food was ok, but a bit repetetive, but for a very reasonable price was more than exceptable. Only moan i had was, although i'd booked a superior room, this was not on the west facing pool side. A transfer was available to that side at 70 Euros, but just for a view of the pool and some tall trees, wasnt really worth it.Minor moan, i know. Resort appears to be probably 95% German orientated, so dont bother trying to find somewhere to watch any English Football ! All in all, great placve to stay, midway between harbour and beach.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d584451-r486335376", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Amazing customer service", "review": "We had a problem with our hotel in Cala Rajada as we couldn't stay one more day and our flight was in the evening. We came to Guaya Wave and they were so great ,they let us stay at the pool and they gave to us a free towel,so we spent a whole day there. We would like to thank to an amazing guy from reception (I think his name was Umo) Thank you very much for your help. i would recommend this place 100 %", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d584451-r437492001", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great stay at the Guya Wave Hotel!", "review": "We stayed here in late October as a family of three along with friends and as others have said, rooms are very spacious and clean with towels changed daily if needed. Transfer was a bit lengthy at around 2 hours 15 mins. We were all inclusive and food was very good although not as wide a choice as we've had in similar priced hotels elsewhere. Staff work very hard to please everyone and we would happily recommend staying here. Perhaps my only slight complaint would be that there were no 'bar snacks' as such just a few biscuits put out at tea time. We have been used to bar snacks in the afternoon serving hot dogs, burgers, pasta dishes etc. which is ideal if you go out for most of the day and miss lunch. You can get back mid to late afternoon and know you can grab a bite to eat…", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d584451-r431563212", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "What a difference a refurb makes.....", "review": "Shhhh, don't tell everybody but the refurbished Guya Wave, formerly the Guya Mar,  really is rather good these days.  My partner and I have just returned from an 11 night / 12 day half-board stay and have been really impressed with everything about the place. The rooms are sizeable, clean, light and airy and all have balconies, fantastic for people watching. The bathroom is spotless and the shower is a thing of beauty. The staff, from room maids to restaurant to reception, are wonderful, always helpful, friendly and knowledgable. The restaurant, buffet style, offers wholesome and hearty food with plenty of choice and always something freshly cooked on the grill. Hotel located halfway between the harbour and the beautiful Agulla beach, no more than 10 minutes stroll in either…", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d584451-r431513315", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Just cannot fault it .", "review": "We arrived at the hotel at 11.30 p.m. only to find that our suitcase had been taken from the transfer bus. Ralph from reception tried to reassure us that it had more than likely been taken by mistake and we would receive within a couple of days. We were then brought into the  bar and restaurant area as they had prepared food for us. Nice touch. Then the icing on the cake was to be told that even though the bar had closed we could still indulge in the all inclusive drinks. Very much appreciated due to our missing case. Anyway, to cut a long story short, we never found our case even though Ralph, Udo and Magdalena from reception phoned the bus company, airport etc EVERY DAY for us. The food was hot, very well seasoned and a very varied menu. Manolo, the head chef is so proud of…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d584451-r430675540", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely Staff and Holiday !!!", "review": "Me and the wife went to Guya Wave Hotel on 17th September for 11 nights and spent her birthday whilst over there ...  A few negative reviews and many positive ones and all I can say is a holiday is how you make it and as you're abroad things are never like back home so expect that.  The transfer from the airport was approx 2 hours and got the hotel at 2am. The night Porter who checked us in didn't speak English which wasn't too bad as we got to our rooms with ease. The next morning we went to reception and the staff spoke very good English and ensured we were given the correct and then gave all the necessary maps etc and details about the local amenities.  The hotel is very clean like very very clean. We found no creepy crawlies or dirt / dust which shows the staff clean the…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d584451-r423888114", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Overbooked, terrible customer services", "review": "Where do I start, I booked my room over 3 months ago. We arrived at 0100hrs from the airport after a long drive.  Upon check in we were informed, there is no room for us and we will have to stay at the sister hotel. We couldn't be bothered arguing as I was tired and four months pregnant.  We got taken to the sister hotel which was awful. The room was tiny and claustrophobic, TV was  taped by duck tape to the wall, insects and  ants throughout the room.   We got moved to our original hotel the morning after and finally checked in at 10am.  My partner complained to the manageress, as we were not pleased by our experience so far, so asked for a refund for the first nights stay as I think that is reasonable as we did not stay at the hotel we booked and stayed at a dire sister hotel.…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d584451-r422969179", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Lovely hotel", "review": "It was my pleasure to spend a couple of days in this fabulous hotel. Rooms are large and clean, beds comfortable, staff friendly and kind, food really good and delicious. It has perfect location, near to the beach (which is one of the top 10 beaches in Palma De Mallorca) and also next to market, near restaurants and bars and at the same time, peacefully for sleeping during nights", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d584451-r421719361", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "LOVELY WEEKEND", "review": "Hello  First of all, its been a pleasure to stay a few days at Guya Wave Hotel. Lovely place, good food and also the staff really friendly and helpfull.  I will be coming next year with my friends.  Thank you.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d584451-r414322230", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "nice spot", "review": "arrived here with my mother 19th may..bish bosh bash..all inclusive wristband on..room key..drink in hand..all very quick...nice airy clean spacious hotel modern situated on road street ,,loved that... balcony good enough space 2 chair/table ..sun there early early .till 1 oclock,,,,had no trouble sleeping at night,,didnt get woken so would say although on strip road still quiet with cars n people around.  rooms good fairly big tv..english channels but not many..remote free(20 euro) deposit..bathroom included hair dryer free toiletries,i had standard room,air con,2 single beds(very comfortable) sofa,,and nice light quilts which i prefered to other hotels bedding,nice big comfortable pillows,and shouldnt fail to mention nice huge full length mirror on wall..perfect,,  Breakfast…", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d584451-r394712399", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Awesome hotel", "review": "So we stayed at the Guya Wave for a week, and had booked it as it seemed very good value for money. We were not disappointed, it is a lovely hotel, comfortable, with free air con and great interior design. The showers are amazing too.   The area is stunning, there are 3 beaches within easy walking distance.   There is a variety of nightlife nearby ranging from bars to a handful of clubs. The hotel does attract a younger crowd, but we are young at heart so it didn't matter! ;) it may have had something to do with many Students having finished exams at the time we went.   Little tip - many people abandon sun parasols for the beach at the hotel when they head home, which the hotel then resell at half the price if you fancy a bargain.   Will definitely go back to this hotel and…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d584451-r391877318", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Amazing!!", "review": "I have just returned from a one week stay at Guya Wave Hotel. It was our first time in Mallorca and we were very pleased staying there. Lovely hotel with nice atmosphere and perfect location, ten minutes from the amazing Cala Agulla beach and two minutes from all the shops in Cala Ratjada. Our room was comfortable and very clean, and the food... delicious. We enjoyed the gym and the inside pool. The hotel staff were very kind, helpful and very friendly. We definitely recommend this hotel and hope to return there soon!", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d584451-r390713625", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Between Hostal and Hotel", "review": "Clean, friendly staff, cheap, breakfast okay, Pool okay but not very cosy. 90% of guests 16-20. a bit to loud in the Night. But we would come again because the balance between Price and quality is very good. Location also ok, 10-15 minutes from the beach. 5 minutes to Bierkönig. ", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d584451-r386884473", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "guya wave has a lot to offer british travelers", "review": "staff are more than helpfull,any request is delt with as quick as possible.my fourth year there june 14th 2016.ralph and udo have become personal friends now,very helpfull in any situation that may arrise.the food now is very good and is cooked fresh on a hot plate infront off all its customers.the rooms are exellent,very roomy and spotless.would highly reccomend the guya wave to any english customers.it is situated with easy access to the harbour and beaches.i plan to return yet again in october.good value for money and a beautiful part of the resort.i would rate this hotel the best in the resort for young and old", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d584451-r385271706", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Pros and Cons", "review": "Pros: The hotel buildings and rooms are beautifully renovated and spotlessly clean all the time.   The food (medium sized buffet) is fresh , delicious, and never running low. Cereals, croissants, yogurt, fruit, cooked breakfast all in the morning. Salads, cooked meat and vegetables, fish grill, and deserts in the evening.    The staff work extremely hard (Alex in the dining room has an incredible work ethic)  The pool area is mainly tranquil and relaxing.   The beach and the marina are 10 minutes walk away.   Great value for money.   Free air con and free wifi in reception.   Cons:  The Cala ratjada resort is aimed at and attracts large single-sex groups of loud Germans. They can be disruptive in the evening if you're trying to sleep and generally in an evening in parts of the…", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d584451-r383261957", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good value no frills hotel", "review": "wanted a budget getaway in Spain and found this hotel on teletext holidays. After a pretty uneventful flight from Gatwick it took nearly three hours on the coach to get there as they tend to drop off last and on the return pick up first. I arrived at three in the morning and the security arranged some food and the keys to the room.  It was spacious and clean but you have to pay for aircon and a small fee for the TV controls.  The resort is ninety per cent German and I have found that this is a good thing as they tend to get a better standard of hotel. The food is basic and well cooked with a choice of cooked breakfast and continental in the morning with juices and tea and coffee. I stayed half board and this was the only time you can drink tea and coffee included in the price.…", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d584451-r381931598", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Gaynor Hennessy ", "review": "Thanks for a lovely short break.  The hotel was clean and very reasonably priced. Food was nice but as it got busier towards the end of the week the grill chef needed to be faster cooking. Hotel staff very friendly. A bit noisy outside in the evening but that wasn't the hotels fault just passing groups. Not really catered for socialising in the evening so you'd need to go out and about.  Didn't use the pool as it was quite a small area and I rather the beach.The only reason I wouldn't go again was the two and half hour transfer time but other than that for £237 for five days half board you couldn't go wrong.  ", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d584451-r378518664", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "short break", "review": "Just returned from short 5 day break.Greeted by friendly helpful reception staff on arrival(udo) room was fine but not on top floor as requested and was subject to noise from other Guests above floors. We were on First Floor.Room was road side not a problem.We choose half board as like to support local restaurants.Some do need to up their game and cater for other nationalities not just germans,no problem for us pleasant change for english to be in the minority,having said that one of the most customer focused resturants was german run and catered for many nationalities even spanish, the Hotel was at fault it has to be said .I understand from talking to friendly hotel manager that this is something they are aware of and will be addressing it at the resort hopefully.Hotel dinning…", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d584451-r377262267", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Extremely good", "review": "I spent a very pleasant mini break (5 days ) in Cala Ratjada. The Hoya wave was centrally located , 10 minutes leisurely stroll left took you to the beautiful Cala Agulla beach or turn left into town centre. My room was a double , very spacious, bright and comfortable. Cleaned daily , fresh towels as needed.  I went for the half board option , long meal times in morning and afternoon and a good variety of buffet food provided , meats , fish , salads , sweets and plenty of food .  The resort is very popular with Europeans espically germans and I did not have a problem with this .  The pool was great ,swam in it daily and the terrace area received the sun from about 12.00 onwards so I went to the beach each morning until lunch time .  All the staff were friendly and polite . I…", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d584451-r375006361", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "It's what you make It", "review": "Dear Mr. Slowhan,  Thank you very much for your review. We appreciate all your comments. Hope to see you soon.  Kind regards,  Your Guya Wave Team", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d584451-r370739780", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Excellent Hotel in Cal Ratjada", "review": "This hotel is in a great position in Cala Ratjada  A 10 min stroll to the harbour passing several shops bars and restaurants along the way. The decor in the reception is clean and very big and has blue mood lighting with ample seating area. The dining area is just past reception  I can fault Cala ratjada as an English person as it too much German. Everybody is German every menu in every restaurant is German, they are totally catered for and everyone speaks to you in German....erm hello this is Spain...talk in a Spanish....that is my one main gripe  As for the staff of the hotel, I can not rare them high enough and have to mention Udo who kindly rearranged my transfer back.to the airport when I extended my stay. I also have to mention Ralph and the lady manager who sadly I don't…", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d584451-r368109478", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Break away - not for the less immobile ", "review": "we are from Nepal. This is my first travel in Spain & we are living on  this Hotel 5 days. We  enjoy our holidays  . In this hotel Have big Garden, Swimming Pool ,Clean and wide  Room, Food also very good and Staff are so kind and friendly. Really we are  like this Hotel. will come again .", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d584451-r338622099", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A very good experience", "review": "A good hotel with a good price for all the family. You can enjoy while the children are playing in the park in front of you. All around there are many places to go , and very beautiful beach only 15 minutes away. In the nigths, is so good to seat outside on terrace!!", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d584451-r335776042", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "guya wave", "review": "i have used this hotel for the last 3 years,never had any problems.the reception staff udo and ralph will always do there best to sort any issues that may arrise straight away and the refurb is top class.look forward to 2016 there again", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d584451-r320881518", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "guya wave hotel", "review": "I have stayed at this hotel many times, always been happy with the hotel, it has changed it's name recently under new management, it has been refurbished to a very high standard, we went on holiday there in may 2015 I was flabbergasted at the change, it is superb, wonderful staff nothing is to much trouble they treat you with respect, if there is a problem it sorted out asap, the food is very good, all the amenities are spotlessly clean, the rooms are very spacious and comfortable, I would recommend the guya wave hotel for adults and children alike, there is something for every one, but it is staff they are second to none, perfect.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d584451-r282821820", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great Holiday", "review": "We have just arrived back from our all inclusive holiday, we stayed at this hotel and it was fabulous the staff were great and the facilities were very clean. Couldn't have asked for more, the service we received was exceptional, the experience was one of the best and I would highly recommend this hotel to all. We got more than what we paid for just by the service we received alone. I will definitely be going back again", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d584451-r272501975", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Fantastic", "review": "I have just returned from a weeks holiday at the Guya Wave hotel the transfer from the airport is a long bus drive. On getting to the hotel I was suprised as it looked nothing like it did in the brochure, when booking in at reception the staff were so nice and helpful. The room I was in was perfect! Recently refurbished it was clean and alot more than I expected. The room was cleaned every day and beds remade. My stay in the hotel was a all round pleasant experience all the staff was polite and helpful and made me feel very welcome. The pool area and pool was also clean and tidy. I would not say it's a hotel for young adults as there isn't a lot to do but for couples and the younger children it's the perfect place. I would definitely return to this hotel...", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580283-d584451-r271900612", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}]