[{"title": "Does the job", "review": "We've just got back from our stay at this hotel. It was our first holiday with our 10month old and we were extremely excited. Prior to arrival id tried contacting the hotel to enquire about a cot for our little one but had no replies. Upon arrival the member of staff on reception charged us the tourist tax (which we were fully aware of) but then charged us 60euros for the hire of a cot for 10 nights. I expressed my annoyance at the time but had no choice but to pay it. (I'm still very unhappy about this as most other hotels offer this service free of charge). The cot was absolutely filthy and looked like it was years old.  Putting that aside the room itself was extremely clean and had everything we needed for our stay. There was regular cleaning and the cleaners were absolutely lovely ladies !!!!  There were lifts from the room and ramps down to the reception area but then steps from there down to the pool which posed an issue for us with our pushchair meaning we had to go all the way around the outside of the hotel to get there when we took the pushchair.  The entertainment at night was average and didn't start until gone 9 each night (which we were already aware of) we found the pool bar quite expensive so didn't use it much. The location of the hotel was great and very close to all amenities. Lots of places were closing though mid October so just be aware of that if you're planning on travelling then.  Overall the hotel was ok and did what we needed but we're still quite cross at the charges for the cot and the lack of access.…", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r720668179", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Another awesome holiday", "review": "After visiting Cala D’or last year, my uncle and I returned this time for a week the apartment was clean tidy tour beds and towels changed for you the staff were helpful and I have already booked for 2020 this time the whole family are coming to visit this amazing place", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r718190584", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Regular Visitor", "review": "Dear Danny A, Thank you to spend your time to write a review about us. We are glad that you enjoyed your stay with us. See you next October :) Best regards, Ola es Ravells team", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r717047139", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Catherine duffy", "review": "If you are planning a trip to Cala D'Or be very careful about the location of your stay. Although the main part is quite small, the resort stretches bajk quite a distance and some locations are quite remote. These apartments are excellently located within a 5 minute walk of all amenities. I have now returned to these apartments for the last 5 years and know exactly what to expect. The receptionist staff are most welcoming, helpful and friendly and I make particular reference to the experienced guy (not sure of his name) who has been there each year I have stayed there and always goes the extra mile to ensure you have a good and stress free holiday. Rooms are not large but are what you would expect from the price. They are cleaned regularly. The outdoor bar is a great place to relax and the staff are particularly friendly and the place is well managed by the big fella in charge. Great variety of modern musical entertainment each night (albeit the Abba act could now do with an update). Would highly recommend and will no doubt return next year.…", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r716851817", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good location", "review": "Dear kevinjohnson592 , Thank you to spend your time to write a review about us.Always it's a pleasure to see you here with us. We wish you a nice winter and we hope to see you again next summer. Our best, Ola es Ravells Team", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r714105008", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "First time to Cala D'Or", "review": "I was very pleased with the location as had not visited before.The apartment was good value for money. It was clean,tidy,light and airy and the balcony overlooked a park. There was a great Italian restaurant only half a minute away which was very reasonably priced for food and drinks. The local beach, Cala Gran, was literally 3 minutes walk away and did not dissapoint. The town is around 4 mins walk away and had too many great looking restaurants to choose from along with many shops. The bus stop is located just before the beach. One thing I would definitely recommended to do is to arrange transfers to and from the apartments as the taxi fare is €75 each way. We arranged a transfer from the apartments to the airport- was €29 for both of us and took around 1.5 hours- was a nice…", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r713566044", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Fantastic", "review": "Dear  Jo R Thank you to spend your time to write a review about us. We are glad that you enjoyed your holidays with us. We hope to see you next summer. Best regards, Ola es Ravells Team", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r713051887", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great time", "review": "We are currently five days into a seven day holiday, we read some reviews about people saying it was noisy, so we asked for a room far away from the nightly shows, it is perfect for us, the apartment is huge and spotlessly clean, we can not fault it at all, the fridge is great for keeping the beers cold. The staff are brilliant, really friendly and helpful, we had one small minor problem which was quickly sorted, not sure what the entertainment was like as we never went to see it, we just went to the local bars, I would highly recommend this place and wouldn't hesitate to go back.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r712809858", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Noisy,noisy,noisy!", "review": "Dear  chessfun, Thank you to spend your time to write a review about our apartments. We are glad that you enjoyed your holidays with us and we hope to see you again in the near future. We wish you a nice winter. Our best, Ola es Ravells Team", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r712784675", "sub_review": {}, "travel_purpose": "", "rating": 1}, {"title": "Poor Entertaintment", "review": "We had a great time in our 3rd floor (with a lift) apartment - staff were very helpful/polite and efficient - entertainment in the tropical garden was excellent - just one hiccup, as pensioners we felt that some sort of grab rail in the shower would really help all the old buggers and reduce the risk of 'having a fall' - we will be back!!!", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r711057104", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Exceeds expectations ...", "review": "Stayed here towards the end of August ... excellent location, Customer service and accommodation that combined to make it a great holiday !   Can heartily recommend Cala d’or as a destination and the Ravells apartments are a really base for exploring the area.", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r709399575", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Es Ravells", "review": "Dear Adventurer320303, Thank you to spend your time to write a review about us. We are glad that you enjoyed your stay with us and we hope to see you again in the near future. We wish you a lovely winter. Our best, Ola Es Ravells Team", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r708463217", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Super convenient and yet quiet", "review": "Been coming back here for years, great place to stay, fantastic staff and really close to the town centre. Rooms are clean and tidy and towels and bedding changed regularly. Tropical gardens offer entertainment in the evening.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r707842738", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very good apartment.", "review": "Dear Steve B, Thank you to take your time to write a review about us. We are glad that you enjoyed your satay with us and we hope to see you again next summer. Have a nice winter. Best regards, Ola es Ravells Team ", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r706892338", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "First Time ", "review": "Currently staying here for two weeks. We are in block 5 ground floor which is very quiet indeed. Exactly what we asked for. Lots of supermarkets around and a 10 minute or less walk into the centre where all the action is, and dozens of restaurants  and bars. Live music abounds! The apartment is immaculate and well enough equipped for most.  Always plenty of hot water and a great shower. Big balcony and view over trees.  By the pool there is live music each night and a good bar, although we tend to walk into town. ", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r706069607", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Some good and some bad", "review": "Have stayed many times in these apartments and the staff are always pleased to see us and always eager to help with any problems.  The rooms are adequate if a little basic but contain kettle, toaster and microwave. The aircon worked ok and could cool the room quite well. Not sure what the position is regarding the pool.  Does it belong to the hotel or as it seemed to be privately owned.  The owner put a notice up saying that no food/drinks etc to be consumed at the pool except those brought at the bar or people would be asked to leave.  We saw one person being asked to leave in a very nasty way after eating there own food which begs the answer to my question above.  If it does not belong to the hotel then this should be stated on there web site so people staying there would…", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r705972617", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Perfect! ", "review": "Dear sukeNotts, Thank you to spend your time to write a review about our hotel. This review help us to keep improving our service. We wish you  a lovely winter. Our Best, Ola es Ravells Team", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r703933662", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Some Positives and some negatives.", "review": "We checked in on the 15/8 for 8 nights a family of 3, 2 adults and one child, we arrived at around 22.30, check in was simple and took no longer than 5 mins, receptionist very friendly and helpful, directed us to our room which was block 6 6201, on entering our room we were pleasantly surprised, it was all clean and spacious, the balcony was massive, and larger than the whole apartment! Had a perfect view of the pool and entertainment stage so could watch on the balcony!Free air con is great, and the room is well equipped for a self catering holiday, we didn’t do much cooking in the room but the facilities were adequate with hob, toaster, kettle, microwave and utensils etc. The maids came every other day and where friendly and efficient. The pool is fab but there really aren’t…", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r703118095", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Perfect ", "review": "Dear ff82 Thank's a lot to spend your time to write a review about our apartments. We are glad that you enjoyed your holidays with us and we hope to see you again in the near future. We wish you a nice winter. Greetings from the sunny Cala d'Or, Ola Es Ravells Team ", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r701941048", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Summer Holidays", "review": "Firstly, staff very helpful, especially receptions Jose. Had a apartment that spent four, two in a twin bedroom and two on a convertible sofa bed [not fold out]. Apartment had balcony, was modern, equipped well enough, clean and comfortable with a shower over a bath and plenty of hot water.  Nice, reasonable size swimming pool that anyone can have access to, and do! Lifeguard sits on the stage [built for the nightly entertainment and probably for the shade] but is not keeping an eye on things as he needs a proper shaded and elevated veiwing point made for him in the correct position. While there there was a group of five teenagers, along with their mother, that spent 'hours' grappling and throwing each other in the pool, with no consideration for anyone else of 'any' age, and…", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r700615585", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Lovely Apartment", "review": "Lovely modern clean apartment, quite a small balcony for a family. The pool actually belongs to Tropical Garden not the apartment complex, so the pool is open to the public but we could always get a sunbed from 9am (no rushing to get a bed) lovely staff at the Tropical Garden and also the apartments. Good entertainment at night & was great to be able to watch it from our balcony. Shops and restaurants right beside us and the beach and centre is just a short walk.", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r699159638", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Ok but a few niggles", "review": "Dear twins20142017 Thanks a lot to spend your time to write a review about us. We are glad that you enjoyed your stay with us. Have a nice rest of the summer. Greetings from the sunny Cala d'Or, Ola es Ravells Team ", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r697847512", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Too noisy!", "review": "Location is very good and close to the beach. Our apartment was clean but on the small side, there were 2 of us so it was ok but would definitely struggle with a family of 4 (bathroom was tiny). Pool is nice but some days we could not get a sun bed as the hotel does let non residents use the area. My main complaint is the noise from the bar next door which goes on until 2.30am, the music is played at an incredibly loud volume, my daughter was in tears some nights as she couldn’t sleep (guests with children should not be allocated this section), the room was shaking from the music. Also our balcony had an extractor fan directly outside which made it too noisy to sit out. So all in all this wasn’t the peaceful break I was looking for...", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r693899797", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Lyndsey Stobbs", "review": "Dear JoLeeds21, Thank you to take your time to write a review about us, this is very important for us to keep improving our services. Have a nice rest of the summer and a lovely winter. Our best, Ola es Ravells Team", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r685061084", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great apartment and great location", "review": "It’s a shame to have to write this but the hotel is horrifically noisy. If you want to be asleep before 2am don’t stay here. We are in room 7001 and have The ‘Hollywood’ bar underneath and every night there is singing and karaoke. It is so loud it feels as though Elvis is standing at the end of the bed!! Certainly not the relaxing evening which you’d expect from a holiday.  Aside from this, (if you can get over this!) the apartments have been great. The location is spot on. 2 min walk to beach. Lots of great restaurants close by. The pool is nice too with great entertainment for the kids. I’d love to stay here again so it’s a shame but the noise is too much!", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r683976191", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great place great location", "review": "we have stayed at Es Ravells  a few times in May every time. We have a 1 bed apartment & have always been in blocks 6 & 7. We love these lots of room for 2 well equipped, clean & comfortable. In these blocks there is a great view over the tropical gardens so you can see the pool & in the evening the entertainment if you do not want to pay for it. If you dont like it then this could be a down side. Regarding noise qwe have never had a problem but it may be a different story in high season. from other reviews i think you  may be unlucky with some rooms in some blocks but I can't say anything negative", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r683596084", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good hotel fantastic entertainment ", "review": "Dear nigel691 Thank's a lot to spend your time to write a review about us. We are glad that you spend a nice time with us. We hope to see you again next summer. Best regards, Ola es Ravells Team", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r679416717", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Place of peace ", "review": "I have just spent a week at Es Ravells with my extended family including my five year old and two year old sons. The hotel is clean and in a very good location, near to fantastic beaches and within a few minutes walk of the main square of bars and restaurants.   We never ate at the tropical garden but did buy a lot of drink from there, the drinks and ice creams are reasonably priced and there are deals on bottles of San Miguel etc 2 for €5  The hotel is good but what made our holiday was the entertainment, both of our sons have came back having made a new best friend in Mark. He goes out of his way to make sure kids are having fun and his mini Disco is hilarious. The holiday would not have been the same without him and he was a good laugh with all of the grown ups too, we will…", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r677782018", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Entertainment staff", "review": "Dear SamAth1, Thank you to take your time to write a review about us. We are glad taht you enjoyed the stay with us, we will pass the review to Mark. Have nice rest of the summer and we hope to see you again in the near future. Greetings from the sunny Cala d'Or, Ola es Ravells Team ", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r677162355", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "lovely holiday", "review": "We stayed here 5 days in May with our baby (15 months old). The flat is very comfort for everything and located in a quiet area of Cala d’Or near 400 mt to the centre (restaurant and shops) and the beautiful beach. The staff were kind and helpful. ", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r672254833", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Good hotel", "review": "Had a lovely stay at this hotel.rooms fresh and clean.bathroom was a bit on the small side but had a fabulous shower.staff really helpful. Close to beach, shops and restaurants. Mark the entertainment guy was a friendly soul...loved his dance routine ! Nightly enertainers were also good.enjoyed my stay had a great time.", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r671866399", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Es Revells hotel", "review": "Dear Miranda,   On behalf of the Ravells d'Or team we thank you so much for such a detailed review. It is a pleasure for us to see that we did our work well and you could enjoy that much. It would be a pleasure for us to see you next year again.  Yours faithfully,  Es Ravells Team.", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r671778010", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Lovely place", "review": "Great location plenty shops bars near by and the beach is a short stroll away. Staff are very friendly and can't do enough for you. The entertainment guy Mark kept us all entertained throughout are stay. Would definitely recommend the hotel and are already going to book up again for next year.", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r671767162", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fab location lovely apartments", "review": "Dear Garry,  We appreciate such words about us. There is nothing that can make us happier than satisfying our guests needs and make their stay simply unforgetable. Thank you again for that review and see you next year!!  Best regards,  Es Ravells d'Or team.", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r671594613", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Holiday 2019", "review": "Clean tidy apartment everyone so friendly entertainment is Brilliant thanks to mark keep the good work up location spot on will return next year  well done to all the staff and cleaners Sharon and garry", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r671430786", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Small Room", "review": "Booked a 1 bedroomed apartment, great location, but room very very small, no storage space, just one very small wardrobe, no shelves, no dressing table, kitchen facilities very basic no room even to drain pots, bathroom was extremely small just enough room to get in, difficult to get into shower which was over the bath, not a very big opening and shower screen didn't open, lounge only had a table and a small uncomfortable sofa - no way cud 4 people fit in this apartment we were just 2 and found it very claustrophobic, luckily we had a large balcony and the weather was fine so spent most of our time on there - description on the website was very misleading although very clean when we arrived just got a change of towels and sheets but no cleaning done not a huge problem as the…", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r631731174", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Decent and clean", "review": "Nice spacious apartments close to all of the amenities of cala d'or and the beach is just a few mins stroll away. Other beaches within a 10 min stroll .   The apartment we had was a studio on the ground floor so not a great view of anything much but we were mostly out anyway. Spotless bathroom and shower. Clean towels and beds made daily. Housekeeping staff were nice and friendly. Reception staff were very professional and helpful.      The pool actually belongs to the Tropical Gardens restaurant so is only open 9am - 6pm when the lifeguard is on duty. I felt it could be swept a bit more around there as there was often bits of leaves and other natural debris on the steps down to the sun terrace and pool.  The pool bar does food but its twice as expensive as the bar just outside…", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r629653611", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Nice place ", "review": "Our self catering apartment in block 5 was, lovely, with good sized rooms and comfy beds. The air conditioning could have been better mind. Good entertainment at night having different tribute acts on. Some better than others but all added to a fantastic holiday. ", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r629144477", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great wee place ", "review": "Just back from a great week in lovely Cala Dor. The apartments are lovely and modern and most importantly clean. The reception staff were all great and couldnt do enough for us. As mentioned in previous reviews the pool is shared but this wasn't a problem for us as it was relatively quiet while we stayed. Great value for money and wouldn't hesitate on recommending these apartments. They are also in a really central spot close to supermarkets, restaurants and the gorgeous beaches.", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r625112320", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Apartment great. Entertainment, errr", "review": "Dear rachaelhunter32 Thank you to spend your time to write a review about us. We are happy that you enjoy your holidays with us and we hope to see you again next summer. Best regards, Ola Es Ravells Team", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r624091887", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Clean basic apartments", "review": "The receptionist was pleasant and friendly and gave us a warm welcome on arrival. The room was clean. Decor was fine. uPVC doors and windows meant you could be sure no large insects could get in at night. It was nice to be able to watch the show from the balcony when we came back early from the main town, although the shows weren't up to much. It was ok though. The location of this hotel is very central, ideal for shops, bars and restaurants, of which there are plenty in Cala d'Or. The pool area and grounds (which constitute the view from the balconies) are really beautiful and well kept. This makes sitting on the balcony very pleasant. Balconies get the sun for most of the day.  There were a few small problems, such as the kettle lid was broken. The apartment was clean but…", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r623955192", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Ola Apartment", "review": "Dear Ann N Thank you to take your time to write a review about us. This review help us to continue improving our service, also we are glad that you enjoy your holidays with us and we hope to see you again in the near future. Best regards, Ola Es Ravells Team", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r623447157", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good decent hotel", "review": "When arrived at hotel was placed in room 7101 which unfortunately was directly above the bar Hollywood with Karaoke going on till 2am which was not a real problem as we weren’t going to bed much earlier but at 6am the staff started getting the bar ready for the day dragging furniture and banging about we asked for a move the next day but had to wait 2 days due to hotel being full. But once moved everything was fine, rooms are clean and well equipped. The pool area although open to non residents was clean tidy and staff at bar were very friendly and attentive. Although can imagine getting very busy in high season. Apart from initial room problems hotel was very good, centrally locates and would return.", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r622326647", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Late september holiday", "review": "Dear Safari284016 Thank you to spend your time to write a review about us. Sorry for the inconveniences at the time of your arrival. We are glad that you enjoy your holidays with us and we hope to see you again in the near future. Have a nice winter, Best regards, Ola Es Ravells Team", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r621782160", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Perfect.", "review": "The apartment was clean and tidy and exactly what I thought it would be. Kitchen was slightly too small for an apartment and cooking a full meal would be difficult. But for breakfast and dinner it was perfectly fine. We visited out of season so the hotel was quiet. If you come in summer the pool area may be a bit too small for all of the guests. The reception staff were friendly. It’s in a good location with restaurants and bars down the street. It’s a few minutes walk from the beach. Evening entertainment is a bit mixed. Let it Beatles were good and funny. Watched from the balcony. Will be coming again. ", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r621394011", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "great appartment central in cala dór", "review": "very helpfull friendly staff, clean appartment with everything you need. housekeeping everyother day. Great place to stay with children as everything is provided that you may need.  Only downside was that the airco doesn't stay on the whole night but by opening the balcony door it stays cool enough that it doesnt cause any problems we had a room close to the pool which mean that the nighttime entertainment can be heard untill 12. We enjoyed this as we could go out because our son was sleeping but we could still enjoy the show from our balcony. Maybe if you would prefer something quieter you should request a room further away", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r619095940", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Family Holiday", "review": "Dear sineadNijmegen, Thank you to spend your time to write an opinion about us. We are glad that you enjoy your holidays with us and we hope to see you in the near future, have a nice summer. Kind regards, Ola Es Ravells Team", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r617081472", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Ola Es Ravells", "review": "Recently visted the apartments in September 18 with my family of three. Upon arriving greeted by a lovely gentleman in reception. He kindly told us we had been allocated an apartment above the noisy karaoke bar. He then kindly moved us to two seperate apartments for one night, until they could move us to a family studio once one became available. I thought this was very honest of him. On the whole if you are looking for a reasonable priced holiday I didn't think the apartments and facilities were bad for the money. They are clean the staff are friendly and the area is a good base for the resort. My only criticism of the apartments are that, if they spent more money and put it back into maintaining the grounds and pool area, it could be so much more. The rooms are well equiped…", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r612933128", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Family Holiday ", "review": "Dear Audra C, Thank you to take your time to write a review about our Apartments. We are glad that you enjoy your holidays with us and we give you the thanks because this review is helping us to continue improving. Have a nice winter.  Best regards, Ola Es Ravells Team", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r606156011", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Big hotel", "review": "We as a family come back year on year. The hotel Staff and Manager are so friendly nothing too much trouble.  The hotel is situated in a good place 10 mins from all the Resteraunts. You can catch the Train outside too.", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r603576873", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Good sized apartment with 2 balconies", "review": "Stayed here with a friend and we were upgraded to a better apartment. Fab sized rooms, 2 balconies. The sofa beds in the living room seemed damp, maybe they were wiped down but the material never felt comfortable for this reason. The bed was fine though.  The only problem we found was the amount of ants within the rooms.  Location is central, close to a number of beaches and activities nearby too. Not too far from the main restaurant areas.  Lovely pool with manned by a life guard. Our apartment was a bit away from the pool though. It did mean that entertainment wasn't quite as loud this way though.", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r597102668", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Good location", "review": "Dear HyperBunny86 Thank you to spend your time to write a review about us. We are glad that you enjoyed your stay with us. We hope to see you again in the near future.  Greetings from the sunny Cala d'Or, Ola Es Ravells Team ", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r594264566", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Burgled", "review": "We stayed in Cala d'or in 2017 and knew of this hotel and gardens. We travelled with our son and daughter and their familes so there was 12 altogether. We arrived at approx 11pm, hoping to check in quickley and get the little ones off to bed. The first problem was my husband and I were given the wrong room, when we went in it was already occupied. We spoke to the receptionist and her reply to us was \"I dont think so\" she went and looked. Oh yes it was. Down to reception to get it put right, next problem was there was no cot in sons room for the one year old. My sons partner asked for a cot, to be told that noone was available to get one for her and the baby could sleep on the bed. I said we needed a cot asap, we also needed one for the two year old. I think before we all…", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r590177888", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Great Location/Great Apartment/Very noisy", "review": "Dear hilaryc57 Thank you to take your time to write a review about us, this review is good for us to keep improving our service to the custumers. We are very sorry about the problems at the time of your arrival. We hope you give us a second chance. Have a nicest rest of the summer to you and your lovely family, Best regards, Ola Es Ravells Team", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r589718009", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great location & excellent room", "review": "I stayed at this hotel for 4 nights with my husband & 16 month old son. On the first night our hotel room was broken in to & valuables stolen whilst we slept. The hotel staff weren’t helpful all, they questioned weather it actually happened, said it hadn't happened before, which was later found to be a lie when talking to some English people by the pool who worked in a nearby hotel & at one point the hotel receptionist even said it wasn’t her fault. We had to walk to find the police station ourselves as the manager said they wouldn’t come out & he said CCTV isnt allowed. It is such a shame this happened as the hotel is actually nice with clean apartments, a nice pool area & a good poolside bar & entertainment. Cala D’Or it’s self is also a lovely place although a little pricey.", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r587423353", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great place to stay!", "review": "The location of the Ola Apartmentos Es Ravells D'Or is ideal for both Cala D'or and Cala Ferrera. The apartments are set very near the centre of Cala D'or, just a few minutes walk down to the beautiful beach of Cala Gran and the main town area with the shops, bars and restaurants. It is also within about 20 minutes walk to Cala Ferrera beach, and the shops and restaurants there. The marina is slightly further away, about 30 minutes walk, but well worth it. The self catering apartments we stayed in are basic, but clean, modern and airy, and very good value for money. The balcony looks down over the 'tropical garden' bar area, which has live entertainment every evening, which you can watch from the balcony with a beer, or go down to the bar. There is a nice swimming pool with…", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r586457533", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely Cala D’Or. ", "review": "Dear Mariah5464 Thank's a lot to spend your time to write a review about us. We are glad that you enjoyed your stay with us. We hope to se you again next summer. Greetings from the sunny Cala d'Or, Ola Es Ravells Team", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r586009200", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Mixed review.", "review": "First visit to Cala d’Or and it was beautiful. Hotel was in a great location close to everything and easy to get your bearings from. Rooms are adequate with bathroom on the small side. No privacy on the balcony as only a 4 foot wall between each. Not great that the pool area is owned by bar /restaurant tropical garden therefore anybody using the bar can use the pool. Entertainment on every night from kids disco at 8.30pm to tribute act at 9.30pm-12am. This was quite noisy especially if you weren’t wanting listen to it. Out of 7 nights there were only 2 acts which we thought any good. The ABBA angels and the Beatles tribute (and we aren’t even Beatles fans.) We didn’t go out of our way to watch the nightly shows but couldn’t help it as our balcony overlooked the stage. If you are…", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r585235689", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Stayed here for 10 days from 14th to 23rd May", "review": "Dear AdmiralAwesome Thank you to spend your time to write a review about us. We are sorry about the noise at nights due the shows. We hope to see you again in the near future. Have a nice rest of the summer. Kind regards, Ola Es Ravells Team", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r582377777", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Friendly and helpful staff", "review": "I stayed in a studio which had 2 single beds placed together with a massive bathroom with bath and shower.studio had a microwave,kettle,pots,pans,cutlery and a fridge.There was ample storage for clothes.The staff were very friendly and the rooms get changed frequently with clean towels and bedsheets. A few bad points is that the pool doesn’t belong to the apartments and you can’t take food down to the pool.That belongs to tropical gardens which has tribute acts on every night from 9.30 till midnight.Also there is no privacy whatsoever on the balcony’s. You need to have good quiet neighbours  cos I experienced a few nights with next to no sleep with the neighbours slamming doors and making a racket on the balcony at 4am to 6am.I would stay here again but quiet neighbours is a…", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r582298526", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "No room first night ", "review": "We arrived at the hotel at 23.30 to be greeted by the receptionist and was told that we had no room we were relocated round the corner at the cala d'or so for on night and they paid for our breakfast. Got to say that after the initial disappointment it was handled well rest of our holiday went great apartment great reception helpful only issue for peak season visitors is the entertainment is open to the public and gets full early ", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r581618636", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "For the Family", "review": "Dear Tony W Thank you to take your time to write a review about us. We are really sorry for the inconveniences at the time of your arrival. At the same time we are really happy to know that you enjoyed your holidays with us and we hope to see you again in the near future. Best regards, Ola Es Ravells Team", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r580879588", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "A true review ", "review": "Lovely little apartments, compact and clean. We stayed in a studio apartment, 1 room, 1 bath/shower,  the other option is a 2 room (seperate bedroom) with bath/shower, the bathroom is very spacious and hot water is available all day, with complimentary toiletries provided,  everything you would need is provided, fridge, toaster, electric hob, electric kettle, etc etc, tv is provided but sadly with only 2 channels in English and they're both news channels,  but then again we don't go on holiday to look at TV, rooms are fresh and very clean,  and every room gets a balcony overlooking the swimming pool and entertainment stage at Tropical Garden. The apartments are about 400m from one of the small beaches and a few more metres from the busy town centre with lots of restaurents. ", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r579214902", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Nice Hotel, Perfect Location", "review": "Dear DavidPD59 Thanks a lot to spend your time to write a review about us. We are glad that you enjoyed your stay with us. We hope to see you again in the near futere. Greetings from the sunny Cala d'Or, Ola Es Ravells Team", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r569425256", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Love it!", "review": "We visited cala dor 02.05-06.05  Arrival Arriving at the hotel the bus pulled up and thank God we had some people to as no signs to reception just follow the stairs down wards. Check in seemed a long process and we were put in room 7106.  Room We had booked a 1 bed apartment. After being directed by reception to go back the way we had came to the main road and to go along some dogey looking buildings we managed to find the hidden away elevator to our block. Entering our room we found we had twin beds when we had booked a double (the hotels response to this was to just push them together) The room was very big and clean and we loved the little kitchen and made food use of it. It has everything you need fridge freezer microwave 2 ring stove toaster kettle and sink. Balcony was of…", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r560763532", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely apartment!", "review": "Stayed in summer of 2017 with 3 kids for 1 week. The apartment was adequate for 2 adults and 2 kids (the living room couch is not the most comfortable for the adults, but suffices for children). The bathroom had a problem with smell that nobody could figure out where it was coming from. The pool view is a bad idea if you like sleeping before midnight. The music is very loud, and I would suggest the other side. But overall a nice place and friendly stuff. ", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r558088966", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "A great little hotel in a fantastic location  ;-)", "review": "Dear jazzymax Thank you to spend your time to write a review about us this is very important for keep improving. We hope to see you again in the near future. Best Regards, Ola Es Ravells Team", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r535353051", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Perfect holiday location", "review": "This hotel is in an excellent location, less than 5 minutes from a beautiful beach and a lively town centre with lots of excellent bars and restaurants.  The staff were friendly and very helpful.  We checked in quickly and the room was spacious for 2 people, clean and had a very sunny balcony, opposite the pool and stage (so if you didn't want to join in, you could happily sit and enjoy the evening entertainment from your balcony).   We had a last minute booking for this hotel and therefore had a very good deal, we were also, literally the last guests to leave at the end of the season, this meant that the bar and evening entertainment were only available on our first night, this didn't bother us but we were happy to arrive back to a fairly lively crowd enjoying the Abba Tribute…", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r534839058", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Never again", "review": "Dear Rachael G Thank you to take your time to write a review about us. We are glad that you enjoyed your stay with us and we hope to see you again next summer. Kind regards, Ola Es Ravells Team", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r532821484", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Cheap and Cheerful....Great Location!", "review": "Stayed here with my boyfriend for a week in September. Had a fantastic time! Apartment clean and spacious with nice balcony overlooking pool. Pool was lovely and not too cold with lots of sun beds available. Beach, shops and restaurants within a minutes walk! Staff lovely- especially Jose!!! Couldn’t do enough for us. Would definitely go back! ", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r530810583", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Well worth it!", "review": "Fantastic, well equipped and spacious apartments. Reception staff are absolutely wonderful and exceptionally helpful. The location was great for us as restaurants and entertainment nearby. We would recommend these apartments to others for value for money. ", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r529947381", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Won't be back", "review": "Dear Jill W Thank you to spend your time to write a review about our hotel. We are glad that you enjoyed your stay with us and we hope to see you again next season. Best regards, Ola Es Ravells Team", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r529650105", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Great location!", "review": "First of all they took off the money the day we booked and not when we arrived as promised. Studio was very clean indeed, if a tad basic and small. Fridge was adequate in size. Had to ask for cups.   The bathroom was a good size with a shower and bath. Lovely hot water.  Sheets and towels were changed regularly which was nice.  The balconies were a nice size and sunny but no privacy at all. The pool was very nice with plenty sun loungers.  The nail in the coffin for me was the noise of the dreadful entertainment at night. I asked for a quiet apartment but got block 6😱. I bought sleeping pills from the pharmacy and tried ear plugs; all to no avail!  Why the noise had to go on until midnight I've no idea Didn't try the restaurant.   The folk on the desk were very nice.  Also…", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r529408368", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "perfectly placed in resort", "review": "Dear Hattitatti Thank you to take your time to write a review about us. Your opinion is really important for us to keep improving. We wish you a nice winter and we hope you give us a second chance. Our best, Ola Es Ravells Team", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r528484380", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Ola ravells ", "review": "Great location literally 2-3 mins walk to shops, bars, restaurants & Cala Gran Beach. We stayed in a studio (ground floor - E6 Room 12) which was quite small compared to others I have stayed at previously. Room had been recently painted & there was a strong odour of paint when we first arrived, it was clean & tidy with modern furnishings. Small terrace/balcony but view wasn’t ideal overlooking dirt patch and fencing, some of the other studios overlooked the pool and I would try & request this if I stayed again. Pool area clean & tidy with sunbeds available all day (Sept), pool was smaller than I’d expected as it looks much bigger on the photo’s. Snack bar area open to public as well as the guests but we didn’t find this a problem at all, reasonably priced food and drinks. …", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r528041545", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Basic 3 star in good location but let down by pool", "review": "The room was clean and tidy, had obviously been modernised recently. Compact but co complants about the room. It was cleaned reguarly and well.  The complex is noisy at night with the entertainment, our kids loved it so that was fine for us. It is mainly shows, singers etc that they have on, the kids disco wasn't up to much but the kids seemed happy enough.  The pool looked nice however all our swimwear went yellow after around 20 minutes in the pool. Everyone around the pool was the same, the girls hair started to look a bit green towards the end of the holiday. We complained and both Jet2 and the hotel management could not have been more dismissive of us if they tried.  The management kept trying to blame suntan lotion, we holiday twice a year and some of the outfits have…", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r526524169", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Family holiday ", "review": "Dear Allan N Thank you very much to let us know your opinion. We are very sorry that your holidays were not what you expected but. We hope to give us a second chance and enjoy your holidays in Ola Es Ravells next summer. Best regards, Ola Es Ravells Team", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r524718291", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "You get what you pay for!", "review": "Stayed as a family of four in a one bed apartment, the size was great, with a balcony over looking the pool. Great for when the night time entertainment was on in Tropical Gardens. Nice refurbished rooms, but did lack a bit character. Very central and only a couple of minutes walk to bars and restaurants, beaches close by too.   A couple of issues was that it did get very noisy during the night, nothing to do with the entertainment but we were woken up early hours of the morning by what could only be described as the sound of a Hoover?! I also felt that the room could have been cleaner, we did get beds and towels changed but felt like certain areas were a bit grubby. We thought the air conditioning would have been included also but apparently the price list at reception shows…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r518712557", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Stay in OLA Apartamentos Es Ravells D'Or 2017", "review": "Dear Julie,  Thank you very much for taking your time to write about us. Your opinion are very important for us because improve our services and keep going on. About the air conditioning , it  must have been a mistake. Our air conditioning is for free. We don't  know why you thought that. Hope see you agains enjoying your holidays with us. Our best From Es Ravells Team.", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r514661703", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Nice stay!", "review": "There are some unnecessarily harsh reviews about Ravells, ok it's not 5 star but you know that when you book....pay for 3 star and you get a fairly decent 3 star.  The rooms are adequate, very clean and have all the basics you need. We had a 1 bed apartment and it was plenty big enough for 2 adults and 2 children (one of whom is 6 foot and slept very well on the sofa bed!) personally I don't go on holiday to watch tv, sit in the room or do any kind of cooking so it met all our needs - but if you do want to cook anything other than toast or have enough space for a full on rave, you will probably be disappointed.  The entertainment is typical package holiday fayre but there is so much to do in Cala D'Or you don't need to be tied to that every night.  The \"animation\" during the day…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r511422151", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Perfect central location for beaches, shops, bars etc.", "review": "From the moment of the arrival the staff in this immaculate reception were polite, friendly and very helpful.  We had organised this trip ourselves by booking our own flights, transfers etc. Despite that, the staff kept us fully informed about collection times for our transfer home which took a weight of our minds because one can never be sure that these things are going to work like clockwork, however, they did!  The studio apartment was basic but spotless and contained everything we needed and was of a good standard.  I had read a couple of reviews about the entertainment being too near. I found this a plus because we would sit on our own balcony and just enjoy the show, which was usually cheesy but good fun. By 12.30 each evening the entertainments stopped and we had no…", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r511182121", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Basic, acceptable, cheap and central location", "review": "Dear dawntbates, Thank you to spend your time to write a review about Ola Es Ravells. We are glad that you enjoyed your holidays with us. We wish you a nice winter and we hope to see you again next year. Best  regards, Ola Es Ravells Team", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r503427704", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Our 1st yearly trip", "review": "Our family stayed here on SC basis (2 adults 2 children) for 2 weeks. The hotel is fairly basic and clean, with the normal basic provisions in the rooms. The rooms are a little small when 4 are sharing, but if you all get on its no real problem. Overall, the hotel is a good base if you are up for exploring the local resort but that's all.  Easy reach of shops, restaurant's and walking distance to several beaches. Bar stays open till late and the music can be a problem if you have a pool view where the bar is also located.   There is nightly entertainment for children and adults at different times. With live groups (look-a-likes) of leading pop singers. This is repeated over 7 days so if you are staying longer than a week you will see the same artists again.  Most people used the…", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r497526174", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Cheap holiday", "review": "Dear sukidukes Thank you to take your time to write a review about us. This is good for us to keep improving. We hope to see you again in the near future.  Have a nice rest of the summer. Greetings from the Sunny Cala d'Or, Ola Es Ravells Team.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r496520204", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Subaverage", "review": "We come every year for our 1st holiday and it's always brilliant. Never have any complaints. The staff can't do enough. They are very friendly and professional.  I wouldn't stay anywhere else. I would highly recommend this apartment hotel. ", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r493440015", "sub_review": {}, "travel_purpose": "", "rating": 2}, {"title": "Very enjoyable stay!", "review": "Stayed for 9 nights in studio 6E08 and a few week prior in studio 6E02. Studio 6E02 has a view of the pool and stage; the other room has view of the gardens. Both were plenty big enough for two people and were clean and modern. The single sofa beds were exceptionally comfy; in fact I slept the best I have slept for years on those!   If you are a light sleeper and go to bed before 11.30/midnight you might want to take some ear plugs as the evening entertainment goes on till this time but may not be heard from all apartments. It certainly didn't bother us.   The bathrooms were perfectly adequate and had an excellent power shower above a bath. Please note, the website says there are hairdryers in rooms but there aren't! Please bring your own.   The air con must not have been…", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r490731077", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Bring back Maru!!", "review": "Dear  joyg1969 Thank you to take your time to write a review about us. We are happy than you enjoyed your holidays in Ola Es Ravells. We hope to see you again in the near future. Best regards, Ola Es Ravells Team", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r489140655", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Good little getaway", "review": "Place isn't the same without the boss! Other than that it was ok. it doesn't feel like the same hotel where we previously had some great memories I'm struggling for two hundred words for the rest of the 200 words.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r488880909", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Holiday", "review": "Dear kieronc583 Thank you to write a review about us. We hope to see you again in the future. Best regards, Ola Es Ravells Team", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r486901017", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Es Ravells 4th Visit ... Returning Sept Love This Place its a Gem", "review": "Wanted to get away for a week with my partner at low cost. Es Ravells exceeded expectations as was budget friendly. Very basic rooms but had everything we needed and was mostly clean. Great location with near by beach, restaurants, bars and shops. Entertainment from the bar out the back, and the bar out the front was very loud - not sure if this was just our room or if it's the same for all rooms, but didn't bother us anyway as we were mostly getting involved!", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r486140381", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "very clean", "review": "stayed here for 5 days very clean and roomy,nice pool area and bar, plenty of entertainment every day and night, ideal for families with small children, always something for them to do with the childrens entertainer, and entertainment for the adults in the evening", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r484142204", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent! Cant wait to return!! ", "review": "Dear Stephen  Thanks a lot to write a nice coment about us. We hope to see you again in the near future. Greetings from the sunny Cala d'Or. Ola Es Ravells Team", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r482680908", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great Apartments!!", "review": "Stayed here in room 7104. Directly opposite the tropical garden's stage. Absolutely loved the live entertainment every night (singers, parrot shows, reptile shows etc). Apartments were lovely, French doors didnt close properly and door in the room didnt lock so not child proof if you're child likes to try doors! Hollywood bar is very very loud but didnt bother us too much. Had to take the mattress from the living room sofa bed and put it into the room with us as we didnt trust.our 3 year old alone. Towels were only changed once in the week we were there so luckily we took some of our own. Beds were made by cleaners but sheets weren't cleaned.  Cala Gran beach is stunning. Gets busy but sea is lovely and warm/shallow. 5 minute max walk to the town. Glass bottom boat trip was…", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r479096009", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very nice and helpful staff.", "review": "Dear Rachel Thank you to take your time to write a good coment about us. We will pass this review to our animator. We are happy than you enjoyed your holidays and we hope to see you again early enjoying a new holidays whit us. Best regards, Ola Es Ravells Team", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r438387129", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Tour to Mallorca with a group", "review": "We have stayed here three times now, and every time we return to Cala D'or we will look to stay here! The staff are friendly and very helpful! On this trip we missed our transfers to the airport to return home, the reception staff were extremely helpful and managed to find us a taxi to the airport (not a short drive!) at very short notice! And thankfully we managed to make it to the airport, just in time!  The apartments themselves are lovely, well modernised since our first stay with comfortable beds and a well equipped kitchen - we always stay Self Catering as we like to try out local restaurants. The bathrooms are very clean and tidy and we had fresh towels at east every other day.  The balcony's are big and our got the sun most of the day if we didn't want to be by the pool…", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r429928138", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Great accommodation ", "review": "Stayed here for a week in a studio apartment with our 2 year old. The rooms are small but manageable. Great location - close to the beach and centre. Cannot complain at all for the price we paid. Wasn't too keen on Cala D'or itself however would probably return if we found a good enough deal. Would definitely stay at the Ola hotels again. ", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r428790418", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Dave", "review": "Mss. Stephanie, we are glad to see your nice review about us. We hope to see you and your wonderful family agtain with us in the near future. Best regards, Ola Es Ravells Team", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r428408221", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "First class holiday accommodation", "review": "Stayed for 2 weeks, bathroom has not enough room between basin and the bathroom  wall. Was in a 1  bed apartment in block 7 and could do with more work surface to prep food in the kitchen  area when you are staying self catering. You can't take food or drinks down to the pool as it's not part of the hotel.had a good holiday except for the couple of issues", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r425529997", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Nice, small, not expensive apartments near the center", "review": "Mr. Dave, We appreciate your opinion and we are very sorry for the problems that you had. We are glad to read that finally your holidays was great at Ola Es Ravells, we hope to see you again in the near future. Have a really nice winter, Kind regards, The Manager & The Team", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r424633822", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Excellent Apartments", "review": "Excellent apartments, a little basic but then you don't need loads of cooking facilities when you have so many bars and restaurants at your disposal.  We stayed in block 6 and if you want to have an apartment with a view of the pool and stage then you need to ask for one in either block 6 or 7.  Evening entertainment was great (although the last nights woman singer was dreadful).  Staff are brilliant, very helpful and always on hand.  Would definitely recommend and would stay again, excellent value for money.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r423139506", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Hotel fully booked on arrival!", "review": "I arrived at the hotel late at night following my transfer from the airport. On arrival I filled in forms and then was told that the hotel was full for three days due to \"an overbooking\" and we would need to go to a different hotel. This shows poor organisation between the hotel and travel operator and was a huge inconvenience to our stay as we could not properly unpack at the replacement hotel. The reception staff were apologetic and I understood it wasn't their fault. The lady with glasses on reception remembered us and gave us some free stuff.   When we did finally get to stay in our original hotel we had a one bedroom apartment in block 7. The entrance to the apartments is via a lift shaft on the Main Street and involved moving the suitcases up and down the steep incline to…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r422197118", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Now I know why they didn't get back to me....", "review": "Dear Gracieg Thank you to write a review about us. Please accept our apologies for this inconvenience at the moment of your arrival. We hope to see you again in the near future. Have a really nice winter. Best regards, Ola Es Ravells Team", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r421980027", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Lovely clean apartments in central location with good management", "review": "We booked in October 2015 for a 10 day stay in September 2016. I emailed, I sent a message by fb and trip advisor. I even tried to ring to see if I could get a particular room or at least a quiet block. No one got back to me. Probably because I was double booked! This happened to two couple's last year when we stayed. This year, it happened to us and three other families! Luckily the travel company rang us two days before and found us somewhere else. I'm not usually one to complain or write negative reviews but I think the way es ravells is managed is disgraceful. People spend their hard earned cash on accommodation and look forward to their holidays. To be told the place you booked is no longer available is terrible. The accommodation we were moved to was stunning and we came…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r420438487", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Disappointing", "review": "Dear Carolynda We are very sorry for this inconveniences, please accept our apologies, this year was very difficult in the whole island as well, is not an excuse.  We are happy to see that finally you had a nice holidays. Sincerally, The Manager", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r420379376", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Fantastic apartments had a lovely break ", "review": "Stayed here with my husband and 2 daughters recently. We had a one bedroom apartment which was no problem as the girls slept in the living room on the sofas which were just like proper beds -would be ideal for adults too. As we arrived late we had no food or drink as everything was shut but the bar staff were very helpful and sorted us with water and drinks to take up to the room (although quite expensive it was what we needed). The location is perfect just a walk down the road to the beach (which is beautiful) and you can go either into centre of Cala D'or about 5 minutes walk but is heaving with restaurants or as you come out the main entrance go straight ahead to streets of shops and things for the children  (bouncy castles go karts etc). Plenty to do although was surprised…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r419791514", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Very good appartment", "review": "Whe arrived late at night to find a appartment with only 2 beds for 3 adults! Went straight down to reception to complain and was told they would get it sorted asap! So we decided to go out for a drink and returned about 1 hour later to find no bed, just as i was about to go back to reception the lady arrived with a fold up bed!! At the time i thought hear we go its going to be holiday from hell!! But the next morning we realised the room (a studio)  was a little to small for 3 people but we accepted it and got on with the holiday, from then on the maids, pool area and bar were excellent, and the area is beautiful! I would recomend these appts to anyone but if there is 3 or more, go for a 1 bedroom and not a studio as these are really only suitable for 2 people also you get FREE…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r419709405", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "The best hotel in Cala D'or", "review": "Dear Scott, We are glad that you enjoy your holidays with us. Thank you for this precious comment. Hope to see you soon among us, we wish you a nice winter :) Best regards, Ola Es Ravells Team", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r419266069", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Amazing apartment.", "review": "I would recommend this hotel to anyone. Marut and the staff make you feel at home from the minute you arrive. The pool is fantastic and the atmosphere is laid back, the rooms are clean and spacious and offer fantastic value for money.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r419083466", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very relaxing ", "review": "Dear costumer, Thank you to write a nice review about our hotel. We are very happy that see you enjoy your holidays with us. We hope to see you in the near future. Greetings from the sunny Es Ravells :) Maru & The Staff", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r418613694", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Couldn't fault this place", "review": "I booked these apartments not knowing they had been under refurbishment. The whole apartment was modern and clean. I cannot fault anything from this holiday. Great hotel to sit on the balcony and watch the evening entertainment. I will be visiting again.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r417082385", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "All you need and really well placed in the town", "review": "Clean and centrally located. Really well placed for the beach. Good pool. Good air conditioning.  Our kettle was broken and kept tripping our electrics, but was replaced when we reported it to the reception.  Staff all very helpful.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r416198626", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Fabulous ", "review": "Dear guest Thank you to take your time to write an opinion about us. We are really happy to see you enjoyed your holidays in Ola Es Ravells. We will pass this message to the staff. We hope to see you again next summer. Best regards, Ola Es Ravells Team", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r415713277", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "great location", "review": "So sad that this is our last day here. Fabulous hotel, rooms modern and very clean. Staff can't do enough for you, and help to make your stay a good one. Will defiantly be recommending this hotel to friends and family and will certainly be coming back ourselves. ", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r414990484", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Our holiday", "review": "Dear guest Thank you to spend your time to write your lovely review. We are glad to know that you had a wonderful week here with us. Please send us an email before you are coming. Have a nice winter. Greetings from the sunny Cala D'Or, Ola Es Ravells Team", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r414239645", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great holiday", "review": "We stayed here for 2 weeks recently and found good and bad things with this place. Staff were always very helpful, we had to stay in studio for first night as no 1 bed apt available, we were told this was because original booking through low cost hols was cancelled & had to be re-booked, however hotel staff were very apologetic & gave us a bottle of wine & free use of room safe for 2 weeks as compensation. We had a few issues with the room at times & these were attended to promptly & there was free wifi in the room. The set up with Tropical Garden & the pool area is a bit confusing but they do need to get some more sunbeds, however the same families would be down every day to reserve beds for themselves whether they used them or not. Entertainment at Tropical Garden was mainly…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r414133479", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Disappointing", "review": "My friend and I spent a large amount of money to stay in these apartments and I have to say we were not best pleased. The room itself was fine despite being on the ground floor with absolutely no view whatsoever however, the maids did a great job of cleaning.   It was the entertainment staff that really let the place down. The acts of entertainment each night were fabulous- particularly the black eyed peas and michael jackson/bruno mars.   However, I had a horrific encounter with the 'kids entertainer' who made several rude comments about my friend and I while we were watching the shows. We were extremely humiliated and felt very uncomfortable for the rest of the stay. Considering we paid such a huge amount of money, we did not expect to be insulted by the childrens entertainer…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r413839605", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Nice stay - need to sort sunbeds", "review": "Thank you very much to take the time to write your opinion about us. I am very sorry for the inconvenience during your stay. I already spoke with the entertainer to be sure this matter will never happen again. He apologize for the misunderstanding. I will keep the control on him, please accept my apologize. I hope you to give us a second chance and come again to visit Es Ravells and have a nice conversation together. Sincerely Maru Curutchet", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r412354039", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Fantastic Stay in the Ola Apartamentos Es Ravells D'Or", "review": "Booked over 9 months ago, arrived after a long day travelling to be told our apartment would not be ready for 2 days and we'd need to stay in the nearby (across the road) Sol Hotel. Apartment there was nice enough but this wasn't ideal with a 4 year old. Receptionist at Ravells was apologetic and walked us over to the Sol Hotel. We then had to wait another 20 minutes to get checked in here. Would advice Ravells that if they are asking guests to stay at a different hotel that they arrange with Sol to have their rooms ready. We'd been up since 4am.  For the inconvenience we got free breakfast at sol for 2 days and free safety deposit box at Ravells.  When we got our apartment at Ravells it was nice and clean, larger than expected and looking out over the pool area.  The pool is…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r411567998", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Very small indeed!", "review": "Dear Lauren Thank you for spend your time to write a review about us. We are very sorry for these inconveniences at your first day, but we are happy that finally you were pleasant enjoying your holidays with us. We hope to see you again in the near future. Have a really nice winter :) Best regards, Ola Es Ravells Team", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r407894757", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "family holiday ", "review": "We stayed again this year in Ola Apartamentos Es Ravells D'Or & I honestly can not speak highly enough of Maru & her staff again this year, they made the 3 of us feel so welcome everyday & always had a smile & always had time for a chat with us or Ryan or if you needed any help with anything if they could accommodate in helping you they would . The apartments were spotless and cleaned every 2 days & if you did need fresh towels you could have them daily, the air con was spot on, the location is very central pretty much within walking distance of all shops, restaurants etc etc. I'm already looking forward to going back next year to such a wonderful place with wonderful staff in a wonderful location.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r404661718", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Last minute deal ", "review": "Booked through 'travel soon' and wasn't sure what to expect as booking was changed several times (beds not available at chosen accommodation) however my daughter and I were delighted with our apartment. 3rd floor corner studio, two balconies, clean and comfortable. Staff very friendly and helpful, nightly entertainment- bit cheesy but fun, pool exceptionally clean - I watched the pool guy clean it every morning. Less than 5 minutes walk to small clean beach. Plenty of restaurants with very similar prices- average 50e for 2 sharing a simple starter, dinner and drinks. ", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r401575660", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Family holiday ", "review": "Dear Cazjay Thank's a lot for your review. We are very happy that you enjoy your holidays in Ola Es Ravells and we hope to see you again in the near future. Have a nice winter :)  Greetings from the sunny Cala D'Or, Ola Es Ravells Team", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r401376296", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Ola Apartamentos Es Ravells D'or", "review": "We have just got back from Ola es Revells and as usual a perfect holiday. This hotel is the best, Maru and Paco are amazing people who will go out of their way to help you. The apartment was spotless as usual, all of the maids were friendly and nothing was too much trouble. This is our fourth time going to this hotel and already we are planning for next year. It really is the best.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r399928094", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Decent place we had minor issues upon arrival. ", "review": "Dear Debbie Thank's a lot for this wonderful opinion about us. We are really happy that you enjoy your holidays with us. We can't wait to see you again nest year. Please send us an email before you are coming. Have a really nice winter :)  A lot of greetings from the sunny Cala D'Or, Maru & Ola Es Ravells Team", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r399870355", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Great holiday", "review": "Stayed here for 11 days 2adults/2kids15&10. Rooms clean &modern. Pool area always clean too. Staff very friendly and helpful. Great location and everthing in walking distance. Nightly entertainment at poolside bar very good and varied with fairly professional acts overseen by Liam the resident, full of energy, rep. Would highly recommend and will definitly go back", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r398880273", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Good standard accomodation in a great location", "review": "Our long awaited family holiday hit a hitch when on arrival we didn't have an apartment and had to stay at the hotel across the road.  The receptionist Jose was very apologetic, and assured us we would be happy with the apartment we would get the following day.  He was right, the apartment we eventually got was a good size, we had a balcony and a terrace and it overlooked the pool. The luxury of overlooking the pool meant we could enjoy the evening entertainment from our room if we didn't want to stay downstairs in the tropical garden bar.  The apartment was well equipped and was cleaned on several occasions during our 8 (should have been 9) night stay, and all the staff at the apartments were all very friendly and helpful.  Only a 2 minute walk to Cala Gran beach, with all the…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r398872848", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Ok hotel", "review": "I stayed for 4 nights with 2 friends. We shared one apartment with sofa beds. Beds were ok. Air conditioning is quite poor and we found at some moments we would have liked it to be cooler. We barely managed to get sun beds by the pool, the area is pretty crowded at times.  The pool closes at 18.30 which is a shame. They should have a second pool that stays open longer. The evening entertainment pretty good considering that we are on a small Island in the mediterranean. But noise from singing can be heard from the apartments until midnight. Location of the hotel is really good.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r398463144", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Very dissapointed!", "review": "Booked this accommodation due to the great reviews and were very disappointed on arrival. For the life of me I cannot understand why the reviews were so great. Firstly a positive our room was ok, spacious and comfy. Rooms clean but not spotlessly cleaned as per other reviews. Rooms were just swept and never appeared to be mopped however they were ok just scrapping the 3 star rating I would say. Our bathroom flooded overnight but to be fair was fixed within a couple of hours so no big problem, we were however without hot water for two days which was inconvenient to say the least.   Now to the rest of the place. Our balcony over looked some \"gardens\" these were not well maintained, the path to the pool were uneven and dirty and  the bin area was often overflowing. The locals…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r398419382", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Visited many times", "review": "I have stayed in Cala D'or many times over the years and I think you will be hard pressed to find accommodation that is as good as this place.  The rooms have all been renovated recently and to a high standard.  The pool is excellent as is the entertainment during the day and also during the evening there is a mini disco for the kids and then attribute act to finish the night off. All entertainment finishes at Midnight so very quiet after then. Any problems and the manageress Maru will go to great lengths to sort them out. Give it a try you will not be disappointed", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r398062186", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Worst apartments we have ever stayed in", "review": "Thank you very much for spend your time to write this fantastic review about our Hotel. We are happy that your stay with us was perfect. We hope to see you again enjoying your holidays with us in the near future. Greetings from the sunny Cala D'Or, The Manager - Maru", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r398016271", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Good apartments for a good price", "review": "Have just returned from a weeks stay here and we were very pleased with our stay.  We had a 1 bed apartment in block 6. The apartments are very clean and nicely decorated. We were apprehensive at the thought of having to sleep on sofa beds for the week but were relieved that these were actually 2 single beds with proper mattresses. The air con was a bit hit and miss but was on during the evening when getting ready so didn't really bother us too much. Rooms were kept clean and towels changed regularly and reception were very helpful and friendly when we needed something.  Pool area was great and was still able to get a sunbed at 9am, so no early morning alarm. My only criticism is that we found the pool bar a little expensive, but the evening entertainment is great. All in all we…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r397993419", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Some problems but still enjoyed", "review": "Dear Rachel Thank's a lot for this wonderful review about us. We are glad that you enjoy your holidays with us and we hope to see you again next summer. Please send us an email before you are coming. Have a nice summer and a not to cold winter in London ;)  Best regards, Ola Es Ravells Team", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r396486019", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Very Disappointing!", "review": "Please do not be put off by what I am about to say. Room was 1 bed apart. Very nice as we had one of the refurbished ones. Very comfortable beds however air conditioning only came on between something like 6pm and 2 am the reason why I am vague is because I could not tell difference when it was on !!! I did report it but nothing was done. We also had no hot water for 2/3 days whilst a part was being sourced. Our fridge did not work but was replaced quickly. To top it off we were woken at 3.50am on our last night there for a wake up call we did not request. Could not then get back off to sleep which ruined my last day. I do think the hotel should have offered some sort of compensation for the lack of hot water. A simple voucher to use for food/drinks would have been appreciated. …", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r395851073", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Great hotel", "review": "After reading all reviews on this property we decided to book two rooms, one bedroom apartment for myself, husband and two children and one studio for my Mother and Aunt for 10 night holiday.  The rooms were more basic than anticipated for the price.  Not much room in the bathrooms and in the studio apartment you had to sit sideways on the toilet!  Also the pool area was certainly not huge as described and anyone who drinks at the bar can come in and use the pool.  When we checked in we were charged double the rate for safety deposit key than weekly stay.  We were charged 30 Euro for safety deposit for the 10 days (15 Euro for 7 nights), weekly and 10 days receive 6 euro back when return key.  Also when we checked in we were told that are room would be cleaned 3 times per week…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r394443665", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "May 2016", "review": "Dear Jules Thank's a lot for your time in writing your review and help  to keep improving our service. We are sorry that your stay was not to your liking and also very sorry for the problem that you had. We hope you give us a second chance and look again in Ola Es Ravells. Best Regards, The Manager", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r386061790", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "FABOULOUS APARTMENTS", "review": "We have just returned after a last minute 3 night break with 2 kids. Last stayed here 5 years ago with 20 guests for our wedding and had an brilliant holiday. The hotel manager Maru is AMAZING lady and nothing is too much trouble for her to sort, even left a note & gift in our room to welcome us back .Everything is run ship shape and to a very high standard. The place has been refurbished to an lovely modern Mediterranean white/grey design which even has proper bed mattresses on the sofa beds. Nice to see the same staff on reception too which shows you that Boss knows how to look after the workforce. We look forward to book again in September as we've had such a good holiday. Best apartments in Cala D'or by far in my opinion as I've stayed in many others 😊", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r385738893", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Lovely place", "review": "Dear Friends Thank's a lot for your review. We are happy that you enjoy your stay with us once again in Ola Es Ravells. It was nice to see you here again.  Have a nice summer in the meantime see you in September ;) Best regards, Ola Es Ravells Team & Maru", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r381644640", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Clean, Comfortable, Perfect Location", "review": "Stayed here end of May.....had read all reviews.....brill place....rooms lovely....all staff very friendly nothing too much trouble....bar and entainment area good....would def stay again. 15 mins to the lovely Marina and 5 mins to the centre.....lots of restaurants and bars.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r380649307", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Es ravells appartments  Cala D'or", "review": "Thanks a lot for this fantastic review about your stay in our hotel. We are glad that you enjoy your holidays with us and we hope to see you again in the near future in Ola Es Ravells. Greetings from the sunny Cala D'Or : ) Ola Es Ravells Team", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r378511677", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "5 star ES RAVELLS", "review": "This hotel has a perfect location. A short walk from the beaches, restaurants and bars.  The rooms are very spacious and modern for Spanish standards. Fully equipt for a self catering holiday. The room/bathroom was very clean. I was very impressed.  The pool area is very big and the bar/restaurant is very good. I ate lunch there everyday. Entertainment isn't really my thing but it's really good if you have kids.  My mum was also staying in Cala D'or in another hotel. She loved our hotel so much that she booked herself in.  Next time I come to Cala D'or I'll book this hotel.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r378304009", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good location", "review": "This hotel has a really good location. It is 5 mins walk to the square where all the restaurants are, it's about 15 mins walk to the marina and 5 mins to the main Cala gran beach. The staff in reception were very helpful and friendly. The room was clean and had a nice big terrace overlooking the pool. We used the hotel as a base so didn't try the bar for food, entertainment etc. Great for the price we paid. ", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r375204547", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A long needed break", "review": "Dear Tracey  Thank you to spend your time in writing about us. We are happy that you enjoy your stay with us and we hope to see you again in Ola Es Ravells. Greetings from the sunny Cala D'Or, The Management.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r373626441", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "No frills - but a lovely hotel", "review": "What an amazing hotel the rooms were spotless everything we needed was in the room the staff were all very pleasant and helpful and we enjoyed staying at this hotel so much we have just rebooked to come back in October for a longer stay.  We were able to get free wifi in our apartment which was a blessing and the live entertainment every night in tropical garden was always a pleasure to watch. This hotel has everything great location for shops supermarkets bars ice cream parlours beaches and no end of places to eat & drink when needed.  Myself & my partner flew back to the uk last night and we were sad we were leaving & we both wished we could have stayed longer hence rebooking in October 2016 to return.   Thank you ever so much for everything you did whilst we were staying with…", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r372056921", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Holidays ", "review": "Dear Brian & Sue Thank's a lot for your review. It is nice to know that you enjoy your stay in Ola Es Ravells. We can't wait to see you again next october. Remember to send me a mail before you come. Have a nice summer in the meantime! Best wishes, Maru & the staff :)", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r371468947", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent entertainment", "review": "We stayed here last week, had booked online direct on the hotel website. When we arrived, we were greeted by reception and given our hotel key card. Went into the room and it was smaller than a hamster cage, probably mainly my fault but I had booked a studio room.  There was no bed!  Just two sofas, which turned into beds, so basically you slept right next to the kitchen. I immediately discussed the matter with reception, and asked for a room upgrade, 75 euro later it was sorted, and we had our own bedroom.    We were then really happy, the room was very clean, and spacious. Beds were comfy. TV didn't work so we had to contact reception and that took around an hour to fix. Kitchens had a worktop hob, toaster, sink and microwave all of which were spotless.  There was no…", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r371268172", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Basic apartments", "review": "We first visited Es ravell dor in 2005.  Things have been maintained to a minimum and no real improvements made.   Our holiday was a cheapy and if your really not fussy then this will do, however even I was a bit unhappy with the smelly toilet, the ant infestation, the lack of air con or fans and the lack of self catering facilities.   We really love Cala dor and have been several times now but won't be returning to Es ravell. ", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r337034202", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Fabulous stay", "review": "Thank you very much for your review. This is very important for us to keep improving. We are sorry that your stay was not to your liking. We hope you give us a second chance and look again in Ola Es Ravells. Kind regards, The Management.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r320978599", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Great value for money", "review": "We booked a first time, last minute trip to the Es Ravells apartments in Cala D'Or and were more than pleasantly surprised.  The apartment itself was on the first floor of Block 6, it overlooked the pool, was clean & comfortable, the complex was close to the beach and the amenities of the town, the staff were friendly & helpful and there was entertainment every night in the Tropical Garden.  We would definitely return and book again.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r320033784", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Never again!", "review": "Dear Angel  Thank you to spend your time in write about your stay in our hotel. We are happy that you enjoy your holidays and we hope to see you again. Please send us an email before you are coming. Best regards, Ola Es Ravells Team.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r319418598", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Lovely stay", "review": "We have been here many times and love the central location and having an apartment enables self-catering. Everthing is within easy walking distance. The staff is always extremely helpful and friendly.  The nightly entertainment goes on until midnight so do not expect an early night.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r318202530", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "First visit", "review": "Hotel very clean and close to everything. Staff are friendly and helpful. The Tropical garden and  Pool adjacent is lovely, friendly with an array of entertainment. You are a hairs breath from the centre and one of the beachs.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r317478755", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great Location and accommodation.", "review": "Thank you very much for your opinion, we like to know that you spend a pleasant stay in our hotel. Hope to see you again. Have a nice and not very rainy winter. Greetings from the sunny Cala D'Or! The Management", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r316934343", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "annual holiday", "review": "We stay here every time we visit Cala D'or. Self catering in an apartment. Lovely staff, great location, clean and comfortable accommodation. Reasonable prices too. Very close to the centre of Cala D'or. Visit the marina for great food and views. Visit Dugans Irish bar for great live music. ", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r316894666", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "had a great time. first time in cala d,or.", "review": "Hello Thank you very much for your opinion, this makes us very happy and help to continue improving. We hope to see you again in the near future. Please send us an e-mail before your arrival and we will try our best. Have a nice winter. Kind regards The Management", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r316354845", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Amazing holiday! Amazing hotel!! ", "review": "This is the 6th visit to this hotel and from years past it has much improved. It has been a very comfortable stay with friendly staff available 24/7. Being so close to all amenities makes this a very popular hotel. We are now looking forward to next stay", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r315741091", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "1st holiday for years", "review": "Amazing. This hotel deserves 5 stars and I can not fault it. The staff were very helpful and nothing was too much trouble. It was very clean and unlike some places the maids were not noisy in the mornings 😊😊😊", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r315448672", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Es Ravells ", "review": "Thank's a lot for your time, your opinion is very important for us. We are glad that you enjoy your holidays and hope to see you in the near future and spend again an amazing holidays whit us. Greetings from the sunny Cala D'Or! The Management", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r310736687", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Brilliant hotel", "review": "Had a great stay at Es Ravells.  We stayed in block 6 top floor and had great views of the live music acts at the Tropical Gardens, which I have to say were  fantastic.  The rooms were cleaned every other day and were spotless.  The complex is ideally situated, less than 5 mins to the beach and 10 to the square with all the restaurants, with shops along the way.  We ate in Supertramps most days which is just across the road, had some fab meals and very reasonable. Never had a problem getting a bed by the pool. I can highly recommend if you're thinking of staying here.  Cala D'or is a beautiful resort with something for everyone. ", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r310574740", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Good apartment - however a lot of noise", "review": "Thank you for your nice opinion about us, always is grateful to hear that our guests enjoy the time whit us. We are working hard to keep improving Es Ravells and make everybody happy. Hope to see you next year. Kind regards The Management", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r310443882", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Love this place!", "review": "Fantastic hotel close to all restaurants and beaches. Rooms very clean and Maids cleaned every other day and changed towels etc. fantastic pool and bar. Entertainment was pretty good. Definitely recommend ", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r310159277", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Simple and central", "review": "Our first time in Cala D'or and indeed on this island.  This hotel is ideally places for all of the bars and restaurants in the town and has a nice pool complex.  Our room (Block 6, 12) was small and compact with two single beds that we pushed together.  The room was quiet and the air con free and pretty efficient.  We can't comment on the nightly entertainment was we were too busy in many fine bars and restaurants!", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r309837563", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Fabulous As Always", "review": "Thank you very much for your time, your opinion is very important for us to improve our service. We hope to see you again in Es Ravells. Kind regards  The Management", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r308540857", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Es ravells", "review": "Once again we had a fabulous stay at Es Ravells.  Maru and her staff are fantastic, so helpful and such lovely, approachable people.  The apartments have all been totally refurbished and are gorgeous, really bright and fresh.  There is a microwave, kettle and toaster in the apartments and a laundry room on site. The pool area is clean and tidy and there's plenty of beds.  The beach is a 2 minute walk away and the main town is only a few minutes further.  I cannot recommend these apartments highly enough and will be returning again.", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r306724081", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good Stay", "review": "Hello, nice to hear you did enjoy once again your stay with us, that help us to keep going along all the season and keep working hard year after year. I hope to see you again next year and don't forget to send me a mail before your arrival. Have a nice winter!!  Hasta pronto Amigos ;-)", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r306217734", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good value", "review": "Lovely place, lovely restaurants, beautiful bays, really enjoyed it. The people are nice, worth a visit, not to noisy really nice for families what else can I say. And the water park is fun for the kids and the starfish boat trips, and the marina is gorgeous with some lovely restaurants aswell .", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r305091654", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great value", "review": "We stayed in a studio which was plenty of room for three of us, sleeping on two sofas plus a pull out bed. The rooms are fairly modern and not tired looking like some I have stayed in and also look like they have been recently decorated. Staff are friendly and always happy to help. Cleaners visit every other day. Hotel is in a central location and is noisy up until midnight with live music. Ask for block 4 for maximum peace and quite if required. Block 7 is the noisiest as there is a karaoke bar below which goes on after midnight. The beach is a 2 minute walk one way and the shops, bars and restaurants 2 minutes another way. The marina is around a 10 minute walk. The pool is open to the public but doesn't get overly busy. The bar shows sport when on and prices are about average…", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r304667964", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Family holiday", "review": "Tank's a lot for your time,  your opinion is very important for us.  We are glad that you enjoy your holidays and hope to see you in the near future. Grettings from the suuny Cala D'Or!! The Management", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r303038111", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Absolutely disgusting...sick splattered on the bed sheets!", "review": "Main reception staff polite unfortunately not able to help sometimes,very clean well presented apartment, with 2 balconies, block 7 206, would have liked more clothes storage as for 4 or us not enough space, missing 1 couch in living area but we used fold up bed, lovely large patio balcony shame that they didn't put sun-loungers on there for full benefit, bathroom well if you couldn't fit through a 13\" gap between wash basin & wall you wont reach the toilet or bath! Air con was quite poor when on between 12 lunch time -7am but adequate, wi-fi you could get some in room as we were near reception, in reception area not too bad. Kettle would take ages to boil as it cut in out (apparently all hotels are like this says manager!) We were over looking pool area & Tropical Garden bar…", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r301841135", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Holiday Stay", "review": "Tank's a lot for your time,  your opinion is very important for us.  We are happy that you enjoy your holidays and hope to see you in the future. Kind Regards!! The Management", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r301443645", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Don't be fooled by the pictures!", "review": "We originally booked to stay at the Cala d'Or Playa but Jet2holidays and the hotel overbooked the hotel and we had to stay in Es Ravells for 2 nights.   On arrival we were personally greeted by the manager, who seemed nice.  On entering our room we were first greeted by the terrible smell, it smelt like stale cigarettes, it was awful. On further inspection of the room we found sick splatters on the bed sheets, rusty and stained fridge, cobwebs hanging from the roof, broken roof tiles, grime on the shower, rusty shower head.   We ended up complaining to the Jet2holidays rep who came out to see the room and was shocked at the state of disrepair. She spoke to the manager and some of the problems were fixed immediately, which was a slight improvement.   When we checked out the…", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r300348729", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Time of my Life!!", "review": "I will never forget the 5 days I spent in Cala D'Or!! From the moment I arrived,I knew this was the beginning of a special vacation. The staff were incredibly helpful from the get go, and extremely accommodating! I live in Canada, and my stepfather booked this excursion for me while I was visiting him in England. I had no idea where I was going, but would love to be able to return there again. I made several friends, and will cherish the memories I took from there!", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r299542236", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Basic apartments in a great location", "review": "Tank's a lot for your time,  your opinion is very important for us.  We are glad that you enjoy your holidays and hope to see you in the near future. Grettings from the suuny Cala D'Or!! The Management", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r297657990", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Live Entertainment nightly", "review": "The apartments are basic but adequate for a family of four. We stayed in block 6 which has a lift and the rooms have been recently redecorated. The kitchen has a fridge, microwave, kettle (think ours was a bit dodgy though as water not always totally boiled!) and a small hob. The air conditioning was fine- on all day and very welcome!! Depeding on the room you are allocated you may or may not have a double balcony- we didn't but there was plenty of room for the four of us plus an inflatable boat and the handy washing line. The room was cleaned every other day and bed linen changed once during our 10 day stay. The reception staff, Jose and Paco are very helpful and friendly, they were able to advise on day trips (which can be booked at the reception) as well as local maps and…", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r297125155", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great holiday July 2015", "review": "Tank's a lot for your time,  your opinion is very important for us.  We are glad that you enjoy your holidays and hope to see you in the near future. Grettings from the suuny Cala D'Or!! The Management", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r293455100", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Disappointing ", "review": "I haven't stayed in this hotel but the bar area 'Tropical Gardens'  of the hotel is open to the public and there is free nightly entertainment.  There is a mini disco for the kids nightly before the main show and 3 times a week they also put on a parrot/reptile/birds of prey show.  Once you have got your table, it is waiter service and the 2 main waiters Tony and Paco couldn't be more helpful. We have seen some really good shows in the few years we have been going, but the best act we have seen, what The New Jersey Boys who were playing there this year.  We saw them both weeks of our stay. They are 4 lads from the UK who obviously enjoy what they do and the chemistry shows in there performance. The first half of the act is dedicated to the music of the Jersey Boys which will…", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r292963264", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Poor", "review": "Not a very good hotel:  Airco only at nights. Beds are terrible. Pool restaurant is not part of the hotel. So you cant bring your own drinks and food.  Please keep looking for another hotel in Malloraca, there are plenty of them.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r292914015", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Perfect location", "review": "Tank's a lot for your time,  We are sorry that your stay at our hotel was not good. We appreciate your opinion and we will work hard to improve. Kind regards!! The Management", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r292146430", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Good holiday with good location", "review": "Stayed here for a week so we could attend wedding nearby in the yacht club. Glad we did. On arrival we were told the studio rooms were not quite ready so they upgraded us to two appartments. All good. Situation for the rest of Cala D'or was great with all you could want within a few minutes walk. Desk staff and bar staff were very polite and friendly. Never ate here but we were meeting people every night. Cala D'or is a lovely place and if I was to return I would have no hesitation in booking these apartments.  ", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r291525810", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great Holiday", "review": "Tank's a lot for your time,  your opinion is very important for us.  We are happy that you enjoy your holidays and hope to see you again in Ola Es Ravells! Kind regards !! The Management", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r290427080", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely clean friendly hotel", "review": "We stayed in a studio self catering apartment for two weeks at the beginning of July 2015. The hotel was really close to all the restaurants and within walking distance to a few beaches, the closest being Cala Gran. There was also the electric solar train bus stop outside the hotel. The marina was also only approx a 15-20 mins walk away.The room was as expected for a studio apartment, towels were changed regularly although the floor never seemed particularly brushed, the bits of sand seemed to be pushed under the table. Could have done with a brush in the studio to sweep up sand ourselves to stop it getting on our feet all the time. There was free Wifi in the hotel lobby and nightly live entertainment shows in the tropical gardens bar by the pool. We were in block 6, away from…", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r288000563", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great week", "review": "This is the second time we have stayed at these apartments and throughly enjoyed ourselves.  The apartments have been  refurbished this time they are clean and bright. The entertainment was excellent and Aer made our holiday. He was really helpful and good fun. We would definitely book again.", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r280488436", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "wish it had been longer", "review": "Thank you for your opinion.  It is very important for us.  We are happy that you had a good holiday at our hotel.  Hope to see you soon!!  Greetings from the Sunny Cala d'Or!  The Staff", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r278347508", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A++", "review": "Stayed at the ravels D'or 11th -18th May.  We had a great apartment, very clean with lovely big balconies The apartment number was 501 and you got the sun most of the day. You could here the music from the Tropical Gardens Bar but not loud enough to bother you. The staff here were fantastic, the staff on reception could not do enough for people. I wish now that I had booked for 2 weeks instead on 1. Will be going back to these apartments again.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r278120446", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Mrs K Donoghue,    Brilliant place to stay", "review": "Thank you for your opinion.  It is very important for us.  We are happy that you had a good holiday at our hotel.  Hope to see you soon!!  Greetings from the Sunny Cala d'Or!  The Staff", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r277241267", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Mr and mrs smart", "review": "Been home a month now, and forget to write a review. but here it is...   Es Ravells D'or is a very friendly, comfortable clean play to stay. it was our first holiday as a couple and we are so glad we picked here. the staff were so friendly and helpful. (even at 2:30 in the morning when we arrived). We stayed in Room 6E00 and was SO clean. and well kept. Maid service every other day. they was Really quick and in and out before we knew it. Our view from our balcony was spot on too!! We was pool view, and could see everything from there. even the night time entertainment. Es Ravells is a few minutes walk from the town center, beach, local shops and restaurants/bars.   the bar and restaurant at the hotel (tropical gardens) is also a nice place to go and sit, have a cocktail or two.…", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r275453503", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Brilliant holiday place", "review": "This was a very pleasant place to stay and the staff are very polite it's also  very clean too they definitely make you feel welcome. The bar staff at tropical gardens where ace and the pool was very nice and clean. Me and my partner would come here again maybe in a few years time the only down fall was the coach journey to the place from palma airport it's about 2 hours drive but it was OK. It's also 5 minutes walk away from the beach is the hotel and even that is very clean many thanks to all the staff :)", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r275294106", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "wonderful", "review": "Thank's a lot for your time,   your opinion is very important for us.   Thank you so much for your good opinion about our hotel and the staff, we work hard to do the best for our guests and we appreciated your satisfaction.  Hope to see you in the near future  Grettings from the suuny Cala D'Or!!  The Managment", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r275116182", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "good all round", "review": "Well equipped spotless apartment everything looked brand new. The towels were changed 3 times during the week which was great. I stayed in block 4 which was perfect, i would imagine blocks 5/6 would be a little noisy as they are closer to the entertainment, but in 4 although i could still hear the singing it wasn't too intrusive   ( it also finished about 12ish anyway). The staff were all very helpful and knowledgeable about the areas bus routes and timetables for example and the Apartments are perfectly placed for exploring the Calas ( on the road train )and indeed all Majorca.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r274963521", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great stay", "review": "Thank you so much for taking your time and help us to improve our service.  We always working hard to do the to do the best for our guests and appreciate so much your opinion.   We hope to see you in the near future.  Grettings from the sunny Cala D'Or!!  The Management", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r273087716", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Would be 5 stars but was too noisy for us", "review": "stayed here for week,enjoyed every minute,rooms clean and tidy,staff friendly,entertainment ok,we had good room looking over pool and entertainment so in evening could sit on balcony cheap bottle of wine and be entertained,close to all amenities,short walk to nice beach,would go back", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r270633820", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great stay", "review": "Me and my partner had booked to stay in a studio, on arrival we were told that there was no studios available and if we stopped at another hotel for 2 nights (free) and then go back we would be upgraded to an apartment which was great we got a spacious apartment with a huge wrap around balcony paco also give us safe key and remote for free. The pool is great just a shame about having to stop using it so early. Es ravells is in a good central location very close to plenty of restaurants and bars, also very close to the beach. I would stop here again but maybe when im older as great as cala dor is there is not much for a 22 and 23 year old. Apartments are fab though.", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r249257073", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "A good central location", "review": "We enjoyed our stay at the Es Ravells D'or.  We staying in a studio apartment overlooking the pool.  The room was clean & quite spacious.  My only issue was as I am 6ft 4 tall the single beds which also doubled up as settees had wooden sides which prevented me from stretching out a night!.  The tropical garden pool bar & entertainment was very good, however being told on our first night on the 3rd October that the food was running out wasn't great! For relatively cheap accommodation in a central location, we would go back....", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r240026223", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent value", "review": "Stayed from 16th October to 22nd first of all i would highly advise that u do not book the bus transfer to the hotel got on the bus at 10am sat on it for over one hour before we departed arrived at the hotel at 12,30 so it took longer to get from the airport to hotel than to fly from Doncaster pay for a taxi it realy is worth it when we did finaly get to es revells we were greeted with a great smile and walm welcome my partner was even given a cold beer Paco was very helpfull upgraded from a studio to a larger room in block 6 third floor rooms very clean beds good this was the week that the hotel was closing for the end of the season big mistake for us Thursday until Sunday was fine then after that things started to disapear sun beds parasols tables all around the pool and bar…", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r237183233", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Lovely surprise", "review": "This was a last minute holiday for my mum and myself and it was a lovely holiday.  The hotel is clean, the apartment had a fantastic wrap around balcony overlooking the pool area.  We went self catering, there were plenty of restaurants to choose from, las palmers restaurant (pedro's corner) is a gem, lovely food, good presentation and the best service.  The beach is about 300metres away in a straight line, it has good facilities, clean toilets cafe's and shops.  The sun beds i thought were expensive 13 euro for two sun beds and parasol.  This perfect for couples and families as there is plenty to do all within walking distance.  Cala  D'or is a lovely Spanish town, not like palma nova or magaluf, it is a small town with coves and history. Enjoy :)", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r235233358", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "A LATE SUMMER BREAK IN CALA D'OR", "review": "Two weeks ago my wife and I returned from a 14 day holiday to Mallorca. We stayed at the Hotel ‘Apartamentos Es Ravells D’or’ within easy walking distance to the town center of Cala d’Or. We had a wonderful fortnight, the apartment was very clean with three verandas, one outside the bedroom, one outside the kitchenette area and the other outside the lounge. All the staff at the hotel were very friendly and helpful, the maid especially so. However there are always things which mar the holiday.  When we arrived in resort the bus dropped us off outside our hotel. To get to the reception was a fairly steep downward slope, steps or ramp. So, down we went with our luggage, Paco, the receptionist, a great guy, booked us in,  allocated us our accommodation gave us the safe key and…", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r235127615", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Another perfect stay!", "review": "My partner & I stayed here for the second year running after a wonderful time last year! We requested the same apartment as last year via email direct to the hotel as the room was perfect for us and they managed to move things around and get us into the same apartment we had last year. The staff were more than helpful and were always more than happy to help, should we need them to! Plenty of sunbeds and the bar staff are hilarious! Entertainment every night was fab and finished at a reasonable time. The pool was gorgeous, got the sun almost all day and was very well kept. Good selection of drinks and food at the bar. Perfect location, just a very short walk from shops, restaurants, bars and the most gorgeous little beach.  The apartments had been done up since last year and I…", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r233623359", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "taffys break", "review": "we went 19th sept for a week had a fab time everyone friendly lovely appartments and pool area and near the beach if you walk down steps by stage few mins will bring you straight onto the beach there are loads of bars and restaurants and we seen some good singers there is also entertainment every night in the appartments the hollywood bar next to the appartments was good lindleys was great dugans irish pub had some great bands the cocktail bars have parrots in them and the owner comes round and puts them on your head if you want all a bit of fun hadnt been to calador before but will def be returning", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r233120070", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Generally very good", "review": "Booked 2 1 bedroom apartments, 1 for 3 adults and 1 for 2 adults. Requested rooms next to each other on a higher floor, got 1 in block 6 on the first floor and 1 in block 4 ground floor!! not really a problem. Both apartments generally good, myself, husband and daughter in block 4 had an \"upgraded\" apartment, slightly bigger and a bit more modern than my parents apartment in block 6, but on the whole not much different. Air con seemed to be available 24/7 which was great at no extra cost, balconies were big! One bit of advice though, if you want to hang clothes up, take hangers, both apartments had 2 hangers per person !!! I don't class myself as fussy when it comes to basic holiday accommodation (many, many years travelling to Greece!) but 2 hangers per person and no drawers or…", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r231679047", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Best holiday ever!!", "review": "We went to ravells apartments on 1st of september for a week with our 2 children. The staff very excellent and couldnt do enough for us especially Dani the childrens entertainer. My kids loved her!! The food and drinks were lovely and the entertainment were great especially take that and michael jackson. Will be returning next year!", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r231536424", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Superb Holiday", "review": "Once again a superb holiday with many thanks to all the staff at ola es ravells.  We are always treated in a fantastic way from the minute we walk in reception to check in  2015 we will return   Thank you Maru and all your wonderful staff", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r230661393", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Cheap getaway", "review": "Stayed here for a long weekend. Rooms were spacious good size balcony kitchen OK but didn't use except the fridge. Bathroom nice and clean. Great for what we paid. Pool area was excellent plenty of beds and pool was lovely. Cocktails were sometimes good but avoid frozen style at all costs! Food basic but ok. Good location for the quiet resort. Entertainment was OK what we saw of it. Drinks expensive! Also we were woken by a cockrel every morning at 6am.....", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r229763958", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Fabulous location", "review": "Travelled 31st Aug.. Es Ravells is situated very central with plenty of bars and restaurants near by.  We had a one bedroom apartment for the 2 of us but the lounge would be a squeeze if 4 adults. However, some vary in size and looked like may have been bigger than ours. Basic but very clean and tidy and looked like the bathroom had been refurbished. Kitchen facilities are basic and if planning to cook may be a problem. Maid service excellent...Pool lovely and clean.   Evening entertainment was very good apart from the Elvis tribute......Kids entertainment girl was very friendly.... We were in block 7 room 701. This had a huge balcony and was directly over looking the outside stage, excellent view to watch the entertainment .  Weather hot, 28 degrees @ 9pm.., which was lovely to…", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r229657080", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "another fantastic holiday at ola ravells", "review": "(Lynda..mary and ashley) another fantastic holiday ..Very clean hotel..room was made up every other day with fresh towels ..staff and bar staff were very friendly ..air con not fantastic but was adequate ...Great value for money ..pool very clean lots of friendly people ..Great entertainer with daily polo games and quizzes round the pool ...definitely will be returning next year ..", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r229494303", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Great facilities- great value and location", "review": "family of four stayed in Late July / early August 2014 - placed in block 7 with good view of pool and late night stage entertainment. In this block I agree things do go quiet at midnight but if need quieter rooms then younger families should  request the other blocks. I was a bit worried about comments of air con but it is on enough to give cool rooms without the need for extra charges!! - a bonus. The pool is excellent with enough shady sunbeds and the location for central cala d'or is perfect .All hotel staff ( especially hunky paco) were very friendly and helpful. Would definitely re- book.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r229054156", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Fantanstic 2nd Visit", "review": "Returned to Es Ravells with my daughter for the 2nd year this time our arrival was a lot quicker last year it had taken us about 3.5 hours to get to Es Ravells so was pleased that we didnt seem to drop at so many places.  We were greeted at reception by one of the lovely staff and were advised that we have been upgraded from a Studio to a 1 bed aparrtment free of charge, which was really nice. Our apartment was in block 6 very clean and tidy and as it was an end apartment the balcony was absolutely huge.  Ravells is ideally situated for everything, bars, restaurants, shops. I read again reviews before going and the Hollywood Bar and block 7 is still being mentioned I can only speak from our experience and I appreicate we werent in block 7 but having walked past the bar at…", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r228351910", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "More than I could have hoped for!", "review": "for the price, I wasn't expected anything special. But during my stay in August 2014 I was pleasantly surprised by how big and nice the room and balcony was, and the general facilities of the Hotel. The pool was very well maintained (although could be open later into the evening) and there were always plenty of sun loungers.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r227673705", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "fan bloody tastic", "review": "stayed here from 11/8/14 until 21/11/14 in the so called dreaded block 7.....don't no what all the fuss is about all go's quiet at midnight. rooms a good size if but basic but its all you need as there is plenty to do in cala d'or  hotel staff (maru and paco) where very nice and could not do enough for us throughout our stay. pool great,tropical gardens bar great overall a great family hotel.our hotel room was 7301 this had a added bonus off a huge and I mean huge balcony/terrace. don't be put off by some reviews about block 7 its not that bad", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r227315952", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Wonderful!", "review": "Just returned from our third year at these apartments.  They are in a great central location.  The apartment is cleaned every other day. There is a toaster,  kettle, crockery etc all you need for basic self catering.  The pool area is lovely with  plenty of sunbeds.  Maru, Paco and the rest of the team are so friendly, helpful and efficient.  We look forward to going back in 2015.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r226942937", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Ms webster", "review": "Overall a nice place but missing a few touches. Cleaning of appartment could have been better and the utensils .had a enjoyable week thou .cracking weather and the pool is very nice just what u need cool down in .", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r225866833", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "great location nice resort", "review": "For the price we paid , we have no complaints. Family of three(12 year old daughter), A bit of a squeeze fitting in the third fold up bed, but I thought the sofa beds were surprisingly comfortable , the studio was very small , but we got used to it. We had a ground floor studio room in block 6. Nice large bathroom and adequate balcony. Air con in this block was controlled from the room so had it on 24/7. It was quiet and worked perfectly. Entertainment could be a little loud if you are early to bed, but all done by 12.00. plenty of local shops if you want to do a little self catering , but be prepared to eat out as well , our room had no microwave or oven, but it did have two hob rings, a kettle and toaster. do not miss the adjac ent ice cream parlour (across the bridge to your…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r223123389", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Enjoyable family holiday", "review": "Overall a pleasant place, location is excellent at the centre of shops, bars, restaurants, no need for any taxis and walking distance to 3 different beaches all absolutely breathtaking and clean with aqua water for snorkeling.Rooms at Es Ravell's pretty basic, maybe a little small as we have 2 kids ( 16&14) but clean, we mentioned this to the hotel manager Maru, lovely, lovely lady but stated as it was peak there were no rooms available until following week, we decided to stay put, but she couldn't do enough for us when requested, always gave us a wave and said hello remembering our first names which makes it more personal, top marks. We stayed in block 7!!!!! By Hollywood bar, overlooking pool, karaoke from bar in the evening didn't bother us as we went out into Cala D'Or by…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r222869865", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "excellent holiday", "review": "We stayed in for 9 nights at the end of July/beginning of August it was fabulous Paco and Maru are wonderful people and made us feel completely at home , even lending us a wheelchair as l was recovering from surgery. We had a one bedroomed apartment which was spacious and clean with the maids coming in every second day.. Nothing was too much trouble for any member of staff, we have already booked to go back next year and can't wait. We just like to say a special thank you to Maru  you are brilliant.", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r222642545", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Just got back from VERY enjoyable 7 nights", "review": "This is a great choice for families. The rooms are pretty basic but all have clean modern bathrooms and nice balconies - most overlook the pool. The location is fantastic. The beaches, town centre, bars and restaurants are all within a few minutes walk. Unlike most hotels, the bar area (tropical garden) is open to the public and so is normally busy with a good atmosphere. Most of the acts that we saw were good... And if they aren't to your taste the Hollywood bar next door is busy and has entertainment every night. The staff are great. The receptionists we very helpful trying to sort out a problem we had with our transfer. The bar staff are great - make the effort to get to know them and they will really look after you. A lot of people moan about the pool closing at 6.30pm which…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r222390151", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "ok could be better", "review": "Hotel/rooms were very clean food was good , entertainment was ok. Thought all the staff bar  one or two could do with a bit more personality. The main problem with these apartment was the rules sometimes i felt like i was still at school, no food or drink down by the pool unless it was brought from their bar/restaurant which wasn't cheap, also everyday at 6.20pm you got a 10min warning that the pool area had to be cleared never known this before, even the reception didn't agree with this rule as when i question it he answered if it was him on holiday he would want to be at the poolside till at least 8pm ive been abroad quite a bit i like to leave the pool when i want and if im self-catering eat and drink were i like and don't feel like im doing something wrong. i appreciate it…", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r218510268", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "lovely apartments", "review": "Just back from 10 night stay, appts newly refurbished very clean maids an reception staff all very hard working and friendly. Good central area my only problem was the pool being so far away as we were in block 4 no good if you have children as you have to walk about 100 yards to main building and also the nightly tribute bands weren't for us but it each to his own it all stopped at 12pm so not to bad. All in all a lovely place to stay .", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r217856460", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Very happy to recommend", "review": "Spent a week in these apartments and I was very satisfied with our choice. I was in a one bedroom apartment in Block 7 directly overlooking the pool and the stage from where there was nightly entertainment. The apartment was very clean and met our needs.  The bathroom was a little small in my opinion but apart from that we had no complaints at all. I enjoyed sitting out on the large veranda in the evening and watching and listening to the entertainment below. The music stopped at 12am and noise was not an issue at all.  These apartments are in a superb location, just a couple of minutes walk away from Cala D'or town centre. Everything a tourist could want is virtually on their doorstep.  I would have no hesitation in recommending Es Ravells D'or apartments to others.", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r217121384", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Sold under false pretences", "review": "Stayed 8 days, 2 weeks ago and had booked - and to quote the accommodation voucher - a one bed roomed apartment with air conditioning. Guy on reception initially tried to send us to a studio and even after I told him that's not what we booked, he insisted he was right. Good job I had a spare copy of the voucher he now possessed to prove the point. Apartment was fine, as described and I would have scored it 4/5 except - no air conditioning. Went to reception after our first restless night of limited sleep as it was too hot, to advise the air con wasn't working, the guy explained it was working but management policy was that it was only switched on between 3pm to 8pm - not much use when you're out all day til 7 by the pool/ beach, but useful if you're indoors all day like…", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r213875935", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Great Value", "review": "Sorry for the inconveniences. We always try to give our bests to our clients. The air con is not working the 24h as it is informed in our web description, the timetables change during the season, depending of the weather. We are really sorry if it was not to your liking. We work hard to improve our service and solve guests complain to give them the bests holidays in the Ola Apartments Es Ravells D’Or.", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r213855267", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "paula& chris", "review": "Just returned after a 2 week break with my girlfriend at Ola Es Ravells. We arrived late on but the staff where very friendly and helpful, We were in room 303 in the \"dreaded\" block 7 and had no problems at all, apartments look to have recently been painted and look good for it. Nice view of the pool area/tropical gardens and stage, The apartment was cleaned every 2nd day with fresh bedding/towels which was fine. The tv had mainly dutch/german channels, the only 2 English ones where just news stations.  Usually managed to get a sunbed however it started getting a lot busier towards the end of our second week and the pool isn't the largest so we started going to the beach as the pool felt a bit crowded at times.   I'd seen some reviews about noise and although we were in block 7…", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r213713381", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Excellent apartment, price to match!", "review": "A big thanks to Maru for another great holiday, Es Ravells is like our second home now,we love going there on holiday cala dor is a beautiful place and the bar staff at tropical gardens are great people I would recommend holiday makers to try Es Ravells  they will not be disappointed we have been to cala dor several times, all our times we have stayed at es ravells and have enjoyed every time and cannot fault it from Maru to the cleaners the apartments are cleaned on a regular basis and are ideal for couples or a small family there is live entertainment on nightly with tribute acts and also childrens entertainment before the live entertainment there is a bar on the complex aswell called the tropical gardens great bar staff who go out there way a big thanks to them especially…", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r209362642", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Relaxing holiday", "review": "Me and my partner have just come back and can't wait to go again, highly recommended. The staff are lovely and the rooms are clean. When we arrived to the hotel we was up graded free of charge! If you are looking for a cheap hotel I would highly recommend ", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r209242649", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Lovely Holiday!", "review": "Myself and my fiancé had a fantastic stay at Es Ravells! It was my fiancé's first visit to cala do and thanks in part to this hotel, he can't wait to go back!  The rooms are basic but very clean and the bathrooms look to have been modernised quite recently. We stayed in a self catering studio which was plenty of room for the two of us. We had a lovely balcony area which got the sun later in the day - perfect for drinks before heading out for dinner!  The pool are of the hotel is lovely. Pool is very clean and as we went before the summer holidays there were plenty of sunbeds for everyone. We didn't have a problem with anyone reserving sunbeds with towels and always managed to get a good spot! The pool was quite cold but we were there at the end of May so it hadn't had much of a…", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r209144841", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great Week at Es Ravells..!!", "review": "Had a really great week here May 17 - 24, was quite happy seeing our room with this massive balcony and thought great..!! My daughter's and boyfriend had room 7102 and my wife, son and I had 7101 the fun kicked in when we went to bed.....we were right above the worst and loudest Karaoke bar in Cala D Or. Didn't cause us much problem really we did sleep eventually but don't go to bed before 1am..you will suffer this horrendous noise. Apart from that no problem. Staff really nice, pool very cold but we still went in there loads. Pool bar and food very good a little expensive but can't complain really. Plenty of sunbeds I know it wasn't peak and probably different when busy. Danni the animations rep try's very hard to get people doing things but easier said than done getting…", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r206961095", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Disappointing", "review": "When we arrived we were told that our room was not ready and had to spend the night in another hotel! If only we could have stayed there for the rest of the trip as our room at Es Ravells was very basic, unclean and had shutters and bolts on the doors, which made us feel aware of our safety. Although we were given an 'upgrade', I don't believe that this was a positive outcome as the upgraded room was below average. Cala Dor was slightly less disappointing as the beaches were beautiful but were quite crowded. The general area had lots of shops and restaurants and a lovely harbour that I would advise visiting. Overall, we were disappointed by the hotel but enjoyed our stay in Majorca. It may be worth noting that Cala Dor seemed a popular resort for German tourists rather than…", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r193525823", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "pretty good", "review": "We are sorry not to have fulfilled your expectations with your accommodation at Ola Apartamentos Es Ravells D'Or.", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r185438039", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely Holiday", "review": "Just spent the last week at this hotel, good location, lovely pool, good entertainment, great ice cream parlour next door and plenty of lovely restaurants to eat.  Only one issue we had was the air conditioning did not work, when we asked at reception he said it was \"too hot\" to work? It was a shame as the apartment was boiling especially at night.  All in all though we had a lovely time and would go back again.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r180032536", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great hotel", "review": "Thank you for taking the time to review the Ola Apartamentos Es Ravells D'Or, and for your confidence in our service.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r179776593", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "A nice hotel", "review": "Just got back from a 7 night stay at this hotel and overall I thought the hotel was brilliant.  The rooms were clean and spacious, beds were not to uncomfy either and it had a decent sized balcony.  The pool area was kept nice and clean and we didn't have a problem getting a sun bed. The food at the pool bar was very nice too.  The entertainment brought in a lot of people to the hotel on an evening the acts were mainly older groups but still had a good atmosphere.  The hotel itself is very near to the centre within easy walking distance to all the restaurants shops etc. We did however find the supermarkets very expensive and to be honest even the bars were not cheap, you wouldn't get a vodka coke cheaper than 5 or 6 pounds.  The beach was very nice but still rather crowded to…", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r179437703", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Ola Es Ravells", "review": "Thank you for your review, and your confidence in our service.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r178343422", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "paula&chris liverpool", "review": "We stayed at Ola Apartamentos Es Ravells D'or during late September booking through Travel Republic. On arrival we were told that our room was unavailable and that we would need to spend the first night of our holiday in another hotel. The hotel would pay for the taxi to the new hotel, throw in a breakfast and upgrade us to an apartment on our return. Not the best thing to hear but we decided to go with it and accept the deal.  On our return we were happy with the apartment and got on with our holiday...  THE ROOM The apartment we stayed in was a good size with bedroom, bathroom, kitchen area, living room/dinner area and balcony. The decor and fixtures were a little outdated but not as much to cause any issue. The bedroom has the standard 2 single beds pushed together to form…", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r177094557", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A good recommendation...", "review": "I just came back from a 6 night stay here and I am very pleased by this holiday. The reception was open 24/7 which came in use for getting directions as Cala d'or is a maze. We were two people in a studio flat which gave us plenty of space. Wed the basics; a stove, fridge, towels, kettle and toaster. As well as a tv (which did not work) and a balcony. The cleaners came to change towels almost every day, and which, despite not speaking much english, were very friendly. We didnt eat at the restauraunt but had quite a few drinks there, by which, despite being simple, were good price for value. The entertainment was...interesting (although it only really started getting good once youve downed a few drinks) and most of the entertainers were english origin. Everyone was super friendly…", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r177029578", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent", "review": "Thank you for your review. We are very happy you enjoyed your holiday at our apartments. We hope to see you next year again.", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r176835863", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Ola Es Ravells D'or", "review": "We have just returned from an 11 night self catering holiday and I must say we could not fault these apartments. We stayed in a studio, which was basic (to be expected) but had a kettle and toaster (bonus). The bar staff were great and we had a few laughs, the cleaners were thorough and our linen/towels were changed regularly, we had an issue with the kettle but a call to reception and this was resolved within minutes. The reception staff were also very pleasant and helpful. The apartments are in a great location, with bars/restaurants on the doorstep and the beach is a few minutes walk away. We didn't find it difficult to get a sunbed by the pool, even though it was usually mid-morning before we surfaced. All in all a great holiday and will certainly return and would recommend…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r176485107", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Block 7: Abba tribute nights: Good Times", "review": "Thank you for your review. We are very happy you enjoyed your stay at our hotel. We will pass on your review to all hotel staff in order to motivate them for future guests. We hope to welcome you back next year at our apartment.", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r176294599", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Apartments are great - pity they didn't heed our request for quiet location!", "review": "These apartments are excellent standard for the price. We usually stay in the Studio for 3 adults. We have a balcony overlooking the pool and the night entertainment. There is also a balcony on the side too. The Manageress Maru is very friendly and goes out of her way to see that you are enjoying your holiday. The reception staff and cleaning staff  are friendly too and cant help enough. If you ever need anything at all just ask the staff and they will do their very best for you.  We have visited the Apartments on 5 occasions and have booked already for next year. The Pool attendant does a very good job too in keeping the pool clean daily and tests the water during the day too. The food in the Tropical Garden bar is good too. Tony and his staff work very hard day and night.…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r174969330", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "First Class Apartments ... as usual!!", "review": "We have just returned from our second trip to Cala D'or staying at Ola Es Ravells apartments.  These apartments are fantastic, they are in a great location and have everything you need for a great holiday.  The apartment was clean, comfortable and spacious.  They have been redecorated since last year with the addition of a kettle and toaster. The beds are comfy, the air-con good and the bathroom was a good size, with great pressure in the shower, bedding and towels were changed every other day.  The reception staff are so friendly and helpful especially our special friend Ramiro who looked after us so well prior to our visit, although unfortunately we only saw him on our final day.  The pool area is kept lovely and clean and you can pretty much always get a sunbed.  The nightly…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r174542314", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great value", "review": "Thank you for your review. We are very happy you enjoyed your second stay at our apartments so much. We are happy you noticed the improvements we made this year to our apartments. We will certainly pass on your compliments to Mike and Ramiro to motivate them to keep giving excellent service to future guests and their children. We will warmly welcome you back, next year at our apartments for the third time in a row.", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r172536864", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Nice Apartment but quite Noisey", "review": "Just returned from a week here and it was excellent.On arrival reception staff could not be more helpful.The room was clean,The pool was great as was the entertainment.We wandered around a bit but found the best food was actually at the hotel itself,And having a 10 yr old with us we were able to return to the room around 10 pm but still have a great view of the entertainment from the Appartments balcony.I would go here again without hesitation.Fantastic", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r172470009", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Fantastic Holiday", "review": "Thank you for your opinion. We are very pleased you enjoyed your stay with us so much. We hope to see you next year again in our apartments.", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r169051266", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Self cater holiday", "review": "Visited in July and found the apartment very clean and a good size. There is a great pool and bar downstairs also with some good live entertainment each night. The apartment staff are very friendly but the guys on the bar downstairs seemed quite grumpy and did not seem to be that friendly. Apartment is in a great location just 2 mins from the lovely nearby beach. Be warned though if you are looking for a quiet holiday this may not be the place for you as the nightly entertainment goes on late and there is a nearby Karaoke bar which stays open till 3am which we found quite a pain as we had asked for a quiet place when we book our holiday. On the whole this is a very nice place to stay but just be warned of the noise at nights.", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r168739137", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Decent 3* apart hotel, does what it says on the label.", "review": "Perfectly adequate apart hotel, just what we were looking for.  Good pool, friendly staff and a short walk to bars and restaurants. Two gripes: pool closes at 6.30 and it could really do with a refurb, though based on what we paid (through booking.com) not a big issue. PS the chickens that roam the grounds are good entertainment.  ", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r168712006", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Great holiday", "review": "Thank you for your review. We are happy you enjoyed your stay with us. The pool closes at 18:30 because we need to clear away the sunbeds and put tables for the evening entertainment,.  We hope to welcome you next year again in our apartements.", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r166482891", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Could not recommend more, amazing holiday with friends!", "review": "I'm still here now!!!  after reading a few rubbish reviews I don't understand what they were complaining about! It's basic but it's very clean the staff are friendly and the animation girl Amber try's really hard! The pool is great and the menu choice at the pool bar is fantastic the evening entertainment was great Gary Barlow was fab!! Shame it wasn't him himself!!!  Lots of gift shops and near to lots of restaurants I would recommend the taste of Texas ! Beach is close but gets packed ! A bit noisy at night by the Hollywood bar but it doesn't effect all the rooms ! Overall I'm glad we chose es ravells and would come again !", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r166172677", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "great stay, the most helpful staff ever!", "review": "Thank you for your review. We are happy you enjoyed your stay at our apartments. We will pass on your compliments to amber to motivate her for future clients. We hope to welcome you next year again.", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r164998225", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "The night receptionist MIGUEL is so good !! So helpful :)))))  really liked it.", "review": "Me and a group of 5 friends just returned from a week holiday at Es Ravells. We had such a lovely time and really cannot rate the hotel any higher, especially not for the budget price! We had two apartments which were large and comfortable and cleaned every other day with new towels. We had a huge balcony in one of the apartments (Room 7201 I think) which was perfect for drinks before dinner and we wished we could have had a BBQ! In terms of self catering the apartment had a fridge, kettle and toaster and two hob rings for cooking. We ate out every night so didn’t use the hob but it probably would limit guests in terms of what they can cook but like I said it didn’t affect us at all. There are loads of supermarkets nearby and it’s a good idea to buy 5 litre bottles of water…", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r164950732", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Ola-la", "review": "The apartment [Block 7] had good things going for it. Spacious, clean, good refrigerator, not so sure about 'cosy'. 'Electric cooker' means two hot plates. Adequate clean bathroom. Fine SW facing balcony. Sad reflection on modern guests. Management need to hire out safe deposit boxes and TV zappers. We are not so sure that swimming pool is 'huge', but is does have a faux Roman aqueduct.. Central location for town based activities. [The Cala D'or Jazz Festival was great fun.] Do find the garden pathway to Cala Gran. Food shopping is fine. Note that not all SPAR shops sell at the same prices. Now the bad news is the nightly programme of entertainment. If being caught between Lady Gaga tributes and karaoke from next door Bar Hollywood till midnight, do it.  Otherwise ........", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r163803044", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great aprtment, great place to stay", "review": "We stayed at the Ravells D’Or (Block 7 Room 302, I bed apartment) for a week  during the end of May 2013, and overall we were very pleasantly surprised considering this is budget accommodation, upon arrival at 01:00 our room was ready and very clean, and included a kettle and toaster, everything worked, there were two sofa beds, plus two single beds, and we had  a decent view of the pool complex, beds and towels were fine, maid service every other day, the only thing missing was an oven, so could not cook chips or pizza, but no big deal as plenty of restaurants in Cala D’Or. The Hotel tries hard to provide entertainment every other night, which is ok, and the shows usually finish by 23:30, we did not hear much noise, but depends on what block you are in, also no music is played…", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r163595241", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "nice complex shame about the noise", "review": "Thank you very much for taking the time to review our apartments, we are very happy you enjoyed your stay with us and we hope to welcome you next year again", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r163579956", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "perfect self catering destination", "review": "we arrived at stupid o clock to find the staff at the reception very smiley and helpful,,found our room on the first floor it was quite spacious and had three balconies, twin beds which were very comfortable,nice bathroom and a sufficient kitchenette with fridge toaster and kettle.The décor was a bit scruffy and dated but it was clean enough.The only problem was..the noise..we were told we had  quiet room-I think what the man meant was \"away from the bar\" but what he didn't tell us was we were on the main road where all the lorries rumble past at 6am after delivering to the bars and its also on the main bus route..they also empty the bins about 7am and you can still hear the bar music which stops at midnight.Apart from that we had  great time, not too far to wait for amenities,…", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r162451237", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "fab hotel fab location fab friendly staff", "review": "Thank you very much for taking the time to review our apartments,", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r161906478", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "great apartments & great location", "review": "me and my partner stayed in these apartments a few years ago, we really enjoyed it. the apartments were spotless, food in the snack bar was lovely and reasonably priced as were the drinks. as for the location you couldnt ask for better shops, restaurants and bars just outside the complex and a short walk away from the main town and square. the only down side to our holiday was that the week we went was the worst weeks weather spain had in a long time, rain, thunder & lightening for a 2 days then rain the rest, we would love to return to this complex as we feel we never got to see much of the resort because of the weather. would definatly recommend this place.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r161586390", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fantastic Bargain and lovely people", "review": "Booked this 2 weeks ago. I have to say, for the price I feel we have had a fantastic bargain. As soon as we walked into the place, we were greeted with a smile and a friendly hello. Then, probably because they are not too busy, we were given a free upgrade from a studio room to an apartment. Is is equipped with everything we feel we need for a good holiday. Of course, it is basic, but as we spend all day out, we dont need anymore than basic. It is very. Clean, everything works as we would want it to. The beds are a bit hard but not uncomfortable, if you like a soft mattress, then maybe its not for you. Its everything I look for in a cheap room. 109 pounds for 5 nights, with entertainment right outside your window", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r160458269", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Sum job!!!", "review": "Thank you for taking the time and the effort to write a review, we are very happy that you enjoyed your stay. We are also happy that you find the given service very good, we value this a lot in Ola Hotels. About the matrass being hard, this is because they are new, this year we bought new matrasses, so this is maybe why they appeared hard to you, so more clients have to sleep on them to get softer :).", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r152803745", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "OK accommodation but GET A SAFE!", "review": "I stayed here in august 2012. Once we arrived at the hotel we were greeted by some of the friendliest staff you could ever meet I forget their names and they showed us to our room and I was quiet surprised that it was pretty well kept but there was only one thing that I didnt like was that although the sheets and all were cleaned I think if they just took a little extra time te clean them I would make a big difference. After reading other comments about the noise I myself didn't find this annoying I always had a good sleep. The pool is clean and the staff down at the tropical gardens are absolute legend first class service and the food was also great.  Keep it up lads !!!!!!!!!!!", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r142507505", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "lenny 2012 sept (liverpool)", "review": "Stayed here in Summer 2012. As many others have said, these are basic apartments but have what you need. We enjoyed some of the entertainment but did have to plan strategically to be out at certain times some nights to avoid the tribute acts murdering some of my favourites!  My main gripe is that we had our phones and money stolen from our apartment during our stay. I know, I know, we should have got a safe, but they were well hidden so this was not an opportunisitc theft but a good rifling through all our things in wardrobes and drawers. For a number of reasons we know it was the maid (this is NOT me being judgemental, there was concrete evidence). Reported it etc, the manager gave us great lip service, but then wouldn't let us use the hotel phone to call our UK mobile…", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r142082198", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Last night in es ravelles - excellent budget hotel.", "review": "All packed ready to leave but would definatly come back.Our room 7301 had a massive balcony secluded bathing sun up to sun down all day.Down side above the hollywood bar - not complaining about the noise but the quality of the karoke singers !!!Location is excelent for shops bars beaches. cannot fault Cala d'or on all counts.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r141929256", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Great budget apartment!!", "review": "My wife and I came here last minute for a cheap long weekend break because it works out more value for money than Cornwall! Don't know what people are moaning about. The location couldn't be better, the staff are lovely and the studio we had was clean but basic. Yes there is music nightly and it's cheesy but if you want something first class and silent, hire an expensive villa in Deia!!!!! Why you need a tv, kettle, microwave or toaster on holiday is beyond me - there are hobs/pans provided with crockery and cutlery. Those moaners should simply stay at home. Experienced travellers my butt! You get what you pay for.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r141432455", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "No sleep for a week!", "review": "Stayed here for a sleepless week in early Sept 2012.  If you're a party animal its fine, no one sleeps here at night, domestics on the verandas till 4am & 5am, neighbours unable to unlock their door at 2.30am, shouting, banging and crashing about outside our room.  VERY loud entertainment at Tropical Gardens every night. Very loud Karaoke at Hollywood bar every night, including some sort of brawl on night 2 in the early hours. We did hire tv remote to try to drown out the overpowering noise from all directions.  We stayed in 7105, with very small awkward bathroom.  No Kettle or toaster. Beds are memory foam and get very hot & uncomfortable. During the day we found that the staff at Tropical gardens had given up, as the seasons end approached and we were left waiting for our…", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r141352216", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Great location", "review": "Just got back from one week at es ravelles which is right in the heart of this beautiful resort. there are bars and eateries right on the doorstep so we didnt bother trying to do any meals in the room,we just went down and had breakfast by the pool a full english with toast and tea for 5 euros great value.The entertainment was mostly tribute acts so we saw Michael Jackson (so so) Lady Ga Ga  & Amy Winehouse with two of the best backing dancers you will ever see,and the best Beatles act I have seen they were really great. Ok the room wasn't great but we had a nice view of the pool and for a resonable price you get what you pay for.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r141319276", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "First impression was awful....", "review": "When myself and my fiance arrived we were shocked at the room we had been allocated...terrible shabby studio (not what we paid for by all means), maintenance man was doing the electrics, it was dark and dreary, no view after asking for one (basement with dirt and trees outside) We then had to pay 140 euros to upgrade to a room with a view, it wasn't much better but we thought it would do!! Were not treated well at all after complaining (although he then gave us a free kettle rather than charging us 12 euros for our problems) We then went to room 7203.The noise was fine, after all on holiday your not tucked up in bed before midnight really...We had friends in a much better hotel just behind ours so spent most of our time up there with them...the location is great but after being…", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r140919279", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Wouldn't Go Back", "review": "Situated in a nice area of Cala D'or, close to the many resturants & shops this resport has to offer. On arrival we were greated by a very friendly & helpful receptionist, ( forgot to ask her name ), and nothing was to much trouble for her. On entering our room, which was a 1 bed appartment we thought it looked rather shabby & tired. No kettle, microwave or toaster ( all available  as extras ). 2 single beds which were hard and rather dirty, with badly stained mattress covers. Paid 2 euros a day to hire a remote control for TV. Wish I hadn't bothered as the only english programmes were BBC news & CNN. The worst  thing about Es Ravells is the noise though, Bingo from noon until 3pm (yawn) then in the evening a kids disco & so called singers who are on until midnight (7 days a…", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r140895964", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Just Right!", "review": "Just returned from a week long stay here... we didnt know what to expect before getting there, and its always hard to know from tripadvisor, as people are either going to moan or complement on the little things...   Overall.. this place could not have suited us better.. We had a large apartment, with a very large sun terrace that wrapped around our apartment, very friendly staff from reception to cleaners.... clean pool.... nice gardens.... also, just two minutes to restaurants, shops and a great cala! without feeling you are in the middle of things...  The entertainment can be noisy, but if you stay out a little later or go down and have a drink, you wont be annoyed or even notice it, as it stops at 12 and as cheesy as it may be.. its a little laugh... If this is your only…", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r140842222", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good time !", "review": "I booked the apartments based on the majority of positive reviews on trip advisor - I was nervous before arrival but was more than happy by the time we departed. Was really concerned when block 6 was allocated to us - not a problem, noise - yes until 0015 (we are on holiday so evenings went beyond this time). Would point out if you get 7103 or 7104 then I hope you like a late night out ! As before mentioned - the Hollywood Karaoke bar is directly underneath and is roudy but really good fun if that's your bag. back to Ravells's - I have never met a nicer bunch of hotel and bar staff in all the travelling I have done - special mention to the receptionist \"Rameros\" and \"Paco\" who were so helpful. Tony in the tropical garden is a legend and every one of his staff are totally bought…", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r139178726", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Poor Hotel. Great Location", "review": "My fiance and I are off travelling around the world for our honeymoon in January. This was supposed to be our last holiday before then that we didn't need to worry about the accommodation, it turned out to be more of a preparation for what to expect in some of the less developed stops on our travels.  Good: + Situated in Cala D'or where there's a lot to do. + Relaxed atmosphere poolside in the daytime.  Bad: - It's really not clean. - Outdated. - Pressure to buy things if you're poolside in the evening. - Little effort to fix pretty major things like water and electricity mixing.  Overview: On arrival we were told that toasters, microwaves and kettles were available to rent during our stay, not a cost you'd expect to fork out for on a self-catering booking (Rooms do include a…", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r138531698", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "A Wee Gem!", "review": "Just came home last weekend - this was our first time to Cala D'or and we were really looking forward to it .... we were not disappointed.   On arrival at Es Ravells D'or we were greeted by a very friendly receptionist, who was very efficient and informative.  We went to our room, which had everything we needed - clean comfortable beds, a clean bathroom with good pressure in the shower, air-conditioning and a fridge!  Having read reviews on Trip Advisor I was aware of rental charges for kitchen equipment therefore I brought my own kettle! The Ola Es Ravells apartments are in a fantastic location, there's a supermarket across the street if you need it and it's just downhill to Cala Gran beach which is beautiful (3 sunbeds and an umbrella 17.50euro) and really close to the lovely…", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r138302874", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Should not be promoted as self catering!", "review": "I have been on many holidays, many of which have been self actering, but I have never had to hire a kettle, toaster and microwave in a self catering apartment!!! They are described as well equiped, tis could not be further from thr truth. Exactly 3 of everything and by that I mean the basic of the basics. No such luxary of any cookiong utensils, sieve etc How anyonw can self cater in there is beyond me. On arrival was put in a one bedroomed apartment as our studiowas not ready. I was informed that this would be at no extra cost to me. I am so pleased! It was the most depressing place I have every slept. I was dreading moving to the  studio the next day as I had never stayed in one before and thought it would compare badly to the room I was leaving. It turned out to be a better…", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r137270970", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Great Location - Nice Apartments", "review": "Just back from these apartments, i found them basic but clean with a lovely big bathroom, they need to cut down some of the trees which block the sun from some balconys.  Entertainment on every nite. The staff are all friendly and there was no problem getting extra towels or sheets.  We'd ants on the first day but reception gave me a spray and i didn't see anymore for rest of my stay.  There was no problem getting a sunbed in the mornings, i used to go down between 8.30 - 8.45 to reserve a bed.  Although there a loads of seats if your really stuck.  The rule of \"no food or drinks from your apartment around pool\" is not really enforced so i wouldn't let this put you off from previous reviews. Apartments are just short walk to main eating places with too many to choose from, lots…", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r136912532", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Nice apartments for a good price!", "review": "Es Ravells is located in the centre of Cala D'or. The service is good, the apartment's are clean. It's 200 meter from Cala Gran, the largest beach in Cala D'or. You also must try the beach at Cala Mondrago. It's about 20 minutes from Cala D'or. In the centre you can find lots of restaurant, there's something for everybody's taste. ", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r136195884", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Excellent location and great value", "review": "Arrived 17th July 2012, for one week .  Apartments are clean, spacious and in such an excellent location.  Loved the pool and the meals around the pool are surprisingly decent quality.   You are literally 5 minutes walk from Cala Gran beach, we preferred Cala Esmerelwhich was about 15 minutes away but all of the beaches are idyllic.   Air conditioning is free - good point.  Would very happily return.    Minor points of irritation - no kettles in room, instead the hotel wants to rent you one for 12 euro.  We just boiled our water for coffee in a pot.  If you do not like the entertainment you have to put up with it until midnight, in saying that, most of it was decent.", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r136113931", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great stay", "review": "Just returned from a 7 night stay in a 1 bed apartment here.  Apartment was reasonably priced and was of a good size for 2 adults and a teenager.  Towels were changed approx every other day and the apartment was adequately cleaned.  We were lucky enough to have a balcony facing the bar and stage area where a different tribute act took place each night - saw Abba, Lady Gaga/Amy Winehouse, Michael Buble, Beatles etc.  Pool area was kept clean and we never found any difficulty getting sunbeds.  Plenty of restaurants in Cala D'or to choose from - we enjoyed Fernandos in particular.  Would recommend these apartments as great location, great entertainment and great value for money.", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r134347629", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "basic", "review": "i stayed here last year in september for a quiet relaxing week,QUIET is the word it was dead most places had shut cause of the time of year i found there was not much to do of a night maybe because of the time of year am not sure.the hotel was clean but the layout was a bit topsey turvey 2 settees that converted into beds couldnt even push them together to make a double,other than that complex was ok come 12 midnight that was it went quiet so sleeping was not a problem,staff were friendly,my personnel choice is i wouldnt go back", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r133259079", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Air con not good...staff excellent", "review": "I stayed here with my mother from the 23 june to the 27 june.  On arrival we checked in swiftly and efficiently.  We had booked a studio apartment but when we got to the room we were quite shocked to see exactly how small it was.  The beds were two settee's on each side of the living room and were very small.  I went to reception to enquire about paying more for a 1 bedroom apartment and spoke to a lovely man called Ramiro (i may have spelt this wrong)  he informed me they had no apartments available until the next day but he will phone and let me know as soon as he knew something.  Within an hour he had phoned the room and we were told to come back and we will be moved the next day with no extra cost to ourselves.  We had quite an uncomfortable night (the entertainment by the…", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r132976890", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "good relaxing family break", "review": "we stayed at es ravels in july 2011 ,second visit there.we really like the friendly and welcolming vibe in these appartments.it is cheap and basic but perfectly good.we enjoyed the entertainment at night and the quiet days by the pool.we are going back this year and are looking forward to it.", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r124619819", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great clean budget accommodation!", "review": "Stayed here in June 2011. The rooms are clean and basic, theres some great entertainment at the Tropical Gardens bar and restaurant, nice pool, plenty of loungers. The pool entertainer (Danny when we were there) will keep kids (and adults) happy with games of killer pool, killer darts and various pool games and dancing at the kids disco every night etc. Cala d'or itself is lovely and has lots of nice restaurants nearby, a couple of nice beaches and a beautiful marina. This is more the chilled holiday rather than action packed and super busy which is what we liked. We would stay here again. The only gripe we had was that this is advertised as air conditioned rooms but the management refused to turn it on in june!! lots of people complained but still no air con when we left…", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r122604783", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "cheap and cheerful-basic but great location!", "review": "I have just returned from Es Ravelle D'Or 17-24th Sept Good: I was given an apartment in block 4 so very quiet-if you have families you should ask for this block.Or if you like more privacy,there were only two rooms on my floor so very quiet! We had an extra large balcony,larger than most which was nice! Good Location to walk everywhere! Although we didnt eat directly near the hotel as found most of the food quite poor in Cala D'or,nicer if you walk further to the marina and not much difference in price!Plus it has a lovely holiday feel there! There doesnt seem to be many places with cheesey nightly entertainment so es revelle is perfect if u like that!I enjoyed Robbie Williams!I walked past while 'Lady Gogo' was on and was very thankful to be in block 4 as she was woeful! Car…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r118570150", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Just got back", "review": "Arrived 17th sept for a week. Rooms are very basic. The couch transforms (Luckily not like the film) into your bed. On the plus side hotel is slap bang in the middle of it.Restaurants,bars etc.The in-house singer at the Hollywood bar thinks shes great. Sadly she wouldnt make it to Boot Camp on the x-factor. A lot of holiday makers complained about the noise so you may need ear plugs. All in all not to bad for a cheeky week away.!!!!", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r118536256", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Basic apartments but good for entertainment", "review": "These apartments and studios are quite basic but if you want basic accommodation with loads of entertainment then this is the place for you.  Expect a lot of noise up to midnight but it's so easy to enjoy the acts from the comfort of your balcony that you can't help but get swept up in it all.  I think the apartments were described as having everything you need for a self-catering holiday.  However, nowadays I would expect a kettle, toaster and even microwave to be included without having to hire them from reception when you get there.  The toaster, kettle and microwave were 12 euro extra each for a week and if you want to use the TV then you have to pay 2 euro per day - this adds an extra 100 euro to your bill if you hire them for a two week holiday.  So long as you understand…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r118355791", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "great holiday", "review": "we had a great holiday at the Es Ravells, the staff were fantastic and our Apartment was spotless with a first class view of the entertainment off the Balcony, in fact I cannot find anything to complain about and we will definately be going back again next year. S, Hunt", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r118209529", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great for families with teens.", "review": "We booked Es Ravells as a cheap, end of school holiday in the sun for our teenagers and friends. Some of the previous reviews worried me slightly as the holiday approached but I needn't have been concerned. We got exactly what we wanted and we had a good holiday.   Apartments Don't expect luxury -this is a basic apartment with simple cooking facilities that is perfect for a base. The apartments are \"refreshed\" every other day with towels and a cursory sweep which we found adequate.   Entertainment The entertainment is nightly and noisy but everything goes quiet promptly at midnight. You WILL hear it from the apartment (we were in Block 6), but it is mostly enjoyable and we found that we were up that late anyway, despite being earlyish to bed at home.   Poolside and bar This is…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r117783447", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "We'd definately go back!!", "review": "We stayed at Es Ravells D'Or from 24th August till 3rd September. The apartment was basic but what we expected. We also had a problem with ants but it was quickly resolved! The only thing bad about the bedrooms was that there was not enough space for a family of 4 to put all their clothes. Cleaning of apartments could have been to a better standard. Danny Rodgers the entertainer was absolutley brilliant with both kids and adults, what a really lovely person, would love to see him back again. Tony Paco and all the bar staff were very friendly and great fun. The entertainment on a night was great! The location of the apartments are perfect, everything was within 5 minutes walk that is too the beach and the centre, we heard no noise from the HollyWood Bar even though we were in…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r117672578", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Wasn't the best, but would return", "review": "I returned home yesterday. We had a very long day, and when we got to the hotel the man at reception who was a cross between mr bean and faulty towers said that the room had a water problem and that we would be staying in a 4 star hotel around the corner. When we got to the other hotel, it was not a 4 star hotel it was a 1 star, and it was 10 minutes walk from everything. We tried not to let this spoil our holiday, and if there is one thing we love on holiday it is a great pool and it didnt have a great pool. So on the Monday when we got back to Es Ravells, we found out by somebody who is staying in the hotel that our room was over-booked. When we got to the room, we was infested with ants, ants everywhere, so we got out insect spray and sprayed the ones inside the appartment…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r117330195", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "lovely cala d'or - es ravells - so so", "review": "arrived 6am to be told there was no room for us as there had been a crash and rooms were booked. moved us to cala egos (10minsintaxi) for 2 nights. cala egos was surprisingly lovely but small. told to be in reception after breakfast on sunday morning. taxi took us back to es ravells. receptionist told us room wasnt ready - problem with water. asked her for room number which she gave us. entered room at 2pm and guests next door told us that the previous guests from our apart left an hour ago. settled in to our basic but clean apart. (tip) air con isnt the best but cala d'or is breezy so open all doors and windows to create vacuum! went back and asked for manager. demanded refund for first 2 days. she would not give it but offered free full breakfast for the 4 of us for rest of…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r117021887", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Good location - very noisy", "review": "We spent 2 weeks at Es Ravells. We stayed in block 6 which is directly over the pool area. Firstly, the pool area is owned by the bar not the hotel. That out of the way the pool area is where all the entertainment is shown. There is entertainment very night, starting with a kids disco then the adults entertainment. These were very bad tribute acts - in our opinion. The acts were on a weekly rota so you saw the same act twice. Not only that some entertainers did 2 different covers but used the same jokes. We saw some of the entertainment during the first week but our aim was to go out every night. The entertainment finished at 12. Once the entertainment had finished the staff around the pool bar set up the sunbeds for the morning and cleared the bar. This could take up to an hour…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r116940777", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "In need of urgent refurb!", "review": "We stayed here from 31.07.11 - 10.08.11 and had booked 2 rooms. Upon check in, only one room was available. We had to leave 2 of our party in the available room and we had to stay at another hotel for that night and to return the next day when they would have a room available for us. The guy on reception briefly gave us directions to the hotel and then left us to it to find it!!! This involved walking around with our elderly mother, plus bags for at least an hour before we located the hotel we had been given. Not quite the start of our holiday we had hoped for! The next morning, we headed for Els Ravells but were informed when we got there that our room was still not available and it was several hours later before it was, Sara on reception didn't seem to care! Bad Points: 1. Air…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r116706860", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Well worth it", "review": "We stayed there between the 1st to the 8th of August in room 7103. We was directly above the hollywood bar and u could hear it for a little while but it soon went quite. We went with a party off seven 13 year old 11 year old and a 4 year old and they all loved it. We spent most of the days around the pool area and we met sone lovely people who we will be keeping in tonch with . The entertainer Danny was the best entertainer we have ever met he was great with the kids and the adults to the old day we went out was on is day off. The night entertainment was fantastic once again Danny was brilliant doing the kids disco the acts that tropical gardens had was the best too. The only down side was for this hotel is that the air conditioning would be a bit better but we will defo go back…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r116630756", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Not for us - in diar need of a major renovation!", "review": "Our experience of this hotel is the same as the last review-same time and we could have been been neighbours!!  Our room allocation was 7101 and directly over the Hollywood bar. We took ear plugs in preparation and as a result of the reviews we saw before leaving and in case we ended up in block 7 - and of course we did! The music was on until 1:30am on our first night so i asked to be moved.  I was told that we couldn't move because the hotel was fully booked and that the police would be called if the Hollywood bar continued after 12:00 in the evenings thereafter.  To be honest, we also stayed around the pool area until midnight so were not directly effected for too long into the night but it isn't pleasant. The rooms are very basic, a little 'unkempt'-you have a wardrobe with…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r116557213", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Lovely hotel but block 7 !!!!", "review": "After reading some of the reviews I decided to email hotel and ask if we could stay in another block but not block 7 !!!! On arrival we were greated by a lovely girl in reception, who then preceded to give us our rooom key and directions. I looked at room number 7102. I looked at her and said is this block 7. Yes came her reply but dont worry Hollywood bar has been warned and the police will close them down and there is no other rooms. Any problems come back. So off we trotted and low and behold, we were not just in block 7, we were directly above the Hollywood bar. I didnt know whether to laugh or cry as we had also arrived in torrential rain :(.   Anyway the apartment was fair size and bathroom was quite decent. (you pay for what you get its not 5 star) We brought a  travel…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r116410119", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Thought it was a great holiday, will go back", "review": "Hi Had to write as I can't see why there are so many complaints regarding this hotel/complex. We stayed at these apartments last September and wasn't expecting much after reading some reviews....We had a great time, the apartment block we were in was down the road away from the main entertainment bit, so the noise wasn't a problem and anyway, it finished bang on midnight so I don't know why there are so many complaints about the noise.  The entertainment and Tonys crew were fantastic, such a laugh, best we've seen for a long time.  Staff were great.   Apartment was roomy and the balcony HUGE, fed the chickens most mornings while having breakfast.  My only complaint would be that the room hadn't a kettle.....but can honestly say we'll be going back...", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r116255958", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "FAB!!!!!!!!!!!!!!!!!!!!", "review": "First visited these apartments 19 years ago when i was a nipper best holiday i can remember which made me want to take my family. Although times have moved on the hotel being took over and several changes etc.. i still love it!!!! We have been staying here for the past few years now and we visit about 2 times a year.  The apartments are very basic but clean (one bedroom apartments are miles better than the studios they are quite roomy)  Nothing is too much trouble for the staff they will help you as much as they can to make your stay comfortable (the manager is lovely). Cant say i have any complaints from the noise as cala dor turns into a ghost town after 12pm!!! Yeah you might hear them cleaning up at closing time but it has to be done. The pool area, entertainment and bar is…", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r115991396", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Don't book a studio and don't book if you like your sleep", "review": "The reviews we'd read said all apartments were pretty basic, as this is all we usually go for we booked  a studio apartment with no hesitation. What we didn't realise was that a studio apartment doesn't include a proper bed. There were just 2 wooden not even proper sofa beds in the room, there were no fresh covers for these, you have to turn them over and the covers are there, the itchiest thing I've ever slept in! Also the apartment was ridiculosuly tiny (you could practically stand in the middle, arms wide and touch either wall), the bathroom was so small to sit on the toilet properly you had to put your feet in the bath. There was also an archaic air conditioning system. After complaining we managed to upgrade to a 1 bed apartment on the 3rd day, though we had to pay extra.…", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r115958151", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good budget hotel. Clean, good location but noisy.", "review": "I wont write a lot as my stay was a year ago so just trying to do my bit to give back to the forum. Overall, this was a good stay. Its in a good location in Cala Dor, walking distance to everything. The room was absolutely fine for the 4 of us but as other people say, its pretty noisy. I wouldnt recommend for light sleepers or tee totallers! Our 5 and 9 year old had a great time and slept fine on the settees/camp bed. They enjoyed the mini disco in the night and the odd bits of entertainment throughout the day.  Overall, its true that you get what you pay for, dont expect 4* quality here, its a good 2* I would say.", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r115884097", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "The DEFINITVE review - basic, clean but noisy", "review": "A three-star review for a rightly two-star property  The Good - Great Location - Staff Friendly enough - Kids activities good (Danny the entertainment co-ordinator is the hardest working man in Majorca - Alan Sugar should give him a job!) - Rooms clean and reasonably maintained for standard of property  The Average - Rooms very very basically equpped. Toasters, Microwaves, TV, Iron and Hairdryers are all very expensive extras (e.g. Toaster is 15 euro to hire for the week) - TV is 14 euro a week but only supplies 2 german, 2 spanish and 2 news channels (BBC and CNN)  The Bad - Air Conditioning vitually none existent. Reception claim it operates from 4.00 pm to midnight but no-one we spoke to could find any evidence of it operating at all. - NOISE. Terrible, terrible noise. In…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r115790452", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Ignore reviews I LOVED IT!!", "review": "I loved this hotel so much! Great central location amazing entertainment, shops are fantastic and the night life is brill for everyone! I can't speak more well of this hotel.  Bit noisy but just bring some ear plugs like me, i heard nothing after 12! you're on your hols you have to expect some noise!! Great for families try the little ice cream bar down the side of the hotel where the shops start! Its amazing!", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r115731070", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good complex shame about the noise.", "review": "This was a good complex with swimming pool, bar , day and evening entertainment. Entertainment was coordinated by Danny and he was fantastic. Evening entertainment was a nightly show of various tribute bands/ artists. Our favourite was Ian James as Michael Buble and Robbie Williams. The apartments are in a really good location - Cala Gran beach is 5 mins away and the pedestranised area where majority of the restaurants and bars is10 mins away. There are restaurants/ bars close by as well as smaller type spa Shops. Bus stop for Palma etc. is also close by. We stayed in a one bedroomed apartment which was good value for money 500 euros. Our apartment could have done with a lick of paint but it was clean. The kitchen had 2 rings which was adequate for us and plenty of pans,…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r115456656", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Mixed feelings", "review": "We arrived back last week from a week at these apartments and unfortunately I agree with the last reviewer's comments on the noise from Hollywood Bar.  We stayed in block seven and had to complain twice about the noise from the karaoke until we were finally moved to another apartment.  It isn't just the music that's disruptive but also the general noise the bar makes throwing out bottles and closing up.  Deliveries then early in the morning don't allow you to sleep in.  I hardly slept the nights we stayed in block seven.  On the other hand the staff were friendly and helpful, the apartments clean and in good condition, the pool area well maintained and the evening entertainment quite good.  Cala D'or is a great resort and I would definitely return - just not to Es Ravells!", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r114196256", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Don't go in you intend to sleep before 4am", "review": "We arrived on 29th May for 1 week for a chill out for us and our son who was doing g.c.s.e's when he got back, we picked the apartments because of Majorca's law on no music after 12 but this wasnt the case. After the first night of karaoke til 3.30am from the HOLLYWOOD BAR downstairs (under seperate managment) we went to reception to ask if we could be moved to a quieter apartments but were told they were fully booked, didnt appear that way but we took their word for it, was told if we had anymore noise to come to reception after 2AM and they would get the police to sort it out. After 5 nights of 3 am and later of karaoke for the HOLLYWOOD BAR downstairs we went back to reception to get the police to come and sort it. Needless to say the police didnt come but the bar did turn…", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r111827416", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Better than the two star rating from Thomson", "review": "Just arrived home from our two week holiday. We had a brilliant time, apt was better than we had expected. We had a one bedroom apt in block 7. We were overlooking pool and entertainment area. Pool was excellent, clean with plenty of free needs and shade. Could be noisy at night if you were not a lover of some of the entertainment, but that is I guess personal preference! Get some ear plugs when Lady Go Go is on as I'm sorry but she can't sing! But the entertainment is free. One point to note is that TVs were installed in all rooms last week. All staff were helpful, maid service was excellent.   We had our evening meal in a different restaurant each of our 14 nights and we only tried half of them in Cala D'Or.  Try the Hollywood Bar mown stairs, good breakfasts, good bear, and…", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r110115675", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "value for money", "review": "just returned from a 10 day holiday at these apartments, i cant fault them in any way, the staff were so friendly and helpfull, the lovely blond woman at reception goes out her way to help you, wee will be back.  thomas/yvonne    scotland.", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r109996603", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Stayed in May 2010 - Excellent budget accomodation", "review": "I stayed here with my girlfriend in early may 2010. Good location with lots of choice for food locally. The beach is two minutes walk away with lots of sun loungers. The room we stayed in had the biggest balcony ever, the bedroom was large and basic. The kitchen had very basic clean facilities I.e. It only has a two ring hob to cook on. Pans, plates and cutlery provided. Lounge was comfortable with dinner table and chairs. Balcony overlooks the pool and nightly live entertainment. The bathroom is the smallest I have ever experienced but it has been really well decorated I.e. Nice Spanish tiles and granite worktop...   Live entertainment every night was excellent with a full bar. The Robbie Williams/Michael Buble tribute singer Ian James was simply excellent!   FOOD - The choice…", "date": "June 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r108155478", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Great Apartments", "review": "Stayed in these apartments the last week in September, Lady manager very friendly and helpful as was the reception staff, especially Miguel, the apartments are nice & clean and we had a huge balcony overlooking the pool & entertainment, there are some restaurants in Cala Dor as cheap or expensive as you want, everyone raved about Fernando's but we found that the food was the best at The Pirate, although the drinks were expensive. Cala Do'r was very quite in the evening I suppose as it was nearing the end of the season but the beaches were busy in the day. A word of warning DO NOT USE THE SPAR in the middle of Cala Do'r, this is next to a Santander ATM and opposite a perfume shop, the owner in there rips you off every time, she overcharged us by 13 Euros the 1st time we went in…", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r84112259", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Cheap and excellent for purpose", "review": "This was a great place to stay if you are looking for inexpensive self catering. I was upgraded to a one bedroom apartment having booked a studio.  The room was a little basic, no frills, but clean, comfortable,  and the balcony was great.  Excellent location with a short walk to the main amenities of the resort.  There are only two electric rings to the 'cooker', which was very slow to work, but they fixed it by the next day - the hotest setting is at 1.00.  Do bring anything you personally need to cook with - eg cheese grater, sharp knife, etc.  If you like 'hotel entertainment' then ask for block 6 as this overlooks the pool where they entertainers perform.  However, if you don't, ask for block 4 which is furthest away.  I found if you close all the doors and put your own…", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r81581585", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "cheap and cheerfull", "review": "es ravells is run by a lovely lady and has many very friendly and helpfull staff we took our 17 month old son and when we didnt have a bed as we,d booked a studio(mistakenly) we were very kindly moved to a bigger room with a very large balcony!! the resort is a fantastic place if your looking for a lovely beach many nice restaurants and a very relaxing place then this is ideal, the only drawback was the transfer nearly 2 hours due to many drop offs. the ae ravells rooms are very basic self catering but you couldnt cook nothing really as there is only 2 small rings! cooker/toaster you must pay for. but i would recomend this for a cheap getaway we paid 580 for 2 adults and a baby beg of sept and we were vaery happy for what we got.", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r81508537", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "On the whole we were more than happy with the apartment, location and weather and would definately be happy to return.", "review": "We stayed in a 2 room apartment which was spacious and clean.  Cleaners came every other day.  Cooking facilities were basic - 2 ring hob and a fridge but adequate.  No Kettle !!! Our room was 6108 which was a corner one and had a balcony all the way around two sides, this got the sun all day. For a budget apartment we were very pleased, it provided just enough but nothing more, you can 'hire' hairdryers from reception.   The evening entertainment was excellent and we heard lots of good comments about the quality of childrens evening entertainment.   Bar and music finished by 12. Excellent location for town shopping and eating, loads of restaurants to choose from.  No street hawkers here to annoy you, you can actually browse at your leisure!  Yipee!! We hired a car, again very…", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r79249806", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Excellent value for money", "review": "We found Es Ravells d'Or very nice and cozy apartment hotel. When checking in we actually got a bigger room than we were supposed to get (1 bedroom apartment). The air conditioned room was spacious and nice eventhough the view from the balcony wasn't much of a view. The kitchen had most of the equipments you need for cooking (fridge, small freezer, hot plates, forks, knives, spoons, pots, pans, cups and coffee making facilities).  The room was cleaned in every other day (with very strong chemicals). The pool area was clean and tempting. Like some people have written earlier the sunbeds were mostly taken. If you want to make sure you get one you might want to go to the pool area already in the morning. The pool was lovely and popular especially among families with children.…", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r78913137", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fabulous!!", "review": "We've just returned from our 4th visit to Cala Dor and this was by far the best! Maybe not the best accomodation but everything else was fab!  We were in block 7 on the top floor and had an amazing balcony which looked in 3 directions!! The accomodation is basic but 'it does what it says on the tin'. Location is perfect, staff were great, pool was always clean and Danny the entertainment rep looked after the kids really well. Entertainment at night is as good as you'll get anywhere for this type of holiday!! We would definitely return as it was the best value for money we've ever got!  Walshies is fab for a few drinks at night - the owner Layton has made it a very family friendly pub!! Its a must! La Fontanella (just below the apartments) is the best place we ate in!! All in all…", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r75505044", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Spot on", "review": "Just had a week in a 1bed apartment in block2. Have no complaints at all.Basic accomodation but clean enough and cooking facilities at the bare minimum. Location  wise couldnt be any better. First time in Cala D'or but would definitely return and no qualms about going back to Es Ravells. Entertainment on offer not really my cup of tea but i still sat most nights having a beer and watching from our balcony.We took a travel kettle and ate out every night,plenty of cheap grub or some excellent restaurants within a few minutes walk.Of you want 5star pay 5star prices but if you want a reasonably priced self catering holiday i think these apartments would take some beating.", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r75163855", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "excellent for the money", "review": "Position: Excellent for all amenities Rooms: Basic but clean. No kettle or toaster if you are self catering. We used a pan to boil the water. Cleaned by friendly maids 3 times a week. Pool: Large and clean, Sunloungers are reserved altho policy says this is not allowed.  Entertainment: Daytime with Danny was excellent and we enjoyed the evening tribute acts except the awful Spanish Elvis\" lol Poolside bar: Not cheap but food excellent and the staff make the holiday special, see pics of Paco. owerall excellent value for money. **TIP** Ask for a room with a pool view.", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r75077963", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Central location for beach and town", "review": "Stayed at this hotel(?) for 10 days.  When we arrived at reception it had the all the makings of a hotel reception but that was it.  We were then redirected down the road to block 4.  This apartment had a balcony but we couldn't see anything from it.  When arriving in the room it was only made up for 2 people - not enough bedding or towels.  After going back to reception the receptionist arranged for the maid to call.  The apartment was pretty basic.  No mirror in the bedroom.  Pots and cutlery weren't very clean.   We had paid for half board accommodation.  Not having any details about the restaurant went back to reception again and was handed a \"ticket\" and advised that we had to eat at the hotel opposite.  The food there was ok but the spec for the Es Ravells should make it…", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r74934747", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Didnt disappoint for the third time!", "review": "My fiancee and I stayed for a week at Es Ravell D'or, the third time we have stayed at this hotel. The rooms are basic and your not gonna be able to cook much in them butif your looking for a good base for your holiday and a relatively comfortable apartment, these are the apartments for you! The staff at the hotel are more than helpful and the manageress was very accomodating when we asked if we could change rooms to the one we got engaged in. She did everything she could to help us. The 'Tropical Gardens Bar' attached to the hotel and pool was again fantastic with daily afternoon and evening entertainment and bar and kitchen staff  that made our holiday! My only complaint would be that other hotel guests were up at 5am to put towels down on sun loungers, despite there being…", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r73250471", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "10/10 for value.", "review": "Firstly, let me start by making sure you are aware that you are going self catering at the apartments! You dont get anything in the room unless you rent them at an expensive cost so please pack a travel kettle and toaster if you can. My wife and I knew we were going to eat out all of the time so these missing luxuries weren't reaaly a problem to us.  The rooms are of a good size, good bedroom, good dining area, the bathrooms are a squeeze at times and the kitchen area comprises of 2 hot rings and a sink. However none of this would distract us from the fact that these apartments were excellent value for money. Every apartment from what we could see appeared to have an excellent view of the nightly entertainment which was propably the best in cala d'or. the entertainment below the…", "date": "June 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r73180630", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Excellent value for money!", "review": "This hotel is not the three-star standard it claims to be, but it's such good value for money, who cares!? Our room didn't smell great when we arrived, and the kitchen & crockery wasn't clean, but there were so many plus points that outweighed these. The location of the hotel is superb - slap bang in the middle of Cala d'Or, which is a lovely place. The pool is pleasant, but we were never there early enough to bag a lounger so tended to head to a lovely beach instead. The pool bar wasn't cheap - head into town and seek a local bar for cheaper drinks. Cala Gran is a lovely beach, but we usually went to the smaller, quieter cove next door.  The evening entertainment was a mixture of cheesy and hilarious, as was the karaoke in the bar next door - don't let the noise factor put you…", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r71388498", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "great value for money and brill location. can i go back please?!?!", "review": "Recently returned from a brillant week at The Es Ravells Apartments. I went with my friend and dad. We're both sixteen and the resort was great for all ages. The bar is fantastic! For me it was one of the best things of my holiday, especially the bar owner/manager Tony, so much fun! And all the rest of them were very welcoming. Never seemed a problem to find a sun lounger in the day, though some of them are more comfortable than others (the blue ones!). The apartments were fabulous, had a 1 bed apartment and had 2 huge balconies! Both which were in the sun, so could do some sunbathing there as well which was an added bonus, was like having your own villa! The only thing i would criticise about the apartments were the fact you have to pay for a kettle, toaster etc. All you got to…", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r71184908", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great value for money - exceeded expectations", "review": "I stayed with my boyfriend in a self catering studio apartment and didn't expect anything amazing considering how cheap it was. But it certainly exceed our expectations when we arrived. The lady at the hotel reception was very friendly and helpful and the room and bathroom were clean and well maintained. The best was the large terrace we had to ourselves which overlooked the tropical garden cocktail bar. The entertainment meant there was some noise in the evening but it ended promptly at midnight. Some of the cover bands/singers were good fun too.  The only let down was the bed which were two sofas we had to push together every night to make a twin double, and weren't too comfortable but ok. It didn't bother us too much as we only lazed all day on the beach anyway. There were…", "date": "June 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r70368482", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Fantastic- loved it that much going back again in October", "review": "Good clean basic apartments with entertainment every night (some quite cheesy) well worth the money we paid, only 1 let down, you have to pay for any extra electrical equipment you require e.g. 12 euros for a loan of a toaster for the week, but if like us you only wanted to make a cup of tea/coffee in the morning we just boilet a saucepan of water.", "date": "May 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r68927674", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Superb !!", "review": "We booked a 1 bedroom apartment which was very nice & spacious with a huge balcony. Lovely view over the pool (Block 6, Top Floor). My 4 year old daughter loved the pool and the entertainment at the tropical gardens. Extremely good value for money. Maid service 2/3 times per week but they only mop the bathroom floor not the whole apartment! Also beware of the free air conditioning.......It is only switched on during high season (July-August) which was never mentioned before we arrived and it would have been nice at night. Failing that, we would definately stay here again. Excellent holiday!", "date": "June 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r68634111", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Brilliant !", "review": "From beginning to end a superb holiday - OK so the rooms are basic but they are spotlessly clean, we booked a one bed roomed apartment, wonderful large bathroom, great main bedroom and living accommodation, balcony overlooked the pool area.   Pool area was again spotless, plenty of sunbeds, but would imagine they are scarce during the high season (School Holiday time) pool gets the sun from early morning till late at night. Bar staff were are very friendly and approachable, food in the bar area was good too. Entertainment on an evening was first class, and proved popular as it was nice and busy on an evening with a great atmosphere !  Cannot complain about the location central to everything - people who complain about noise from bars, what do you expect, you are on holiday, and…", "date": "June 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r67993484", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Loved it!!!", "review": "My review is a little late... Me and my girlfriend travelled here in June 2008 for 10 nights and it was one of the best holidays we've had!   Firstly Cala D'or is is our favourite resort. Its small beaches are gorgeous, turquoise sea... white sands and the boat trip to cala mondrago is a must! They take you to all the coves along the coast.   There are so many restaurants to choose from and all the food we had was good, bodega was excellent! There are also many bars, which vary from chilled out family type to the more lively in the square, I must say the night that Spain won Euro 2008 while I was over there was a night i'll never forget!  The apartments are spacious with a big balcony. No they are not 5star but you only sleep there! The pool was a great place to relax and soak…", "date": "January 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r67726035", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good Value - basic but well located.", "review": "Just returned from a short break in Cala D'or staying at Es Ravells and had a great time. This hotel is pretty basic but if, like me, your holiday is more about the local town, its restaurants and bars, the local beaches, days by the pool etc. then you're likely to love it. We arrived around lunchtime and check-in went quick and smooth. The room we had was a studio which is basically one room with a balcony and a bathroom. The bathroom was excellent, the main room had a small kitchen which you couldn't really cook in (no kettle / oven / toaster etc) but had a sink and a fridge which was all we used. There are no beds in the studios as such just 2 of those sofa's that double as beds which we had to push together to make a kind of big cot! A bit odd - I wouldn't like this…", "date": "June 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r66843439", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Fab accomodation, cheap enough & perfect location!!!", "review": "Travelled to Es Ravells in Sept last year with my Dad for a week… I must say I was so impressed and so glad I chose this accommodation  I honestly can not fault these apartments... The apartments were basic, but clean and had all the essentials you would need on a self catering holiday! I did originally book a studio as this holiday was for me and my ex-boyfriend but we split about 2 months before we was due to go, so my Dad come to the rescue and came with me, therefore we really needed a one bedroom apartment. So I emailed the Es Ravells directly on the off chance they would let me upgrade (I was willing to pay the difference) but I never heard back from them but when we arrived they had upgraded us to a one bedroom apartment free of charge - I thought this was fantastic…", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r65197474", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "brill holiday", "review": "stayed here in sept 2009 with my partner, on arrival we were greeted by charlie who was very helpfull, swimming pool in tropical garden was fab food great, pp chaves across the road is a great place to eat. the bar next door was great fun, martin had us laughing all nite.. as for the complaints about the beds, we thought they were very comfy.. all in all we will definatly be back again, looking forward to seeing you again. gavin quinn", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r61843753", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely Hotel", "review": "Amazing swimming pool! Lovely staff Masssssive balcony! A little noisy from the bar next door at night,", "date": "June 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r55097662", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good and Bad Points", "review": "We are so pleased that your thoughts regarding your stay with us, were wery positive. We sould like to think that we can welcome you back in the very near future.", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r54249809", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "brilliant", "review": "After half an hour in our ground floor studio apartment we noticed a mass amount of ants crawling on the floor. Looking out onto our 'balcony area' (on the ground floor so in front of a fence) we noticed a tree where there was a stream of ants crawling in and out of the tree, making their way from the tree, to the floor, over our balcony and into our rooms.  We had arrived at our room quite early because we hired a car, and so got there before other holidaymakers made it from their tour operators buses. We decided to ask if we could be moved to another floor that wasn't on the ground floor, expecting it to not be a problem as some of the rooms hadn't been allocated yet.  To this the lady at the desk told us no, we cannot change our room. If we wanted to move to a different room…", "date": "May 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r53217958", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "fab holiday", "review": "my review is a little late but just want to say as a family we have been going to es ravell for over 10 years and love it ,we have also taken friends with us and they have been a few times with us now.Everyone is so friendly and we have made some good friends.They always try to give us the same apartment whenever possible.Beaches are lovely yes sometimes a little crowded.Restaurant below ravells good food, we go there a few times to eat.My husband and i are looking at going again in june.Look forward to seeing you all soon.Cath and Paul Hewitt ,Great Sutton.", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r47595944", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good value, great location", "review": "We are highly delighted that you have chosen our complex during so many years . We must be doing something right. We see you have booked again for this year. We look forward to having you once more as our guests.", "date": "July 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r46641298", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Never again", "review": "Stayed here in September 2009 on arrival complex was ok ,but have never felt so ripped of on any holiday before ,how came can you charge for a kettle & toaster in a self catering apartment.They were even selling the old books games etc that people have left.Saying that the entertainment was great.", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r45530436", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Never again !", "review": "Just returned from Es Ravells apartments in cala d'0r Mallorca . apartment was nice size but very basic and could do with a lick of paint here and there . Chuck out the chintz as they say ! No kettle supplied had to hire one from reception for 10 euros for the week and was only a travel type took ages to boil . Good size balconies with 1 table and 3 chairs as per the norm . Good air con system which is free . But the beds are naff to the extreme . Mattresses made of 5 inch thick rock solid foam , and i mean solid . Not one good evenings sleep could myself and my wife get . Please please please invest in some decent mattresses they just might help you to keep people coming back ! we went for a relaxing week but came back shattered from lack of sleep .  Nice area but everything so…", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r42405982", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Very Nice Apartments", "review": "We apprecieate your constructive critiscm concerning your holiday with us. Every year we do our utmost to improve the standard of the facilities at the complex.", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r40828390", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "a great holiday", "review": "Me and my girlfriend have just returned from a ten day stay at es ravells apartments, we used resorthoppa to get there and back and would recommend them. We had a 1 bedroom apartment which was very spacious and had great air con, our balcony had a pool view which was a nice size  overlooking the tropical gardens, the entertainment ends around half 12 so dont expect to get to sleep untill 1 when they rearrange the sun loungers. The kitchen was ok, we brought our own kettle coz we knew from trip advisor that we wouldnt have 1 in our room, also no toaster, tip - bring a tea towel. The reception staff are very friendly and helpful. We bought a map for 1 euro from reception but then found them free at a bar in the marina, so dont make that mistake. The pool belongs to the tropical…", "date": "August 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r39749202", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "4th year in a row love it next year i will make it 5 in a row with friends", "review": "We are glad that you had a good holiday at Ravells d'Or and thank you for your very positive comments. We hope that when the pound against the euro is stronger you will pay us another visit. Many thanks once again.", "date": "August 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r38557625", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "What a Gem!", "review": "This hotel is conveniently located by he Karaoke bar Hollywoods in Cala d'or. It is close to 2 beaches and the marina and town as well. It was an absolute bargain and we booked through alpha rooms. The lady on reception is english but speaks perfect spanish! You can call the hotel and book through her as well - i will probably do that next time.   The pool is lovely and the food at the pool bar is ok - although the ice cream parlour a 2 second walk away is the BEST!   The rooms are large and very clean all of the facilities are in good condition and the balconys are large.  A fabulous budget hotel and i will be using this again!", "date": "June 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r38348640", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Nice location, clean rooms and good evening entertainment", "review": "We would like you to know that we appreciate your comments on our complex!!! Our aim is to please and we will continue to do that. Into 2010. Many thanks for your support.", "date": "July 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r37231530", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "FAB APARTMENTS AND LOCATION BY THE CAVIES FAMILY", "review": "My wife and I stayed here for 7 nights in July 2009.  The room was clean, cool (aircon working fine) and an above average bathroom.  The single beds were basic but ok; I'm 6'3\" so I had to lie diagonally.  We slept ok.  Cooking facilities were also basic but we did get a working kettle and a toaster, both of which I was lead to beleive were extras from reception.  Not this time!  The room had a balcony which overlooked the pool.  The plastic chairs and table are what you come to expect, urgh, I wish they would do better there.  There was a downside - The evening entertainment next to the pool is on 7 days a week and ends at midnight.  So if you want to go to bed earlier than midnight you will have to put up with pretty loud music.  We also found the childrens entertainer lady…", "date": "July 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r36615384", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Nope, not for us", "review": "Could we just say that we appreciate your comments and are delighted that your stay with us was satisfactory.", "date": "July 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r34711737", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "One of the best holidays ever!", "review": "We have just recently returned from a fabulous holiday at Es Ravells D'or Apartments.  The staff and facilities at these apartments are great.  The staff are very friendly and provide you with all the information you need.  We had a great apartment with a huge balcony overlooking the pool and entertainment (Room 6201).  The apartments are very clean and are very good value for money.  We will definately be returning to these apartments next year.  Cala D'or itself is a great place for couples or families.  The beaches are excellent.  Plenty of very nice restaurants with lots of choice.  Didn't want to come home - wished we had booked two weeks.  Thanks Es Ravell's D'or for making our holiday an excellent one.", "date": "June 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r34620478", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Cheap, Cheerfull, Nice beach, perfect with Kids", "review": "Travelled to Es Ravell with the better 1/2 and 2 young children (<5) for seven days at the end of may. Apartments were basic but clean with functional kitchen (although the hotplates did take me a couple of meals to work out).  Room had huge balcony which was lovely.  The privately run pool  is really nice and well maintained and the glorious beach is only a short walk (<5mins) away (tip - there is a path next to the pool which takes you through some gardens directly to the beach, saves walking down the road with kids).  Entertainment for the kids was great and the lady who provided it was brilliant, she played in the pool with the children during the afternoon and did the Black Lace style entertainment form about 8ish.  The tribute acts afterwards were always well supported…", "date": "May 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r33541754", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Brilliant Holiday", "review": "Thank you so much for your felicgtful comments on our apartment complex, and th resort of Cala d'Or. It really assists us, when people take the time and trouble to let us know exactly what they think. In this way, we are able to improve our standardseach year, in the hope that our loyal guests will return once more to stay with us. Many thanks once again.", "date": "June 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r32948628", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good Reviews Justified", "review": "Just got back from Es Ravells and loved it, basic clean but friendly staff and great entertainment. The rooms are ok for a base and somewhere to sleep, there is plenty to do and see so you will not be in there much anyway! as for the ants? well you get ants in Mallorca just as you would in any hot country!! just not a big deal really. We wil be going again we loved the whole experience.  p.s tribute bands were great.", "date": "June 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r32740640", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Absolutely lovely holiday - great entertainment :-)", "review": "To our most welcome Guest, we truly appreciate that you have chosen our establishment in which to spend your vacation. We hope that your stay with us has been most satisfactory, and that all your needs have been met! We would be delighted to receive any suggestions you may have, on how to improve our services for the future.  We hope that you will choose us once moer for any holidays that you may be contepplating. In hope of seeing you in the near future.", "date": "May 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r31839927", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Fabulous! Can't wait to go back!", "review": "I searched long and hard for accomodation on the internet for myself and my husband as it was to be our first visit to Cala D'or and didn't want to be disappointed. Made list after list and kept coming back to Es Ravell d\"or. But it was the cheapest - surely it was going to be a let down and him indoors would not be happy !?!!  After a drag of a transfer from the airport we were very pleasantly suprised by the reception area & the welcome we were given by the English lady on duty. Michael was most impressed that it was 24 hour reception and they had books for sale and also leaflets and postcards. Not thrilled that we had to pay for a map but perhaps we would have come across a free one if we had waited.  We were given a welcome pack and our keys and headed for our room on the…", "date": "August 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r31395469", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Basic but clean", "review": "Booked a week at es Ravells d'or at the last minute. Apatment was basic but clean with a massive terrace. Some problems with Ants in the kitchen area and it was a bit annoying to have to hire the safe and kettle.   Resort itself was very quiet at the end of September.", "date": "September 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r21153840", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "A bit of a kip!", "review": "We had been to Cala D'Or around 7 years ago, and having had a great holiday first time round, were keen to go back.   First problem arose when the transfer driver chucked us off the bus at Club Martha's at 6am in the morning, despite our protestations that it was the wrong hotel. Between our limited Spanish and his limited English, there was no arguing the point. Luckily, when we got inside the receptionist was really helpful and ordered us a taxi to Es Ravells.  The room at Es Ravells was a bit of shocker - we'd stayed in pretty basic accommodation before at this resort, but we hadn't been told it was a studio apartment with what was essentially two sofas to sleep on. Cooking facilities weren't great - no way that a meal (however simple) could be prepared on the very weak hob.…", "date": "July 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r20719450", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Great Time.", "review": "Just returned from a great holiday at Es Ravells. lovely clean apartment, free entertainment every night by good tribute bands, and the restaurant \"Rafaels\" is superb. I can highly recommend the food and the service.", "date": "September 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r20693478", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Cheap & Cheerful", "review": "Just got back from a great week at Es Ravell's. Myself and my husband booked a one bedroom apartment and it was very spacious with loads of storage - tip, don't book a studio apartment and then complain your beds are sofas in the same room as the kitchen, that is what a studio is wherever you go!  Lovely bathroom with great shower. Cleaners came 3 times in a week, changed towels, mopped floor etc.  Beds - yes, they are a bit hard, but we both managed to sleep on them fine for a week.  Kitchen - rubbish, but I don't go on holiday to cook. We've got our own travel kettle, and I boiled a couple of eggs and made a few sandwiches, but that's as far as it goes for me! Fridge has an ice-box in it if you're taking freezer blocks for a cool bag (good idea for beach, trust me - the state…", "date": "September 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r20165325", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "You get what you pay for", "review": "Just got back from our stay in Es Ravells and loved it I wouldnt say i was short of money but me and my partner and both of our parents wanted a CHEAP getaway and thats what we got. We all stayed in studios yes very basic but what you expect for a hundred quid. There are a few ants knocking about but nowt major. The rooms were very clean nice big balcony newly fitted bathrooms, the sofa beds were fine just as comfy as your normal spanish hotel bed. To be honest the rooms were only there to sleep and make a bit of dinner in them as cala do'r has so many things to do, a superb choice of resteraunts, bars and things to see. People say its pricey but how can anything be pricey when you come from England. My only gripe was the beds round the pool are in desperate need of updating it…", "date": "September 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r20140248", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Tribute!!!!", "review": "Just got back from 2 weeks at Ravells.  I can honestly say it was a brilliant holiday.  Ok so the apartment was a bit basic but remember when you booked it is only a 2 star!!!! but it was cleaned every day.  There was always plenty of room by the pool and it was always kept very clean and tidy.  The entertainment at the Tropical Gardens I have to say was EXCELLENT we saw Abba, Westlife, Take That ,Robbie Williams, Rod Stewart , Blue Brothers, Neil Diamond and a whole lot more and as tribute acts they were very good.  The resort itself was a bit hilly but worth the walk.  Noddy trains were a good way of getting your bearings......", "date": "September 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r20115433", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Like a Carry On Film!", "review": "The following is a true account. I arrived at Es Ravells, Cala D'Or on friday 29 August 2008. I had booked a 'studio apartment' for myself and my two children for a week. This was on the ground floor and consisted of a small room with two grotty tartan sofa beds and a 1960's fold up metal camp bed. The 'kitchen' was in the same room and comprised a sink and two electric rings. No kettle. No toaster. No microwave. These could be hired from reception for extortionate fees (10 Euros to rent a toaster for the week!). The fridge had an ants nest in it. It was like something out of a Carry On film. I had never seen any holiday accommodation so bad. The bathroom was clean at least.  I asked the receptionist if I could upgrade. Either that or I was going to fly back to the UK that…", "date": "August 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r20084525", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Fab resort", "review": "Myself and my partner (in our 30's) got back from a week's stay at Es Ravell D'Or Apartments, cant really fault the room - although our bed was 2 sofa's.  Room was clean and the maid came every other day.  I didnt spend any time around the pool as was more for familys with kids - to be honest a bit tacky, could not get a sunlounger at all and everyone seemed on top of each other! The resort was great, plenty of restaurants, bars - although we found a bit pricey. Beaches are lovely although get there early if you want a bed/umbrella as this were all gone when we got there (about 11ish).   We hired a scooter, very reasonable 29 euros for a day, and you can get around to see a lot more of the island. Not much of night life though after midnight.   Over all a great holiday with lots…", "date": "August 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r18873163", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "hotel average/ tour operators horrendous!!", "review": "Just returned from a week in cala d or at Es Ravell Apartments. As previously mentioned the accomodation is very basic, but clean, balconies are great, but the beds are rock solid!!   I went away with my mum and 6 and 8 year old neices and as the beds were so uncomfortable, we ended up sleeping in the lounge on the setees, 2 of us on each!! Not ideal as I was just under 6 months pregnant, and unfortunately as a result am now suffering with bad back pain..The other issue we had with the apartments was the invasion of ants, we came back from the pool one afternoon to find hundreds (I kid u not) of ants marching across the apartment, reception told us that every apartment had them at the moment, and issued us with a pest killer foam!!   The pool area was fine and the staff were…", "date": "July 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r18395281", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Perfect for families", "review": "We stayed here with our four year old and just got back.  This place has everything you need for a family with young children to enjoy.  OK, the accommodation is basic but we got the one bedroomed apartment for the same price as the studios that seem to get bad press elsewhere in these reviews.  The 'kitchen' is an afterthought and we didn't use the cooker once as there was plenty of reasonably priced cafes, bars and restaurants to hand.  The bathroom seems to be the most recent upgrade as it is more contemporary and finished to a higher standard; plus the shower was great and never ran cold.  The balcony was open to the neighbours but this proved a plus as our inquisitive little one chatted to the kids from neighbouring apartments.  The receptionist was helpful and never seemed…", "date": "July 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r18137529", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "A Place To Chill!", "review": "Just returned from a short break  to Cala D'or to see our daughter who works in the resort.  We were looking for somewhere to stay that was cheap, clean and well maintained. We got all this and more from the ES RAVELLS Apartments.  It is very well positioned close to the beach and all the shops, bars and resturants. The pool is fantastic with no towel watch and big enough for everyone. The friendly staff gave all the services and more with a smile on their faces and the entertainment was top notch with the likes of the temptations to the spice girls catering for all.  If you want a cheap night  - ask for a pool view room high floor overlooking the stage. Get some beer and pizzas and sit on the good sized balcony and enjoy the show. Cala D'or itself, has everything you need in a…", "date": "June 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r17483972", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Love Cala d`or. -  2nd visit.", "review": "This was our 2nd holiday at Es Ravell D`or apartments.  Me and my partner went with our 3 daughters aged 13, 20 & 22.  We had such a fantastic time in 2006, when Gareth & Ellie were our entertainment staff,that we just had to go back again. Even though there was live entertainment every night at Tropical Gardens, what  WAS missing was entertainment staff. We feel there would have been more audience participation if there had been.  Apart from that ,our holiday was what we expected. I do agree with other reviewers that the sun loungers could do with being renewed but the pool was excellent and cleaned regularly.  I do think that a lot of people are not aware that Tropical Gardens (and therefore the entertainment) is owned & run (by Tony) independently from the apartments,so to be…", "date": "June 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r17464453", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Never Again", "review": "Worst hotel I have ever stayed at and worst holiday ever !  Hotel room absolutely stank of foist, no view and electricity went off every time we plugged in our appliances, especially hair drier. Hotel staff were unfriendly, sunbeds were so old dirty and uncomfortable that we preferred to lie on the concrete.  Prices at hotel were ridiculous, 1.80 euro for a small bottle of water.  Resort itself was overpriced and boring.  The money we spent on this holiday would have paid for us a Caribbean Cruise - Never again !", "date": "June 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r17173916", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Happy hol for 2nd year running", "review": "After visiting last year and being so impressed we booked and went back for a 2nd visit and were not disspointed.  I agree with a previous reviewer about the need for new loungers and the prices in the bar area being abit steep but bearing in mind the overall prices, the facilities and the great entertainment I am not complaining!  Tony the bar owner is constantly striving to ensure everyone is being served, enjoying themselves and joining in.  The reception staff are english, only to happy to help with anything you want/need and friendly and helpfull.  Particulary usefull is being able to buy old magazines and 2nd hand lilos, boats etc as well as having internet access for 1euro for 20mins so you can still keep in touch with the uk.  Think we might even go back again next year!", "date": "June 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r17164050", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Would not go back!", "review": "You may find this review surprising since every other review listed on this site gives a glowing reference for Revells.  You may be inclined to ignore what i have to say, but of course thats your choice.  I stayed at Revells last week with my father (June 2008).  We booked a late deal on-line and were allocated a studio apartment, which i was told had two beds. Although we booked very late, the price was still reasonably expensive imo (i have been fortunate in that i have travelled extensively).  On arriving into the Studio, my father and I, looked at ourselves a little bit in shock.  The studio apartment had no rooms.  It was an all in 1, apartment.  The two beds were sofa beds, that did not pull out.  They were quite hard, and as our holiday progressed discovered that we were…", "date": "June 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r16987678", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Good value", "review": "Just back from a week at Es Ravells and can't really argue with anything that hasn't already been said. The rooms are fairly basic but I've stopped in worse. They are cleaned three times a week depending on when you arrive, so for us arriving on a Saturday, the maid called on Sunday, Tuesday and Thursday.  Only down side really was the condition of the sun beds around the pool - they were minging! Hand on heart I don't know how people could lie on them as some of them were broken and almost all of them had black mould encrusted into them.  Luckily the beach at Cala Gran is only a 5 minute walk away but if you want two sun beds and a parasol it will set you back E11.60 a day.  The entertainment at the Tropical Gardens is ok depending on which night you hit on, but there are…", "date": "June 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r16942565", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Fantastic!", "review": "This is the best place to stay for a break.  The apartments are basic as per other reviews, but are clean and tidy.  This is the 4th time we have stayed here.  We come year on year and never have anything bad to say about the place!  the entertainment in Tropical Gardens is great, the bar is expensive, but if you do find yourself lucky enough to be placed in the apartments overlooking the entertainment, then this will save you loads of money as everyone sits on the balconies and drinks their own!.  The beds are the only downside!  Es Ravell Dor...please spend some money and improve them....please!!!  Booked again for next year...", "date": "September 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r15340929", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent Es ravells!", "review": "Just back from ten scorching days in Cala D'Or, staying at Es Ravells apartments.Wonderfull!! We requested a quiet upper level one bedroom apartment and that is exactly what we were given.Spotlessly clean,excellent air con,spacious with lots of wardrobe space.Yes.. the cooking facilities are limited to two electric rings, no toaster or kettle, but we managed fine,we took a travel kettle with us although one could be hired from reception.It depends which company you book with if you are charged or not.No TV,but again who wants to watch CNN or eurosports on holiday.I took my portable DVD player and played music and films whenever I wanted a break from the heat and boyyyy was it hot!!!We had three very private sun terraces with the apartment, so we chose to get an all over tan up…", "date": "September 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r8852177", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Didn't want to leave!", "review": "My boyfriend and I stayed at es ravell d'or for a week in August and it was one of the best holidays we've had.  We were a bit apprehensive after hearing some tales of it being over priced and boring but I have to say it was brilliant.  The area was fantastic just a short walk to everything you could possibly need, and as a young couple we never ran out of things to do.  The pool area is kept very clean and the pool itself is excellent.  The 'Tropical Gardens' bar which is attached to the hotel is also fantastic and the food is lovely and all the staff are very friendly.  The entertainment is great for the kids through the day if you have any, and the tribute bands on night time are a good laugh and some were pretty impressive!   The beach was quite crowded so we tended to stay…", "date": "August 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r8514719", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nice place but wont be returning", "review": "We (Family -2 adults, 2 children 9 & 5) have recently got back from our week long stay here at Es Ravells D'or & after having read a number of reviews i was heartened that it was not too uncomplimentary, however I need to inform those that are reading this of the facts when considering choosing this accomodation:  The Complex is centrally located in Cala D'or within 800metre (8min Walk) to Cala Gran beach, 15Min walk to Cala Esmerelda. The Apartment has a 24hr reception that has public payable access to the internet (€1=30mins). The rooms are Spacious, Clean & very presentable with A/C. However as advertised as a self catering apartment, there are a number of items not available as standard Self catering appliances. The rooms have Plates, cutlery, glasses, Saucepan, 2 pots, 2…", "date": "August 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r8509360", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Peak season", "review": "Our apt was good - a one-bedroom on the top floor with a huge and very private balcony. The apts are basic but they are clean and have very good air-conditioning. No complaints at all about it.  If you get allocated apts in the blocks nearest reception, you will be much closer to the 'entertainment  centres' ie. the Tropical Gardens and the Hollywood Bar. They are both very noisy but everything shuts down at midnight. Obviously, it depends what you want - it seemed that many people - whose balconies overlooked the stage at the Tropical Gardens , sat out on them every night and watched the shows from the comfort of their own balcony. Much cheaper than paying bar prices downstairs! Overall, a good place to stay if you want to be right at the heart of things - near the beach, shops…", "date": "August 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r8508132", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "brilliant", "review": "brilliant holiday,been here twice in the last 8 months,cant beat the place.booked again for two more holidays next year. ", "date": "June 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r8456449", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Fab family location", "review": "Myself, husband and 4 yr old son have just returned from a lovely week in the Es Ravells Apartments in Cala D'Or.  They are ideal for families or couples - very relaxing during the day, no fighting for sunbeds , friendly, attentive staff, a lovely pool area with tropical gardens and only a few minutes walk from both the resort 'centre' and the lovely beach. Free kids animations are provided both on an afternoon (12-3.00pm) and evening as well as very good shows and 'tribute' bands for all the family from 10pm until midnight every night.  Anyone wanting to get to sleep before midnight would struggle but we just 'paced' ourselves accordingly - we are not a 'party animals' type family and went out for dinner each evening, but thoroughly enjoyed our night cap back at the 'Tropical…", "date": "June 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r7838434", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "great family holiday!", "review": "after reading a few of the reviews on this hotel before i went i was a little worried, but none of those worries were founded. our hotel apartment was clean and well equipt, ours included a small living area and a dining table which was great. we were able to watch the entertainment from our balcony if we wished to which is the most popular night entertainment on the resort free to watch and includes a childrens caberet. the swimming pool and the beach were clean. i would strongly recommend this resort to family and those requiring a relaxing holiday. ", "date": "May 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r7721341", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "great holiday, loved this place!", "review": "The Es Ravell is a great place to stay if you want to be in the middle of the resort of Cala d'Or. The apartments are lovely and clean, the 1 bed is definately worth paying for rather than a studio as it is much bigger. The balconies are big and look over the pool area.  The complex is geared towards families, with excellent entertainment provided for kids, but I went with 2 friends and we had a great stay there. The bar and reception staff are helpful and friendly, and food is good.  Would highly recommend hiring a car and seeing some of the beautiful beaches around the island, particularly Cala Mondrago.  The noise from the Tropical gardens area in the complex is loud, and you can also hear the karaoke bar in front, but both don't really cause a problem as they both finish at…", "date": "August 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r5762914", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "excellent holiday", "review": "We stayed at Es Ravell D'or Apartments in July 2006 we loved every minute of our two week stay ,the kids aged 11 and 16 were entertained every afternoon and every evening by Ellie and Gareth you guys were absolutely fabulous you made our holiday,we loved the fun dances and joined in regularly with nearly everything you did.The apartments were spot on including maid service the beach literally is a 4 minute walk our rep naomi hooper was an excellent guide to what was going on in the area.Thank you all so much and hope to see you all in october for another week luv stan dawn scott and elise x ", "date": "July 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r5543941", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good Value Holiday!  Good Hotel.", "review": "Stayed at this hotel for a week with my girlfriends at the beginning of May.  Hotel was pleasant.  Pool area very nice and the bar food is delish and all home made!  Although none of us had kids, the entertainers were excellent and all the kids seemed to be having a great time at the club/in the pool/at evening entertainment.    As it was beginning of Summer season the hotel was not as full as it would probably be at it's peak.  Plenty of sun beds and no trouble getting the same places everyday.  In the end everyone just stayed on the same beds each day so we all got to know each other!!  Every evening they would put on a show (e.g. tribute Robbie Williams/Westlife/Abba) - ABBA was absolutely excellent!!  Robbie was a bit dubious though!  However, it is worth staying in for the…", "date": "May 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r5539652", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "brilliant", "review": "absolutely brilliant, cannot wait to next year to go again.  Me and my boyfriend went for a week, first holiday together and had an amazing time, the only bad thing was coming home,   Apartments clean and tidy, bar staff helpful and entertaining, entertainers good fun, pool, bar and local ammenities all great. recommend it to people of all ages,our age band 20-30 plenty of late nite drinking holes and places to hit the dance floor, entertainment in bars under apartments finished at midnite so no problem with noise if you had young children in bed. amusements and internet access in local arcade to keep the teenagers happy.  Cala gran beach gorgeous clean, no rubbish, a must to see is tutti frutti man selling fresh pineapple, coconut and watermelon everyday.  all the restaurants…", "date": "July 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r5537347", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Loved it!", "review": "Me and my boyfriend stayed at the Es Ravells D'or and had a great time!  The rooms were fantastic, a little small but as there was only 2 of us it was adequate!  The entertainment at night for us in the complex got a little tedious but there are lots of restaurants and bars only a couple of minutes away if you need to get away from it all.  Tropical Gardens, which is where all the entertainment is situated has lovely cocktails but the prices are expensive compared to nearby competition.  The pool area is nice and gareth & ellie did a great job of providing entertainment in the day.  The bar staff and reception staff are all really friendly and make you feel really welcome!  Would definetely reccommend it to anyone! ", "date": "July 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r5502868", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "excellent hotel all round!", "review": "I have just visited this hotel with my boyfriend and we had a lovely holiday. The apartment itself was clean and tidy although compact but for the amount of time you actually spend in your room it was more than enough. The staff were excellent very friendly and more than happy to help, they also offered free electrical items, ie, kettle, toaster, etc which i thought was a very good service. The surrounding area is very nice close to all shops and bars and only a 2 min walk from the beach which is a beautiful cove. Our apartment was situated right above the reception on the ground floor the music was quite loud from the bar downstairs but we were able to sit on our balcony which was double the size of those in the upper floors, the music finished around 12 every night so it didnt…", "date": "July 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r5499580", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Not bad at all", "review": "My girlfriend and I have just returned from a great week at this place and I would definatly consider going again. As it was a late deal we had to pay a supplement and got a 1 bedroomed place instead of a studio and it was more than sufficient for our needs, we were in block 4 (furthest away from the night time entertainment area which can be loud) and our apartment was lovely.  For a couple it was perfect, the bedroom was large and had a good sized wardrobe and then in the lounge (if you were travelling as a 3 or 4) were 2 single sofa beds and another wardrobe. The apartment had air conditioning which was much appreciated as the temperatures were high all day and night long and the kitchen area was clean and modern.  The staff are friendly and helpful and the pool and bar area…", "date": "July 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r5441748", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "not a nice hotel", "review": "Myself and my boyfriend booked a wks hol in may, and got the Es Ravell Dor hotel, after having a long trip to get to it, seem it was the last hotel on the route to drop off. The surrounding shops and area looked lovely ,as did the hotel until we checked in, The staff were very friendly, but when issued with or room key and the looking around for the number we were staying it, it had been raining when we arrived and there was water and puddles every wear near the room doors, so siutcases got very wet.Then we found our roon right at the end, near all the dustbins which some had over turned. Also very dark on approaching the room.When we got into the room we couldnt believe wot we were going to stay in, very dark and very small, nice cooking area and a lovely bathroom, but all we…", "date": "May 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r5383246", "sub_review": {}, "travel_purpose": "", "rating": 1}, {"title": "great if you like fun and have kids", "review": "We went in June this year, the hotel has good entertainment but geared towards children and is very loud. I can imagine in the school holidays it will be over run with kids............Which is fine if you have them, also kids above the age of 5 as sleeping before 12am could be a problem. Overall  has a very family feel, not suitable for girly or lads holidays. ", "date": "June 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r5381215", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "very very very loud!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "review": "We were disappointed with this hotel from the moment we arrived- the lift was broken for some of our stay the rooms were tiny and there is no privacy on the balcony but the worst thing of all was the competing noise from the bar at the front of the hotel with very bad karaoke and the \"entertainment\" from the tropical garden at the back of the hotel. The pool is tiny too and all the sunbathers get cleared away from the pool at about six to make way for the very poor Robbie, Kylie and Madonna lookie likeys while they murdered poor renditions of well loved pop songs, unless you enjoy unrelenting music played at top volume all evening and all night then this hotel is to be steered well clear of- another complaint if this is possible! is the fact that we were self catering and this…", "date": "September 2005", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r5236081", "sub_review": {}, "travel_purpose": "", "rating": 2}, {"title": "best holiday!!", "review": "me and my fiance went on holiday to es ravells d'or in october 2005. we done allocation on arrival, we both were bit worried about the place we'd end up in. but to our luck we ended up in es ravells d'or. the rooms were very clean and tidy!! maids made a good job, they always came on time about 4 times that week. the food and drink at the bar were very good, but a little exspensive, i think that was because es ravells d'or had the best entertanment in that area. they had acts on the stage every night from westlife to madonna to blues brothers and even a great parrot show. they had kids disco from 8pm every night. also in the afernoon shaggy and steph ( hello ) played some music done some bingo and made it very plesant. shaggy is a top bloke! everyone would get on with him. steph…", "date": "October 2005", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g580287-d584696-r4141121", "sub_review": {}, "travel_purpose": "", "rating": 5}]