[{"title": "Great hotel for overnight stay prior to flying", "review": "We were very happy with this hotel.  It’s 5 minute drive from Alicante airport.  It is a  very modern hotel, the room was spacious and clean.  Spotless bed linen and nice toiletries.   We visited the Spa,  which doesn’t open until 5pm but it has a nice pool with jacuzzi jets.  Plus a steam room and (sauna which was unfortunately out of order).  However, the steam room was excellent.  Spa towels are collected from reception together with wi fi password.  It would have been nice if we had been offered both these at check in - we weren’t.   Breakfast was nicely presented with a good selection of food plus a good coffee machine.   I would definitely recommend this hotel.", "date": "November 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r728211442", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "More than a place to sleep.", "review": "Dear Remy. Thank you very much for your detailed description of your stay at our Hotel. We are very happy that the facilities and attention received have been to your liking and so well valued. We hope to welcome you very soon, we will be happy to assist you. Sincerely, Hotel Areca & Restaurante Carabí.", "date": "November 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r728015795", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent location for early or late flights from Alicante airport", "review": "We had to find a hotell to sleep waiting for an early airoplane. This functioned very well with the hotel’s matebus early in the morning. In addition to this the hotel had a very good kitchen and served an excellent dinner. Peter the norwegian", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r721974195", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Good Hotel Close to the Airport", "review": "Dear Peter. Thank you very much for such nice words. It has been a pleasure to have you stayed at our hotel. We hope to see you very soon. Sincerely, Hotel Areca & Restaurante Carabí", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r721729277", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Disappointed", "review": "Easy to find with cheerful and helpful staff and literally 5 minutes by car from the airport.  The hotel does have a shuttle.  This is not a luxury hotel but our room was clean and comfortable and the hotel has a resteraunt and pleasant outside bar area.   The spa was excellent , just what you want before or after travelling.   Besides the hotel there are several places to eat a short stroll away.  We ate at the resteraunt SAN Rafael in the Hotel Dona Isabel and the food was very good. We will certainly stay here again.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r712271862", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great hotel for an early flight", "review": "stayed here one night before an early flight. just 5 minutes from Alicante airport. very easy to find, lots of on road parking. room was spotless. we ate out in a cafe in the town. left before breakfast. would stay here again", "date": "January 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r707729130", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Perfect Airport Location", "review": "Stayed here before an early morning flight. Check in was fast and efficient and reception staff very friendly. Room was clean and tidy. There is no door into bathroom so make sure you know your other room mate well before showering.There is a glass door between bathroom and toilet. Bed was comfy and air con very good. Hotel is very modern and spotless. We ate in hotel restaurant and the food was superb, well worth trying if staying here. The hotel is a 5 min taxi ride from airport and a 10min walk away you will find Torrellano train station that will take you into Alicante for 2 euros each way. Would recommend staying here if you have an early morning flight or a late arrival.", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r706571834", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Very impressed", "review": "Dear john. Thank you very much for your detailed comment about our hotel. We are very happy for your recommendation and for everything you liked to appreciate our attention and facilities. We hope to see you again on a next visit to our country. We will be happy to assist you. Regards, Hotel Areca& Restaurante Carabí.", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r703123740", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "This hotel was a great find!", "review": "What a lovely surprise i was expecting a sort of travel lodge style hotel but it was far from that. The hotel is excellent very modern and clean, theres a nice spa with pool and steam room. The staff are excellent and the restaurant food is to an unbelievable high standard.  Really on very level i was impressed i cant say how much would recommend a stay here no problems", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r703057789", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "DonTin", "review": "After a flight landing at 22.30 this hotel was minutes from airport and 24hour check in. Room was clean and comfortable. Bar was still open to get a drink, but the water in the mini bar had been opened! I did mention this to reception on check out. Great location and minutes away from shops. Breakfast was good , buffet style and only 12 euro. Both mornings I had spa to myself, but sadly no pool outside. There is the garden in the outside terrace restaurant so was at least able to sit out. Food was very good and food and drinks were reasonably priced. Check out was 12 midday and our flight was not until 22.35 but they looked after our luggage and we used facilities until we had to leave for airport. On a walk in the morning you could see the planes landing so great for plane…", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r697497667", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Never again!", "review": "We booked this Hotel because of the vicinity to the Airport, free Shuttle and WiFi Service. When we arrived, the WiFi didnt work so they sent us to the City to find WiFi ans Said it will be fixed in the evening. When we came back, it was still not working and they told us that we wont die because of that. I asked If He meant the Statement serious and He apologized, but still, it reflected their Attitude. The Shuttle Service was also not available and if IT hadnt been that late and travelling with a toddler, I would have checked Out immediately since in the Childrens room was a strong smell of cigaretts (even tough they claim to be smoke free).   To be fair, the rooms were clean and lovely. The beds were comfortable. But we would not recommend this Hotel to our Family and Friends.", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r696022943", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Lets Start with a Person entering your room at 5am after been given the wrong key", "review": "First of all we would like to thank you for the time spent writing and sending us your opinion about your stay at our Hotel. We are sorry to hear that the room did not meet your expectations. Apologize for not having available the Wi-Fi network during the night of your stay. Surely the reception staff informed you that the problem was foreign to us. The network stopped and when restarting, the system configuration was deleted. We work as quickly as possible to solve it but until the day after his departure it was not possible. Regarding the transfer inform you that this is available every day of the week except 2 days: Monday and Tuesday. Giving causation during your stay. In this sense, the reception staff offered you the option of calling a taxi but you decided not to call it. In any case we regret the inconvenience you may have had in our Hotel and we hope that we have a new opportunity to show you the quality of our services and facilities. Sincerely, Areca Hotel.", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r691659714", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Overnight stay", "review": "Feel a bit destroyed really writing this , but it must be said and taken notice at the Highest level of the Hotel Chain, Great hotel Fantastic Staff BUT...... new staff on the desk, which is not a issue untill some one in this case, a male was standing hovering over the bed, in our sons and girlfriends room  ( aged 25 ) room located next door to us at 5am, this could have turned out very nasty and violent, when seeing a intruder in the early hours, genuine mistake or not THIS SHOULD NEVER HAPPEN, how would you handle this, when the phone rings and your sons says theres been a man in our room, immediately we were at reception, apolagies were given but this really must never happen again, we will stop there again, Great Hotel and location", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r686932627", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Clean and convenient ", "review": "We stayed overnight after a late flight into Alacante. The hotel is a short taxi ride from the airport. The facilities and rooms are very good, decent breakfast and close to railway for onward travel. I would definitely stay again if I needed a hotel after a late flight.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r678431206", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Excellent standard", "review": "Stayed one night on way home from Champions League Final in Madrid 🏆🏆🏆🏆🏆🏆  Clean and convenient and very good value £55. Dinner was about £25 in their decent restaurant.  There is a spa with small pool, sauna and steam room.  Taxi to the airport took 10 mins and cost about £10. Hotel booked it and were really helpful", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r677716773", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Overnight Stay", "review": "Lovely hotel close to Alicante airport, and only a short stroll into the town. Very friendly helpful staff, arrived early and not a problem checking me in early, clean large rooms and gorgeous food. Would definitely stay again.", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r672169865", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Near Alicante airport.", "review": "I've been there for a one night in order to catch my flight early in the morning. Low priced but great value. Somehow quirky design on the rooms but it was very comfortable. The staff was friendly and very kind.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r671694744", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Nice place", "review": "Nice room,wonderful spa pool sauna as well.But be careful when you shower,it b as tile floors and when wet it becomes very slick.My wife fell but was not Injured I did not tell the h I tel which is something I should have done..", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r659598963", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Lovely Hotel", "review": "Lovely 4 star hotel, close to the Airport cab from Airport was 9.60€. The room, 118 was spacious, clean and twin bedded. Had a great nights sleep. Hairdryer, soaps etc provided. My only bugbear was the en-suite had no door and therefore no privacy.  But if you’re ok with that I would gladly recommend it.", "date": "February 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r653620754", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Stopover in Alicante before a walking holiday", "review": "The Areca is very close to the Alicante airport-but I did not notice the planes at all.The rooms we had were ideal, modern and clean. We arrived late but had a really nice meal in the restaurant. Breakfast the next morning was excellent -much better than the usual hotel food. We tried the spa which is compact but enjoyable. The staff could not have been better, helpful in every way. We will use this hotel again", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r648102673", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Work Stay ", "review": "Stayed here for work for 2 nights in January. Arrived at the hotel to find it was very nice with its new furnishings and nice garden areas. The check in process was quick and easy and the staff were very pleasant. I arrived at my room which was lovely, reviews said old and dated but they are better than that, they have a few imperfections but other than that they are fine. The pool area is very nice it’s indoors which is great in January and has a sauna, pool, steam room and jets. The pool is small but if you know how to operate the wave machine you can get a good swim. The breakfast is lovely traditional Spanish with cheese and ham and eggs and bacon. It’s more than fine for anyone. I really enjoyed it and apparently in the summer it’s outdoors which would be lovely... ", "date": "January 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r647105406", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Very clean hotel ", "review": "Stayed here for a night for a little break and thoroughly enjoyed our stay. Very friendly and helpful staff. Exceptionally clean throughout and a fantastic little spa.  The bar is also very nice with good staff and decent pricing.  We didn’t eat in the restaurant but wish that it had been warm enough to sit outside as the courtyard terrace looked fabulous.  Would definitely stay here again. ", "date": "January 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r643983014", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Awesome staff and nice hotel", "review": "This hotel is located in a sleepy town with the odd restaurant dotted in the street.   The hotel is just a few minutes from the airport and charge very reasonable rates.   The rooms are comfortable and well maintained.  The cleaning is perfect.   The only thing that was missing was a kettle or coffee maker in the room - shame that such a small things was the only thing I could point out.  The facilities are excellent.   The biggest benefit of this hotel is the lovely staff.   ", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r642236652", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Our first choice!", "review": "Our first choice ! Whenever using Alicante airport, this is our first choice when in either an early or late flight. Comfortable, friendly and very well located. Food and drink service, from very competent staff, good.", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r641953459", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Alicante Hotel", "review": "Last night of the touring holiday, Areca was the closest nice hotel to the airport. Very comfortable with 5€ secure parking, giving a total bill of 65€ for the night ( excluding breakfast which we had at the airport). Only minor gripe, the shuttle bus was not running Saturday, we planned on dropping the car off Friday night, not sure why it wasn’t running.", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r632857058", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great hotel, great service, good food and close to the airport", "review": "This hotel is fairly modern.  The rooms are spacious and clean. We ate in the restaurant and were very pleased with the food (ribs and seared tuna).  Wine in the bar and restaurant were also good.  A welcome when we arrived and everyone spoke English, which is a bonus.  Bar staff and restaurant staff also very efficient. The property is about two to three minutes from the airport.  They also run an airport shuttle for 9€ per room.  Free parking.  There are also good bar snacks available if you don’t want to use the restaurant. Would we stay again....absolutely!", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r632580024", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good hotel", "review": "Dear Jennie. We greatly appreciate your assessment of your recent stay at Hotel Areca. We are happy to know that you enjoyed the room, our location and our restaurant. Thank you very much for mentioning the work of the staff. We hope to have the opportunity to receive you very soon. Sincerely, Hotel Areca.", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r629720254", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Almost brilliant", "review": "Good hotel for overnight stay, staff good and friendly l, rooms clean and comfortable. Very near to the airport, great if you have an early morning flight. Was a little disappointed in the food last time, but will try again", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r623917868", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great for airport", "review": "stayed here for the night prior to going to the airport, place was beautiful, staff were excellent apart from one waiter, he tainted our stay which would have been five stars,we asked him if we could have our coffee in the lovely garden he abruptly said no, on walking back to reception the nice girl on duty asked if we were okay, after telling her what happened she sorted out coffee in the garden straight away, the waiter never said a word to us and served us coffee.On the evening we were looking forward to a fantastic meal in the restaurant, we had not made a reservation but their were plenty of unreserved tables available. We asked the waiter if we could eat here he said no in a offish manner and proceeded to ignore us.we then sat in the cafeteria next door and asked if we…", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r614638556", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Ideal for airport", "review": "Stayed for one night before our early morning flight.  On arrival very friendly receptionist who spoke fabulous English, quickly checked in and hotel facilities explained, why oh why did I forget my swimsuit as I forgot about the spa facilities! Room spacious, clean and had everything you would require. Decided to eat in the hotel restaurant outside space having their tasting menu which was plentiful and delicious, wine also great and although more expensive than in a local restaurant not stupid price for basically an airport hotel. All in all great food, staff, rooms and overall stay I will be back next time I have an early flight but will have my swimsuit!", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r606747516", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Perfect Location for the Airport", "review": "Just 3 km away - this is the perfect place to chill out after a long drive - enjoy a drink in the garden before enjoying a fantastic array of dishes on offer in the hotel restaurant - you will not be disappointed.  The hotel rooms are functional, modern and clean and all essentials have been thought of except for bottled water.  We were going to use the spa facilities, but these aren't air conditioned and extremely hot in high season but overall the facilities for a small budget hotel were surprisingly very good and I wouldn't hesitate to stay there again and recommend the hotel to others.", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r603896010", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Lovely Hotel", "review": "Beautiful rooms, very clean and comfortable. The restaurant was excellent too. We stayed for one night after landing at Alicante late in the evening. It was a lovely refreshing break after a long flight.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r603824977", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "My family staid for one night", "review": "We had very nice welcoming right after midnight.  The check in was nice and easy and we where all a sleep few minutes later.  This is a very nice hotel close to the airport and a excellent value for the money.", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r603458909", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great find!", "review": "We had a very early flight home so needed an hotel close by for one night and we chose this one based on the reviews...we are glad we did. Check-in was friendly and efficient. Our room was large and comfortable, and the air conditioning worked well (individually controlled).  The bed was two singles pushed together which was just fine...linens and pillows good. The bathroom was large and had a shower over the tub (needed a hand rail to make entrance and exit safer) there was a separate WC, with frosted glass door. There is a lovely little walled garden at the back of the hotel where we sat for drinks and then had a light dinner. The food was nicely presented and very tasty. It is a full service hotel, although we did not use any other services. There was a shuttle to the airport…", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r599836877", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent value for money, close to airport", "review": "Arrived in the evening, took 5 min from the airport. Looks dull on the outside but has been nicely refurbished inside, fresh and modern. We had a connecting room and it was nice, clean and just what we needed. Ate dinner in the restaurant which was nice, pretty setting and good value for money! Even managed a morning dip in the pool, kids liked it.", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r599095376", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Nice hotel close to the airport", "review": "It was a nice place to spend the night.  We stayed at the hotel for one night before an early morning flight. We had a tasty dinner at the hotel, and we were offered breakfast in the morning at an additional cost. ", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r597830497", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Convenient and comfortable", "review": "The hotel is well located at the edge of the town and only 5 minutes drive from the airport. It has a car park but there is plenty of free parking in the surrounding streets.  Friendly welcome on arrival and reception staff were very helpful throughout our stay. Rooms were a good size, clean and comfortable.  We checked out at 5am and I couldn’t find anyone on reception then nor any bell to call them.", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r594206196", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Fairly good place", "review": "Very convenient if you need to stay close to the airport - just 2 min driving. Very modern rooms, lobby and bar. Parking is paid (5 eur as of June 2018) but you can park on the street, just opposite the hotel for free. Perfect location to spend the night if you arrive on a late flight, and plan to travel further in the upcoming morning (like we did).", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r589548542", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Five minutes from airport", "review": "Lovely hotel right on the doorstep of Alicante airport.  Plenty car hire places within a five minute walk. Lots of little restaurants, cake shops around too. The food in the hotel is excellent. The staff here were really helpful & welcoming. Lovely place.", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r588589574", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Perfect for early flight", "review": "Dear Terru. Thank you very much for sharing your stay with Hotel Areca with the rest of the tripadvisor users. We are glad that everything was to your liking. We will be happy to see you again at our hotel. Sincerely, Hotel Areca.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r587468867", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Perfect for Airport", "review": "Great staff (specifically Benilde) at the hotel who let us leave our bags prior to our stay.   The room was lovely and very modern and spotlessly  clean, chambermaids were really friendly.  We had 201 next to lift and you could barely hear the lift and I am a light sleeper.  If you are using the pool, ask the times at check in as they have different times for seasons. I used the sun terrace too which was a little tricky to find.  There 4 sunbeds but as there must have been recent rain, could have done with a bit of a clean.  The breakfast is what you would expect but at 12€ a little expensive. It is served in a lovely little oasis garden which is lovely.  Hotel location is perfect for Airport but not for too long as nothing to do in Torrelano although there us a train station…", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r587309043", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Airport Stopover ", "review": "Dear Sandy. Thank you very much for such a nice comment and fantastic assessment. We are very proud of your opinion. Knowing that they have enjoyed their well-deserved rest, our gastronomy and the treatment of our great team is very important for us. Thank you for evaluating it so positively. Here we will be waiting for you. Sincerely, Hotel Areca.", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r586151375", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Great Hotel & Facilities", "review": "If you're looking for a holiday hotel, this is not the one. It's 20 euro from the nearest beach each one, so I would only recommend this as an airport stop over.  A lot of comments on here about the breakfast with comments too from the hotel. The breakfast is disappointing. Scrambled eggs and bacon every day and the rest is croissants and dairy, gets very tedious after the 3rd day. If there were different types of egg, sausages, hash browns etc they could mix it up a little. The dinner meals are pretty average too, spag bol is just spag bol, ribs are just ribs. Chips are a few wedges.  There is no sun at this hotel, it is all in the shade as the garden is in the middle and no swimming pool.  The rooms are basic, small TV, scratches all over the desk etc. Not the end of the…", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r585020192", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Close To Airport", "review": "Great little hotel directly looking on to the airport. Very modern inside and just off the motorway. Parking was free and underneath the hotel and the Spa facilities are great considering the reasonable low cost of the hotel. Sauna, Steam and jets in small indoor pool was great the morning before travelling. Breakfast was very good too and staff very friendly. I would stay again. The only issue is the Spa you have to take your towel from the room as there are no towels downstairs, and the whole area between the changing rooms and pool area became very wet and slippery.", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r580376000", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "good quality hotel", "review": "Dear Gareth. Thank you very much for sharing your assessment with the other tripadvisor users. We are happy to know that your stay met all your expectations and that you want to stay with us again. We will be happy to assist you. I take this opportunity to inform you that towels are available at reception for use in the spa. It is not necessary to use the one in the room. Sincerely, Hotel Areca.", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r578087275", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "An overnight stay near the Airport", "review": "We had to drop people off at Alicante Airport and pick some one up the next morning so we decided to stay over night. Friends had recommended this Hotel as a nice place to stay and convenient to the airport. We paid €69.70 which was a bit expensive for an overnighter but it had a pool and Spa so we thought it would pass the time nicely. When we got there we found a parking space right outside the door but had we wanted to park in the Hotels own parking we would have been charged €5 which i hadnt expected. When we tried to check in we were asked for our passports and as we'd driven from Mojacar we hadn't brought them This was apparently a major issue as you cannot stay in a Spanish Hotel without showing photo ID. Either a Spanish (not English) Driving licence or a Passport.  …", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r574418497", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great overnightplace for Alicante airport", "review": "The Areca hotel is conveniently situated near the road to Alicante airport and easy to find. We were warmly welcomed by reception staff and were quickly in our smart, modern and very clean room providing walk-in shower separate toilet, safe, fridge and smallish TV.   Wi-Fi was open but thought it wasn't working then realised you had to sign in from browser which is always a hassle from my laptop.   There is plenty of street parking which apparently is safe. There is also a parking garage.  There is a shuttle bus to the airport for which they charge 9€, but it wasn't working on the day we needed it.  Taxi to the airport costs 12€ during the week 14€ at weekends. A very short ride!   Not much in the \"mini bar\" fridge but they only charged 1€ for a Coke. Very fair indeed!.  There…", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r573196054", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good but very noisy elevator", "review": "Dear johnash. Thank you for taking the time to write a review about your recent stay at Hotel Areca. We are very happy to see that everything was to your liking and that you value our facilities and staff's attention so positively. We hope you keep visiting us. We will be happy to assist you again. Sincerely, Hotel Areca.", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r571343207", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "No sleep in this so called boutique hotel", "review": "We were pleasantly surprised by the look of the hotel once inside. And by the very friendly staff, both at reception and in the bar/restaurant. We had requested a quiet room and were given a room without a view (#302) but not facing the street anyway. We didn't mind the fact that we had no view. We just wanted a good night's sleep before our flight early the next morning. I'm so glad I brought earplugs because of the extremely loud and annoying noise coming from the elevator shaft. Very, very unpleasant! The room was very warm and the airconditioning wasn't on yet. When I book a hotel with airconditioning, I expect it to work, even if the locals think the weather isn't warm enough yet.  Our booking included breakfast which was very good. Another pro is their shuttle to the…", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r571223997", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Unexpectedly rather special", "review": "Dear Amoboseli. First of all thank you for the time spent in reporting your opinion about your recent stay with us. Thank your positive assessment towards the treatment of employees. Regarding the noise that we mentioned we are investigating that it could be since we have checked that from the room you can not hear the elevator engine and regarding the air conditioning please note that we have some temperatures between 24º and 12º for this reason this machine is turned off as we have complaints in both directions and it is the most appropriate thing we can do. In any case we apologize for the inconvenience you have had during your stay and we thank you for having stayed with us. We hope to have the opportunity to receive you again and try to reach your maximum satisfaction. Sincerely, Hotel Areca.", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r570111314", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "nice airport hotel, bit expensive", "review": "Spent one night between flights. Paid 82 Euros without breakfast and without shuttle to and from the airport. So all in all, a bit on the expensive side for a one night stay in the middle of nowhere.  shuttle to the hotel is 9 Euros single trip. Had a room on the first floor, just above the hotel entrance on the street side. a bit noisy in the morning with all the hotel deliveries going on.", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r569278750", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Back again!", "review": "We always stay here when we have an early flight out from Alicante airport. The rooms are clean, well furnished and comfortable and the reception staff always remember us which is quite impressive. As it was early in the season when we stayed the outdoor restaurant was closed which is a shame so we ate in the bar. The menu choice was not great but the entrecote was very good and the service was o.k. Because the hotel is clean, reasonable price and has nice staff we would always stay here before an early flight. The parking on the street is no problem. We were told (again) that coffee is available at 5 a.m. but have not been able to get this for the last few years.......even though we were told it is available! We noticed this visit that we could hear a lot of other guests…", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r563409168", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good location for the airport", "review": "We found this hotel as we had a late arrival at Alicante airport and didn’t want to drive the 2 hours to our final destination. Street parking was available in front of the hotel and its only a short drive from the airport. It’s also easy to access the A7 motorway.   The hotel is modern and very good value although the breakfast was a bit expensive for Spain.  Would stay here again.", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r558808946", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great place to stay for early flight.", "review": "The hotel is modern and fresh. The room was clean and quiet. Staff was friendly and helpfull. The Food was not so great and the indoor pool was a bit small. Lovely backyard. We only had a one night stay, because of a early flight the next day. The hotel was Perfect for this.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r556806740", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Best place to stay for Alicante Airport departures!", "review": "a friendly and decent quality hotel - clean and tidy rooms with everything you need for an overnight stay - though could really do with tea/coffee making facilities, but you can get coffee in the cafe by reception most of the time. Hotel offers smoking rooms too which will please some people. You can park outside the hotel at no charge but it is on street parking - not sure about leaving the car for longer than one or two nights. Loved the fact that the hotel is in a small town so somewhere for you to walk around with lots of bars and restaurants - though the hotel restaurant is good too!", "date": "December 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r555144220", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent ", "review": "Stayed for 3 nights. Great hotel, all of the staff were really friendly, rooms and public areas spotlessly clean and very comfortable. Bar and restaurant reasonably priced and the food is excellent. Very popular with the locals aswell.  Would highly recommend this hotel. ", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r554244312", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Overnight stay for early flight", "review": "Dear Mandy. Thank you for sharing your opinion with the other Tripadvisor users. We are very happy to know that you enjoyed a perfect stay. Thank you for trusting in our service and we hope to welcome you again very soon. Regards, Hotel Areca.", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r553224548", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Holiday", "review": "Perfect location for airport and good standard hotel with friendly staff. Beds comfy and room clean and decent size. Torrellano itself was really quiet on a Sunday night but found the Irish bar and a lovely restaurant so made the stay even better. Had a drink at hotel bar which was reasonably priced. Lovely garden area which would be stunning in the warmer months. Could have sat out but a wee bit chilly, possible patio heaters would have made it comfortable. Would stay here again when flying early as it’s easy to find and less than 5 minutes from airport. ", "date": "December 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r552524946", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Bra läge för en övernattning inför tidigt flyg", "review": "Estimado cliente. Muchas gracias por compartir su opinión acerca de su estancia con nosotros. Nos alegramos mucho de leer sus buenos comentarios acerca de nuestras habitaciones, ubicación, restaurante y personal. En cuanto a las estufas por favor no dude es comentárselo a algún empleado del hotel para que las encendamos. Esperamos volver a verle. Atentamente, Hotel Areca. ", "date": "December 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r551230613", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Fab Hotel", "review": "Great hotel and friendly staff. Easier and cheaper to get to airport from city though, so partly defeated our purpose of airport hotel.  Managed to get an upgrade to suite for a minimal charge which was nice.", "date": "December 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r550746556", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "One night stay", "review": "Stayed for one night before flight from ALC back to London. Very friendly, helpful front desk staff. Nice, very clean & spacious room. Enjoyed Lunch, Dinner & Breakfast in the restaurant which was reasonably priced. Used their shuttle to the airport which was very reasonably priced at 9 euros. Will definitely stay again if in need for early flight.", "date": "December 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r547194760", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Unimpressed", "review": "Dear customer. Thank you very much for sharing such an excellent comment about your stay. We are happy to know that the room and the treatment of our staff was to your liking. Our goal is to try to improve day after day to offer the best service to our customers. We hope to see you again soon. Sincerely, Hotel Areca.", "date": "November 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r542426687", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Overnight after flight", "review": "We stayed here for 7 nights in November and were quite disappointed with our stay although it was very reasonably priced we would never class this as a 4* hotel. Coming from the UK where we stay in 4* hotels regularly and the standards are very high. A few negatives: - we booked a king size bed room and on the first night arrived to a twin room and were then offered a queen size bed room the next day for the rest of our stay. So we did not get what we had paid for. - the room was clean and basic but there was definite lack of complimentary facilities. Only shampoo and body wash. No coffee, tea, water etc or nothing. If you wanted something you had to pay for it. - Breakfast was very basic the only food on offer that someone has actually cooked was eggs and bacon everything else…", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r538293252", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Over night stop", "review": "Dear Customer. First of all thank you for the time you have spent giving us your comment on tripadvisor. We regret that the stay has not been to your liking. Inform you that the selection of bed type is always low availability. As the day of your arrival there was no proposal to make the change the next day, I do not know if you requested it or they offered it to you from reception. Regarding the free products, explain that they really are the amenities and if you want another product logically they are under payment. Tea set € 5 per room, room service (€ 3 supplement), laundry, ironing, etc etc ... All these services are extra and carry a supplement. With regard to breakfast every day there are enough products to avoid being repetitive. 3 different types of pastries are offered, 3 of cheeses, 4 types of bread, 5 types of sausages, 4 types of cut fruit and 3 in complete pieces, scrambled eggs and beacon, 3 types of juices, 3 of milk, etc etc ... We will review the products that are offered for our clients that stay a week. In any case if you are staying with us we will be happy to make you a special breakfast to avoid this inconvenience. Our SPA is right which is small but has a 6x3 heated pool, Turkish bath and sauna plus changing rooms. The access is totally free for all our clients and we have just made a reform where, among other things, the entire floor has been changed. Once again we are sorry to read your review and we hope to have a new opportunity in the future to welcome you back. Sincerely, Hotel Areca.", "date": "November 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r538131559", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Good airport hotel", "review": "We always use this hotel and the standard is always consistently good.  €11 is the taxi fare from Alicante airport at night and the shuttle bus to the airport costs €8 for 2 people.  We used the cafeteria for coffee and croissants at breakfast which was excellent and very reasonably priced.  Evening meals in the cafeteria also looked good.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r535726399", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good hotel for airport stayW", "review": "We booked here as it was close to airport for our early morning flight. Room was small but functional and we got check in earlier than the late time of 4pm they advertise, so that was a bonus. Very clean and comfortable and wifi access in room was excellent. Only problem we found was the shower, ended up with the floor and bath mat soaking due to the bad design of shower. Also no tea or coffee making in room, not even a complimentary bottle of water which would have been a nice touch, but staff at reception very friendly and we booked the airport shuttle next morning which was cheaper than the taxi at E9 and very efficient. Great choice for eating out within 2 to 5 minutes walk from hotel.", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r531493123", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "2 day stay", "review": "Room comfortable and reasonably quiet although movement of furniture did keep me awake with the early or late comings and goings.  Found beds rather hard for me. Our shower did not have a full door so it was rather chilly - found this rather odd. Missed the use of tea/coffee making facilities although now see there is a room option now to include such...at a price!  Ate at hotel for evening meals - enjoyed the experience and food was tasty. Unlike some guests, found the breakfast gave a plentiful choice and had no complaints. We made a mistake and boarded the wrong train to Alicante after purchasing our ticket at the station via a machine.  No attendant for any advice and no other travellers to ask either. In error we boarded the inter-city train and the ticket inspector charged…", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r531076478", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Short stay after flight", "review": "Dear Awjlove. First of all thank you for the time spent in sharing your assessment about your stay. In all our rooms there is no door for the washbasin (if for the toilet area) since the original design was to make more spacious and comfortable rooms, we regret that it is not to your liking. Regarding the tea set, I commented that its service has been modified, being included in all our executive and junior suite rooms and in the rest of the rooms it has a supplement of € 5. You only have to ask our reception staff to leave it in your room. I apologize if you were awakened by the noise of the furniture but we do not know what could be due as our cleaning staff starts at 10am and during the days of your stay there were no works at the hotel, it could be something from abroad. In any case let us know as soon as possible to give you some solution since the comfort and satisfaction of our customers is our priority. Sincerely, Hotel Areca.", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r530311842", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Free upgrade but noisy", "review": "The hotel was clean, tidy, pleasant with a spacious and quiet room.  It was very close to the airport and the taxi was only 12 euro.  We had a late flight and chose this rather than travel late in the night.  The reception service was good and the breakfast was very good.  Lara cars delivered the car to the hotel which made our start to the day easy. Lara cars are recommended and good value, except that they fill the petrol tank which you pay and need to return it empty :-(", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r530107489", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Comfortable and convenient", "review": "Dear Guest. Thank you for your excellent rating and comment on your experience in our Hotel. We are happy to know that we meet your expectations and find you in the best conditions. We hope to see you soon. Regards. Hotel Areca.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r528563096", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely Hotel Near The Airport!!", "review": "We stayed here for 1 night following a late flight into Alicante before making our way the following day to another hotel for a wedding in Elche. We arrived at midnight and were checked in by a friendly guy at reception.  Our room was lovely. Very spacious and modern. The bed was huge and very comfy. There was a jacuzzi bath in our bathroom and a separate shower. Not the most powerful jacuzzi bath I have ever been in but it was ok. Robes and slippers also there for use.  The following morning we had breakfast. Breakfast was ok. Not a massive amount of choice but fine for what we needed.   The outdoor terraced area was closed while we were there for maintenance work but it looked beautiful and would have been lovely to sit out there.   We were hoping to use the spa that morning…", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r526272803", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Stop over on way to airport ", "review": "Arrived Friday lunchtime surprised that room was ready. Room very adequate for the one night. Missing tea and coffee facility which would have been handy. As with other reviews the menu was very limited I had the bolognaise which was grim and certainly not worth the money. Bread put on table without us asking and they charged for that too. I would use again if I had early flight. Taxi to airport at 5.30am cost nearly 15 Euro wow!  Spa area very small and steam room stunk! Also around pool wooden slats with holes causing severe trip hazard. ", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r525079213", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "A lovely hotel to stay near airport ", "review": "Dear Guest. First of all I would like to express our gratitude for making you aware of your experience at Hotel Areca. Your comments are our main tool to improve day by day and exceed the expectations of our customers. I regret the inconveniences that you have experienced during your stay, we will work on them so they will not be repeated. For this winter we have planned the remodeling of the SPA area. Remind you that our transfer service to the airport costs € 9 per room and public taxi € 13 approx. We hope to see you soon. Best regards.", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r523783962", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Airport Hotel", "review": "We stay here when we have an early flight. We arrived feeling stressed from work. Had a lovely soak in the jacuzzi bath and rest. Eat in the garden which is very pretty and relaxing. A lovely meal and restful night ready for flight in morning. ", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r522908221", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Convenient for the Airport and 1st class", "review": "Dear Guest. Thank you very much for your excellent comment. We are happy to know that you had a pleasant evening and that we met our goal. Satisfied customers. We hope to see you soon. Regards.", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r520552127", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good hotel, close to airport (no shuttle) bit noisy (2nd floor)", "review": "Went here for a quick stopover arrived late. Nice reception rooms decent of size, free Wi-Fi and a good/average breakfast. Special note to the Nespresso Coffee machine (professional) for use with the breakfast. Pricing is good and worth it. Had a room next to the elevator and early in the morning it was quite noisy unfortunately. No shuttle service but Taxi.", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r518006956", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Easy to find and good parking", "review": "Flying out of Alicante airport, this was an excellent choice.  We parked the car in their underground carpark - first night free and then €5 per night for each night we were away.  The shuttle took us to the airport early in the morning and we had prepaid €9 for this for two of us.  For some reason they would not pick us up again from the airport so we had to get a taxi, which was quite a bit more.  On reflection maybe if we had been staying a night on our return they would have picked us up, but we didn't think to ask why at the time.   We took a look at the spa but the heat hit us as we opened the door and we made a hasty retreat!  Much too hot in August.   Had a wander around the locality, which had several bars and cafés but decided to go back to the outdoor area of the…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r517429342", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Overnight stay ", "review": "Our family stayed 6 nights in Valencia and travelled here for 1 night before flying early from Alicante airport. Beautiful hotel with clean, spacious rooms. Lovely garden area where we enjoyed a delicious evening meal. Unable to comment on breakfast as we left too early. Staff were very pleasant and helpful. We were impressed by all that we saw during our brief visit, so much so that we wished we'd spent 4 nights in Valencia and 3 nights here. ", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r515653384", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Airport overnight stay", "review": "At the beginning of August 2017 my family and myself stayed overnight at the Areca Hotel when we arrived very late at Alicante airport.  The ease of finding the hotel was so simple we could not have been more delighted, as we had had a long day traveling.  On arrival at the hotel the reception staff were very helpful and directed us immediately to the underground secure parking.  We were checked in within a few minutes and went to our rooms.  The rooms were an excellent size and a very generously sized bathroom in each room.  The rooms were spotlessly clean and the air conditioning worked superbly.  Plenty of towels and toiletries available in the room.  We all had a very comfortable sleep which we were most grateful for.  The breakfast was wonderful a very good variety of…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r513749931", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Convenient", "review": "Dear Rosina. Many thanks for sharing your excellent opinion of our hotel on Trip Advisor, it was a great pleasure to have you among us. We are happy that you have enjoyed our facilities and we are honored that you have been so comfortable at Hotel Areca. We remain at your disposal and waiting to greet you again. Receive a warm greeting, from the whole team.", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r512820151", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Terrific hotel", "review": "Stayed one night prior to an early morning flight and what a treat it was. Lovely calm attentive staff with breakfast served in the garden. Lovely spa facilities only downside was pool was indoors. Will be back", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r504188104", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Overnight stay Dropping family at airport", "review": "Dear Guest.Thank you so much for your time for such an excellent comment. We are very excited to know that we will see you again. Best regards.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r501276352", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Comfortable overnighter with good restaurant for dinner", "review": "We have used this hotel several times. It is convenient for the airport, it is a lovely modern hotel with excellent facilities.  We had a larger room this time with tea making facilities which was very useful", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r500273789", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great for an airport hotel", "review": "Dear Gi. Thank you for your time in evaluating your stay at Hotel Areca. We are very happy that you have us as a reference and hope to see you soon again. Regards.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r495781303", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great for the airport!", "review": "Chosen for its proximity to Alicante airport, we were delighted with the accommodation (suite) and the package offered by the hotel which included dinner. A bottle of Cava was delivered to our room shortly after our arrival, and with the car safely parked in their underground garage we were safe to indulge. With dinner came another couple of free drinks of our choice. A love Spanish starters because they are so imaginative and unusual, and these did not disappoint. However the main course excelled all my expectations because of its delicacy and taste. Two salmon fillets in triangles in a type of terryiaki sauce was perfect. There's a chef in this restaurant who can cook! The dining room is set looking out at a beautiful garden with tall trees - banana, yucca and palm trees which…", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r495707461", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Airport convenience", "review": "Ideal for a late arrival/early flight to/from Alicante airport. A 3 minute taxi ride away (10-15 euros depending on the time of day). Situated on the edge of the small town, the hotel is modern, clean and quiet. Some of the fittings are not of the highest quality, but this does not detract from its generally high standards. Some of the staff seemed uncomfortable speaking anything but Castillian.  The restaurant in the garden at the rear (Caribi) was an eye opener - stunningly good food in a quiet and pleasant location.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r495405807", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great hotel and restaurant ", "review": "We only stayed one night as a stopover for Alicante airport, but what a find! Modern, spotlessly clean and very friendly. Had dinner in the tropical garden which was beautiful and had a fantastic menu. We had the tasting menu and it was delicious and excellent value for money, highly recommended. ", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r494861033", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Hotel for a night", "review": "The Hotel Areca is great for an overnight stay before a flight. Its clean and tidy and the staff are very very welcoming. We ate there too and the degustation many is large and reasonably priced and pretty good quality to boot! The town of Torrellano is actually wee gem if you walk around it with a couple of very good Spanish restaurants with very good food. Only downside was the spa.....not top notch and needs a wee bit of tender loving care to bring it up to scratch. Overall still good for the money you pay and the people are lovely.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r494011193", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "OK plus hotel close to Alicante airport", "review": "Spent two days at Areca Hotel on business. Can't say much about the neighborhood, but the hotel is nice. Rooms are clean and fresh, staff friendly, breakfast and lunch have limited options but tasty and good quality. 10 minutes by taxi from the airport.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r492724065", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Stopover ", "review": "On organising my route from a 4 night stag do in Benidorm, I found this place. Within a 5 minute taxi to the airport and a nice air conditioned room. Staff really friendly I arrived on 3 hours sleep at 9.30am and they kindly found me a room!  Facilities were ok it was nice to relax in the pool but nothing impressive. Very average if you are looking for an actual spa hotel however at the price it's worth 4 stars for what you get", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r490618922", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Another excellent visit to the Areca", "review": "Yet again we chose Areca for our winter visit to family in nearby El Altet. Delightful room. Helpful, friendly staff. Last time we stayed (February 2016) we went out for breakfast each morning to try some local cafes. This time we ate at the hotel. For €9 each we had an excellent choice of cereals, meats, cheeses, pastries, breads and hot and cold drinks. Service was excellent and the coffee among the best I've tasted! Later in our stay we sat in the bar for a drink with friends who had a toddler in tow. The little one is a busy little lad but the staff chatted to him as he trotted around and made us all feel welcome.  Looking forward to maybe another visit in January 2018", "date": "January 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r489638356", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "An overnight visit on way back to UK", "review": "My room was very pleasant and clean and comfortable.  The staff were friendly. The weather was appalling - it was the night of the big storm 13th March 2017. My meal in the restaurant was served by the chef and the waiter and nothing was too much trouble and the lamb shank I was served was well cooked, beautifuly presented and the staff were very kind and helpful. Although I did not have time to use it, the indoor health suite looked very inviting and I would definitely stay there again perhaps for more than one night to enjoy the ambience and the relaxing nature of the beautifully staffed and run hotel.. The hotel runs a shuttle to and from the airport at reasonable hours but taxis out of hours will charge 10 euros for a fare.", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r489015601", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Convenient to Alicante airport", "review": "While this hotel is not on airport complex it is an easy to find short drive from the terminal Room spacious and comfortable Staff friendly and welcoming Areca is a modern contemporary hotel so nothing Spanish about it but if you're looking for a bed after a flight it's perfect and it's reasonable I paid 61 euros", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r487270850", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Cosy, antique hotel with reasonable price", "review": "Gorgeous hotel in George Town. If you find cosy, antique and luxury hotel, you must stay here. You can enjoy a snug but fully equipped convenient room with antique furnitures and continental styled breakfast in a calm and beautiful restaurant placed at the end of the pretty corridor.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r483318613", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Ideal for airport", "review": "modern hotel, has some underground parking but we parked on the road. About 5 minute drive to the airport. Room was nice, clean and modern. I have no complaints and would stay here again. Checked in late due to delayed flight but no problem", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r479219414", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good stop over hotel", "review": "Arrived late at night, a few minutes taxi drive from the airport.  Reception efficient, room comfortable, breakfast good. Nice little garden area with bar facilities. Price was good - under 100 euro B&B If u need a hotel stop over for the airport this will do the job very well.", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r477888953", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A delightful surprise", "review": "We ve been there just for one day. It s been a surprise for us. Excellent facilities, relaxing spa and nice terrace with good service and food.  Ready to help and nice staff. Couldn't ask for more at this price!!  ", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r476219910", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Ideal location", "review": "Arriving in the early evening this was a very convenient place as a stop over - just a 12 euro taxi ride from Alicante airport when arriving in the early evening. Staff were very welcoming and attentive.  The restaurant is very good and eating outside in the sheltered garden was a delight.  The indoor pool provided an inviting interlude and for those feeling energetic, there is a small but well equipped gym!  The hotel was very good value and an ideal base to tour the area and visit the many attractions nearby.", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r474488476", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "First visit & we have a great time", "review": "First visit. The hotel is very clean with very friendly staff. Fantastic service, impeccable housekeeping.  The buffet breakfast is very good with a wide selection of food & drinks and worth the money, though the dinner is expensive. Good location to the airport, restaurants, bars, shops & many sight seeing places.  We have enjoyed staying there, for me 5 nights & for my guests 6 nights. The children love the swimming pool though they commented that the pool is too small, should be able to swim in it but we have enjoyed it & the sauna. There is ample car parking space outside the hotel. Will definitely come back if we need to.", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r474380159", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Second visit ", "review": "The hotel has a cool vibe and great garden for cocktails in the summer. Rooms are modern and clean with super comfy beds. Staff are friendly and courteous and happy to recommend local restaurants if you want to step out of the hotel.   The buffet breakfast is extensive and has everything you could wish for.   The hotel also has a spa which I have not experienced yet, maybe next time ", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r465065825", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great Place To Stay After a Long Flight", "review": "We arrived at the hotel after traveling for 25 hours. Our room was ready and very comfortable. We had a light dinner in the cafe and settled in for a much needed rest. The staff in both the restaurant and hotel were great. They knew we were tired and when out of their way to make our stay comfortable. Breakfast the next morning was fresh, plentiful and varied. We returned to the hotel for two nights a month later. Once again our room was ready, very clean and quiet. We took the train into Alicante the next day for a final visit to this beautiful city. The train stop is a five minute walk from the hotel. We returned to the hotel after a day of touring and once again had a meal in the cafe. The following morning our taxi to the airport was waiting for us at 5:45 am.  This is a…", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r465004818", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Stop over", "review": "Excellent hotel clean very friendly staff Good location to Alicante airport 11 euro taxi fare  would stop here again for early morning flight lots of good places to eat and drink in local town close to hotel ", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r464347933", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Convenient, by longshot Best hotel in the area", "review": "I have gait/walking challenges (stroke); accom. has to be convenient to shopping and/or sights. Perfect location close to the airport, base for sightseeing. August fiesta time was superb; wow-ed by stunning festivities Elche; also Alicante, Santa Pola. Best hotel in the area by a longshot. Didn't spend a lot of time at the hotel, but ambience was great, modern, good facilities.  Good food options are closeby, great parking - free.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r462356646", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent stay booked another on check out", "review": "Stayed at Areca straight off a late evenng flight from the UK. Very near to the airport and fancied a good night's sleep before heading to the airport to pick up a hire car.  Very friendly staff at check in. Room was very clean and comfortable.  Had a light meal in the bar - very good service from waiter Pedro.  Great sleep and the breakfast was very good too.  In fact we liked it so much that we booked another night there at the end of our holiday.  Excellent value for money and very friendly and attentive staff. A gem of a hotel.", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r460993499", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Valentine treat", "review": "Dear Guest. We thank you for your excellent comment about our hotel as the opinions of our guests are very important to us. We are glad to know that we exceeded your expectations and that you repeat night with us. We hope to see you again. Thank you so much for everything. Sincerely,", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r460938551", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Perfect stay", "review": "Stayed for a night because of the near to the airport. Good parking outside, top team at the reception. Checkin was quickly done. Got a room , spacious and spotless clean. Well equipped, good maintained. Water pressure good, temperatures were good. Bed was super comfy, good range of tv channels, a lots of power plugs. Strong and complementary wifi. Perfect breakfast. No noises from the airport. Around the hotel good range of restaurants  Recommended place to be", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r457991363", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Excellent", "review": " Dear MArco. Many thanks for your detailed comment about your stay at Hotel Areca. We are pleased that our clients value so positively all the services and facilities that we offer and have enjoyed all of them. Thank you very much for your recommendation and we hope to see you again. Best regards.", "date": "January 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r457598953", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Unexpected, but excellent, stay", "review": "I was really very impressed with this charming hotel.  We had a particularly warm welcome from reception when we arrived.  The two girls couldn't have been more helpful or charming and spoke excellent English.  We had asked for a double bedded room and as they only had twins we were upgraded to a junior suite, which was extremely comfortable.    We chose to eat in the hotel restaurant and had the degustation menu, which was extremely reasonable and included a bottle of wine.  The food was delicious, well presented and served by attentive, professional staff.  The hotel itself is attractively designed and is located very close to the airport.  We will definitely be staying at this hotel again as we were so very very impressed with its high standard, comfort and superb food.", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r448860756", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very Nice Hotel and Restaurant", "review": "We had an unexpected stay at this hotel on 30th December after our flight was cancelled.  Swissport/Flybe told us that they’d be putting us into a hotel for the night.   It was nearly 9pm when a coach full of us were dropped at the door and I did wonder what kind of chaos we would find all trying to get in at once.  But I cannot find fault with the way we were looked after by the staff.  The receptionist had us checked in very quickly and not long after that we sat having dinner.  And it was really nice.  The rooms were all ok – the bathroom and door situation that you read about in other reviews was a bit weird, but when you were as tired and grateful as we were to have a bed, you can look past it.  The bed was very comfortable.  No real noise from inside or outside of the…", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r447520949", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great hotel", "review": "Stayed one night at the Areca before a flight out of Alicante to Madrid. The room was spacious, clean and modern. The bed was a little firm for my taste yet I slept well. The shower did not have a privacy door between it and the room and the shower stall had a 3/4 clear glass door. The shower also did not have a shelf for toiletries yet I was able to place such on the shower fixture. We had the Pollo Club Sandwhich with Huevo and fires and it was fantastic! Shuttle from the hotel to airport runs every 30 minutes and costs 9 euros per room. Overall an excellent stay and good value.", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r445770559", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good for a night stay", "review": "The hotel is close to the airport and thus very handy when we had a late flight.  The rooms were large and tidy with a good bathroom (some bathrooms didn't have doors). Our room had a lingering smell of cigarettes, but as we were tired it didn't make much difference.  Room service was good and to a fair standard.  Parking was a little tight but secure and easy to find. ", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r442537535", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Nice hotel near Alicante airport at a reasonable price", "review": "The English-speaking staff that met me at reception were quick to answer my questions and get me my key, which meant I was installed in record time, arranging a five-o-clock taxi to the airport at the same time.  I dropped my things off and went to say goodbye to the people that had dropped me off.  Walking back up to the hotel, I noticed a guy smoking from the room window next mine (what was he thinking?) and dread descended. I needn't have worried as there was no trace of smoke in my room.  The room itself was a business room and relatively large; the decor was modern and pleasant. The bathroom was a strange affair as the shower was open plan into the bedroom. As I was travelling alone, this wasn't a problem, but it might have been if you're self conscious. This also made the…", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r442446725", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Perfect for airport sleepover", "review": "This hotel really is close to the airport-just a few minutes drive away. We expected something basic ,but were pleasantly surprized . Its smart and stylish with a good restaurant with good food and service,The gardens looked an inviting place for Summer dining. We parked just outside by the roadside. Our room was large and airy with an opening window and extra large comfy bed. Stylish bathroom area with hot shower. The basin is in full view from the bed and yes the loo has a frosted glass door with no soundproofing.Must have seemed a good idea on the drawing board, but its not what people want! Joy of joys there was a KETTLE  -so unusual in Spain,so well done there.I would take your own longlife milk.Tv was better than normal with international news.", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r438871279", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent Value for Money", "review": "My husband and I recently spent a night at the Areca Hotel, Elche having arrived into Alicante airport late at night.  We were greeted by a very friendly and professional gentlemen at reception and were in our room within minutes.  Our room was spotlessly clean and modern.  Our bed extremely comfortable and the bathroom was equally clean with an excellent shower (no bath).  We slept well and next morning headed down to the dining room for breakfast.  Breakfast is self service with a very large choice of meats/breads/cheeses/pastries plenty to start the day.  On leaving we were bade farewell and we on our way.  We paid 55 euro for both of us overnight including breakfast.  I can honestly said staying at the Areca Hotel was probably the best value for money we have experienced in…", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r436575248", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Areca hotel", "review": "Regular user, good location, good accommodation, good food at reasonable price. Torrellano is a nice small town with lots of restaurants/bars...it is only 3 minutes transit time to the airport. Thoroughly recommend.", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r435968587", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Superb value minutes from the Airport", "review": "Arriving at Alicante airport late in the evening we needed a local hotel. This one was fantastic value super clean, very friendly staff and good sized well equipped rooms. Nice outside eating area. front desk arranged our hire car no fuss and very efficient.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r432629668", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Convenient for airport ", "review": "Excellent location for airport so good if you have an early morning flight.  Helpful receptionist. Nice, clean room. Good restaurant. Good spa with small pool and sauna. Not much to do locally. Car parking. Paid €5 extra for tea making facilities.  Would recommend ", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r432582540", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Fab for a short stay.", "review": "Great for a short stay. Really clean and tidy, polite staff. Very close to the hotel. Not much around the hotel itself. The odd restaurant, takeout and a shop. Bus stop right outside to pop into town. Lovely outside area. ", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r428554747", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Stopover", "review": "Dear Guest.  Thank you for your comment and rate on tripadvisor.  We hope to see you again.  Sincerely,", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r427943948", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Nice Hotel", "review": "Early flight out of Alicante so needed somewhere close to airport. Can't complain at all.  Well appointed rooms, quiet, friendly and attentive staff..managed to squeeze in a visit to the Spa! Restaurant quite upmarket but food pretty good and well priced.  Outdoors cafe/garden restaurant very tranquil and spacious.  For the price we paid this hotel is excellent value and we woukd definitely book again.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r427645894", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Overnight stay", "review": "Very nice hotel..close to the airport..nice buffet breakfast..friendly and helpful staff. Rooms are modern, clean and nicely furnished. There's a nice little restaurant on the premises and has a nice lobby area with plenty of seating if you don't wish to sit in your room.  Only complaint would be that the mattresses are not the best I the world and if I had to stay more than a couple of nights it could be a problem.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r427619424", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Overnight stay", "review": "We chose this hotel to stay in overnight as we were catching an early flight home after a weeks holiday in Calpe. It is clean, and the have a good selection for breakfast. The staff are friendly too. It is conveniently close to the airport for catching an early flight I highly recommend this hotel and the price is very reasonable.", "date": "January 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r422667049", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Four star hotel without the use of restaurant and bar??", "review": "Dear Customer.  Thank you very much for your comment on Tripadvisor about our Hotel Areca.  We are glad that we have covered your expectations and enjoy your stay with us despite being the last day of vacation.  For your next visit we recommend you visit our restaurant.  We hope to see you soon.  Sincerely,", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r417544806", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Value for money in Torrellano", "review": "We returned to this hotel on Saturday after our visit last year was such a success. We'd loved the restaurant and wanted to sample it again. However, this year we were disappointed to be told that the restaurant and bar could not be used because of a wedding. It is my understanding that a four star hotel should provide these facilities. We had not been warned before we arrived that this would be the case so we were very disappointed. An excellent hotel which we would have rated five star if a bar and restaurant were available. ", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r406690135", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "An excellent hotel", "review": "Dear Customer.  We regret not been able to enjoy his last visit in our restaurant Carabí.  As we said we had a wedding that night which occupied spaces available.  We expect and hope to see you again at our hotel and to taste our new restaurant menu.  Sorry for the inconvenience that we have caused.  Sincerely,", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r403971122", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Last night stay before flying home", "review": "My wife booked this hotel for the last night of our 2-week holiday.  We were staying in Javea (about a 90 minute drive north from Alicante) but because our return flight was at 8 am we decided to book a hotel near to the airport for our last night to avoid a long drive in the dark which we would have to have undertaken c 2.30 am.  The hotel is conveniently located just a five-minute drive from the airport.  It is 4-star, tastefully furnished in a modern design, rooms very comfortable, and the most delightful courtyard garden were we had one of the tasiest meals of our whole trip and at a very reasonable price.  Staff were without exception extremely friendly and helpful, and we would definitely stay there again.  Our two children (aged 16 and 13) were suitably impressed and we…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r403531218", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Close to the airport", "review": "Dear Paul.  Thank you very much for record their stay with us, we are glad that you enjoyed your last day of travel.  We work so that all our customers enjoy in our hotel and our restaurant in which we have great enthusiasm.  Thank you for choosing us and we hope to see you on your next trip to Spain.  Best Regards,", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r403520883", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Ideal location for Alicante airport", "review": "We stayed here for one night between for flights.  Check in was a little laboured as the people in front of us appeared to have some issue which involved the receptionist at one point speaking on two telephones as well as to these people.  The room we had was clean but basic, however it could do with a door on the bathroom and in order to fill the bath my son had to walk up the edges of the bath to get to the taps as there was a rather large wall in the way - maybe best to stick to a shower!    Breakfast was good and they arranged transport back to the airport for 9 Euro.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r400966061", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Very convenient for Alicante airport", "review": "Dear Paul.  Thank you very much for letting us a comment, help us to improve and try to make our customers enjoy in our hotel.  We regret the delay in the check-in caused by a problem in another client.  Tell that we are aware of the problems of the bathroom doors and we expected an improvement on this issue.  Except hope these details have been enjoying our excellent restaurant Mediterraneo, Spa and Gym of our Hotel.  We hope to see you soon.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r396057426", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Great Airport Hotel", "review": "I just stayed one night so I could get to Alicante airport in the morning. My hotel room was lovely and clean and I got some food brought to my room which was lovely. I paid €9 to get the shuttle bus to the airport, which is only a couple of minutes away.", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r392429042", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Unexpected gem!", "review": "We booked a last minute room at Areca Hotel, and it was fantastic. We had an excellent dinner at the hotel's restaurant, and the rooms are very nice and modern. The restaurant was unexpectedly fine dining in a casual outdoor setting, very reasonably priced too. Hotel is very close to the airport as well, would definitely recommend! ", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r388257957", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Good for an early flight at the airport", "review": "We stayed here the night before a 6am flight from Alicante airport , the hotel was very efficient and clean and the bed extremely comfortable , the hotel booked us a 4am taxi which was there 5 mins early and our trip to the airport was less than 5minutes! So it doesn't get any more convenient. There are a few bars and cafes within a 5 minute walk from the hotel and we had some excellent and very inexpensive tapas I would highly recommend if you need to be close to the airport for an early flight.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r386992972", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "nice hotel", "review": "fresh breakfast and nice water circuit, just one thing that I have to say maybe is not the hotel but I get the reservation from internet and they sale the reservation including the taxi ( to the airport ) but wasn't like that, I payed 9euros extra, so be careful ! ", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r386173334", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "A one night stopover.", "review": "I stayed here for one night as I had an early flight from Alicante airport the following morning and it was convenient.  The reviews looked good also.  I found the staff very helpful and courteous and the hotel overall was very nice and well located.  I was disappointed in my room however.  It smelt of stale cigarettes and it certainly wasn't a room with a view!  My window faced on to a wall so I just kept the curtains closed.  The bed was comfortable and the room was clean, although I did spot some hair in the shower tray.  Finally, there were noisy people in the next room who kept banging their door throughout the night and speaking very loudly which disturbed my sleep. Overall my experience was good though and for convenience I would stay again.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r382479690", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "First Class. What a find!", "review": "We stayed here after driving down from Ontinyent to get an early morning flight. Check in was fast and fuss free ( Booked through Booking.com) and very professional. We wandered along into town for a few beers and to look for somewhere to eat but I had already spotted the lovely garden dining area at the hotel so we wandered back to the hotel to check out the menu. Staff were helpful and friendly and said we could dine later or have a snack in the cafe if we needed food there and then but we decided to dine in the garden restaurant which opens at 7:30 on Fridays and weekends. In a beautiful setting with soft music and the sound of a fountain as a backdrop, we chose from the interesting menu and enjoyed the surroundings while having an aperitif. We had a three course meal with a…", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r381909098", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Airport hotel", "review": "Arrived late from the airport. Staff were very helpful and food was available in the bar at a reasonable price. Room was comfortable and breakfast good. Parking was on the road outside. Rooms were 'family' though my friend and I had a room each No tea making facilities in rooms", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r380950554", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Don't miss out on Fabulous Accommodation", "review": "We only stopped for a night after a late flight in from Ireland, What a treat, A warm welcome at reception, a lovely room. Had a very pleasant bottle of wine, with olives, in the lovely garden courtyard. The restaurant was open until 11:00pm, but we were not hungry so we didn't try it out. In the morning we were anxious to get back home to our dogs, so again cannot comment on the quality of the food", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r380229647", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Close to the airport", "review": "This hotel is very close to the airport , so very convenient for my overnight stay before my morning flight. The reception staff were very polite and helpful. As I was travelling alone I wanted to eat in the restaurant, though the whole experience was not good. They had a function on for most of the day so the hotel guests were pretty much ignored. Dinner was served up very late and the quality of food was not brilliant. The waiter seemed to find it inconvenient to have to serve hotel guests and would throw things down onto the table... Not very friendly at all. The room was clean, quiet and comfortable, so no complaints there. Would I stay again? Probably not. ", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r379444917", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Great hotel!", "review": "Really pleasant suprise!!! A very good hotel in a very small town. Book this hotel because it was close to the airport.... Ir was so perfect and service friendly......and  The restaurang was good! Thanks", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r376948405", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Another visit: Food not great!", "review": "Stay here as it is so close to the airport, good value and friendly staff who speak English very well. Room was, as always clean and comfortable. Decided to have a drink before dinner (we normally stay away from hotel bars and take our own!) Was reminded why we do this......asked for a couple of double gins with fresh orange. Bar tender took a while to understand this, giving us 2 glasses of awful 'from concentrate' orange before understanding that we also wanted gin, took a couple of requests before we actually got what we wanted and was then presented with a bill for 19 euros!!!! Having had many gin & oranges in Spain this is definitely the most by at least double we have ever been charged. Disappointed to find that the outside dining area was not open (due to weather! It was…", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r376264202", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Have used this hotel many times", "review": "I am currently on my year abroad, and as there is no direct flights from Valencia to Glasgow, therefore it's easier to travel to Alicante and catch a direct flight. I have used this hotel many times, as it is fairly cheap. The breakfast is branded stuff and therefore the quality is slightly better.  When my parents were booked in, and I reserved a room almost 4 months later, they gladly found us two rooms together.  All the staff speak good English and are willing to help. On one occasion with my mum, I had asked for \"normal tea\" and they were more than accommodating for us, even if we did get some strange looks pouring milk into tea.  Only downside is different receptionists have told me different things about the minibus. For example, one told me it started at 9 and another…", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r373633969", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Areca Hotel is a comfortable hotel very close to Alacante airport", "review": "Dear guests,  thank you very much for your comments.  With regards to the information about the bus, we have now informed all the staff about the correct times to get the bus. Sorry for the confusion we might have caused.  We are very happy that you continue trusting on us during all these years, and we hope to continue welcoming you quite more!  Best regards!!", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r365113268", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Excellent staff, service and food.", "review": "We stayed in Areca Hotel as we had early flights from Alacante.  The hotel is very comfortable, with friendly, helpful staff.  There is a basement pool, which has spa features and is great for relaxing but less good for swimming.  The steam room and sauna were welcomed by tired travellers. It was an excellent place to end our holiday without stress.  There is even a shuttle to the airport!", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r363686059", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very close to alicante airport ", "review": "Dear guest,  thank you very much for your interest in Areca Hotel.  We are pleased to know that your experience with us was comfortable and stressless.  We hope to have the opportunity to welcome you very soon.  Best regards!", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r359718465", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice hotel, pity about the food", "review": "Stayed here for one night to catch an early flight from Alicante. First impressions were of a spacious, modern, clean lobby leading to a garden area at the rear. Reception staff were excellent, quickly checking us in,arranging an early call and a taxi for our early start, as well as arranging a takeaway breakfast for us due to our early departure. Room was very clean and airy, well decorated with comfy bed. We had wine and tapas in the cafeteria area which was excellent and good value for money, before dining later in the Caribe restaurant. Again, service was excellent with staff attentive and pleasant and the food top order. Room service was swift and inexpensive. Check out without a hitch and our taxi driver waiting in reception. Overall, an excellent experience and we would…", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r357795380", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Very convenient", "review": "Stayed over night after a late flight arrival at Alicante. Friendly welcome, clean modern room, excellent breakfast. Can't fault it really. Only one minor gripe, and this applies to a lot of modern hotels, can the designers please bear in mind that some people, particularly the older generation, prefer their bathrooms to be enclosed and not part of the bedroom!", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r357732813", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Friendly staff, noisy hotel rooms", "review": "Dear Sirs,  thank you very much for your nice comments!! We are very happy to know that our hard work is yielding results!    However, we are aware that there is still much work to be done.  Thank you very much for your trust and we hope to welcome you very soon.  Best regards!!", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r351672874", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Noisy ", "review": "The hotel is conveniently located just outside Alicante and very close to the airport.  Unfortunately, although the room we had was clean and tidy, the decor was looking tired, light wooden coloured laminate flooring had gaps where the planks of wood were separating. Again, with the wooden floors, this was very noise when walking on and we could hear other guests walking around.  The room is open plan with no door on the shower cubical and a frosted swinging door to the toilet.  The lift could be heard and doors to other guests rooms slammed shut at all hours of the night.  Other guests could be heard through the walls while we were trying to sleep. The reception and communal areas including the dining area are very clean and tidy.  The breakfast buffet has a good continental…", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r346885857", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 2}, {"title": "At Least they listen", "review": "Dear guest,  thank you very much for your interest and wide description of our facilities and service.  We take note about your comments about the rooms, and we'll consider them in order to do improvements on it.   Thank you very much for giving your feedback and we hope to welcome you very soon.  Best regards!", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r346882825", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Holup", "review": "Stayed here last night. People above me moved furniture for hours above me - I cannot imagine these were guests but rather hotel staff doing some work.  Elevator near room also made lots of noise . Room was hot with no way to cool it down .  Horrible experience . ", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r346307328", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Convenient for a visit to our family", "review": "5 minutes drive from my family in El Altet (staying here meant the grandchildren didn't have to share a bedroom at home!); 10 minutes drive from Alicante Airport; 4 minute walk to train station. Spotlessly clean; friendly, helpful staff.  Only quibbles:  a) Aircon didn't work properly although we tried every combination of controls imaginable; window stays open only if you slide back the (very effective) blackout blinds so room was hot even in January. b) We were told there'd be a kettle in the room - there wasn't but a kettle, cups and bottled water arrived within minutes of us asking. Silly thing was that the kettle and cups were removed by the cleaner every day so we had to keep asking for them! Eventually we left a note, in Spanish, saying, \"Please leave the kettle and cups…", "date": "January 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r344459374", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Lovely hotel close to Alicante airport", "review": "Dear Sirs,  Thank you very much for your interest and for your comments.  We are really sorry for not being at our best level on the things you have described. We'll do our best to give you the best service as possible in your next visit.  Very best regards,  The management", "date": "January 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r343649932", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great for Alicante airport - but not quiet!", "review": "We were put up in this lovely hotel for 2 nights when our flight was cancelled by Ryanair on 26th January.  The hotel is very nice with a small indoor pool and spa with steam room and sauna.  Breakfast was very nice and food in the bar was also very good and not too pricey.  The staff in this hotel were excellent, a special mention to the the young girl on reception who was so helpful and friendly, she spoke good english and helped us to print off boarding tickets and arranged taxi to airport etc.,  There was a lot of nice restaurants and shops in the resort and the train station is a short walk from hotel.", "date": "January 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r341021588", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Enjoyed our stay here", "review": "Dear guest,   Thank you very much for your nice comments.  We have informed our staff about your opinion. We are all very happy to know that you had a nice and comfortable stay among us.  We hope to see you very soon around.  Best regards! ", "date": "January 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r340726989", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Fantastic hotel  5 stars", "review": "This hotel is only 5-10 minutes from Alicante airport so is great if you have an early morning flight. The rooms are spacious and clean and quite modern. The sound-proofing both between rooms and for external noise is poor. The restaurant is fine and the cafeteria offers good value.", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r340516982", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent hotel within 5 minutes drive of Alicante airport", "review": "Very reasonably priced, modern comfortable hotel which is the closest to Alicante airport of various hotels I have stayed.  It was great after getting lost on previous trips from various hotels in Elche, Alicante town and Alicante hills, to access the airport so easily.  Has a small swimming pool which is free and has a jacuzzi and sauna.  Rooms facing the courtyard are away from the main roads. Restaurant and bars in Torrellana are withing walking distance.  Torrellana also has a garage for filling up a hire car.  Will definitely stay again.", "date": "January 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r340406962", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Very Good Quality Airport Hotel :)", "review": "Thank you very much for your comments.  We are very happy that your experience with us was according to your expectations.  We look forward to welcoming you again very soon.  In the meantime, we remain  With best regards!", "date": "January 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r339203216", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Mrs Margaret Burns ", "review": "We had a late flight into Alicante and didn't want to do the drive so booked into the Areca for the night. First and importantly for an airport hotel, great value for money. We paid 47.50 euro for a double room. On arrival the reception staff were friendly and helpful. The room was a good size, large, comfy bed and a very nice shower room. Everything was clean but there were significant signs of wear and tear in the room. We didn't have supper at the hotel but did have drinks in the bar which is recommended. Like reception, the staff were friendly and charming. We didn't have breakfast at the hotel as it looked a little expensive, we drove to the nearest cafe and had coffee and croissant for 2 for 4 euro - and it was good! Finally the taxi fare from the airport was 13.40 euro…", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r334646481", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Last minute booking", "review": "Dear guest,  thank you very much for your comments.  With regards to your comments about the breakfast, it's important to know that we also offer the possibility to have breakfast in our cafeteria, ordering only the products you prefer:  a coffee and toast, or whatever suits you.  We hope to have the opportunity to welcome you very soon.  Best regards!  ", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r333209986", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "The third room that we were offered was lovely but not the first 2 rooms!", "review": "This hotel won an award from you in 2010 No idea why? Our visit was a disaster. We booked a double room which was actually a twin room with the 2 single beds pushed together. The beds were hard and lumpy. The food was appalling, undercooked and cold and they couldn't evenue provide a cup of tea other than herbal. The shower room offered no privacy as was open into the room with no door on it. ", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r332633939", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Relaxing overnight stay very close to airport!", "review": "Great hotel with very friendly, helpful staff! Comfortable and very quiet room with window to iner courtyard. Spotlessly clean. Spent a while in the spa area in the afternoon. Good buffet breakfast served from 7.00 am. Literally 5 mins from Alicante airport and with both on site & street parking. Short walk to restaurants/bars/shops. Will stay again!", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r332430267", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent hotel", "review": "Thank you very much for your comments!!  We are happy that you found everything according to your expectations.  We look forward to welcome you very soon.  In the meantime, we remain with best regards!", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r332414721", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great value if you want an airport hotel", "review": "We stayed for one night in this 4 star hotel. It was only 5 mins from the airport so very handy. We stayed in a junior suite. We were attracted to the hotel by its Spa. We were disappointed when we went to use it at 3.15pm only to be told it did not open until 5.00pm. There was no information on the website about this.  We went back at 5.15pm and the sauna and steam room were still not on so we missed out on this.  The room was fantastic.  we had dinner in the hotel restaurant and the food was great.", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r331878338", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Alicante Airport hotel", "review": "Dear Sir,  First of all, thank you very much for your interest and the nice comments about your stay.  We are really sorry that you couldn't enjoy our Spa. Since we have our new website, it seems our colleagues didn't updated that information. We are now fixing that problem.  Please do not hesitate to contact me in your next visit, and greet you personally. You can email me at direccion@hotelareca.es  Best regards!", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r330962542", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Does What it Says on the tin", "review": "Excellent facilities, modern, new and cheap, within 5 minutes of Alicante airport. Has a small restaurant on site, with a bar that serves food until 11 pm.   Highly recommended, will use again.   Free wifi and nice breakfast buffet included. Parking available outside (on the street but didn't have trouble finding a space).   ", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r323904999", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great spot by the airport and entry to motorway network", "review": "Stayed for 2 nights as part of a business trip.  Staff were exceptionally helpful, particularly the desk staff who helped me plan in routes to my satellite navigation system. secure car parking onsite.   Evening dining is  a little restrictive for a solo traveller as a number of dishes were for 2 people minimum, but there are eateries up the main street near the hotel.  Room was very clean, comfortable enough and plenty of hot water for showers", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r323175642", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Great for stopover at airport! ", "review": "Thank you very much for your comments! We look forward to welcoming you very soon.  Best regards!", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r321858888", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Perfect for stop over near Alicante Airport", "review": "Landed late into airport so decided to stay local before collecting car next morning !   Great for stopover near airport , 10 Euro each way in taxi ! Rooms very clean with great showers  and staff friendly!   As it was late we didn't try the bar or restaurant but they looked fine !   Would stay here again ! ", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r321525100", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very Good", "review": "Thank you for your comments!!  Looking forward to welcoming you soon.  Kind regards!", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r315764779", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Clean and modern hotel", "review": "Good quality hotel at a very reasonable room rate. Staff very pleasant and helpful. We had dinner in the restaurant and spent sometime in the bar. Menu fine, if unexciting, and food and drinks nicely presented. A pleasant experience.  The Spa Suite is a real bonus - large Jacuzzi, plus decent sauna room and a fully tiled hammam. I won't be doing middle of the night drives to the airport to get an early flight in future - I will be staying at this hotel. It is only 1.5 km as the crow flies from the centre of the airport ( 4km drive to terminal - simple well signposted) but there was no noise problem.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r313584379", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Stopover for a night", "review": "Got to the hotel around midnight. Quick and easy checkin, short and good information about facility. Nice room, sad view from the window....just concrete walls. Good bed, good bathroom. Smiling and greeting staff all over. Allright breakfast, very nice garden with a little bar. Perfect place if sleepover is needed due to the nearby Alicante Airport.", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r303580855", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Handy for the airport", "review": "Dear guest,  Thank you very much for your interest in our hotel and for your nice comments.  it's a great pleasure for us to know that you felt comfortable in our hotel.  We hope to see you soon around Alicante once again.  In the meantime, we remain  Kind regards!  DA", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r299094025", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Airport friendly!!", "review": "From the reception area this looks like a lovely hotel. The only reason I didn't request another room however was I arrived late and was only staying one night. The room was  a good size and generally smart and comfy but smelt of stale cigarettes although it was supposed to be a non smoking room. I found several hairs in the room and there was some mould around the bath. The shower was positioned around 4 feet of the ground so thank goodness I am short. I requested a double room but was allocated two single beds.  The service at the bar was very slow. I did receive a free drink however at the end of the evening. The following morning my wakeup call was twenty minutes late. The shuttle service was however excellent and only 5 Euros!!   On the positive side the hotel was cheap and…", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r298798735", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Great location for Alucante airport", "review": "Dear guest,  First of all, we wish to thank you for your interest in our hotel and for letting us know your experiencie with us.  We are really sorry if the room was not in the normal status it should be (fully clean, neutral smell, ...). I presume we couldn´t change your room as we were fully booked that day (due to local holidays in Elche).   With regards to the service in the bar, I guess it was also because the restaurant was fully booked on those days. We are sorry about that. We are trying to improve our agility and efficiency in the restaurant, and probably we didn't get it on that day. We beg your pardon.  We hope you can give us the chance to compensate your last stay with an unforgettable future stay. Do not hesitate to contact me at direccion@hotelareca.es to take personal care of your next stay.  Kindest regards  DA", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r297499067", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Nice stopover hotel....for smokers", "review": "very near the airport if u are on a late flight etc only five mins get,s there modern clean and good sized rooms also has a spa but didnt get to use it as opens at 10.30 and was gone by then so would be good if they opened this facility a little earlier, used the gym and was fine and the staff were friendly, if needed would stay here again especially for the location!", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r296497519", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Excellent hotel, convenient", "review": "Stayed there for business, the hotel is close to the airport and well located to get onto the highways for traveling to Murcia, Alicante and surrounds. Staff is friendly and helpful. The food in the hotel is EXCELLENT. Rooms are comfortable and well laid out. Some small corners could be cleaner but otherwise very good. Will stay again. ", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r293772434", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Be careful with your belongings.....there unfortunately a thief on staff", "review": "We are very happy that you found our hotel comfortable and suitable for your expectations.  We take note about your comments on the cleaning service.  We hope to see you soon around Elche.  Regards!!  D.A. Manager", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r292987495", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Friendly reception staff; nice rooms; close to the airport", "review": "It's with a heavy heart and mixed feelings that I write this review. As an former owner of a travel agent in ireland, I have travelled all over the world and stayed in many hotels. The circumstances of our stay in the Areca Hotel unfortunately was not for pleasure, my family were staying while waiting for my mother to be repatriated back to ireland.  Although, the hotel was a lovely hotel and the front office staff very helpful, one staff member has completely ruined my opinion of the hotel.....I will explain why.  Myself and my brother entered an empty breakfast room for the last breakfast sitting, we were discussing the events of the week and I was quite upset. We left our table and walked out of the breakfast room, leaving the room empty except for two waiters. I realised…", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r292879171", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Smart comfy hotel", "review": "First of all, we would like to inform and to calm down to those guests who are reading this, that we NEVER show our recorded images to any client, in order to preserve privacity and security of the rest of the guests. Only when Police claim us to show them recorded images, then we show them.  Therefore, most of the comments you write here are FALSE. We never showed you any image, so we understand that you imagined or invented all the information written down.  You think you lost a handbag (with 600 € in it), you think someone stole your handbag from the restaurant, and, in addition, you think that the handbag was stolen by one of our staff.  As I told you when you explained me the situation on Wednesday, first of all (what most of the people do, indeed) I told you to go to the police station and write a police report. That is the initial step, so that we can continue our investigation. We asked the 3 people that were working on that day, and no one (even the Restaurante Supervisor) saw any handbag during your breakfast time.  After that, I personally checked our recorded images, but our cameras are not in the restaurant area... There is only one camera in the cafeteria, but not int the restaurant. So, I couldn't see anything.  On Thursday, we talked again. I ask you about the police report, but you decided not to go to the police station, even when I explained how to go there (because the police don't come to the hotel for  those sort of situations), the way to fill out the claim, etc.  You told me that, probably in the afternoon, you would go there.  On Friday, again, I asked you about the police report. And again, for any mysterious and suspicious reason, you didn't go to the police station, which is the only thing I needed so that we continue with our investigation and talk to our insurance department.    Could someone tell us why a person who guarantee that someone in the staff stole a handbag with a lot of money, don't go to the police station and write a claim???  It's so dificult???   I explanied you many many times the procedure in order to clarify the situation, but it seems you didn't want to clarify it, according to your behaviour.   On the other hand, the feedback I had from you on Friday was a THREAT to publish a comment on Tripadvisor if we didn't refund the 600 € ….   Just one word:  BLACKMAIL   From my point of view, we did our best to help you and show you how to proceed with the investigation. You did nothing.  We invited you to some drinks in the cafeteria, not as a compensation of the SUPPOSED stolen handbag, but for trying to be  polite for the bad experience you were filling.  We are really sorry for your lost/stolen handbag. But it is very serious to accuse someone without evidences, and even more to announce it in public.    In conclusion, we take the opportunity to inform to our customers that we work hardly everyday to give the best service as possible, in the best secure environment we can.  But we need also the cooperation of our guests, if an incident (like this supposed robbery) occurs.", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r292388556", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Still great!", "review": "Nice warm welcome on reception. Very good location near to the airport at Alicante so great for arrival late (like us) or an early departure. Nice courtyard where we had a lovely chilled glass of wine (very reasonably priced). Bar shuts quite early though (by Spanish standards!). Nice breakfast. Underground parking included.", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r290892699", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Decent Hotel", "review": "This hotel is clean and close to Alicante Airport.  The breakfast buffet was very nice but I personally felt it was overpriced.  The rooms are very nice; being large, well equipped and clean although there was a very strong smell of cigarette smoke in the room and corridors.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r290637204", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Nice surprise near Alicante airport", "review": "Dear guests,  thank you very much for your comments and for your interest in our hotel.  With regards to the breakfast's comments, we think that, in our hotel, we offer to our clients several possibilities just to avoid that someone can find it overpriced. I mean, we offer a cafeteria service, in wich you can order just a coffee and a piece of bread with butter, for no more than 4 €... or take the option to have buffet breakfast with many different types of bread, cold meat, fruits, Nespresso coffee, etc. for 9 € per person (if you preorder) or 12 € per person if you don't reserve it in advance. In any case, sorry if we couldn't offered you the suitable option.   We hope to have the chance to welcome you soon.  In the meantime, we remain  Best regards!  D.A Manager", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r285866975", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Food ", "review": "Well, there are really nice surpirses. I needed a hotel near Alicante Airport en found this lovely hotel. I only had to pay €67 including breakfast. And I found a 4 star hotrl, 2 km away from the airport. It is clean, friendly and professional staff, nice rooms with all amenities, free wifi, and a spa. As a bonus nice restaurant/ cafetaria in cosy garden in open air.  For me this is a hotel to stay if you are here in the neighbourhood.", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r278327632", "sub_review": {}, "travel_purpose": "", "rating": 1}, {"title": "Airport hotel for Alicante", "review": "Dear guest,  Thank you very much for your comments, and for your positive comments.  We are very happy to know that you enjoyed your stay and that our service reached your expectations.  We hope to have the opportunity to welcome you in a near future.  With best regards  DA Manager", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r271924291", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "ideal location close to airport and quit area", "review": "The hotel is lovely but the food in the bar is awful. I ordered chicken and the first serving was not cooked. The second serving was cooked but it was served with salt on it and the chips could hAve been counted on one hand. I realise that the hotel is one used for people using it as a stop over for a flight but that does not mean that we have to suffer substandard food. ", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r268515816", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Post/pre flight haven", "review": "Late flight, can't face the drive just yet ? Stopping here for an over night break could really transform the rest of your trip - really great hotel at prices that can't be beaten !   A recharge will become a standard on all future trips out here - such a brilliant find...", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r267836100", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Ok but disappointed ", "review": "Dear Nigel,  thank very much for your interest in our hotel and for your comments.  We hope to see you soon again!  Kind regards!!  D.A.  Manager", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r264740599", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Worse food ever. Dont eat here!", "review": "There of us stayed in a lovely modern room but we were disappointed with some crucial elements which are advertised.   The massive issue for us was the lack of sound proofing in the rooms. We could not only hear corridor noise but downstairs and the tv next door! This is ok for a hotel that is two stars or lower but poor for a hotel claiming to be four stars and advertising sound proof rooms. Even more annoying as we specifically asked for a quiet room due to being light sleepers.   On the positive side I cannot bring myself to give the hotel a poor review as the staff and meal we had were lovely. If you're going to dinner make sure to come hungry! Really recommend the fish and the rice is a sight to be seen.   Overall good as a one night place to stay when flying out of…", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r264521482", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Airport handy but food iffy", "review": "Dear Sara,  thank you very much for your comments.  We are sorry that we couldn't offer you the experience expected because of the noise. We should, perhaps, given you a room on a another part of the hotel. We are really sorry for that.  Please do not hesitate to contact me directly in case you are coming back again to the hotel. My email is:  direccion@hotelareca.es  In the meantime, we remain  With best regards  D.A. Manager", "date": "February 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r264378420", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Shocking food, otherwise high standard!", "review": "Stranded in the hotel because the flight was cancelled. The hotel is fine. But do not eat at this hotel. Although the food was paid by the airline. I wouldnt recommend anyone to eat here. Said by a non picky eater.", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r257668569", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Lovely room and a lovely hotel ", "review": "What a breath of fresh air , I stayed here I had room 216 which was the smaller of 3 rooms that my brother and my nephew had , and it was lovely ... Modern up to date beautiful bathroom and nice big bed ,, the reception area is great the staff have been very nice and helpful the only reason I have not given this maximum is the location as its a drive into alicante and although close to the airport it is still 12 euros to get here and the town is not great , but I would stay here again as it has been the best hotel I have stayed in alicante  area  ", "date": "February 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r256600610", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "OK, But No Change", "review": "Dear guest,  We are happy to know that our hotel met your expectations.  We hope to see you again in a near future.  In the meantime, we remain  With best regards  D.A. General Manager", "date": "December 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r253521731", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "It is not Elche... its at the Airport", "review": "Having stayed here previously, we stayed again as we had an early morning flight, and this is about the closest to the airport. We arrived reasonably late, and there was nowhere open to eat, neither any drinks available, no coffee or tea making equipment in the rooms. Parking was OK in the underground garage. Again as in the previous time, the room was too warm, the receptionist agreed that it couldn't be lowered, as it was centrally controlled, the only alternative was to open the window, which meant it was quite noisy. As breakfast doesn't start until 07:00 we were given a care package, which quite frankly was uneatable. A vending machine for drinks, and nibbles would have been useful. I notice that the General managers response to a previous post, says that they now provide…", "date": "January 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r252117649", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Loved it here", "review": "Dear guest,  First of all, we really appreciate your trust for coming back again to the hotel.  On the other hand, we are not happy that, again, we were not able to cover your expectations.  As far as the A/C is concerned, our hotel has only two different types of climate control: warm in winter and cold in summer. Unfortunately, it doesn´t have an individual climate control in the room. However, if you are coming again in a near future, I suggest you to send us an email in order to put the climate control exactly in the terms that suits you.  You can send it to:  reservas@hotelareca.es  With regards to the drinks, there is a minibar in the room with different soft drinks and water. In any case, if you don't find what you need, you can always order something to our 24 hours Reception staff.  It would be great if we can meet together on your next visit and talk a little bit about this issues.  We hope to have the opportunity to welcome you in your next visit.  In the meantime, we remain  With best regards  Daniel A. General Manager", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r250210712", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Disappointing.", "review": "If you are looking for a hotel at the airport than this is it... no more than 5 minutes away. but if you are looking for something down town Elche then this is not it... I should have paid more attention.  That said the hotel is clean and well appointed albeit up a street in an industrial suberb close to the airport. make no bones about it, this is an airport hotel and it does exactly what it says on the tin.... if you need to stay overnight near Alicante airport, then I could not recommend this place highly enough, if you want stay in Elche then this is not what you want.  Service was friendly but not great - seemed understaffed. Stayed two mornings and the breakfast was lacking, particularly on the first morning as it was obvious the pastries were not fresh.", "date": "December 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r247255144", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Very noisy room even with the window closed", "review": "Last night of our hols and we booked at the last minute, Room clean and well set out but I could not sleep because of the traffic noise. Breakfast for 7 euros per person was v. expensive and the coffee machine did oot work & only made cold coffee. El Plantio had much better breakfast so we would not stay again  The Receptionist did try very hard to tell us where to go", "date": "December 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r243877422", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Close to Alicante airport but isolated", "review": "Dear guest,  We are really sorry that you could not rest properly. Although we think that our rooms are correctly insulated from the outter noise, it could happen that is not enough for some of our clients. In that case, I would suggest to take a room facing to the other part of the hotel, which is much more quite.  With regards to the breakfast, we are now working on the new breakfast with new products and a Nespresso coffee machine, which will be available on next January 2015. We are completely sure that our new breakfast will fulfill your expectations.  We hope you can give us another opportunity in a near future, so that you can test our new standard on that matter.  We hope to welcome you soon.  Best regards  Hotel Manager", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r243209785", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Ideal for Alicante Airport", "review": "The hotel is very 5 min drive away from the Alicante terminal which is very convenient if you are travelling or working there. The hotel is situated in the town of Torrellano with bars and supermarkets nearby but not many attractive options for the demanding traveller. Alicante city is only 20 min away by taxi offering plenty of options for a great night out.  Rooms and deco are modern, however some of them start to feel a bit aged. Space and amenities are acceptable. Insulation is good and no noise from the outside was perceptible (a road connecting Alicante and Elche is a few metres away).  The bar and the restaurant offer a good selection of tapas and local dishes, including fish and meat.  The breakfast buffet is average and could be improved, specially the dried meats…", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r242484062", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good hotel for the airport", "review": "Dear guest,  thank you very much for your comments.   As the new General Manager of the hotel, I agree that the breakfast needs to be improved. That's why we are now working on that.   I am sure that, in your next visit, once we have our new breakfast ready, you can enjoy our new products available.  Should you have any other questions, do not hesitate to contact us.  In the meantime, we remain  With best regards  Hotel Manager", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r234086841", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good for stopover for Alicante airport", "review": "This hotel is situated within a10 minute drive of the airport. The staff are friendly and speak English. The rooms are clean and furnished simply but with everything that is required  for an overnight stay. There is a pleasant bar that has a selection of snacks, or needing something more substantial the restaurant has a very reasonable menu. We would stay here again if using Alicante Airport. ", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r231804056", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Convenient and efficient", "review": "Arriving at Alicante airport at night so stayed over before returning to airport next morning to pick up hire car.  Tried to contact hotel by e-mail but no reply so had to book via Late Rooms.  Taxi from airport costs €11 and takes 5 minutes.  Next morning took hotel shuttle back to airport costing €5 for for us both.  Double room with breakfast cost €73 but would pass on breakfast in future.  Very good value.  Reception staff very efficient and helpful.  Wifi fast and free.  Good Transit but hotel with little comfort.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r230256307", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good airport hotel", "review": "Booked by company entertaining us on overseas trip for last night before flight home. Public areas and rooms of good standard, bit of a 'wobbly' shower tray floor, but not a problem. Restaurant nice, food OK. Handy shuttle bus to airport but needed air con. Recommended for airport stay.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r229830986", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Near airport ok for one night", "review": "Perfectly clean smart  modern hotel . Very good value.  Picked it because we a were arriving late almost midnight at Alicante airport . Taxi 12 euros from airport which was very steep because it's only about 1.5 km. I think we were ripped off. Reception man was ok. We asked about the swimming pool for the next day he said we could use it and the spa. Next morning told it was not open till 7.00 pm!  Which is a ridiculous state of affairs is it not? Breakfast woman very very unpleasant and unhelpful. Coffee machine needed filling you'd have thought we were asking her to climb Everest.   She was equally unpleasant to another very nice fellow from the Far East , we were  all bemused. Morning receptionist very nice and pleasant got us a taxi to La Zenia not ripped off 67 euros for…", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r228267525", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Lovely hotel with very helpful staff, near airport", "review": "Very lovely hotel 5 mins away from airport by bus which you can get just outside the hotel.i travelled with my husband and kids kids (4&1 ) we booked the family room which turned out to be two joined rooms so there was lots of spaces wad it was very quite though th other room smelt of cigarette smoke it was not too bad after opening the windows  The rooms were maintained to a high level of cleanliness and there were showers which was ideal as I prefer not to use baths when travelling The staff were very helpful and went out of their way to be helpful.wifi was quick and free from anywhere in the hotel. There were lovely spa facilities I tried to use these in the mornings but was told they would open at 10 but when I retuned after 10 the steam room and sauna were still off so I…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r225845680", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Excellent hotel for a stopover. Near the airport.", "review": "If you fly early in the morning from Alicante or arrive late and do not wish to search for your hotel in Alicante or elsewhere, this hotel is excellent for such a stopover. Small rooms, but clean.Very helpful and friendly staff. Free parking and free wifi (although a bit slow). Breakfast early from 7 am (if you fly early that is a great help) and the price is very reasonable, even in high season. All-in-all a good little hotel, but probably not suitable to stay there for holidays, as there is not much to do and the beach too far away. Their restaurant out in the garden is very beautiful within the little waterfall and the lovely palm trees. Great atmosphere to eat and drink.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r225033362", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Over night stay", "review": "Thanks to Trip advisor found this great hotel after being forced to stay in Spain due to the strike in France. Could recommend it to anyone wishing to stay close to the airport. Small town and not much to do but for a base or overnight . Rooms excelent,staff helpful,food and drink  good. What more do you need.", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r212234356", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Convenient hotel close to the airport", "review": "I stayed in the Areca hotel in view of its proximity to the airport,  The hotel itself is good. The rooms are comfortable and spacious. It is quiet. The restaurant seems ok but lack atmosphere. Ample free parking in front of the hotel. Free internet. The hotel is situated on the outskirts of Torrellano, a neighbourhood that still seems to be under construction.", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r210800968", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "boutique hotel in a tiny town", "review": "Firstly this town is in the  Elche area but in a small town called Torrellano- don't get confused by just looking at a Google map as  my partner did- read the directions.  Had planned to stay 3 nights for house viewing in the area but plans changed and so left after 2 nights and then re-booked for the last night before flight from Alicante the next morning. Reception were happy to accommodate my request to change pre booked nights so I  was impressed with them.   There is an underground  garage but it appeared locked although there is on street parking at the front and to the side  of the hotel.  Very nicely furnished with clean, modern lines  for  its rather odd location, although it is very handy for Alicante airport.  if you like privacy for your bathing please consider …", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r202981853", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Perfect for alicante airport", "review": "We booked this hotel based on trip advisor as we had a midday flight from alicante back to uk after a short trip to visit friends in Valencia. Our flight was cancelled so instead we had the whole day here and the hotel allowed us a late check out (3pm) which was only 15 euros. The room was very clean, bright and spacious, including a cot for our 7 month old baby. The staff were very helpful and friendly. If you are looking for an overnight stay you won't go wrong with this hotel, although be warned the \"spa\" wasn't quite as good. The sauna and steam room were not working and the jacuzzi was very cold which was a shame as one of the reasons we did book originally was so we could take our baby into the pool.  Another negative was no tea or coffee or even cups which meant it was…", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r199517679", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great for the airport shame about the food", "review": "Stayed for one night prior to returning to UK. Staff spoke very good English and helped me with my poor Spanish. Couldn't do enough for you and all happy smiling faces. Shuttle bus to the airport every half hour and cost 5 Euros for 2 people, took 5 minutes. Room very clean, beds very comfortable, no door to the bathroom area, design of the room but not to every ones liking. Food not very good at all, had an evening meal, should have had Tapas in the bar. Breakfast OK but that coffee machine needs binning.", "date": "March 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r196299246", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Would use again", "review": "Myself and my partner used this hotel for one night before we flew home the next morning. Beautiful reception and great service from receptionists. Very comfortable room and bed. The separate toilet and shower cubicles didn't bother us- We used the pool (the steam room and the sauna are only opened during the afternoon, we were told) both in the evening and morning. It was small but great- empty but for us!! One suggestion - - purchase a decent coffee/tea making machine in the restaurant area for breakfasts. We had to ask how to use it, and everyone who entered the restaurant after us, we watched scratching their heads also, before asking for help.", "date": "February 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r194980154", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good for the Airport but a coffee would be good!", "review": "We stayed here before an early flight the next day. Check in was efficient and easy. The room was basically all that you'd need, except no coffee/tea making equipment. The  Cafeteria opens at 7.00a.m. which is to late if you have an early flight, there are no drinks or snacks machines anywhere in the hotel, which was a surprise, again if you are arriving late in the evening. We were able to catch a quick drink, and a snack when we arrived, but only just as the bar closed early. The courtesy bus to Alicante Airport doesn't start until 09:00, but a taxis is only 11 euros. Would use this hotel again, as it is convenient, clean, and modern.", "date": "December 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r193365672", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "O.K., but lacking....", "review": "We booked this as an Airport Hotel, for Alicante/Elche Airport, and it is certainly very convenient for this. Check-in was friendly, and speedy, and the offer of car parking was made. (We didn't need this, as our car was collected, for long term parking). The room was clean,and the bathroom, though rather small, was fine. The modern, modular concept of no bathroom door, and a rather noisy, sliding glass door for the toilet, was, in my opinion not ideal, as it was impossible to avoid disturbing my husband, when I showered at 5.30, and then dried my hair! It is a case of both being woken up, but only one bathroom. A cup of coffee would have been a possibility, but, there are no tea/coffee making facilities in the rooms, and, impossible to comprehend for an \"Airport Hotel\", - no…", "date": "December 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r189017414", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "An Excellent Place For  A Stop Over", "review": "Arriving late at Alicante airport decided to stay here before travelling on the next day. Super modern and clean hotel, one of the best value ever and we have travelled a lot! Easy to get there by taxi (about 11 euros) even at midnight and then took the hotel shuttle (5 euros) the next morning to collect our hire car.   The staff were extremely pleasant and very helpful . We were wishing we had reason to stay longer.", "date": "December 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r186704659", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good Alicante Airport Hotel", "review": "If it is neccessary to saty over for a flight in or out of Alicante airport then the Hotel Areca is very convenient, very clean an d very reasonably priced. The rooms are good size with serarate toilet and bathroom facilities. The location is minutes from the airport by car/taxi/bus but not walkable. There is a restaurant, coffee lounge and Spa - so really everything you need for a convenient overnight stay when using the airport.", "date": "November 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r186251371", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great Location For Travelling to Alicante Airport", "review": "The Hotel is very conveniently located and clean.The staff very courteous and helpful.The room was spacious and clean. Pleasant garden setting, with friendly cafeteria staff.For vegetarian they were able to cater, a good dinner. My room was faced towards the road but the noise level was low. Around the walking distance of the Hotel you would find a few restaurants which offer various different cuisines. The area amount the hotel is more rundown", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r182645872", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Our last night in Spain", "review": "My husband and I stayed in this hotel our last night in SpIn because of convenience for airport. We were met by a friendly receptionist. We had dinner in the restaurant where the waiter was very friendly and helpful. Dinner was excellent, I had the Lubina and my husband had the BolognAise. Wine excellent as usual from Alicante.  Room was very modern and comfortable. Free wifi offered too. My husband and I visited this hotel a couple of years ago and must admit standards haven't changed. We enjoyed it then too.  We didn't have time to use the Spa but maybe next time.", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r182230767", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Modern, Stylish and Comfortable", "review": "Ideally suited for a pre flight stay.  The hotel has a sleek look.  The staff were friendly and helpful.    The bed was very comfortable but the minimalist style came before practicality of use.   The bathroom was open to the room - good for romantic couples but others could find this embarassing.   The loo did have a sliding door which had obscured glass and was very heavy to move.   Nowhere to put makeup etc by the room mirror, if someone was using the bathroom. Pleasant outdoor area for drinks.   No in room coffee facilities.  Overall, it had almost everything for an overnight stay.", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r180302943", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "let down by the spa", "review": "This is a very clean and well run Hotel with great friendly receptionist and comfy beds. High powered showers in the room with good tv listings. We booked this for the steam room and a massage. 48 hours before we went we tried to book a massage but they could get anyone after 1pm and when we went to the spa the steam room was broken. So if you want a massage they need plenty of notice! This is a great Hotel for the airport as its 5 minutes but despite the receptionist saying its 5 minutes and will be no more than 10euros it was 15 euros in the end. So try and book your taxi without the help of the hotel as a normal taxi is 8 euros we found out.", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r179522897", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Not Only for the Airport", "review": "We have stayed at this hotel in the past as we were spending a few days in the area, and returned as it was convenient for our sporting event at Gran Alicant.  The hotel facilities are excellent, the only disappointment was that the pool and spa don't open until 7pm, far too late in our estimation.  We enjoyed chilling out with a drink in the garden before wandering into town to dine at one of the many bars and restaurants.  The reception staff were very friendly and helpful.  Wifi was available in our room.  Be careful in the shower, the floor can be very slippy and there is no grab rail.  An excellent place to stay, not just for the airport.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r178099909", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Quality hotel close to Alicante Airport", "review": "Warm welcoming in this quality hotel with amazing garden. You can eat in the garden.  Food is fresh, well prepared,  for reasonable price.  And menu is in English.  Room is big,  clean, with moderneequipment.  On top you have free access to the spa (haven't tried)", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r177675140", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Best hotel for airport.", "review": "Stayed here for a night before an early morning flight from alienate, we booked the park and fly package which was really good value. We made use of the free spa and got the bus from right outside into Alicante for the day. The room was lovely, outside bar and restaurant very good and the staff most helpful I've ever come across in spain. We will stay here every time in future for Alicante flights.", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r175658728", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Perfect hotel close to Alicante Airport!", "review": "Love it for the price of 40EUR for one night!! The hotel is not in walk distance from The Airport but very close in a taxi, around 10EUR. The hotel has an Airport shuttle for 5EUR charged per room at the hotel. Would defenetly come back to this hotel. ", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r175655872", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Great Hotel... but dinner was a big disappointment", "review": "The Hotel was excellent.  Good sized rooms with comfortable beds, a great place to stay (our Villa wasn't available until the day after we arrived in Alicante, so we looked for a Hotel close to the airport).  We'd booked a family room for the two of us and our two boys (ages 16 and 13), but they gave us two rooms adjacent to one another - first class service and a very helpful reception.  We arrived at around 22.00 hrs and decided to eat at the in-house Restaurant 'Carabi'.  We were seated on the outdoor terrace in great-looking surroundings.   The starters were plain and the main courses disappointing even though it was relatively expensive (not over-priced, just dear in comparison to the cost of the rooms). My eldest and I had pasta dishes which were served to us cold - they…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r175399818", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "The place to stay if flying to or from Alicante Airport", "review": "Not very inspiring when we viewed the hotel from the outside but do not be put off.  The hotel inside is ritzy.  We asked for a room at the back to avoid any road noise at the front.  Our room faced the airport and Torrellano Train Station and despite this it was surpisingly quiet.  Our room was spacious very clean and very smart.  If you like a good breakfast book it, it was excellent.  The usual continental plus a full English from the buffet, lots of fresh fruit and juices, coffee good.  We stayed 2 nights prior to our departure from the airport in order to go to the beautiful city of Alicante by train.  Just a 5 minute walk down the road and you are at the station where trains depart hourly.  Two stops and 15 minutes later you are in the city centre.  Do not miss out on a…", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r165646308", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great hotel for short stay", "review": "This is a perfect hotel and perfect location for a night before our flight. Very clean and comfortable rooms, nice friendly staff and lovely garden setting if you want an evening snack or meal.  Close to train stop also if you want to visit the great city of Alicante if you have time.  Would definitely recommend to others.", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r165386958", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great hotel as airport stop-over", "review": "We stayed at The Areca when we arrived at Alicante for our holiday to the Costa Blanca, and also on our return to the airport a week later. The taxi from the airport is around 12 euros and are obviously readily available at the airport but also the receptionist will call one for you from the hotel. At first glance, the building doesnt look brilliant from outside, but in fact it is surprisingly modern, clean and spacious inside. Breakfast was typical buffet with helpful staff. Bar stays open til late and was light and airy. There is also a seating area outside the rear of the building which is nice. The rooms were modern and clean. If you are staying with someone that you worry about seeing you in the shower, or hearing you in the toilet, then maybe its not for you, as it is very…", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r164188796", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Good Hotel Near Airport", "review": "We were taken to this hotel as our flight was cancelled. It had been a very long day of waiting around in the very hot airport. On getting to the hotel we were quickly given our room key by very helpful reception staff who spoke perfect English. Our room was very clean and modern, Not keen though on having no door to the bathroom or the glass door on wc. This meant one had to sit on the bed while the other had use of the bathroom. Ok for couples but friends may find its lack of privacy not to there taste. Staff were very helpful at breakfast and went that bit extra to provide gluten free bread for my friend. Plenty of choice for all.", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r164087870", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "No coffee?????", "review": "Why have a nice Hotel, with garden, close to airport, and yet not have either coffee making facilities in each room, or coffee available for us poor travellers who have an early morning flight>?????? I asked receptionist evening before, for 4.30am coffee....and she noted it, but made no promises..... No coffee appeared, and I commented on it on checking out....Was mer with \"You must have misunderstood her\" and other remarks about my lack of comprehension!! he offered to see what he could so then, but too late as we had to be off.......... So although place was fine, and area was fine, I won`t be returning!!!", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r162736063", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "A clean modern well presented hotel with good service and a great breakfast buffet really convenient to alicante airport", "review": "We stayed here after taking a late flight to alicante. Literally 5 minutes by taxi from the airport the late night reception service was excellent. Room good, bathroom state of the art, breakfast amazing. I find it hard to fault this place and would definitely use it again.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r162640254", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Airport Bus Service", "review": "The main reason we picked this hotel was its proximity to Alicante airport, and the added bonus of a free shuttle service to the airport early the next day. Staff were very friendly and the food was very good, I didn't have the breakfast as I left very early but my wife enjoyed it and said the choice was very good. The shuttle to the airport literally takes 5 minutes and was very right on time. Simply told the lovely receptionist what time I was looking to leave and she sorted out the driver. Great attitude shown by all the staff, very clean and pleasant rooms, would stay here again for sure. Enjoyed it.", "date": "March 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r156528900", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Lovely room cold breakfast", "review": "I enjoyed staying at this hotel near the airport. It only took five minutes in a hire car and free underground parking as well. The room was modern and comfortable. Frosted glass doors on the bathroom were fine for me. The breakfast looked appetising but the bacon was cold and sausages luke warm. Cereal, fruit juice and breads were fine.", "date": "March 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r154251130", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "A nice end to the holiday!", "review": "A nice , clean modern hotel with friendly staff and plenty of parking.  We stayed here the night before our flight home to the UK and enjoyed a last evening of warm sunshine before heading back to grey skies!  The bathrooms are very typical of modern Spanish hotels - lovely kit but you need to be VERY good friends (to say the least!) if you're sharing a room.  We enjoyed it and wouldn't hesitate to recommend it as a good quality hotel at a very respectable rate.", "date": "February 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r152041698", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "nice, but...", "review": "The hotel was nice, modern and clean. Good terrace, good restaurant, good spa. Very convenient for airport. Friendly staff. BUT.... the fact that the bathrooms have no doors, is unacceptable. Furthermore, the toilet door is a thin glass one, which didnt slide smoothly or silently. At least there could have been a door in the small hall to isolate the bedroom.....but even that doesnt exist.  When we asked for another room, were told all are similar and that it was the style of the architect... I would prefer that the architect confines his excentric taste to his own home...", "date": "January 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r149244218", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Happy to have been there!", "review": "Staying for two nights, we are happy about having chosen Areca Hotel. Main reason for our choice was the short distance to Alicante airport av well as Torrellanos Railway Station and bus stop (for small local trips during our 2-day stay). Considered the low prices charged for the rooms, we were impressed of the common areas at the hotel, and also about the guest room itself. Very clean, good beds, cool drinks available, ok wi-fi. Spacious closets. Free mini-safe. Nice being able to open the window. Very good soundproofing, all quiet when the window was closed. We would however appreciated hot water and coffe/tea at our room. About staff: Fully serviceminded and helpful, the more laudable as we were reasonable low budget travellers. We would be happy to stay here again.", "date": "December 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r148086015", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice hotel in a small town", "review": "This hotel is situated in a very small town on the outskirts of Alicante airport, there's a bus which takes just over 5 minutes to reach the airport.  The hotel itself is really nice, the rooms are clean and tidy with good sized beds. Generally the wifi was fairly good with a stable connection.  1 big issue with this hotel was if you are sharing and don't really know the person then this will be an issue, as the shower has no door and the toilet only has a fairly see through glass door.  The breakfast was really good and well worth it, the assistant who was working most mornings was incredibly friendly at 7am and was really helpful - she was fab!", "date": "December 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r147381444", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "A well-rested break before returning to the UK", "review": "Areca Hotel is a spitting distance from the airport and therefore it took all the stress out of getting to the airport on time, which meant mucho relaxation in the beautiful gardens and having enjoyable evening meals on the terraza! Could not want for more and in such pleasant surroundings, with pleasant staff", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r144002200", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Really nice hotel close to Alicante airport.", "review": "Really nice hotel close to Alicante airport. Literally round the corner from the airport, in the nice Spanish town of Torrellano, restaurant is good, but also good choice of bars and restaurants in easy walking distance. Nice rooms, clean and coo. Good value, good place to stay on your way out or back.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r143204839", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "great!", "review": "Clean, modern, not too expensive, convenient, lovely garden, very convenient for Alicante airport. Only thing that I'd have liked was if the spa was open longer - 3 hours in the evening isn't really that much - so I didnt get to use it which was the main reason I booked, but everything else was really really great. Hope you can open the spa for longer in future...", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r141341616", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Excellent stopover hotel", "review": "Brilliant location and truly excellent value.  Arrived around 3am to fluent English speaking night-time receptionist.  Comfy bed, clean room and generally really nice hotel.  Would not hesitate to come back.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r140634665", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent hotel close to airport", "review": "Great hotel in good location and only €10 taxi to Alicante airport. The room was nice, modern, spotless and had free WIFI. There was no tea / coffee making facilities in the room which I was surprised with. The staff spoke excellent English and were very helpful. This is a hotel I would recommend.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r139718430", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Good hotel, close to airport", "review": "A great hotel in a good location in relation to Alicante airport. Nice rooms, a bit small. Separate toilet and bathroom, modern and clean. Safe parking inside the hotel areas.  We ate at the hotel restaurant, good food but quite expensive. The breakfast was somewhat disappointing, small selection. There was no coffee / tea making facilities in the room, this was negative. The staff spoke English well  In all, a hotel I can recommend.", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r138117190", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good price/quality ratio", "review": "+ : The room was very good, clean, with free good quality wireless Internet connection. The hotel is located very close to Alicante Airport.   - : Only the room service menu had poor choice, and unfortunately breakfast was not open yet at 6,30, so I had to leave the hotel still hungry.", "date": "February 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r137293409", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Surprisingly close to being a proper 4 star for the location", "review": "It's not a holiday hotel, but for a stopover for a night or 2 while you're in the area, the Areca is very pleasant. Certainly on a par with AC or NH Hotels. Breakfast was poor and I didn't try the Spa. But the quality of the room and standard of service were very good, and they have a pleasant courtyard in which to relax.", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r133336027", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Short holidaytrip", "review": "The employees of your hotel were very friendly and helpfull. After a busy day we enjoiyed  sitting in your garden and have dinner there. However the hotel is sittuated near the airport and close to a busy road we slept  well. We had a very pleasant stay and hope   to come back one day.", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r132219772", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Would have been a great stay if the facilities were open as advertised", "review": "We arrived and were happy was only 10 euro cab from the airport.  Rooms were nice only spanish tv but room service menu was a nice bonus.  I was told on arrival the spa was closed until 8.30pm then would open later so we decided to have dinner first so could visit the spa later. We were unable to use the outside terrace due to a private party which was a shame as it looked lovely on the website. We ate and had a few drinks which were very cheap which was a nice surprise - food was pretty basic but ok. Went down to reception at 9 to use the spa and were told it still wasnt open due to a private party using it that had over run (the same ones using the terrace earlier) so we couldn't use the spa today. I said that was unfair as we ate early so could use the spa and had booked the…", "date": "March 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r127863456", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Easy to find - near airport", "review": "The hotel is close to the airport and is easy to find. It is ideal for travellers wishing to overnight near the airport. Clean and comfortable throughout with pleasant staff. Free parking on the street right outside the hotel.", "date": "March 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r127116941", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Helpful staff, practical room, near airport", "review": "Hotel Areca is a great hotel for business or travelers. The airport and car rentals are very close. The staff was very helpful and professional. Room small but clean and practical. Parking on the side of the street is free. Economical.", "date": "December 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r124523550", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A very confortable hotel near the airport", "review": "We stayed here for one night during our holidays in Southern Spain It's a good place to stay, just 10 m' drive from the airport of Alicante and it is really easy to find.We paid a convenient price for the standard of the hotel, the rooms are big and clean. We slept very well because the place is quite and we didn't hear noise from the road of from other rooms. The breakfast is complete and tasty. I will recommend it", "date": "January 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r123340981", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Spa facilities made it worthwhile", "review": "Couldn't fault the service, the staff, the facilities, everything was great for the price. Thanks!", "date": "November 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r120352917", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Very good airport hotel", "review": "We stayed one night at this hotel, en route to the mountains from Alicante.  It was a very modern and comfortable hotel, and quite close to the airport.  On Friday night, we had to take a taxi to the hotel, but the shuttle was running on Saturday morning.  Our room was clean and spacious, and the hotel was quiet at night.  Breakfast was quite good, as there was a wide range of food available, and the dining room was really pleasantly fitted.  Overall, this hotel is very good value.", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r120021044", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great place to stay", "review": "Great place to stay if you need to be located close to the airport. The staff were excellent, friendly and always wanted to help. Free wi-fi in rooms. Room was clean, modern and spacious. Minibar in room with free Fanta and water.  Hotel-airport shuttle bus only runs 5am to 6pm (and slightly diffent times on a weekend I think). Taxi to/from the airport costs €10 and is 5minute drive. The spa only opens from 7pm until 10pm.  Avoid the restaurant. Poor basic food at very expensive prices.", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r119870426", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Excellent stopover", "review": "We stayed at this hotel as we had a late flight into Alicante. Its perfect for a stopover and should be consider for a few days as its close to motorway and therefore all the mountains behind the Costa Blanca.  Our room was larger than average hotel room, modern and attractively designed. The garden is a good place to relax with a drink after a long flight.  The staff were very friendly.", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r119520750", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Quality hotel close to Alicante Airport", "review": "On a four day visit to the area 27th Sept '11 we arrived on a cheap Ryanair flight from Bournemouth at 11.00pm.We had a taxi to this hotel (15 euros) and reservations for two double rooms, with the intention of setting off early next morning. The staff were welcoming and efficient and we were soon in our rooms- both an excellent standard, clean, spacious and modern with huge comfortable beds. The bathroom was really superb and there was a separate loo. So it's a great place to overnight close to the airport, but the local town is featureless which is fine if you're just passing through. Big bonus is we wanted to nip back to the airport to hire a car (so we could drop it back at the airport on departure) and the hotel has a free mini bus shuttle to the airport (not from though).…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r119033823", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Perfectly located near airport.", "review": "Very nice hotel located near airport with trans to airport. Found everything neat and clean.  Room a bit small for two travellers needing two beds.  Cafe food and service great.  Front desk young lady spoke good English.", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r118406225", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "I would use this hotel again", "review": "We landed late, needed to pick up supplies in Alicante next morning so decided to organise a stopover.  I'd maxed out my cards, and had to pay in cash on my arrival, but it wasn't a problem - reception was very nice about it. Having read other reviews, and based the decision to stay upon them, I must say that the complaint I read about the corridor lighting being low may be factually accurate, but it's not a problem, and in my opinion I thought it was restful. The underground garage was adequate for me to park my old merc e220, which is more like a small bus than a car, parking was included in our deal, um the lighting does go off a bit sharpish, but you aren't left in total darkness and the switch is easy to find, it's got a little green light on it. Breakfast was fine, they…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r115818289", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "nice adequate hotel", "review": "used this hotel for airport use and its very close to alicante airport which was ideal for us.  Nice clean modern and toiletries provided.  Rooms not sound proof, next rooms tv was loud and lots of commotion of which we heard every movement.  Would deffo recommend though for airport location alone.", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r109704227", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Slip-sliding away", "review": "Good location for Alicante airport and for hire car return, particularly now the new terminal is open. Parking is under the hotel and in a secure garage from which there are lifts to Reception and to all floors. Very helpful. Pleasant and obliging staff. Receptionists speak good English. WiFi limited to hotel lobby. Our snack supper was fine and quickly provided; breakfast buffet also good. Funny smell in the room (drains) and, as other reviewers have stated, no door to the shower room. Toilet does have a (glass) door but no lock. Bed firm (we liked) but there was no aircon in May and the Hotel is near enough to the airport for visitors not to want to open the window and let in the noise. The shower tray is slick and no non-slip bath mat is provided. Anyone with a mobility…", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r109310720", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Poor restaurant", "review": "Dissapointed as I expected more from previous reviews.  The room was fine, but the double bed comprised two single beds!  The corridors were not well insulated for sound and sound also came through the closed window from the outer courtyard quite easily.  No wifi in hotel. The shower hot and cold temp drifted in and out next morning.  The biggest let down though was the restaurant. The hotel is actually in the small village of Torrellano not Elche so there’s no where decent to go except the hotel.  With this in mind I don’t think the restaurant has to try very hard.  The restaurant took ages to be cleared for the evening meal after a christening had taken place.  Only one waitress was serving so service was really slow.  My meat was very tough and the ‘veg’ comprised a single…", "date": "March 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r100342245", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Excellent Hotel and very friendly staff", "review": "A modern hotel with lovely rooms and very friendly staff. Town only ten mins from airport by taxi. Very few holidaymakers around so be prepared to converse in Spanish with the very friendly locals. Perfect for a quiet getaway.", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r76064857", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very nice hotel", "review": "We stayed at Hotel Areca since we needed to catch an early flight from Alicante. The hotel is situated a few minutes drive from the airport. The taxi to the airport cost 10 euros.  The rooms are very nice and clean. There is no door to close when you take a showe though :-) The spa area is nice as well and there is also a restaurant in the hotel serving the best paella I've ever eaten. Highly recommended!", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r74429642", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent, modern hotel, friendly staff, great rate!", "review": "Very close to the airport, max 10 mins from Alicante airport and 15 minutes into town of Alicante.  Very friendly staff, modern, spacious and clean rooms.  Would highly recommend.", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r74203327", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Modern style, convenient to airport", "review": "Beautiful, modern style rooms. Very convenient to the airport - we just stayed one night before we flew out and it was a five minute ride to the aiport. Staff was friendly and helpful, with good English skills. Loved the style of the rooms - but people should be aware that the bathrooms had no door to the shower/sink area. The toilet had a glass door that was see through. With our four year old it was fine, other families or travelling companions may have problems with the limited privacy.", "date": "July 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g661469-d597012-r35778609", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}]