[{"title": "Holiday", "review": "Super central . No elevator! Very friendly! No mirrors in room! Room was quite small for 2 people . Also we had problem with shower unit as when we took a shower water was gushing out  all over the floor . Reported it but nothing and nothing was done about it during our stay!", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r716484083", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Disappointed", "review": "Very disappointed with the room and the facilities. Although it is clean it is very small with one bedside draw and one unit with no doors on which is for hanging your clothes up on. As you can appreciate the amount of clothes for 2 weeks is a lot more than 2/3 nights stay. The bathroom again clean but no space to put any utilities on such as shower gel, toiletries, makeup etc. Which leaves the bathroom looking untidy. Shower gel was left on the first day then never replaced. No safe to put passports or any other valuables in. All in all a very disappointing stay. I did email booking.com a number of times to complain and they did get on to the manager who offered us another room but it was more expensive than the room we were already in. A week later offered another room at no further expense which I agreed to take. However when we came back on the Friday it was never mentioned and the wife was not seen again until the day we were leaving. The annoying thing was that the manager spoke very little English however she spoke very good English. Quite a few concerns with this Hostal no roof terrace, no breakfast, no safe although they have a garden it is not very clean the sun lounger is broken and it looks as if it the staff uses the garden room to hang washing out. Minus theses few facilities added an extra cost of 168 euros for breakfasts plus 112 euros for sun lounger so taken into account this added cost it was a very expensive stay.   …", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r714697208", "sub_review": {}, "travel_purpose": "", "rating": 2}, {"title": "Great Location, lovely clean rooms, great hospitality", "review": "I have stayed here now 3 times, with children and without, and each time, the rooms have been fantastic, always clean with air con, all amenities including towels, complimentary shampoo, body wash, tea and coffee.  We stayed on the ground floor this time, and had a lovely little terrace area you could sit outside and enjoy, there is also a roof top terrace to use. A great location, within walking distance of the Balcon and shops and bars, I will definitely be using again, the prices are very reasonable for the size of the rooms and location. Highly recommend a stay here.", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r701852276", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Little Gem", "review": "Arrived lunchtime on the 23rd June, received a lovely  genuine friendly welcome. I wasn’t expecting much as it’s only a 2 star rating, however was pleasantly surprised at how nice this place is. Our room had a Street view which lets you soak up the Spanish atmosphere and is great for people watching. The room was spotless and had a small fridge with complementary water, also a kettle for making tea. There is also a lovely garden area downstairs. A short ten minute stroll down to the sea front through the pretty traditional Spanish streets, plenty of bars and shops en route. Definitely recommend this place, very reasonable prices ( we booked direct with hotel ) Looking forward to visiting again.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r683838389", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "relaxing break", "review": "I arrived at Hostal Abril after spending a sleepless four nights in Malaga. I was therefore very pleased to have a very relaxing and peaceful time staying at Hostal Abril for five nights. My room was small but very clean and very well appointed. The bathroom and shower area had obviously been recently refurbished and had an excellent shower.The bed in my room was also one of the best on this trip, very comfortable. I stayed at two other self catering apartments in Torre Del Mar and Malaga the previous nine nights and found that the beds were very uncomfortable. Despite my room facing on to the main road traffic noise was not a problem and stopped reasonably early.  The Hostal is close to the Balcon de Europa approx 15 minutes walk and extremely handy for the taxi rank and kiosk for bus tickets (Alsa). Nerja has many cafes, restaurants all very close to the Hostal Abril.  I was surpised to find that my room was cleaned every day with towels replaced regularly, I was not expecting this in this type of accomodation. The room had a small fridge and kettle for teamaking. The staff were also very helpful (Montse) and helped with local information etc. I was asked if I required towels for the beach upon arrrival, I thought that this was a good touch. The only problems that I encountered were that no lift is available in the property therefore customers with mobility issues may have problems . This was not a problem for me a I dislike lifts. Another top tip would be for customers to have some knowledge of the Spanish language.  I recommend staying here and hope to return next spring.…", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r682244149", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Hostal Abril, May 2019", "review": "We chose to stay at this Hostal for a second time in May 2019.   Its a very friendly, family run Hostal with spotless rooms in a great location.   We were put in the basement room towards the rear of the hotel which has 3 beds and is idea for families.  I wasn't sure about at first, but it was lovely and quiet, if a little cool at times - I actually had the best sleep I have ever had in Nerja.  On our last day the toilet broke and would not flush; we reported this to reception and it was repaired within the hour.   I wouldn't hesitate to return here.", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r674530778", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Home away from home", "review": "We came to Nerja to study Spanish, and found Hostal Abril a few days into our stay as we weren’t happy with our first accommodation. The staff at Abril were fantastic. It’s family run, and we mainly worked with Montse. Between her broken English and my beginner Spanish, we communicated quite well and she could not have been more accommodating or welcoming. They were attentive to all our questions and requests. The room was small but really comfortable and we had a sweet little balcony and lovely views. It was quiet, with a good central location. We really loved it there and will definitely stay there again if we ever return to Nerja! ", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r669096938", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "6th visit", "review": "Just returned from our 6th visit to the abrill and as always it was excellent, its had a revamp, new doors and some new shower rooms,  ours had an amazing rain shower, rooms have kettle and fridge,  and they always look like they have had a fresh coat of paint   the rooms are always spotless, and they are cleaned every day, it is close to every thing you need in nerja , friendly family run , excellent service ,can't wait to return", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r667866293", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A perfect break", "review": "We stayed at hostil Abril for 3 nights. It was perfect in every way. Staff friendly and helpful and went out of their way to help us. Room was clean, modern and pleasant with a balcony overlooking the pretty street. Even had a fridge and kettle which we didn't expect. Situated 5 minutes walk to centre of Nerja. Would definitely recommend and  return.", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r663816968", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fab little place in the heart of Nerja", "review": "Stayed here end of October; after staying in Apartmentos Abril in 2017. Such good value for money. Room was not huge but very functional. A great sleep and a great shower which are always welcome. Staff really helpful and friendly.  Will be back in the future!", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r648995204", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great location, kind people", "review": "The hostel was under renovation and the owner was very kind to offer us an apartment with the same price. We had problem with the wifi and he helped to resolve it quickly. Overall a pleasant stay, great location which is close to bus station, beaches and supermarket. Highly recommended.", "date": "January 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r648494317", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "One step short of excellent", "review": "It is difficult to realise that this is not a Hotel, it is good, but could be better.  Plus points:- Location cleanliness facilities staff including the cleaner Lovely garden and seating - sadly the tranquility is ruined by the building work next door  Negative points Poor wi fi speed- never got above 3mb/s on either of our devices Very poor email communication-- mostly ignored Lack of anyone to speak to in English for most of the day building work next door - drilling and hammering during weekdays - they are fitting out the inside at present. Could take some time !", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r638379529", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent VFM", "review": "A lovely small hotel with every amenity and handily placed for the town centre.  Parking can be a challenge but there is a parking lot only a short distance away.  My wife and I would stay again. Highly recommended.", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r635858383", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Beautiful room", "review": "Me and my family stayed in a family room and it was beautiful. I have been coming to Nerja for 10+ years ever since I was a child and I have stayed in lots of hotels in the town. Our room was decorated beautifully and was really nice and clean with a very comfy bed. Room also came with air conditioning which was brilliant as it was really hot for most of our stay. The only negatives I would have is the cleaners weren't very thorough, and halfway through our stay there was construction work going on in the building next to the hostal, which we wasn't aware of. However, the main thing that concerned me was the fact we were told we could leave our bags in the hotel after we checked out, and we were told to put them in a private hallway outside of a toilet which appeared to be an…", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r619542680", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Lovely", "review": "Lovely family run business!! Very nice people and very helpful, as a family of four we had a lovely stay there . Would highly recommend , apart from a lot of stairs as we were top floor, but everything else was lovely and room had a lovely terrace", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r618394807", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Best in town........", "review": "Fabulous Hostal...... Montse and her family are so chilled and nothing is any trouble.......they really make you feel relaxed....they place is immaculate, rooms fantastic, fridge included which is a great bonus........well worth the money and in a fabulous situation close to the bus and only a few minutes walk to the beach and the balcon......", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r615197162", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "great stay", "review": "I am currently staying for the 2nd time at Hostal Abril. I stayed here before in 2014. And yes, my good experience with this place is the reason I returned. The hotel is situaded at a walkable distance from the city centre, and the bus stop is just around the corner. The reason i like this place so much, is because it's so tidy and clean. Which is really nice if you're suffering from asthma. The bathroom is just great. Very good shower. And last but not least: excellent service from the staff: friendly people at reception and room gets cleaned every day. Couldn't have wished for anything more.  And all of this above for a more than reasonable price.  Thank you hostal Abril for a great stay again. Will definately come back", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r584373197", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Hidden gem", "review": "This \"hostal\" is just great.  We stayed here in may for one night. We never got into late and although staff were away they kept in constant contact and came and checked us in when we arrived.  Rooms and building are spotless and we had the lovliest little balcony great to have a cuppa in the sun the following morning.  Will definately stay here again.  This was our second stay at hostal abril", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r581385676", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Perfect Stay", "review": "Stayed 8 nights and could not have been better. Location 1 minute from bus drop off and few minute walk into the tapas bar area and beach Nerja and the Abril exceeded all our expectations and would definitely return. Comfy and spotlessly clean and a great Roof Terrace to relax and read in the evening. So many places to visit in the area everyday was filled. This was a great value holiday and with the tapas prices came home with plenty of money which is rare.", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r577412994", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent ", "review": "We stayed for three days from the 15th to the 18th of April and the weather was fantastic, the Hostal Abril is a lovely place to stay we were in room 110 on the top floor and it was a lovely big room with a private terrace. The staff were really helpful by giving us a map and all kinds of information on where to go, they even gave us beach towels as we had not brought any with us, we didn’t think it would be hot enough to go to the beach. The Hostal is in a great location all the shops and bars are only a few steps away, we will return to Nerja one day and will definitely stay at the Hostal Abril.  Liverpool ", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r574755605", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great value in a good location", "review": "We stayed in a double room on the second floor overlooking the terrace garden. The room had recently been decorated and had a double bed, chest of drawers and built in wardrobe. There were tea and coffee making facilities, a hairdryer in the bathroom and a free safe. The room was cleaned and towels changed every day. It is in a great location, 5 minutes from the bus station and an excellent large supermarket. Less than 10 minute walk to the lovely old town and Balcon and around 15 minutes to Burriana beach. The staff were very helpful and nothing could be faulted. There is building work going on next door which may disturb some people (although the noisest part finished whilst we were there) but to be honest there is building work going on in most of the streets we walked along.…", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r573520482", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellently located,comfortable and well run -but  watch out for building work next door !", "review": "Reserved an apartment for 2 weeks  we were blessed with excellent weather for most of the time - it did get very cold at night, but not  problem since the apartment was central heated. A couple of hiccups on arrival - no hot water in the kitchen, not connected ! but dishwasher available. Shower excellent, but no door on toilet/shower room Cooking facilities were good. Apartment could have been better maintained, wardrobe doors difficult to close, fan not working in toilet, could not be repaired The speed of the wi fi  was very variable, sometimes only 0.3 mb/s, with a max speed of around 3mb/s during our stay -and the fact that it would suddenly become unavailable - it was however an improvement slightly on our last stay THE BUILDING NEXT DOOR HAD JUST BEEN BEEN DEMOLISHED WHEN…", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r565889224", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Second Visit", "review": "Our second stay at Hostel Abril, this time with family members. We were given a huge apartment, living room/kitchen, two bedrooms, bathroom and second w.c. Can't fault our stay at all, very helpful staff and the location is just great. Hope to visit again next year!", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r564549742", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "good value", "review": "Nice friendly service and good value clean rooms. Some of the neighbours where very noisy the night we needed sleep the most as we where leaving the next day but that's hardly the the staffs fault. All in all well worth the money.", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r559273176", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great value for money!!", "review": "Fantastic little hotel in a beautifully renovated building. The room was compact but had everything we needed. Super comfy bed, lovely hot shower, spotlessly clean. The room was cleaned daily with towels and bedding changed. The staff at the hotel were friendly and helpful. The location is excellent with lots of good bars and restaurants within a few minutes walk. Would certainly use again when next in Nerja.", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r556139002", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Apartment in street not good", "review": "We booked a 2 bedroom apartment from Booking.com as there were 3 adults in our group. Me, my husband and my 19 year old son.     We were given an apartment in the main street number 40 San Juan.     Yes it was super clean and there was hot water and a lovely shower but the place was not a welcoming place.   We have stayed many times in apartments in Nerja and this is probably the worst we have been in.  My mother and her partner were in a room in Hostal Abril which was up the road from this apartment, about a 5 minute walk and the rooms were beautiful.     Unfortunately due to me being ill for 48 hours on arrival and this was only a 4 night stay I was unable to make any complaint.   I list my negatives just in case you happen to be given this apartment.    Beds like sleeping on…", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r551673268", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Fabulous find from a recommendation", "review": "Stayed 2 nights to bookend an apartment stay. Accommodation faultless, even my picky good lady could not find fault .  Great vfm too!  Will return.  Clean rooms, clean towels, lots of hot water, air con.   Staff very helpful", "date": "November 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r542072459", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A nice place to stay...will return", "review": "We were in a one bedroom apartment which seemed to have been recently refurbished. It was really well fitted and equipped and had a nice balcony.  It was at the back of the property and overlooked the garden.  It was quiet and really well located - 5/10 minutes from restaurants and beaches.  This a family run operation and our hosts were very friendly and helpful.  More like a boutique hotel really.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r535419064", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice stay", "review": "Good location - right on the main street that goes down to the sea (5-10 mins walk). Close to restaurants and supermarket. Staff was very friendly - they have beach umbrellas and towels for you at no cost. Rooms were clean and IKEA renovated, had small fridge, kettle and TV. Bring a power strip with you though - there was only one power outlet in the entire room.", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r525861193", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "I would come back", "review": "We were upgraded to a big apartment from our double bed reservation for free as we had a small child. Apartment was very modern and quite new. Pros: fantastic location for everything, balcon de Europa, restaurants, tapa bars, supermarkets, beaches etc. Cons: hard to find parking space but this is to br expected in historic Spanish towns. The staff at the reception was very friendly and obliging", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r521805859", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good walking distance, and clean.", "review": "A nice and clean \"family\" hotel.  You get the bed made up, and new towels every day. The rooms are normally small and nice with TV/AC. We had a nice small balcony towards the street. The neighborhood is quite during nighttime. Good walking distance to booth restaurants and beaches. An extra plus for letting me borrow an umbrella to the beach. Nice service!", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r516298566", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Quick stop before Gibraltar ", "review": "Great little find, clean comfy everything you need. Nice little shops bars restaurants around also!! Struggled to park found a underground car park 5 min walk with kids and bags so not far at all only downside it's 25 Euro for 24hours but this place is only 130 Euros so I didn't Mind 👌👍 Should be five star to be fair sitcom TVs shower etc and spotless with spare pillows couldn't ask for anything else ", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r511501652", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Excellent value for money", "review": "We stayed for a week in June and couldn't fault it. Great location, very central, short walk to bars, cafes, shops and beach. We stayed in one block and our friends joined a few days later and stayed in the other and all our rooms were lovely and clean with modern decor. Staff were very friendly and helpful. Would definitely stay again. We recommended to friends going this month but unfortunately it is fully booked. Excellent value for money.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r509228966", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Very nice hotel, would stay again.", "review": "Our room was clean and had a balcony which looked out onto the garden.  The location was excellent.  Just a short walk from the Balcon and around the corner from the bus station.  Lots of local places to get breakfast or a drink.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r505576453", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Mid week break", "review": "Thank you very much for your very kind opinión.  We would be very please to see you again.  Yours ", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r479775576", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent value for money", "review": "This is a lovely hotel in Nerja that's only 10 minutes away from the beach. Ideally situated, close enough to cafés, restaurants and bars but still feels secluded.  We stayed in the 4-person room upstairs. Rooms were cleaned daily with new towels. There was a small balcony/patio where we could hang washing (stayed for 2 weeks).  Only suggestion is for some more lights in the room. Energy saving bulbs are great but it did mean we would be in darkness for a while at night!", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r472084944", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Holiday", "review": "Friendly helpful staff, clean and well appointed rooms. Ideal location for old town Nerja. Approximatley 5 min walk to sea. No parking at venue, could be a problem locally due to narrow roads. Kettle & fridge in room. ", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r471639907", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Superb!", "review": "Excellent location in great part of town. Extremely clean, fresh towels every day. Lovely room with small terrace at front of building. Boasts a garden at the back with chairs and sun-loungers. Great way to end the day. Lovely accommodating staff Will definitely return..", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r461547336", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Best hostal I've stayed at.", "review": "Here at the moment (17th Feb). Excellent place. Small but well appointed room and bathroom. No lift but my legs still work at the moment! Near restaurants, Balcon, etc. Room on main st but not too noisy for me ( I sleep well). A bargain at the moment and I will be back in the near future.", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r460579934", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Excellently located,comfortable and well run - pity about the poor wi fi", "review": "Reserved an apartment for 2 weeks in January - we were blessed with excellent weather for most of the time - it did get very cold for a couple of days, but not  problem since the apartment was central heated. A couple of hiccups on arrival - no kettle for 2 days, and more than half the bulbs did not work in the lights - fixed the next day. Cooking facilities were good, and even a dishwasher was available. My main complaint was the poor reception and speed of the wi fi and the fact that it would suddenly become unavailable - little use in our apartment upstairs, and with speed varying from average to very poor, not always usable. I understand this problem is being addressed - it needs to be Good value for money,and overall a pleasant stay.", "date": "January 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r453067217", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Rating Justified!", "review": "I have just returned from a New Year break in Nerja where I stayed at the wonderful 'Hostal Abril'....... a hidden gem in a wonderful safe location....two minutes walk from the bus station and five/eight minutes walk from the iconic 'Balcon de Europe'!  The single/double rooms are spacious and extremely comfortable with en suite bathrooms, a small fridge and tea/coffee making facilities.  The standard of cleanliness is first class and during my stay, there was constant 'coming and going'.... a testimony to the popularity of this great place!  The terraced garden at the back of the hostal is amazing...don't miss it!!", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r450725445", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Very pleasant", "review": "Cheap clean v efficient. We booked a room overnight for 40 euros and had a full apartment which was new and beautifully fitted. Most unexpected. Easy check in and out, fridge, kettle, tv Sep lounge and lovely spacious bathroom had a real feel of home . Highly recommend if in Nerja.", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r437383034", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "classy", "review": "Very tastefully decorated apartment with probably the most comfortable bed I've slept in on holiday. We were pleasantly surprised at how nice this place is, spotlessly clean and in a great location. The rooms were modern and bright with free safe, air conditioning, fridge, TV, hairdryer and toiletries. I don't know why it is so cheap, worth much more than we paid. Staff are lovely and rooms are regularly cleaned and linens changed, overall we were delighted, would definitely stay here again. ", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r410226173", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Holiday in nerja", "review": "Great place,it was clean, modern and a great location. Walking distance from everything. I would highly recommend it!! The owners are lovely! It is very reasonably priced for what is offered. We were very impressed. ", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r395617509", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Clean, modern aparthotel in great location, some night noise issues", "review": "This is a clean, very modern aparthotel, with sleekIkea kitchen, fridge-freezer, dishwasher, microwave and hob but no washing machine, despite listings suggesting it did. There was a washer available elsewhere in the building. Furniture was comfortable, especially the sofa. The apartment was air-conditioned. Outside space - a roof terrace - was very modern but shared.  The aparthotel was very conveniently located on an interesting narrow and beautiful street, close to supermarkets, sights and bus station. The location was quiet - although motorcycles were noisy at night and interfered with sleep. Booked in advance and got good value. Recommended but be aware of scooter traffic at night.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r388508726", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Delightful stay", "review": "Spent the last week in May in Abril and had a most enjoyable stay. Most convenient  as only 2 minutes walk from the bus station .The gleaming marble reception area gives a very favourable first impression.Delighted to be given a free upgrade to an excellent duplex apartment with 2 bedrooms and balcony, 2 walkin wardrobes,good bathroom, downstairs wc,large lounge and ultra modern, well-equipped kitchenette .Outside a spacious terrace leading to an attractive garden which was being refurbished during our stay.Bed linen and towels changed and apt cleaned midweek.Staff could not have been more friendly or helpful to us.Restaurants and cafes nearby and Balcon and beaches only 7 mins walk. Overall 4* accommodation at very affordable prices with free wifi and room safe.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r387455713", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nerja wedding", "review": "Very clean, nice room. Not far from the hub of things, about a 7 min walk to Hotel de Balcon. Little fridge in room which is handy. This was a solo trip to attend a family wedding. There is no pool which in Summer months you might want but for the price and type of trip I did Hostal Abril was perfect.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r375169593", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Huge appartment right in the centre", "review": "We had a huge appartment right in the city centre, which is a great deal in terms of price/quality. Try to get a room on the second floor, so the street noise won't bother you. You get your own living room with kitchen and TV and a separate bed room. The shower is a tad cramped as you'll find more often in Spain. Parking is free on the nearby public parking space, which has plenty of space. Note that your car might get an extra scratch or two, however this has nothing to do with the hostal. There is a supermarket nearby where you can get your breakfast. Note that it is closed on Sundays.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r371238582", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good start, horrible finish.", "review": "As we walked in everything looked good. Lots of marble, clean, spacious nice garden area. Ten minutes from town. Very impressed by Nerja. I tried to pay and was told to leave it for present. I tried every day to pay but the card terminal they wanted me to use was always broken. On our last day I was TOLD to go and get cash from an ATM, but then they decided that since they had my card details they could get the money. We went out for a meal and arrived back and were actually getting into bed when the doorbell started ringing. I dressed and ran down to open the door to a woman yelling agressively in my face in Spanish and waving my invoice. I tried to explain I could not speak Spanish, but the yelling continued. I wondered exactly what she was saying. We eventually got the…", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r361399907", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Retirees Road trip", "review": "We were having a weeks car free break & Our first stay stay in a Hostal ever, normally we are 4* Hotel stayers but this little place comes highly recommended by me. Hostal is just a few minutes walk around the corner from the bus stop, we arrived late about 8pm to a very nice welcome by a lady with very little English unfortunately,my Spanish is limited too but we managed. Firstly No lift !! So if you have mobility problems request a ground floor room, also there is no food available. It is also a gradual walk of about 800 yards to many shops & restaurants we went to several all were VERY reasonably priced your money goes a long way to have a great food & very good priced Accomodation. Our room was exceptionally clean, en-suite shower room,small garden view balcony but adequate,…", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r349567273", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Close to bus station", "review": "We had a nice ,clean comfortable,quiet apartment.Lovely staff.Unfortunately we did not get much help as we  could not speak Spanish and most of  the staff did not speak English.Hostal was in good location .5 mins walk to the Bus station and 15 min walk to city centre,.The main negative about our apartment was that we  couldn't conect to Wifi. And we had to sit in the lobby to use their internet to do our work", "date": "January 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r341786112", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great service", "review": "Spent Christmas 2015 here,two single guys one bedroom apartment,on arrival we were shown the room and told it probably was not suitable for us and they gave us the keys to another apartment around the corner,for an extra 7euro a night we had a fantstic two bedroom apartment with all mod cons,we were over the moon and had a fantastic 7 nights in the Sun,the Abril staff were extremely polite and helpful and we thank them for that,if you go to Nerja i strongly advise Hostel Abril.", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r340149356", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "GOOD VALUE", "review": "Just spent 2 nights at their Apartments Abril. Bedroom and bathroom very modern. Bed comfortable. Free wi-fi, which worked well, and free use of the safe in the room. Main tourist sites within 10 minute walk. We had room in first floor overlooking the road. Quite a bit of street noise late at night, and first thing in the morning. We first ended up in the underground car park Balcon de Europe. We saw the price of 23,95 euros per 24 hours and drove straight out. It took us 5 minutes to find free street parking within 50 metres of the hostal. Good value for money and we would return.", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r336298140", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great value", "review": "Great place and very cheap,very clean and very central. Would def stay again. Only issue was that taxi charged us 8e to get there from the bus stop..we could have walked it in 3 minutes if we realised it was so near but he did not want to give us directions.. No fault of the Hostal though.", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r329061394", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Excellent Hostal", "review": "Lovely rooms, I think we got 'upgraded' to a double apartment, very helpful, very clean, good location (just a short walk away from all the bars/restaurants) so pretty quiet.  Comfortable bed and a good size lounge with fridge/kettle.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r321604410", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely overnight stay.", "review": "Travelling with friends, I booked 2 double bedrooms. On arrival we were greeted by a very friendly young women who offered the option of a 2 bed roomed apartment instead. After being shown around the apartment, we decided to take it.  On the first floor we had a well equipped kitchen, lounge area with flat screened tv, an air-condition unit and patio doors leading out to a terrace with table and chairs, and access to a small garden with sun loungers. There was also a separate downstairs toilet. Upstairs we had two bedrooms, one with twin beds and a walk-in wardrobe, and one with a double bed, which had a TV and an aircondition unit. We had only one bathroom, with an amazing shower, but that was fine, and another wardrobe. Everywhere was spotlessly clean. With fresh bedding and…", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r318965507", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great place.", "review": "Great location. Modern and extremely clean throughout. Rooms are a good size with everything you need. Maid service everyday with clean towels and bedding. Great value for money. I will definitely stay here again.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r317834111", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "1 night stay", "review": "This spanish hostel in nerja is an excellent place to stay. Cant fault it. The price is also far less than it should be. Room clean, and has all you need for a confortable stay. They even organised our taxi from malaga airport. We have moved upto Capistrano but have booked our jast night at hostel abril. ", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r317738010", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Excellent stay", "review": "Very modern and clean hostel. They give you clean sheets and towels each day. Really good value for money and very stylish and in a good location within walking distance to beaches and town. Would stay here again!", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r315444756", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great Choice", "review": "I selected all our hotels from reading reviews on Trip Advisor so I appreciate previous comments.   This was a great choice in one of our favorite stops in Spain.  Easy walking distance to the main shops & restaurants.  We had rooms right on the street & it wasn't too noisy.  AC worked fine and room was very clean although not too big.  Bed was two twins put together but that's what we found in each hotel we booked.   Great value.  Had to park in a lot several blocks away but that didn't present an issue for us.  No problems dropping off luggage & reloading when we left.  Only stayed 1 night.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r314011445", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great location", "review": "Lovely little hotel,  short walking distance to all amenities.  Lots of small shops, restaurants and beaches, also a small supermarket a few minutes walk from hotel.  The hotel was very clean and fresh the only downside was that we had booked a double bed and was given a room with twin beds. When we queried this we were told twin is a double so wasn't too impressed but apart from this we had lovely air conditioning and the safe was free of charge, good Wi fi and a powerful shower. Cleaner came into our room everyday made beds and changed towels. Brilliant base to enjoy our holiday.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r311240901", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Safe, clean, well-located and missing on details", "review": "The Hotel is located along a beautiful and narrow street lined with 2-3 store traditional houses that on its way to the city centre, beaches and Balcone Europé turns into a busy pedestrians only street with lots of shops and restaurants. At the site ot the hostel it is suprisingly calm. Walking to the beach takes 10-15 minutes, and the bus station is 5-10 min walk away.  I was a little disappointed that an \"apartment\" was just two bedrooms, bathroom and a fridge and an electric kettle, as I had expected a few utensils and a small kitchen or at least a small table to sit for breakfast as it is not provided. We got the first floor apartment and it lacked the expected balcony. It looked as if the other apartments had small French balconies only, big enough for a sting for clothes…", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r300041910", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Great town", "review": "It's location is perfect for visiting Nerja, just up from the centre within walking distance of all amenities, it's also very reasonably priced, decent size rooms and they ate spotless and cleaned every day, staff are friendly and make sure that it's quiet and safe at night. Great place to enjoy a smashing townt", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r287290011", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "A clean reasonably priced hotel with a great location", "review": "Thanks for your opinion, we really appreciate it. We are very happy that you were able to have a nice time in our hostel. We look forward to see you here again!", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r281584306", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Reasonably priced but not great when things go wrong", "review": "My family of five adults stayed in three rooms.  The one on the top floor was really large.  The hotel is clean and quiet.  The only disadvantage is the lack of an elevator. Location is great, an easy walk to the beach.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r280168050", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "a little gem", "review": "the perfect place to stay in Nerja, great location, clean and spacious with beautiful garden to relax in.Fantastic value for money giving you the freedom to explore the many restaurants in the town the centre of which is a 5 minute walk away. Will return.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r274743423", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "well worth it!", "review": "Just back after a 4  night stay. Perfect location, fantastic value for money. Room was spacious and clean with fridge and kettle. Lovely garden area for relaxing. Would definitely stay here again. Friendly and efficient owners.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r274423710", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Fab place", "review": "great accommodation, perfect location, lovely clean rooms, amazing value for money with added bonus of beautiful garden area to relax in after a days sightseeing. never stayed in hostal style accommodation before but will DEFINATELY be doing so again", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r272847330", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Cheap and cheerful", "review": "Having booked a single room it was just a little cramped with a single and a double bed. However it was spotless and although the ensuite was on the small side it was modern and also spotless. The location was ideal - barely five minutes from the bustling centre and the Balcon. The small, sunny garden with comfortable seats and a couple of loungers was a bonus Great value at under £100 for the week.", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r260409247", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Great price in a great location", "review": "Nice quiet hostel accommodation in good location for all areas of Nerja. Good rooms, comfortable beds and lovely quiet garden. Would definitely recommend, especially at this price. Only 5 min walk to center of town. Very clean and very friendly.", "date": "February 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r254617663", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "the best stay in Nerja so far...", "review": "This was my 5th time visiting Nerja and have stayed at different hotels before here. Hostal Abril Is by far the most comfortable, pleasant and friendly stay I have had here so far.  It is conveniently located near all the best places restaurants, shopping, beach, bus terminus and caves - but also in a spot which isn't noisy.  The customer service we received from the minute we walked in and throughout our stay was excellent.  I definitely recommend this place and give it a top score.", "date": "January 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r252446876", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Value for money", "review": "Like the previous reviewer we booked through Expedia for the Xmas and New Year period and we got exactly what we paid for I.E. a small room on the street.  The room was fine and it was certainly kept very clean with a change of towels every day.  It had everything you need for a holiday provided that your holiday was based on spending the minimum of time in your room.  The only real disappointment was not being able to have a hot shave at the sink (cold water only). The hostal is situated in the old town a 10 minute walk south to the hub of Nerja but to be honest we spent a lot of our evenings in the bars and restaurants near the hostal.  I would recommend this hostal as it is value for money and would also recommend the following bars/restaurants in the old town area: La…", "date": "January 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r249244774", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "If the price is right, then this is a good option.", "review": "We had a decent sized room that looks out onto the street. The bed seemed decent, but I woke up in the night with back pain. It was clean and came with a kettle and blowdryer. The bathroom was decent, with only cold water in the sink, but lots of hot water and solid pressure in the shower.  The location is not bad. It's a five to ten minute walk down the hill to the primary area with restaurants. It's not near the water, but it's perfectly do-able. And it's very near the bus station and main roads.  Service wasn't terrible friendly, but it wasn't negative either. WiFi was free and had good speed.   We had found a very good price for this place on Expedia. For the money, this was a good option in Nerja.", "date": "January 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r248811005", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "What a hard bed !!!", "review": "At the top of the town so no noise at night you could sleep very well if the bed was not so very very firm (too hard for me) We were in room 106 with a nice view of the garden. Room cleaned every day and clean towels supplied daily, kettle and mugs in room and a small fridge. All in all a nice place to stay.", "date": "December 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r243162668", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Prefect Location", "review": "just stayed in hotel abril for 6 nights and have to say we had a great time, This place sets the standard for all 2 star accommodation. it really should be a 3 star. But does not service drink or food. it is very modern with flat screen tv, power shower, free safe, free air con and free wifi in your room. the place is super super clean every day. the towels changed daily and the sheets changed. it has a modern feel to the place with comfortable bed as  bonus.  its on a nice quiet street strolling distance to the balcon. we are getting married in nerja next year and will be recommending it to our guests. there is also apartments to rent with self catering but didnt see theses.", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r237956305", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Apartments in nerja", "review": "We had two apartments here and they were excellent. Totally spotless,fully equipped ,right in the old town. Fantastic value and would totally recommend it and go back.so unlike other apartments, real spainish style apartment..", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r235418939", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "perfect hostal in a perfect location", "review": "Me and my husband nearly always stay all inclusive when we go away but as we now know Nerja well we decided to brave self-catering and found this lovely hostal on booking.com. So glad we did as it was in a lovely street that is not noisy.  The room was lovely and the whole hostal was spotless and clean. Towels changed everyday and bedding changed a couple of times and we only stayed for 5 nights. Free safe, fridge and air-con in room, which is rare these days. There is a lovely calm peaceful oasis of a garden at the back. Very close to all amenities, great restaurants, bars etc.  Only 2 small moans, the lighting was not bright enough for evening reading in the room and the bed was very noisy, but would definitely stay here again.", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r231330998", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Want the double-bed you ordered? You can bring it up yourself", "review": "They tried getting us to pay more to have the double-bed we ordered, instead of the twin beds they were trying to lay on us. After a day of being played (\"we will do it tomorrow\" speech) and more negotiating, the options were clarified, carry the mattress yourself or be downgraded to a small noisy bedroom that doesn't have the balcony you ordered, without a discount I may add. Stay away, many other lovely places to stay at in Nerja.", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r221818426", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Perfect for hostal", "review": "Very good hostal in the city center but not in very noisy place.The room was clean everytime and the staff were very friendly. The rooms has safe, hair-dryer and good balcony. The only thing that was not good - they forgot about our arrival. But finally they found our booking and everyting was ok.", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r218208210", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent hostel for a pleasant stay", "review": "This hostel was beyond our expectations, as we rented a room for a weekend and we were given a spacious apartment, which included apart from the bedroom a chill out living room with tv and cosy atmosphere.  The people in the reception were very pleasant and willing to help, the location is great. Perfect combination for a perfect weekend! We will definitely prefer this hostel for our next visit to Nerja.", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r216349011", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Immaculately clean", "review": "Its a nice little hostal, lovely touches in the decor.  Immaculately clean and the rooms were cleaned and towels changed every day.  Handy location.  We had a mix up with the room, took a day to sort and we were told we would be upgraded for free. Got back to the hotel and they didn't have a clue what I was on about so more haggling.  We got the room we should have had so no upgrade.  The front of the building where our room was is very noisy.  For the price it is in a good location.", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r211388661", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Fab", "review": "Excellent place to stay been to Nerja many times must say this was the best . The room was so clean and very modern. The towels were changed every day we have never had this anywhere .I slept so well as air condition was free as was a safe . Hostal Abril was ideal location for restaurants and bars . A visit to Malaga is a must the Alcazaba De Malaga is definitely worth going to . Take trip to Frigiliana its very pretty.We just cant wait to return to Nerja .", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r208299017", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Excellent hotel - will definitely be back", "review": "Outstanding value for money just home from our second stay at hostal Abril in May time.  Already planning next trip.  Ideal location for all the local attractions, lovely street view & noise level was fine.  Accommodation is very well maintained turned over every day. Staff are very friendly & absolutely obliging with whatever queries we had.  Cannot recommend highly enough amazing value for money", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r207334542", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "What a hidden treasure.", "review": "This trip to beautiful, sparkling Nerja was a great find on EasyJet holidays. I had researched this hotel as per usual on TripAdvisor. The transfer was booked in the package deal and this hotel is an hour from Malaga airport. The hotel named, Hostal Abril is beautiful and new. There were no bugs or critters and the room cleaned, towels changed daily.  There is a TV (Spanish), air con and safe in the room. Didn't have to pay extra for the safe but didn't use air con for April, May. Weather was a balmy 29-30 degrees. Trips cannot be booked from the hotel and the gentleman on the desk has little English. I also had a little Spanish. Straight down the road takes you to the small beach, Playa Calahonda where beds and brollies are €4.50 to hire. It is black sand with pebbles and…", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r204964874", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Fabulous", "review": "We stayed at one of the apartments, not the Hostal, so this review is based on that.  We had booked a 1 bedroom apartment and requested a quiet room (realising the windows would be street facing).  On arrival, we were told had been upgraded to a 2-bedroom which meant we had a full floor to ourselves and a balcony.  The balcony only provided views of other balconies/ terraces but it was lovely and quiet just to sit and read/enjoy a glass of wine.  There was a flight of stairs to climb to get to our apartment but that did not bother us.  We managed to find a parking space on the street not far from front door and the car stayed there for the duration of our stay (5 days).  The apartment had a living area with full kitchen (and I suspect a bed settee) so we were fully self…", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r203975757", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "hostal abril", "review": "We stayed here from 17th- 24th April '14. Lovely little hostel, bed comfortable good sized bathroom. Very clean with fresh towels daily and bed made up also. Only downside-they decided to knock down a wall on Easter Monday! They did ask us if we wanted to be moved but from what we were told, it was only going to last for one day so we decided it wasn't worth bothering. Unfortunately, it continued on until Thursday the day we  left!.", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r203511491", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Ups and downs!", "review": "We stayed at hostel Abril in march this year and it was not quite what we were expecting! We were put in an apartment over the road from the main block where we had to climb 32 steps to get there! We are an older couple and reasonably fit but after walking back from the centre which was uphill my husband did have trouble with his legs. The apartment was quite nice and spacious but the shower was tiny. There was a roof terrace advertised but we were told there was none and the garden was closed for refurbishment therefore there was nowhere to sit in the sun apart from a bar/cafe or the beach which was a very steep climb. The receptionists did not speak English and it was hard to make them understand. The apartment was only cleaned once in the week and we had to ask for clean…", "date": "March 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r200580564", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "A gem of a find", "review": "Making a whistle stop visit to Granada and back via Nerja to Gibraltar we stayed for one night at the Hostal Abril. The manager was welcoming and charming, advising us on the best places to park. Situated on the edge of the tourist area it provides easy access to the main places of interest, town centre beaches and Balcon de Europa.   We were looking for a simple, clean and comfortable hostal at a decent price and this was what we found. The room had tea and coffee-making facilities, which is often not the case in Spain, and does not offer food. However, Hostal Abril is not far from a mix of restaurants and bars offering both local and international food.", "date": "November 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r192375618", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "will stay again!", "review": "Stayed here recently in Novemeber 2013, It was wonderful! The owners were extremely nice and the hotel's condition was superb! The rooms were of excellent quality and were overall very clean and well presented. The Hostal is located conveniently near to a supermarket, and the main shopping streets of Nerja, just a 3-5 minute walk to the Balcon de Europe! Will definitely stay again.", "date": "November 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r186367302", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Will stay again soon", "review": "We stated here last week, end of October. Very clean hostel, staff great, rooms cleaned everyday! Good location 5 mins from center of town 2 mins from bus station. Will be staying again soon. Only very slight criticism, shower was quite small or may be I was too big!! But try this place it's excellent and great value ", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r182956677", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "A relaxing stay", "review": "Our decision to stay in Nerjas was spur of the moment as we had been on the road for about 4 weeks and needed to recharge our batteries in a low key town where there were'nt a lot of sites to see. Our decision paid off when we were able to get an apartment at Abril. Everything from he pleasant helpful staff to the nice sized apartment made the stay perfect for us. We chose Nerja because it hasn't been over devolped like most of the southern coast of Spain and if we looked hard enough we could find tabernas that didn't offer \"English\" food.....", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r182179585", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very clean, helpful, great value", "review": "Stayed for one night. Very clean, comfortable hostal with all basic amenities. Lovely room and I learned to love black tea-kettle available in room. Great location, just 5-10 mins from Balcon de Europa, so quiet. Helpful friendly staff/owners. Good recommendation for dining. Check out Meson Antonio in calle Diputacion", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r180552396", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Great Stay, So Clean!!", "review": "My partner and I stayed here for 6 night in June for a friends wedding. We spotted in online and the rooms looked lovely. We are not big on breakfast so no food on site did not bother us at all. the rooms are so clean and well kept as is the rest of the hotel, the hotel is very central 5-7 mins but you win out as its just far evough out that it is so quiet even if you have a street facing room. we had friends staying in the square being woken '7:30 with delivery trucks! Honestly great little hotel a gem, so clean, price was brilliant value, no pool but we beach people.  the only thing i would say is that the shower cubicle was a little small but water pressure was brill, bathroom soo clean and modern. Will return how could we not with the prices!! for two people we paid less…", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r176846430", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Location, location, location", "review": "This Hostal is pristine, very comfortable. The staff are lovely and our whole stay was great. We would recommend this to anyone who likes great service and very central location. We will be back next year for sure and have recommended it to all our friends", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r174368111", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Don't stay if you want to enjoy yourself", "review": "I recently stayed at hostel Arbil with three friends and work colleagues as we were attending a wedding.  The welcome was chilly but became even chillier after our first night. We had been out for a social able drink and returned chatting and in good humour.  The next morning we were given into trouble three times for making noise and threatened for eviction.  On the last day we left our luggage in the luggage room and we're refused access to a toilet as we had checked out.", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r170201888", "sub_review": {}, "travel_purpose": "", "rating": 1}, {"title": "Good value for money", "review": "We stayed in an apartment in March for a long weekend - their apartments are just around the corner from the hostal.  This is a lovely family run place, which is very clean and well looked after.  We have stayed several times, but are normally with friends so go for their duplex - this was the first time we stayed in the apartments, and I would recommend them.  It's like a perfect mini home from home with everything you need for a self catering holiday - not that you need to do any cooking with all the lovely restaurants and bars giving you free tapas . The apartments are right in the old town of Nerja, so close to all the bars but not near any noise.  The beach is 10 min walk away.  If you want a Spanish holiday that still feels like Spain Nerja is your place.", "date": "March 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r162883535", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good", "review": "Very good value nice and clean with all the usual amenity's  . The staff where always very helpful and obliging especially when it came to advice on where to go and see the best attractions .The breakfast was not the best but ok and very filling . We enjoyed our stay and can recommend this hostal for very good value at a reasonable price .Location was good and close to transport .", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r162601438", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Handy for bus station, garden at rear, clean basic rooms", "review": "Stayed for only one night after longer period up in Frigiliana - needed to get bus early following morning so was handy being less than 5 minutes walk to the bus station in Nerja. Nice basic rooms, very clean, comfy mattress and a small balcony. Not bad value at 36 Euros a night for a double room with private shower etc. Rooms at the front could be a bit noisy from kids on scooters and people wandering home from their night out so if this is an issue the rooms at the back overlooking the gardens would be a better bet. The gardens had some chairs and tables so if you want to chill out with a glass of wine without going out to one of the local bars then that's a bonus.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r161852370", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A very pleasant surprise when stuck for accomodation", "review": "We were staying in Nerja at the start of summer tourist season and, on the second night, were stuck for affordable accomodation. We chanced upon Hostal Abril and were very pleasantly surprised. An attractive hallway was filled with the sounds of children playing in the proprietor's private space. Our quiet room was very nicely refurbished with a good shower. My only gripe was that the bed was too soft for me, as I can get back problems. The location is near the regional bus stop, but a bit of a walk out of the town - perfect for us, but not for everybody. Overall, a very pleasant stay.", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r161057732", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "FANTASTIC!", "review": "My first TA review, not my thing usually to write reviews but feel the Abril deserves credit for lovely very reasonably priced accommodation.  Brilliant location in the lovely town of Nerja.  We were unlucky to have appalling weather last September for four of our six days so spent lots of time in our room.  Room service was very good about this and worked around us needing to be indoors (yes it was that bad!) I am about to make the return trip this May hopeful of better weather with my daughter for a week and am looking forward to returning to the Abril. Very boutique Hotel feel about and very clean. Thank you!", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r160772909", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great Little Hotel", "review": "Hostal Abril is situated 5 minutes walk from the center of Nerja and is very convenient. The Hotel only has a few rooms and is very quiet, it was great value at 33€ per night in April. Our room overlooked the garden which is available to guests. The room was large and comfortable and the shower room was a good size and modern, the only downside was that the shower tap was a lever type that you kept hitting against and turned the shower off. There is free wifi and also 1 secure parking spot at 10€ per day.  Would stay again.", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r159899869", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent little find !!", "review": "My partner and I stayed here for 4 nights having had our previous accommodation cancelled. And am I glad it happened.  Our room was ready when we arrived just before lunch. It wasn't big but it was clean and ideal for us.  Having read all reviews we were impressed with room, staff and bars / restaurants near by.  Cafe duque over the road is lovely and homely. Food and drink excellent value. Loads of lovely tapas bars close by - la taberna and the round bar. All in all an excellent short break and thanks to the Abril", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r159609963", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Better than I thought possible", "review": "I found this Hostal on booking.com  I have been to Nerja 3 times but never stayed in it. Love the town and normally stay with brother in law up in the mountains.  This time we decided it would be nice to stay in the town so I looked up a couple of places and after reading many reviews.. mostly good.. i chose this hotel. Firstly.. I thought it may be like a hostel as named Hostal and as an option on booking was a shared bathroom.. i chose private.. but still expected a hostel type place.  Wow.. was I surprised.  A beautiful entrance.. lovely host.. gorgeous stairs.. i was waiting for the bad part.. up two floors to room 104.. gorgeous!  I don't know if all rooms are the same but i think they are similar.  Decor was black and white.. the bathroom deep brown and all very modern. …", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r158891670", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent value", "review": "Modern,v. clean and friendly, but what value for money.Parking an issue, but if you know Nerja there are free places but not many and not near the hostel. That said I really recommend the Abril.They provide internet and WiFi, as I stayed five nights the price was reduced without me asking. Very convenient for the centre and bus station if you need it. Ten mins from Auto via.", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r157538324", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "A Wonderful Spot , A Place to Return", "review": "We came to Nerja for 1 day and 1 night and fell in love with Nerja and with Hostal Abril.  Hostal Abril is one of those places that you do not realize how wonderful a place it is until you step inside. It is family run, warm and inviting, and the location is perfect. There is a beautiful garden where you can sit enjoy the sun, read a book or just snooze. We were on the top floor with a large very comfortable room and a balcony that was well situated. There are many restaurants, very close and a great place across the street for breakfast. The family does everything to ensure that your stay at their hostel and in Nerja is a time you will never forget. Hostal Abril puts you in the middle of everything, and the to the staff you are evrything. Our place to return. My 5 star rating.", "date": "March 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r157451169", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very convenient for transport and the main tourist area", "review": "This was a return stay at the Hostal Abril. The one bedroom apartment is very clean and tastefully furnished. I was pleased the initial difficulties.with the Wi-Fi connection were resolved (a problem with the router) Some minor maintenance required in the kitchen but did not cause me any problems. Likewise there was no washing machine but as I would not have made use of I had no reason to complain.", "date": "March 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r156040365", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Superb little place just a few minutes stroll from the heart of the old town.", "review": "We stayed for 4 nights 23rd to 27th January. We already knew that the location was good as we had noticed it on a previous visit to Nerja. It's just a couple of minutes stroll in one direction to the main bus stop for Malaga, Frigiliani & Nerja caves and a couple of minutes the other direction to the heart of the old town with its abundance of restaurants and tapas bars. The decor is very sophisticated, giving it the feel of a boutique hotel. Our room, which overlooked the rear garden, was very modern with ample wardrobe space, flat screen tv, digital safe, kettle and small fridge. which was handy for milk and water. One very minor niggle was the lack of power sockets which meant we had to unplug the bedside lamp and fridge in order to charge mobile phones/camera batteries. It…", "date": "January 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r151038668", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Lovely Hostal with boutique hotel feel", "review": "This is as pretty as it looks in the photos.  Located a short (200m) walk from the main bus stop so great if you are feeling brave and use public transport - which is really EASY from Malaga airport (just over 6 euros each way instead of 30 for pre booked transfers)  The family speak a little English and are very nice.  The rooms are just like a hotel, cleaned daily - fresh towels.  FANTASTIC shower!  We were in 104 - there is a secure safe in the room.  I have one criticism... as I think the room could benefit with a chest of drawers as there is a nice fitted wardrobe and bedside tables as well as a nice big mirror.  There is a small balcony and the patio door has shutters which is brilliant as we slept in until 0930 or later as the room is pitch dark - I wake when the light…", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r143543079", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A good place to be", "review": "We booked a 3bed room for 2 nights. The room was clean and the beds were comfortable. The Hostal Abril is good located. The stuff is friendly but speaks little English. If you come by car, you have to park it in a garage near the hostal. We can recommend the Hostal Abril for a short stay in Nerja.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r141661071", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Very nice place for a (short) stay in Nerja!", "review": "Stayed for the first time in this Hostal and we'll go back for sure! Clean, modern and cosy, a 5 min. walk to the 'Balcon de Europa' and close to many bars and restaurants. Friendly staff, a nice little garden, free wifi... For me this is not a 2* Hostal but a 3* Hotel!", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r139485228", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Happy stay!!", "review": "I booked hostal Abril for one night and u just travelled by myself, can't believe that they offered me an apartment!!! Oh my god! It's really amazing!! The house is very very cozy and comfortable!!  Everything is perfect in the house but the wifi !! I can only receive the wifi signal in the living room! The bedroom have no signal at all!! The location of both hostal and apartment are close enough to the bus stop and balcony of europe !!  I like hostal Abril !  Good value!", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r138664517", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Clean and friendly.", "review": "My wife and I stayed here for the firt two weeks in July . We had a room facing the narrow street to the front. The room was small but it was cleaned every day , towels changed etc. the shower was ok for me as I am tall and slim, but if you have a weight problem , as in ,a wide girth, then the shower would be a wee bit tight. The people who ran the Hostal were very helpful and friendly. And we could use the wi fi free of charge, we also had air con ,free. And a small safe in our room,also free. To the rear of the property was a lovely garden where you could just chill out on the sun beds or or there were several seat and tables. We found the Hostal perfectly situated for all the bars and restaurant ,but just far enough away from these places that we had no noise problems. We…", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r135687997", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Hostal Abril", "review": "During May we toured Andalucia and stayed at a variety of hotels; hostal abril was clean and basic, good value for money, parking was non existant although we could unload and load the car from a few metres away, we then found a free car-park for the rest of our stay.  Don't expect wifi it was hopeless!  Nerja is an excellent resort, the Balcony of Europe is stunning, fantastic views, hostal Abril was a 10 minute walk from the beach, in the old town.  We liked the tapas bars especially La Biznaga in the square next to the church, excellent wine too.   When staying on a room only basis it's ideal if you take a travel kettle and tea bags, maybe its an age thing!", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r131757885", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Poor wifi，unfriendly service", "review": "Good location near the bus stop and the town, good price.   Limited facilities in the room, no refrigerator nor litter bin in the room. Poor wifi even in the lobby. There is a bad smell in the room and a bit dirty, it is itchy after stay one night.   The manager who can speak English is helpful but the reception lady in the morning seems don't know English and show us another bill which charge us €7 more. ", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r129551373", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Excellent value and impressive quality.", "review": "Despite only staying for a couple of days we were so impressed by the friendly, thoroughly professional quality of this \"little gem\". The owners could not have been more helpful, going out of their way to meet any requests. The cleanliness was second to none, absolutely perfect with regard to towels, bedding and the cleanliness of the rooms and throughout the whole place, including the charming outside private garden. We wished we could have stayed longer. The bathroom was absolutely spotless and the best shower I have experienced anywhere ever! Free wi-fi was also a bonus. The location is perfect for anyone wanting to be in the town centre with access to shops, bars and restaurants. The Balcon is just a short walk away, also the bus station. There is an area for loading and…", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r129444409", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "gem", "review": "i have stayed in a lot of hotels in nerja so i gave this hostal ago what a little gem very good value  the room had a heater .aircon/ safe hairdrier new tv and balcony nice bathroom. towels changed every day and cleaned it is near the bus station so you can get into malaga the caves  and local towns 2 minute walk away.  the beachs bars cafes are all nearby the balcon 5 minutes walk its not noisey  it also has a nice garden", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r128598702", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "a little gem in the centre of nerja", "review": "just come back from a 1 week stay in Apartments Abril, the location was fantastic just a short walk to nerja centre,lovely restaurant just opposite El nino's , the apartments were spotless, excellent value for money,the Spanish lady who owned them was really lovely, a added bonus was the free WIFI. Would definitely stay again when in nerja.", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r127863742", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Exceptional value", "review": "I have stayed at the Abril several times. It is always spotlessly clean and represents exceptional value for money being ideally placed for access to the town centre/balcon de europa. It is also very convenient if you are travelling by bus from the airport (the stop being about 50 meters away). Rooms vary in size with the largest on the top floor.", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r120306284", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Spot on value for money", "review": "Stayed here for a week at the end of August 2011 - beginning of September 2011.  We stayed in room 103 which is pretty much directly above reception.  The room and bathroom were modern and spotlessly clean with air-con.  The room was quite small but this wasn't really an issue for us and we only used it to sleep and get washed and dressed to go out.  It has a very comfortable proper double bed (not two singles pushed together).  The room was cleaned everyday and towels and bedding were changed.  The flat screen TV (on the wall) was all spanish TV (as you would expect - no english TV channels).  The location is pretty much spot on with the nightlife being about 5 mins down the road.  We had a tiny balcony over the street which was nice.  We didn't notice any problems with noise…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r117826585", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent holiday in Nerja Hostal Abril", "review": "Good value & clean accommodation. Quiet street 5 mins from main shops & bars. 20 mins from Playa Burriana. Staff friendly & helpful. Would definitely stay again.", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r117547766", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "fantastic hotel", "review": "This was such amazing value for money- we had a great room, with lots of space, lovely furniture, a fridge in the room and a great bathroom too. It was quiet and felt very safe. It was very close to the bus stop we got off at from the airport too, which made our trip simple and much less stressful! It is also just a very short walk down to the main streets and seafront.   Altogether lovely! I think we got free wi-fi in the lobby too and were welcome to sit on the sofa there when we needed to.", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r116772954", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Clean, simple and ... loud", "review": "I was in Nerja at the beginning of April, so not in the peak season. Nerja was quite full of people anyway, so i guess in August could get a little bit stressy. April was OK. We got a studio on the second floor, in a separated building about 200m away from the Hostal Abril itself. This second building was in a bit smaller street, called Calle del Almirante Ferrandiz, and this is maybe an advantage. However, the location in the Calle de la Pintada has a nice internal garden and most of the rooms have a balcony. In our building we had no garden and no balcony. The room was quite simple, recently renewed, very clean and quite confortable. The problem is that in this part of nerja you have to deal with a lot of noise from cars and motorbikes till late in the night. And to find a…", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r116332284", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Very great location for beaches", "review": "We stayed three nights in a double room and were very pleased. The room was rather small (with two suitcases, there was not many space left to walk around), but nonetheless it was ok. We were not there to spend the day in the room, but on the beach and in the sea, so it did not really bother us. The location is very great: a few minutes walk from the bus stop and a few more minutes from Balcon de Europa and beaches. It is quiet (even in rooms on street side) and spotless. The staff is very courteous and helpful.", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r115684455", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent place in Nerja", "review": "We booked a family room - imagine our surprise, when the door is opened, and we see 6 beds while there were only 3 of us. I had to reconfirm that nobody else was staying with us. (:-)  The hostel is totally renovated and the bathroom was huge. The location is excellent as you are 10 min walk from the Balcon de Europa and 2 min walk from the bus station.  We ate at nearby Pacomari restaurant which I highly recommend.  Overall, this was a very pleasant stay and definitely recommended.", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r114743477", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great cheap hostal/hotel", "review": "Got a room for €65. turned out to be a 2 bedroom apmt! Good location, but really nothing is far. Only complaint was that there was no Internet except for the main location (there were 3 abrils)", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r110602761", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Great Value accommodation", "review": "Stayed for 3 nights March 2011.  We found it to be everything that we had hoped for and a little bit more for the price and 2* rating.    The hotel is located for an easy walk down into the centre.  Our room was clean, modern looking with a tiny balcony over the street.  Comfy bed.  Kettle in the room with some tea bags.    The rooms are not very big, neither is the shower but then this is the budget option.    There is no parking at this hotel, but we did manage to find free parking not too far away under the guidance of the reception staff and we were travelling light so it was easy enough to get our bags along the street.  Parking looks like it is a issue throughout the town.", "date": "March 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r100456182", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Clean budget hostal", "review": "If you are looking for a place near Bus stop, (where you can take bus to Frigiliana, Cuevas de Nerja, Malaga, Granada...etc)  this is one of the ideal hostal in Nerja. Balcon de Europa is about 15 min(or less) walk. Many restaurants and bar are around.  This hostal is on one of the main street of Nerja. 5min to Supermarket.    Room are newly renovated. They were still working on some of the rooms while we stayed.  IKEA kind of new interior.  Tea/Coffee/Kettle in a room.  Safe in closet. A/C and Heater panel are available. Everything was quite new and clean.  Nice family own hostal.   Reception is closed during night. Wifi is available but not higher floors. I was on 2nd Flr (room107) and receptionist already told me that room didn't get signal.  I had to come downstairs at…", "date": "January 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r95279461", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Family run friendliness, spotlessly clean, and fabulous, well-equipped apartment!", "review": "We requested an apartment for one night only a few hours before arriving on Saturday early evening (after staying in a remote villa for the week before), and thought we might be left with the 'dregs'.  What a lovely surprise when we were shown up the marble staircase to our rooms.  A double bedroom (with air-con), kitchen, bathroom and living area (with a small balcony), all fitted out brilliantly and spotlessly clean, at an incredibly reasonable price.    Check-in and check-out couldn't have been more straightforward.  The owners/managers/family were also flexible enough allow us an extra late Sunday checkout for only a few additional Euros, and one of the brothers helped us to find a parking space nearby - even offering to park our hire care into the tiny spot for us!  We wish…", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r78892727", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "good value for money, pity about the problems!", "review": "We got there late at night which wasn't a problem as a friendly staff member was waiting for us. She explained that the toilet in the one bed apartment we had booked was broken so we had to take a bigger apartment down the next street. This was fine except she didn't bring us to it only pointed in its direction. When we returned to the main building to pay for our stay it was hard to find anyone available. When we did find someone on our 3rd day we were asked would we mind moving to a smaller apartment as the one we were staying in was meant for a family. We didnt mind and agreed to move the next day and also to pay then. At 11 o'clock the day we were supposed to move a member of the staff knocked on our apartment door and when we didnt answer she unlocked the door herself and…", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r73827358", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Best Hostals ever.", "review": "What a Hostals, we where offer a 4beds room or 1bedroom appartnemt,we took the 4bedsroom,wauw at the toopfloor. No hiss but okay. The room had what we want.  Clean and nice. You can make the,coffee,only you have to buy coffe first,but supermarked is on Calle Miguel just across the policestation. We will stay there again.", "date": "June 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r71018800", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good and bad", "review": "A few things. There is another Hostal Abril just five minutes walk away (owned by the same people) from the Calle Pintada one so do not mix them up. Second; the street outside often has fast moving traffic using it so if you have young children, make sure they do not rush outside. It is not near the centre of town as Nerja has no centre as such.  No lift. Like many Spanish hostals, the room is like a hotel room, but at 23 euros a night, it is approaching hotel prices. Large double bed, separate bathroom, WC. Air-conditioning, small radiator. Kettle, 2 cups, tea-bags, sugar. Tiny balcony. TV with Spanish programmes only. Daily maid service. Traffic noise, mostly in the daytime, especially from loudly whining motorbikes (literally over a hundred a day).  5 minutes walk from the…", "date": "February 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r57392864", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Very Disappointed", "review": "We booked a two bedroom appartment to spend the New Year in Nerja. The owner was friendly and took us to an apartment in a block just off the main road (Calle de Pescia). The apartment was at the back of the building, so we were not aware of any road noise. It was generally well-equipped although the fridge stank and this tainted anything you put in it. Also there was no toaster and the kettle only boiled with a small amount of water. The beds were uncomfortable, and in one of the mattresses we found insects. I suffered an allegic reaction to being bitten from which I am still recovering.  We liked Nerja but we'll be giving the Abril a miss the next time we're in town.", "date": "January 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r53585249", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Great 2 bedroomed typically spanish apartment", "review": "Stayed in a 2 bedroomed groundfloor apartment - in a typically spanish townhouse in a residential street - exactly what we were looking for. Each bedroom had air condtitioning as did the combined lounge, kitchen, dining area. Full kitchen facilities were provided along with an outside courtyard with dining table & sunbed. Very clean & well maintained. Apartment was cleaned once, with bed linen & towels changed, in our 8 night stay. The apartment was handy for shops & restaurants with Burriana beach about 10-15minute walk away", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r46529868", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Excellent place to stay!", "review": "Lovely,  friendly hotel. Very clean and comfortable, with helpful staff.", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r40875894", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Much better than 2* would return", "review": "On arrival we were taken to our 2 bedroom apartment in another building in the adjacent street. We felt we were staying in a typical Spanish home. The furnishings were beautiful and comfortable. The air conditioning was the quietest and most efficient I have experienced. Close enough to walk to the beaches and the centre of the old town but felt very quiet and peaceful in the middle of August. Would return if revisiting Nerja", "date": "August 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r39786874", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Perfect", "review": "This hotel is a bargain. It is very clean, very quite, close to everything in Nerja and very close to the free car parking of the city. The staff was very polite and even tried to speak english!", "date": "June 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r33008970", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A very Spanish relaxed atmosphere", "review": "We have just returned from Nerja having stayed at Apartamentos Abril.  We stayed in the apartment 40 San Juan top floor. It was realy great we could not have asked for more. It was clean spacious had a lovely private terrace and is located minutes from the centre of Nerja. It took us10 mins on a hot day to get to the beach a very pleasent stroll going tiny bit hilly coming back.! Would recommend this family run Hostel to anyone they have put lots of effort into making your stay the best.", "date": "June 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r32701317", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Great value stop over", "review": "We just stayed at Hostal Abril for one night so we could spend the night in Nerja on New Year's Eve - we live about 45 minutes away.  Location excellent in that it's within a couple of minutes' walk from the centre with it's many bars and restaurants but also fairly quiet.  Also only 5 minutes' away from a large free carpark. The hostal seems to have been recently fitted out so eveything felt new and in good condition.  The room was small but perfectly adequate and the bathroom had a fabulous shower.  All spotlessly clean. Good security including a free safe in the room.  Staff were friendly too. Overall very good value for money.", "date": "December 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r23176123", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Loved the Hostal Abril", "review": "Exceptionally clean and well presented hostal situated in the   heart of Nerja.  Beautifully presented hostal with attention to fine details.  5 minutes to beach. Parking a bit of a problem. Owners run and manage this hostal and nothing was too much trouble.  Very good value for money.  On the downside - no tea/coffee making facility but overall, highly recommended.", "date": "November 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r21697191", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Lovely little hostal", "review": "The Hostal is a familyrun business, exeptionally clean and friendly people, would definately go there again. Rooms were very clean. On a main street through the samll town not noisy.", "date": "February 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r14446931", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent Hostal", "review": "Extremely friendly staff and incredibly clean.  Five minutes walk from the Balcon de Europa and beaches. Would highly recomend it. Also very reasonably priced ", "date": "April 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315917-d608295-r5333685", "sub_review": {}, "travel_purpose": "", "rating": 5}]