[{"title": "Pleasant enough ", "review": "We found hotel ok and parking on site was a real bonus and was happy to pay 10 euros per day . Staff were really friendly and helpful. My only criticism was about the beds . The bedding was paper thin and no mattress protector on . Also the pillows were not adequate for the beds and we asked for more . Our room was facing square and a bit noisy at night . ", "date": "November 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r726250642", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "An enjoyable stay", "review": "I was one of a group of 14 cyclists who spent 2 nights at the Coso Viejo in September 2019. Being an old building (originally a convent I believe), the rooms sizes and ease of access varied but my room on the second floor was fine.  It overlooked the street so there was a little road noise in the morning but it wasn't bothersome.  The breakfast was fine and better than most on our journey.  The front desk staff were very friendly and helpful.  The interior courtyard was a nice place to sit and chat, read a book or access the Internet. Our group was allowed to have a happy hour there one evening which was much appreciated. The hotel's central location is good for exploring Antequera and the Tourist Office is just 100 meters up the street. The bar across the street is a nice place to sit outside and have a beer and some food and wasn't noisy.…", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r721501702", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "September Holiday", "review": "Stayed at this hotel for 8 nights last September, whilst travelling through Andulucia it is a family run hotel and is from what I could ascertain runs very efficiently, the room was perfect overlooking the courtyard onto the Cos Viejo Square, I didn't have a problem with the noise/traffic as I block all that out at night time, there is a bar across the road, but again I didn't find it noisy at all.   The room was extremely comfortable I like a lot of pillows, but it was'nt a big hardship that I only had two ! - bathroom cleaned daily, lots ot towels provided, tea and coffee making facilities in the room, TV, air conditioning all worked fine, - there is a nice little courtyard in the middle of the hotel which was very handy when you were waiting to be picked up for tours/trips etc, the breakfast was typical continental, suited my needs as the coffee was the fabulous strong strong.  Very reasonable stay and felt very safe here, Definitely recommend and defintely return if I was going back to Andulucia.…", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r719079353", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Pleasant hotel", "review": "We stayed for three nights as part of a coach trip and we were told that this hotel was originally a Convent. The foyer was a lovely inner courtyard with a fountain a bit crowded with tables and chairs with the reception desk in the corner. We were on the third floor which involved getting the lift to the first floor and then walking around to another lift for the next two floors. The room and bathroom were adequate, clean and a good size with air conditioning but the beds we found a bit hard. We had a view of a wall from our window and the down side was at night there was a continual noise of something on the roof. We did not have a fridge in the room but we understand others did. Our continental breakfast as a group was in a room next to the reception which was slightly cramped but the food was good although we had to unwrap the hams and cheese ourselves and track down bowls for the fruit which the staff could have done before we went in.  The hotel has no bar and does not do food.…", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r717278165", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Very interesting old town, well worth a visit", "review": "  Hotel  has private off the road parking bookable in advance.  We had a fairly basic room on third floor.  Although there are two lifts there is some walking between them to reach the top floor, this could be a problem for anyone with walking difficulties.  Breakfast is served in the bar next door. Staff in hotel very friendly, you will need some basic Spanish here. ", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r710425186", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Pleasant hotel", "review": "The room was adequate, clean, decent sized bathroom and air conditioned. Our room was over the street so a little noisy when there was a lot of traffic. Overall a pleasant stay. They give you a coupon for a continental breakfast next door but we didn't find this out till after the fact so make sure you ask.", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r624305656", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great location ", "review": "I stayed in this hotel for a week. It’s a basic hotel but it was clean and the staff friendly. My room was at the front of the hotel and I opened my blinds every morning to the lovely Coso Viejo square. It does get a bit noisy at the weekend but if you carry a pair of earplugs that solves the problem. I was staying with a large group and my only criticism was where we had our breakfast. The food was laid out but there was no one overseeing the room. With the result that there were a lot of empty dishes left on the tables and the coffee and milk ran out. This was the only fault that I had with the hotel and I wouldn’t hesitate to stay there again if I visited Antequera. ", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r617602854", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Coso Viejo Hotel Antiquera. Spain", "review": "We stayed here as a base for visiting Granada, Cordoba and Seville. An ideal spot. The town is attractive and interesting with plenty places to eat. The hotel served breakfast only. The food was average. The rooms were clean and comfortable, but a bit noisy. We overlooked an interesting square with a good museum and a castle a short walk uphill. The staff didn't all speak good english...a good place to practice your Spanish. A traditional Spanish hotel . Not many amenities", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r583590220", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "quaint", "review": "Lovely old hotel built around a court yard - the rooms are small with limited wardrobe space and when the windows ans shutters are closed there is no daylight at all - air con is good but all rooms are very noisy as hotel in the middle of town. However if you can cope with above it is a great place to stay - central with lots of great tapas bars close by. I would certainly visit again. staff have little English - we only had breakfast which was good.", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r581099988", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Perfect to explore Antequera", "review": "Didn't stay here but the hotel was the second of two at which members of our tour to Andalusia could stay. Those who we met and stayed in it told of friendly staff and a perfect location from which to explore Antequera - a good family run, three star hotel. We had a look around the hotel and although we couldn't see every part of the building it certainly seemed welcoming and the lady on reception was really friendly when a taxi was ordered.", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r574592654", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Very friendly staff, nice convenient location, fun to look out on the square.", "review": "The woman at the front desk was wonderfully endlessly helpful in our one night stay. we loved the room looking out on the square. Convenient for the sites and for Arte de Cozina restaurant. Comfortable room and beds and all was good. nice old building.", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r566367921", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice and simple", "review": "Clean, airy room in middle centre close to Alcazaba. Possible to have a third bed in for our son. Breakfast (simple) in tapas bar.  Restaurant is in a basement which is not cosy at all. Food however is good. Own car parking. Very friendly.", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r563818117", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Ok - Just Ok", "review": "The bad bits - the hotel was a bit soul less, had no personality somehow.  Staff were friendly but didn't go out of their way to welcome you or give you any information.  Bedrooms were old and tired and contained the bare minimum and old dated furniture. Towels were small and quite thread are. If you have a room with a view (and we paid extra for that!!) overlooking the square beware of the noise! The road noise was terrible all night and the bells from the church was constant and the workman starting work early shouting in the street.  Every time one of us moved in bed on the marble tiles it felt like the beds were on roller skates, so not the best nights sleep!  I'd recommend an internal room - cheaper and quieter I would imagine, although reading reviews no windows and dark! …", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r554801535", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Dances with wolves", "review": "stayed early jan ( 2/3/4/5)  right in ceter of towm with its own parking  ( 10 euros) excellent cafe bars nearby..inexpensive...some rooms smaller than others but comfortable enough..we had what could have been the tardis in ours..staff helpful...breakfast next door in meson iberico  see reviews..  wolves outside tof town ,which attractive...will go again  bit cold jan so will try later in year", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r552186590", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Good value, charming building but some shortcommings.", "review": "This hotel is in the centre of the old town with great views from the road side. The building is charming with an open air patio and fountain in the middle. There is a friendly atmosphere. Both the times we have stayed it was very reasonably priced. The bedrooms are large, attractively furnished and comfortable with a large bathroom. The problem for us was street noise, the first time we stayed we were given an external room which has great views but a lot of noise from the street below, both traffic noise and people shouting. The second time we requested an internal room but were told there were no windows so we opted for a street room again but had the same problem. We woke a few times from the noise, especially a bin truck some time late in the night. The first time we stayed…", "date": "November 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r539874819", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Our third visit", "review": "This hotel and this town draw us back. The town is lively, has good shopping streets  lots of old buildings, plus the historic area with its castle and arches and a stunning view over the town.  The hotel is built around an enclosed courtyard. The inner rooms do not have views so ask for an outer facing room if this matters. The receptionists could not have been better.At the time of our visit there were roadworks close by but the hotel staff supplied maps and lots of information to help. However, the hotel has a garage and it is possible to walk about the town so leaving the car is a very good option!  Our room was a little dingy and could have done with more lights as it was an internal room.This said, everything else was fine and good value for money.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r536902173", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Stayed for a week with Travel Department", "review": "Clean, breakfast very reasonable quality, staff friendly room clean However hairdryer in the room had no cover over electrics did not touch should have been checked Would definitely stay there again despite the above problem", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r530315080", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Excellent location!", "review": "Excellent stay, the staff are friendly and very helpful, they're all bilingual Spanish/English.  It's very central for sightseeing or just finding good restaurants.  The rooms are a good size with a good size on suite, air conditioned, very clean with views onto a square. The furniture is of a traditional style and adequate and don't be fooled by the beds, we've had the best sleep in ages!  Breakfast is at the restaurant next door.  The centre of the hotel is a covered courtyard with a fountain, it's very relaxing and you can ask for your breakfast (or anything) be served there instead of at the restaurant.  No tea/coffee making facilities in the room.  A very happy stay!", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r513367178", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Best Value Escape in Ages", "review": "A 3 star, typically local hotel right on the centre of the old town in Antequera, Malaga province.   THE FIRST IMPRESSION was the genuinely warm welcome. From the ease of reservation directly with the Hotel, the recommendation to block out an extra day, the personal service in sourcing a seriously well presented bouquet of flowers and a fruit basket of local fresh fruit (amazing flavour of a perfectly ripening local variety), established the mood for our Anniversary.  I cannot say enough about the people here all promoting their passion of their town.   THE LOCATION is perfect for visiting the museum, a short track up hill to the Fortress, a swag of Churches and really authentic tapas.   A great atrium / courtyard in the middle of the building is the best place to chill, away…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r513358978", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Ok for a short stay.", "review": "We only stayed one night in Antequera and were looking for a cheap and well located hotel.  The hotel overlooks Plaza Coso Viejo with views up the hill where the Alcazaba is located.  There are many cafes and restaurants near by and it is easy walking distance  to many interesting sites around the town.   The rooms are very old style with no wifi and very simple furnishing, small bed etc.  It is very dated but was clean and acceptable for a short stay.   The staff were very friendly and welcoming. The hotel has parking at the rear of the building which is a big plus when traveling to these old towns.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r504422293", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Wonderful town, great location", "review": "I really liked this hotel, it ticks all my boxes: climate control, a powerful shower, central location and plenty of bars and restaurants around. In addition, private parking is available (10 per day). Staff was friendly and I liked the decoration of the hotel.  I don't have anything to complain about, but I must say I found the breakfast rather basic: hot drink, orange juice, toast, butter and marmelade. I find few things more disgusting than marmelade....but I suppose that is just me.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r499246693", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Authentic hotel in an authentic Spanish town", "review": "A no frills hotel but in an excellent location. Our room had two 'Juliet balconies' overlooking the much used town square which made it interesting if a little noisy. Spotless room which could do with some updating. The bath/shower wasn't the best idea since the glass partition didn't reach the side of the bath easily causing an overspill onto the bathroom floor. No rubber shower mats were available when requested - a dangerous oversight and health hazard. However the staff were very pleasant and the breakfast adequate.  Staying there for a week we also dined in the adjoining restaurant which was pleasant and extremely reasonable. Another point about the bedroom was the lack of decent hangers for the wardrobe, both for male and female use.", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r483425183", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good budget hotel", "review": "Our room was quite big with typical dark, Spanish furniture. It was clean with comfortable beds. It had a small fridge but no safe for valuables. Our room overlooked the busy street and square but with windows and shutters closed it was quiet. There's air con too if needed. The wifi in the bedrooms was sporadic at best!!  The breakfasts were very basic though there's a good restaurant next door. The foyer is cool though the chairs are only moderately comfortable. The hotel is right at the heart of this lovely town and area.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r483194015", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Average hotel in pretty town", "review": "This is an old 3 star hotel set right on the town square. Great location near all restaurants and sights. In need of a good refurbishment though. Rooms were cleaned everyday. Towels were substandard and need to be replaced. Staff were ok. Wifi had very bad reception in the rooms. I did enjoy my stay.", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r471658651", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Value and Location excellent.", "review": "Stayed here recently for three nights .The bedroom was fine with a lovely outlook over the Plaza. Staff were all pleasant and helpful . Restaurant next door served excellent tapas which were very reasonably priced . All in all great value for money. Many thanks to all.", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r471331884", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good value", "review": "Basic but it was cheap. Room was small but staff were very helpful when we asked for more pillows. You don't need an alarm clock, especially on a Monday when even the church bells are drowned out by the recycling and road sweepers. The restaurant is very good, though we didn't have breakfast. It's lively and informal for tapas or full meals in the evening, the pork in blue cheese sauce is sublime.", "date": "January 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r462283610", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Not expensive, not luxory but good", "review": "Little hotel in Antequera. Not so lux but not expensive. Our room was very gold when we come but luckely it get warmer for couble of hours. They had very good parking for the car!! Nice staff, one woman. Location very good. There was no breakfast but near was a good restaurant. There we satt in the evening for a beer.", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r443920511", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Warm room (good) and good location - but lots of bells!", "review": "Fine for a one night stopover. We had a forward-facing room on the first floor (so we had windows, thank goodness). We were on a cycling tour and we able to leave our bicycles in the inner courtyard.   Room, bathroom: clean and adequate. Bed not the best, shower ditto, but it was adequate.   Yes it was noisy, as others have said - external traffic, people, and internal noise as well. There are many churches here, and one across the road. Even on a Tuesday, there were a great many bells. It all adds to the atmosphere.  Didn't bother with the paltry breakfast (toast and coffee, with orange juice that 'isn't real'). Instead we headed for the Torfal Bar Cafeteria about three minutes from the hotel, where we had a proper breakfast. There are plenty of good choices nearby.", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r435515185", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Excellent location and good value", "review": "Coso viejo is a traditional Spanish hotel situated on the historic square.  It is the entry route to the Alcabazar - the splendid castle-fortress on the hilltop.   Rooms at the front have a square+castle view - worth asking for this when booking.  Breakfast is served in the (rather dark) next-door restaurant - we didn't take this. but found pleasant places in the town.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r433923541", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A week in Antequera with tours to 3 cities.", "review": "Just after spending a week in Hotel Cosa  Viejo as part of a tour.Its right in the centre of Antequera.The hotel is as basic as it  gets.Old,clean,authenthic.Plenty of cafés all around and none better than the one next door owned by the hotel.Great spot for a few drinks and tapas at night.A busy place.Our breakfast at the hotel was basic  but you would not leave the breakfast room hungry.The bedroom was comfortable.It was at the front and a bit noisy both from the street and the corridor but we managed to get a good night's sleep all the same. Would we stay here again,yes .It's a friendly,homely sort of place,nothing fancy.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r431954147", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A THREE STAR HOTEL WITH A DIFFERENCE!", "review": "I don't want to mislead anyone with this review, so, if only four or five star standard luxury will do, then this is not the hotel for you.  However, if you want to feel as if you had an authentic Andalucian experience this hotel delivers. The reception area is built around a courtyard, in the Moorish tradition, with a water fountain in the centre. It is a lovely shaded area in which to relax with a book, or to just sit with a cup of coffee watching the activity on the square. There is a coffee maker on a side table for guests to use, which the friendly reception staff can show you how to use (€1.30 per cup).  All the staff, without exception, are helpful, friendly and go out of their way to make you feel welcome. One lady at reception had a little difficulty understanding me…", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r429964208", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Ideal location, friendly staff", "review": "Hotel is ideally situated on a square in the heart of the town, just across from the museum and with views of the cazaba or fortress. Staff very friendly and anxious to do their best for visitors. Square can be a bit noisy on Friday and Saturday nights, if your bedroom is on that side. Rooms clean and perfectly adequate but not luxurious. Breakfast provided in the restaurant next door was not lavish, but we found it sufficient.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r427722102", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely hotel", "review": "This is a lovely hotel. The staff can't do enough for you. It is located not far from the town. The rooms where cleaned daily and we where getting fresh towels every day. The staff also put our freezer blocks in the freezer for us.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r407981757", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great place, amazing city", "review": "During July Antequera was very quiet, most of the people having left to the beach and overall the city having only a few tourists. This was only a good thing, managed to get a room with a very good price and was very happy with the service.  There is free parking available close to the hotel, the location is excellent in right in the center and there's a nice restaurant next door to have breakfast or dinner at the square after sunset.  Only a short walk away you can walk up the stairs to the hill to Alcazaba which offers fantastic views of this amazingly beautiful city and the surrounding mountaneous landscape.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r393580226", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Lovely Spanish Hotel", "review": "Nice helpful staff, lovely cool rooms, right in the middle of town, so well located for everything, well priced too, nice old square in front of the hotel, with a friendly bar for cheap drinks, well placed for a morning walk to the Alcazaba", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r392088435", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Nice and authentic hotel", "review": "The hotel is located directly on a little downtown square, close to some nice places to visit on walking distance. The hotel has a beautiful covered atrium with a big fountain in the middle. Rooms are spacious, small balconies, bathroom works but little waterpressure. Parking around the hotel is difficult, you will have to find a place a few streets down the road. Breakfast is provided at the bar/restaurant next door. Simple toast and coffee plus a juice.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r383614598", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Quaint Hotel and small city", "review": "The hotel was for nun's but updated too a 3 star hotel, but could be a 4 star. Very Clean, friendly, and comfortable, well placed in the centre of town on the church square, and quaint. Very central. A small tourist bus to take you to the castle, churches, places of interest. A tourist information centre on the same street. Do beware of a few rooms on the top floor do not have Windows so if claustrophobic check when booking. Food a little basic but very Spanish and tasty. ", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r377139082", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Quaint, great location, noisy streetside", "review": "\"Quaint\" describes this hotel.  Small but comfortable rooms. Friendly, helpful staff.  The location is great, right on a popular square in the center of town.  Perhaps too popular: the partying goes on until late at night, and rooms facing the square are not particularly well sound proofed.  At first it is charming to overlook the picturesque square, but by midnight it becomes a problem.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r376600456", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Central, facilities, breakfast could be better", "review": "The hotel is located in the city centre of Antequera. From our hotelroom you could see the fortress on the Hill. The rooms are quite old, but have all the necessities. The WiFi does not work extremely Well. The restaurant next door serves breakfast, it's extremely simple , but if you pay extra you can get more. We also ate dinner there, which was delicious.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r375799144", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "suitable stay", "review": "We only stayed here for one night and it was certainly not our favorite place. Parking was full (they have very limited spots AND they are 10 euro a night) so we had to park at the nearest lot which is nearly double the price and a few blocks away. We did not get breakfast because all that is included is coffee, juice, and toast. The room appeared clean but we found a sweatshirt in the wardrobe which leads us to believe that the room wasn't checked/cleaned as well as it should have been. The front of the hotel has a nice view, but it is a morning meet up for tour buses - so VERY loud early in the morning as the crowds swarm. Front desk staff was friendly and hotel has charm but I doubt we will be back.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r371290255", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Fantastic location and great hotel!", "review": "Ideally located opposite the old town square, this small friendly but very good hotel is ideal for exploring the old town of Antequera. The staff were always happy to help - although very little English is spoken, here or around the town either. My room was not huge but it had a great, typically Spanish, all marble bathroom with shower and big bath, and it was clean and serviced efficiently every day. The wi-fi worked perfectly. I had several friends staying at the Golf Hotel on the other side of town, paying lots more money...... I know where I would return to (and so do they now!). Car parking isnt easy, unless you use the hotel one, but the streets are all old cobbles and narrow, so lack of parking not a surprise. Dont forget to eat and drink at the Meson Iberico bar…", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r356249845", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Adequate hotel", "review": "This is an old, typically spanish hotel, right in the centre of Antequerra. The hotel is very clean and completely adequate and very close to places of interest. Do not book expecting a hotel similar to  something on the costas. The hotel is very spanish, with a great bar next door for breakfast.", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r354829220", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "A pilgrim walking the Camino Mozarabe.", "review": "I had a room with no view but a window looking down into probably some sort of heating or air conditioning which ran 24 hours a day.  It was like having a car motor running beneath my window.  The promised wifi in the room didn't work even after complaining about it, And there was no connection in the restaurant either!  Restaurant prices were ridiculously high!!  Plain food, fancy prices!", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r326682444", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 2}, {"title": "nighhtmare hotel", "review": "we were very disappointed  with this hotel. The 'public' rooms were fine but the bedroom was terrible. There was damp and plaster coming off the wall, the windows were at ceiling height so it was very gloomy in there and to see out you had to stand on a chair and then you could just make out the top of the church opposite. We were on the 3rd floor, got a lift to the 1st floor then had to walk down the corridor to find the other lift up. We went in the bar that is attached to the hotel (although it has a differnt name it can be accessed thro the dining room and the staff in hotel and bar are the same. In there they ripped us off by charging 15e for a bottle of house wine and freely admitted it was because we were  English! (although we all live in Spain and speak spanish)", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r315030302", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Coach trip", "review": "On checking reviews of your Hotel thought I  was going to be disappointed (not at all)very clean,very old but gave it character. The room allocated to us overlooked the Square, delightful.  Food wise, breakfast was adequate evening meal ample and very tasty.Regarding the Staff they could not do enough to make sure your visit was enjoyable.  We stayed 3 nights, would stay here again.", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r314313688", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very central fantastic boutique hotel", "review": "The hotel was wonderfully situated overlooking the town square, shops, bars, cafes and restaurants right on door step.  Breakfast was basic, but I liked the breads, yogurt and fruit each morning, hot chocolate from machine was tasty!  Rooms were very clean and comfortable.", "date": "November 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r296441417", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Fantastic hotel for the price", "review": "Due to the very low price paid we were a bit sceptical about this hotel, until we arrived, when we were very impressed. We received a warm welcome in the pleasant reception of this centrally-located hotel. Parked next door for E10 extra. For a paltry E35 we were given a twin room with a spacious modern bathroom and an amazing view over the Plaza Coso Viejo and Alcazaba. The room wasn’t huge, but it was clean and well set out, had a mini bar, TV etc. and did I mention the view! We did break out the ear plugs due to being above/opposite a couple of lively bars, not a problem. Didn’t bother with breakfast but there’s a nespresso machine in reception where the staff will knock you up a very decent coffee instead. One of the best value hotels of our trip.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r284674910", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Mrs", "review": "Very basic hotel in the centre of Antequera. The room had on suite with shower over bath and also bidet. The room was small but clean with a single wardrobe that was stuffed with extra pillows and blankets so no room to hang clothes. The breakfast was poor and very repetitive. We did have one evening meal which was acceptable. The advantage is being in centre of town although a bit noisy at night (take ear plugs)! Difficult to communicate with staff as they don't speak English.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r274775867", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Average ", "review": "Hotel is okay, location is excellent Rooms are small and the hotel is quite old, bathroom is acceptable but outdated. Breakfast is below standards for what you can get in Spain. Would not go back there, sorry. Town is nice however and there are excellent tapa bars nearby", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r268931800", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Only for the location", "review": "We stayed here for 3 nights and other than having a good location in the old town, we were quite disappointed as there could be such potential with the lovely building.  Our first room smelled like a Dublin pub before the smoking ban...Our second room was dark and dingy with a broken TV and fridge....and was pretty uncomfortable.  We did not eat breakfast at the hotel as there are good options nearby.  Staff were friendly and polite but we wouldn't stay here again....", "date": "January 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r255442019", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Not a three star hotel", "review": "We stayed here as part of a group and were really disappointed with it. On the plus side the location was excellent and the bedroom was clean, on the other hand it lacked basic facilities such as decent towels and lights that worked. The public areas were freezing cold, the staff wore overcoats at all time. Forget going for breakfast it was a joke! Go elsewhere .", "date": "January 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r247844672", "sub_review": {}, "travel_purpose": "", "rating": 2}, {"title": "Strange goings on...oooh ooohh ooh oohh", "review": "A pre Christmas tale... This hotel we booked through Expedia.  The booking did not say anything regarding if cancelled reservations, this Hotel would still charge us the whole amount. We were suppose to pay up when checking in. Due to impending change of travel plans I phoned to enquire about cancellation. They told be to refer to my agent. Tried cancelling through Expedia Website. Unable to. Had terrible difficulties. Phoned the next day spoke to Coso Viejo.  After ten minutes on the phone they couldn't find my reservation? So all very twilight zone... Coso Viejo still charged us for the full amount THE DAY I booked.  Expedia were excellent they have promised full refund. Scrooge still alive and kicking in this part of the world...", "date": "November 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r244581595", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Location the best - but that's all!", "review": "The Hotel was in a great location and had adjacent private parking. We ate Dinner in the Hotel Restaurant, the food was good, prices were reasonable. You must try the 'Tarta Abuela' - called 'Grannies Chocolate Cake in English. Advertised as a three star hotel, even though we booked this Hotel in advance the bedrooms we were assigned were nothing like the ones pictured on the Booking.com Website or on the Hotel's own Website. The rooms which were on the first floor were small and looked out over rooftops. They were dark and dreary. In the first room the safe did not work, there was nothing in the minibar and the mattress on the bed was thin and not very comfortable. The second room had a ladder which you had to climb if you wanted to open the window. The bathrooms were adequate.…", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r238067354", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Clean, nice, great value.", "review": "We just needed a place to sleep one night in our way to Almeria and someone recommended us this hotel: has a great location right in downtown, plenty of restaurants around, rooms are very clean but a little small...of you go with kids. Great value for the price. Great service, nice people.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r234654731", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Beautiful old hotel", "review": "Great location in centre of lovely old town square. Beautiful old spanish hotel with light filled central atrium for breakfast and relaxing with lots of marble, dark wood and a large fountain! Room was slightly on the small side but well furnished and spotless with lovely bathroom.Very comfy bed. Usual continental Breakfast was OK, could have been better supervised, tended to run of of juice, bread etc and had to be chased. Staff very pleasant and helpful. Antequerra is  in the hills, one hour by coach from Malaga Airport. Well situated base for travel to Cordoba, Grenada, and Seville", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r232281528", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great little hotel and excellently placed", "review": "We have just returned from this lovely little town after staying for a week on a breakfast and evening meal basis. The hotel is excellently placed in the very heart of the old town and all attractions are easily reached on foot. The room that we were allocated was a little on the small side but not to the point where we struggled. The room was cleaned and restocked every morning. The breakfast was OK but could have been a little more varied - a small selection of cereals, ham, cheese and toast. The evening meal was always good but not always what we were expecting as we were given a week long menu and it often changed daily. The menu would state that the main course that day would be fish and the waiting staff would then serve chicken. Not really a problem but we were never sure…", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r232016286", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "For the price, this is fine", "review": "There is too much complaining about this hotel. What is one to expect for 45 euros for a superior room? The view from our room is unsurpassed. The room was spacious, clean and reasonably comfortable except for the paucity of the pillows.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r231252051", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good location & fairly priced", "review": "We stayed for one night. Would probably say that was enough for us as the bed was not the most comfortable, but at 35 euros we couldn't complain really. The hotel is situated in the centre of the town and opposite a lovely plaza. The reception staff were friendly enough. Car parking was secure and off road at 10 euros a night. Book in advance as spaces are limited. We would recommend the bar next door for breakfast and dinner.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r229754907", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "great location true Spain", "review": "lovely central location for this hotel room 115 great view of square Food good breakfast could be improved ie more variety of cereal Unfortunately on our visit while the boss was away they decided to do some drilling at the wrong time !!!!!!!!!", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r229673695", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Cosy Coso", "review": "This hotel is in a good and relatively quiet location for exploring the sights of Antequera and beyond. It is built around a traditional Andalusian-style inner courtyard and features a fountain. The smallish double room was adequate for the needs of my 4-year-old daughter and I during our five-night stay. At 92€ for five nights, we couldn't really complain. However, I had to stump up 10€ a night for parking, which obviously pushed up the price. This is not uncommon in large Spanish towns and cities, as on-street parking is very limited. The restaurant was only open for breakfast, but we had that and our tapitas mainly at the excellent Meson Iberico Dehesa Las Hazuelas next door. The staff were very helpful throughout. Only real complaints were the occasional noise from people…", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r216561248", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great position, reasonably priced, but....", "review": "Great position, which is why we chose this hotel. Really cannot complain at the price we paid - 29€. Initial thoughts on entering the hotel were really hopeful...the staff were helpful, and we did fall for the 10€ parking, which we need not have bothered with, as it was quiet, being February. Bathroom was lovely and clean, and plenty of boiling hot water (beware!), but the beds! I hardly slept - the pillow was like a marshmallow...and I had a bit of a shock when I wento to get out of bed - swung my legs over the edge of the mattress, and the bed virtually tipped up on it's side, with me on the floor! The mattress had 'walked' on it's flimsy base during my couple of hours dozing (I can't say I slept, because the person in the next room sounded as if he was in my wardrobe). But…", "date": "February 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r193159111", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Location cannot be bettered, but ....", "review": "I stayed 20 minutes walk from the centre one night in pouring rain, so decided to stay here, which is next door to an amazing bar - Las Hazuelas on Calle Encarnacion. For the price (€39) it was good value, and room 115 had a great view of the plaza its in, and the Alcazar. The heating worked fine - it was needed - but the overall feeling is of darkness and ageing. Breakfast had to be next door at Las Hazuelkas, which was great. Wifi works everywhere, reception staff wee great, parking €10 overnight in a town where parking is difficult.  I just wouldn't want to stay here more than one night. Except I'd be next door to a gem... !", "date": "January 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r191214717", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Good central hotel", "review": "I stayed in this hotel for three nights with a group of 48 people.  The staff are very friendly and helpful.  The rooms are a little on the small side but for three nights it didn't matter.  They were very clean as was the bathroom. The hotel restaurant and bar is next door and the staff there are very good. The food was quite adequate in that they were catering for a large group.  Four of us had tapas at lunchtime which was excellent. The wine is a little on the pricey side if you are not drinking the usual Spanish tipple of red wine, which was excellent. I would definitely stay again. It is very convenient for exploring the surrounding towns and villages.", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r182570727", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Fantastic location not matched by all the facilities", "review": "Stayed just one night. We had difficulty finding hotel but staff member came outside hotel to identify. Parking is an issue because of such a central location. We hadn't reserved so can't comment on the hotel parking. We parked in free car park about 10 minutes walk away so unload outside hotel and ark car.  Reviewer of 18 July gets most of my points spot on, but you must remember this is a 3 star hotel. Breakfast was only €5 which was excellent value we thought. Room was 114 overlooking square. Great view but noisy. We had evening meal in restaurant below owned by hotel and were very satisfied. Only food on hotel is breakfast.  Room was advertised with a safe but we didn't have one.  Room was small but remember you only pay small price. We might come back but have to admit I…", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r179843315", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "In you wanna sleep, forget it.", "review": "The “Coso Viejo Hotel” is a three star hotel located in the city center, facing one of the most beautiful squares of Antequera. Despite its old abandoned appearance, the interior doesn´t lack quality facilities, especially the bathroom, which is well decorated with marble elements. Some rooms face the square, offering great views, and other rooms overlook a courtyard. The hotel has no meal service and it offers the possibility of parking service within the building for 10 € a day. You can also enjoy a free wireless internet service. The price varies according to the type of room, but it´s about 40 euros (50 with parking service). We paid 55 €, as we chose the most expensive room. Maid service is correct and the staff is helpful. With these features, it would seem that the Coso…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r167447006", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "A good hotel for 1 or 2 nights", "review": "The hotel is clean and the staff are very friendly. Nicely situated in the centre of Antequera and handy for visiting the castle and museum. The only downside is the Breakfast,very basic and no hot food. There is a restaurant/bar next door belonging to the hotel that does evening meals and tapas during the day.The staff are very friendly but do not speak a lot of English. The twin room that I stayed in was adequate with 2 comfortable single beds and the bathroom had everything you require,including plenty of hot water.Air conditioning is in every room.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r161693828", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good location, beautiful lobby, really shabby bed", "review": "From the lobby, this hotel looked like it was going to be a winner. However, the room itself was quite disappointing. The bathroom was fine, but the bed was just atrocious. My husband actually had to check and see if there was indeed a mattress, because it honestly felt like sleeping on just springs. With a change of the mattress and pillows and better breakfast, this place could be nice - it has a great location. However, the reason you come to a hotel is to sleep, and we could not do that here. ", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r161664928", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Good for a Short Stay", "review": "Stayed here recently. The twin room(205) was well equipped and good value at less than 100 euros for the three nights via Booking.com. The reception staff were excellent, helpful in every way. Right in the centre of town and with a delightful square opposite ideal for an informal evening drink and bite to eat. The hotel has a peaceful and pretty indoor courtyard with secure parking at the rear(10 euros per night). Give breakfast a miss. Whilst only 5 euros service is chaotic and other reviewers have highlighted the poor offering. Much better options at a few restaurants up in the town especially opposite the church. However we did have our first evening meal in the restaurant and the Dried Fruit and Smoked Salmon salad was superb and great value at less tha 10 euros.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r161091018", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Mediocre at best", "review": "Reception is nice, good location within 100 meter of tourist information / city center (bus terminal is some 20 minutes walking away, train station further), staff was helpful. Single room on the top floor did only have window (and a small one) in roof so the room was kind of claustrophobic (but I did choose the cheapest room), wifi was available in hotel, but did not reach room.   Breakfast was just a dry baguette with package with butter and jam, I advice going to one of several cafes around for better and cheaper breakfast.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r159896869", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Forgettable", "review": "Great location on an incredibly beautiful square in incredibly beautiful Antequera. The hotel also has a very pretty inner courtyard with arches and a babbling fountain. Here ends the charm. Otherwise the hotel is no more than \"ok\", I'm afraid. I had to stay 3 nights, but was stuffed in a dingy back room with hardly any natural light, a view of generators and chimneys etc and the loud rumpus from the kitchen well into the early hours of the morning. The breakfast is an abomination - 1 cup of coffee and 1 hard packet rusk with a choice of a container of jam or a tomato. I asked for a glass of orange juice. It came eventually. I fear I will be billed for it tomorrow, when I leave. It is also served in a dingy, windowless basement. A really dreary start to the day. So I decided to…", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r158494638", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 2}, {"title": "Great Location, pity about Breakfast!", "review": "Just back from a week's holiday in Antequera with a tour group. From a location point of view I was very pleased I picked the Coso Viejo to stay in, as I was travelling alone (though part of the group) - right in the heart of the town, close to the sights, cafes, bars and shops. The hotel was clean and staff were helpful - the only fault I found with the place was breakfast - it could only be described as chaotic and unpredictable! I'm not fussy and a coffee, juice and toast are fine by me.  But from one day to next I was never sure if I'd get all 3. One day the toaster is broken, the next the coffee is cold and like tar!!.... Having said that if I was to return to Antequera I would stay in Coso Viejo again - but maybe go out for my breakfast!", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r158012211", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Coso Viejo", "review": "We liked the location of the hotel. it was right in the center of Antequerra and infront of the hotel was nice central square where we found an interesting museum.. Also the historcal sides of Antequerra were close. The stuff was very freindly and helpfull and spoke a rather good english. Especially the young man, who recomendet us a great restaurant! The rooms unfortunatly were not according to a 3 star hotel. They were a bit poor furnished, there was not even a banch for the luggage to store and my husbands bed nearly broke. The pillows were very thin and old so we had to ask for more and better pillows. We got addionell pillows. The breakfast in the restaurant was very poor as well .Alltogther I must say the hotel dos not deserve 3 stars. I would qualify this hotel as a 1 ore…", "date": "January 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r150603370", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Big hotel in classic old building in centre of town", "review": "In front of the hotel is a nice central square and its close to the historical sites of Antequera.  Inside is a maze of corridors and a number of elevators leading to the many rooms.   Staff was friendly and spoke reasonable English.   The room was OK with a large TV with some non-Spanish channels like CNBC and Euronews (French).  Free Wifi intern worked at  a low speed in my room (300kB/s download)  There was a clean bathroom with a tub.  There was an irritating buzz in my room probably caused by ventilators from the kitchen below because it stopped later at night.   Parking is difficult in this type of cities. The hotel has its own car park but that is of no use when you arrive and you don't know where that is. So I have parked my car in one of the parking garages near the…", "date": "January 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r149606720", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "poor evening meal", "review": "stayed here at the start of september our hotel was changed to this one at the last minute we had decided to pay  extra and go half board instead of bed and breakfast this was a mistake as the choice of food was limited and not very good and the restaurant staff attitide was that we were a nuisance  breakfast was adaquet with a fair choice the hotel itself was fine and reception staff very helpful we had the impression that the hotel did not usually cater for evevning meals for tour holiday we felt we had wasted our money on the evening meal as twice we ate elsewhere to get a decent evening meal", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r141589112", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "great hotel helpful staff", "review": "this was our 2nd time of staying, great location with a lovely place to eat next door. Staff all spoke english and were very helpful. Hotel had it's own carpark. Being opposite the square was not a problem. We will certanly stay on our next visit in November.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r139929168", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Hotel Coso Viejo comes with lots of 24 Hours Free Parking nearby.", "review": "Hotel Coso Viejo is okay for frequent travellers. Situated in a prime City location and prices are reasonably.   But, avoid the offer of Hotel Car Parking for Ten Euro a day. It is obviously an old stable in this narrow street and you are unable to get your modern size car, in or out or around the place. You are wasting a lot of time and a big risk to your car.   Tip on arrival: Park your car on the pavement opposite the Hotel, unload your luggage and check in. Continue down the Street, turn right at the second street, Callejon de Urbina, and you have a huge 24 hours Free Public Parking Area in front of you only five minutes walking from the Hotel.  Don´t be surprised if you hear a knock on the door as late as 4.00 PM. when you are having a little nap after your sightseeing. A…", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r138783855", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Nice hotel, good location in Antequera", "review": "This was a great little hotel right in the center of Antequera. Rooms were pretty basic but nice and so was the breakfast. Overall very good value. I thought the staff members were all extremely friendly and helpful although communicating in English was a bit of a challenge. I would definitely stay here again.", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r122014427", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Could have been better", "review": "We stayed a night at hotel Coso Viejo on our way to Sevilla. We noticed that the receptionist wasn´t in a good mood, when we arrived. The hotel is in the centre of the town, we just crossed the plaza and took the stairs to get to the castle. The hotel was nearly empty, but we got a room right next to the elevator, so we put the bed away from the wall. Our room is good and clean, not so spacious. The patio is really lovely. We booked a parking, but we got the smallest space, difficult to get in with the car and get out of the car haha... The receptionist wasn´t helpful because she said. ¨I have a bigger car and have no problems to park at that spot¨. So after the unfriendly manner of the receptionist, we decided to have our dinner and breakfast in town.", "date": "November 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r121544478", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Too bad about the personnel", "review": "The first impression of the hotel was, the location is good and the reception / breakfast area looks nice. When you pay for a hotel you expect to deal with friendly personnel though and the woman at the reception just was not that friendly. The parking places in the hotel parking are very tight and are better to be avoided. The room was clean, the bathroom quite nice but the view was a wall just across from the window and the mini bar was empty. The relation price / quality was not bad but just because of the personnel I would find another hotel the next time I want to stay in Antequera.", "date": "November 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r121360740", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Central location", "review": "Dear Customer   Firstly, we have just received your comments about your recent stay in our hotel and we just want to apologyze for any inconvenience you have suffered. Our main goal is to fulfill our customers´ expectations, therefore, the adequate measures have been already taken in order to avoid this kind of unpleasant situations. On the other hand, we want to thank you for choosing our facilities during your visit to Antequera, and we hope you do again on your next visit.  Merry Christmas and happy New Year  Kind regards,   The Management", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r120581821", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Hotel Coso Viejo Antequera Spain", "review": "The Coso Viejo is not plush; neither is it stylish. But it may well offer all a traveller needs in the attractive old town of Antequera. We arrived disgracefully early at 10.00am, but they still found us a room straight away. It was not the last word in comfort, but it was more than adequate. The hotel itself has a lovely tiled internal courtyard, which is where the reception area is and where breakfast is served. Its situation is ideal, as it is set opposite the quiet square where the town museum is. The town's main attractions are all easily accessible from the hotel (the Carmen church and the Alcazaba by foot, the dolmen caves by car). The hotel has, unusually for Spain a spacious car park which, doubly unusually, seemed to be empty when we were there; and it is next door to…", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r119400603", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Well situated", "review": "Overlooking a pretty square in Antequera, this hotel has a pleasant inner courtyard and has clean rooms, decorated in a traditional Spanish style. Unfortunately, the staff are not the friendliest and we had a room which was between the lift and a ventilation shaft going down to the kitchens, which would be best avoided if you are a light sleeper. Also, the beds were not good - a bit wobbly with rather thin mattresses. Breakfast was hit and miss, depending upon the time / how busy it was.", "date": "October 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r118639717", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "It was ok", "review": "We stayed there just one night and I suppose we received a transit room. It was tiny but nice, the bathroom spacious enough and clean. The hotel is very well located, in the center of Antequera. The only minus was that it was very noisy, I suppose that the walls are very thin. The old receptionist is grumpy and unfriendly. The breakfast is ok.", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r117856731", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Centrally located - Beautifully remodelled", "review": "My husband and I stayed for one night March 2010 in a room on the 3. floor (2. floor in Spain). A double door with a \"French\" balcony opened up to the plaza and the view of the hill above.   The interior of the hotel is very tastefully done. Our room was very nice (if a little small) but with a large bathroom which I particularly loved - the bathtub, the warm, glowing colours, the choice of tiles and the attention paid to the details.   Everything was new and sparkling clean. The curtains were competely dark (no light shone through). The windows were tight. I always travel with earplugs, but no need here. Even if it was Friday night and a football match in town, we slept like logs.   We found the reception staff helpful and considerate. (A little Spanish goes a long way.)   We…", "date": "March 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r62826464", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "customer service just ok", "review": "My wife and me stayed in this hotel a couple of weeks ago, and we were a bit disappointed with the staff…specially at the reception. Their level of English is poor and they should be more attentive with the guests…  On the other hand, I must say that the waiters at the restaurant were much nicer.  The hotel is located in a beautiful square which is a bit noisy, I must say.  The building is very beautifully decorated.   Well, on the whole, I’d say that it’s OK.", "date": "May 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r16481230", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Met our expectations barely", "review": "We stayed three nights for a family visit, and were looking for a nice, clean and rather functional, hotel. In that sense it met our expectations fully. For a 3* hotel, it even had bathroom amenities, which I wouldn´t expect in Andalusia. Staff all very friendly and helpfull.  But on the other hand there were small things that gave the impression that they don't pay attention to details: through the on-line booking site we asked for one big bed for two, and they gave us a room with two. This is not so bad, but on top of that the bed linen didn't fit on the bed, so you were feeling the mattress after 5 minutes sleep.  The hotel is new ,so I guess those are  all small details that will be corrected when the hotel get's really going with the high season, and considering the price…", "date": "September 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r10024240", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Not great", "review": "This is a central hotel located opposite a lovely square. Nice terrace in centre of hotel. Staff overall are quite neutral/average. Room was clean, modern and well decorated with air con/BBC world on the TV. Main problem - our room was at the front and on the first floor. The square opposite is used by bus companies to dropoff/pickup, and the main street is very busy with cruising cars (noisy, with music blaring) and scooters. Found it very hard to sleep in this hotel. Good things - the church and bar/restaurant/alcazaar at the top of the hill are very nice places to visit and eat/drink in. Take earplugs! ", "date": "June 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g315910-d645086-r7847488", "sub_review": {}, "travel_purpose": "", "rating": 2}]