[{"title": "Lovely", "review": "It is a very pleasant place to have a rest. We had 2 rooms, a great balcony with a magnificent lake view. The bed was very comfortable. The rooms were cosy, everything was clean. There were additional blankets in case it got too cool. We used them twice on the balcony unable  to resist the pleasure of seeing the lake and the mountains. If you want to use the safe ask for the key at check in. It is free. If you want to use the kitchenette, it will cost 15 euro a day.  The breakfast was good: it included a few kinds of cheese, sausage, ham, fruit, eggs, juices, tea, coffee, pastries. One can have a dinner starting from 7 p.m. There is a number of restaurants nearby, a supermarket. The place is great for walking and biking: there are numerous paths waiting to be explored. It is convenient to visit the lake towns - Limone, Malcesine, Riva del Garda, Salo and others. If you have never been there and are planning to go ther by car, use the SP 115 road from Limone, then merging with SP 38 (keep left). The staff was friendly and helpful.…", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664156-d646039-r620546040", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great View, basic Facilities, problematic location", "review": "This hotel is located in the highlands of Tremosine. I am starting with this detail because reaching this place from Garda Lake is a challenge not to say a driving risk. Arriving at night could be a nightmare. The roads are very very narrow with a place for one car and this is two-way road. For people with height problems it may be a nightmare. Obviously, this detail is not mentioned in none of hotel details.  The hotel itself Is more of a village motel, several villas scattered around and main building with rooms. We got the Villa as we were 4 adults and needed two bed rooms. This hotel is ranked with 4 stars which I wonder why because the facilities in the hotel are very basic. Yes it has a pool and yes it has beautiful view of Garda lake but all in-rooms / shower facilities are very basic and poorly designed. Also sleeping quality was not so good; the combined pillow, mattress didn’t work for me. The mattress quality for us was very low.  Wifi is free as can expected but very weak signal within the rooms.  Breakfast was fine, but basic thing like fresh mile is not around (only long-life milk). The hotel also has restaurant with reasonable prices but the food was very disappointing.  The service was mediocre. Beside one service desk person all the rest where quite correct. Last thing to mention, this is a very German vacation location. The owner is German and most of the staff is German speakers but no English. The hotel folder in the rooms is in two languages, Italian and Germany no English.…", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664156-d646039-r619895676", "sub_review": {"Location": 2, "Rooms": 2, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Best view of Lake Garda and best drive to get there; Strada della Forra", "review": "The best view ever, and the best scenic drive to get to this resort. What an amazing place. The stay is superb, as well as the food and hospitality. As you follow the road, you might think that you are lost, no you are not, you are in fact driving one of Italy's most scenic and narrow roads around Lake Garda and the Southern Alps - strada della Forra. Excellent service and hospitality, rooms are spacious with balcony. Easy access to other areas of Lake Garda and the surrounding mountains.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664156-d646039-r320384542", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Stunning surroundings", "review": "Wow! It's hard to imagine a more perfect setting for a hotel. Up in hills above Lake Garda this hotel really is ideally placed for exploring the north of the lake. It's a 15 minute drive down to the lakeside but those 15 minutes are buying you tranquillity and stunning views.  The hotel pool is the best I've seen. Perfect temperature and spotlessly clean. The manager was brilliantly helpful and have great advice about how to get out and about and what to do. The apartment was perfect for us. Every apartment has lake views and ours was plenty big enough. There's no air conditioning but big ceiling fans kept us plenty cool enough and you're a few degrees below lakeside temperate anyway.  Breakfast was fine. Not perfect (things ran out and they was no proper fruit juice) but perfectly adequate.  People have complained about the dice up to the hotel. We were in a hire car and I'm no Lewis Hamilton but it honestly was fine. Just take it steady and toot as you approach a blind corner. We loved how peaceful the whole hotel felt. We could have spent the whole time just lying by the pool and enjoying the view... but there is so much to see down below.  You won't be disappointed!…", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664156-d646039-r295037736", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Wrong room, terrible restaurant service", "review": "We arrived with a booking for a two bedroom villa. With no apology or recognition we were given a one bed villa. We returned to complain and then had to negotiate a new room rate. Forward a couple of hours and we went to the restaurant. We ordered a cold starter and four mains. An hour later, with nothing delivered to the table, and other diners having had breadsticks, bread and two courses delivered to their table, we complained. No apology - just lots of comment about how busy they were. We ate out the remainder of the week - lots of great restaurants in the vicinity with great service. This hotel has a great pool, brilliant views, but is let down by a lack of customer care", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664156-d646039-r222796964", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "breathtaking views", "review": "The hotel fully deserves its 4 stars. We were lucky enough to be accommodated in the suite \"Little Italy\", 100sqm, comfortable and well furnished. The facility is very nice as was the service. The food is good at both breakfast and dinner. The real highlight of the place is the location with its breathtaking views.", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664156-d646039-r214089101", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Nice and quiet place above Garda Lake", "review": "With 3 boys of 11, 14 and 15 years we were happy to get a large and very clean apartment. The staff was very kind and helpful. Breakfast met the expectations to a hotel of this category. The place is more suitable for small kids, for older kids the activities (surf, golf, Gardaland, etc.) are rather located directly at the Lake, whcih means at least a 15 min drive from the hotel.", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664156-d646039-r169854020", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "High above Garda Lake", "review": "Nice and modernish hotel with a good breakfast. Hotel locates 15 minutes drive up to the hills from the main road down on Garda Lake. Road to hotel is really narrow and there is no beach anywhere near hotel. Scenera from the hotel is outstanding. High altitude keeps warmth a bit lower than down by the lake.", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664156-d646039-r167010979", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Perched High Above Lake Garda for a quiet and Germanic Atmosphere", "review": "We booked this hotel last minute through booking.com and were allocated a suite of rooms for a good price that was really huge with a large balcony and a stunning view. It was clearly an out of season ski residence because it had ski pole containers outside. It is a grouping of apartments with a pool, restaurant and bar. The staff were very friendly and welcoming and the restaurant staff helpful. However it is directed at a German marke and the menu has a German slant and is not really Italian although the Clam spaghetti for prima piatti was excellent.  The menu didnt include simple \"gelato\" for our children and the waitress was a little confused when we asked and a bit stressed but she checked and a beautiful and really good ice cream bowl was made available to the kids. The…", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664156-d646039-r135913681", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "staff lied and destroyed our plans for the trip!", "review": "We book luxury room in this hotel in May. Reservation was confirmed, but after a few days hotel cancelled your reservation, reason - my credit card is not valid.(???!!!) But I booked 5 more hotels around the lake and these hotels like my credit card!!  I specifically made ​​a formal request to my bank - hotel don't requests to my account. The most annoying thing - they lie. And another strange thing -  when I received a letter with cancellation of reservation - I went to hotel website  and saw that all the rooms and my suite too, was sold out 24 hours ago! before I was refused. Rather, I simply dumped and suites have sold more.", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664156-d646039-r119809274", "sub_review": {"Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Absolutely loved Hotel Piccola Italia and would return in a moment!", "review": "We have holidayed twice at this hotel and would thoroughly recommend it. Yes it is up a rather steep cliff but to be honest this added to the appeal and ambience of the holiday. The first time we visited we arrived about 9pm and turned off the main road to be greeted by a rather steep precipice, we very gingerly drove up to the village and on to the hotel. We were greeted with wonderful views overlooking Lake Garda and the hotel staff went out of their way to make us welcome. The accommodation was excellent, extremely clean and the hotel is beautifully maintained. We stayed both times in a two bedroomed villa with balcony and had half board in the hotel which was very good value. Three of the party didn't eat meat and the chef produced some very good vegetarian options.Yes the…", "date": "August 2006", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664156-d646039-r34488655", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Make sure this location is for you", "review": "We wanted a hotel to base ourselves to visit Lake Garda.   We booked this place on the internet and looking back over the website now we should have realised how high the hotel was.   However not knowing the area we overlooked this.   The road to the hotel is treacherous and long and we would not have wanted to make the journey after dark.   Consequently although we had booked 3 nights we stayed for only 1.    Because of the late cancellation we had to pay 80% of the cost and this is not something we do lightly so that gives an indication of how unhappy we were with the location.  The accommodation itself is adequate although the hotel caters mostly for Germans so most of the TV channels and information were German as were the other guests we saw.   The hotel is remote and…", "date": "September 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g664156-d646039-r10019720", "sub_review": {"Value": 2, "Location": 2, "Check in / front desk": 3, "Rooms": 3, "Cleanliness": 3, "Service": 3, "Business service (e.g., internet access)": 3}, "travel_purpose": "Traveled with family", "rating": 2}]