[{"title": "Terrific Hotel and Stay", "review": "We just arrived back from Riva after spending two weeks at the Hotel Royal. First we would like to comment on our room which was modern, spacious and kept very clean. We were supplied with fresh towels every day,  soap, shower gel and body lotion were replenished as needed.  Secondly the food was very 'continental' but we liked the variety and quality that was served to us. The dining room staff are attentive and pleasant. Reception staff were engaging and extremely helpful. The only negative side for us what the hotel took dogs!  But that apparently it's common in Italy. We only became aware of this after seeing one being walked in through the front door and passed Reception.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r713401350", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Very good hotel", "review": "After reading past reviews i was unsure about the quality of the hotel before going.                                  My experience was this was an excellent hotel with friendly staff,top quality food,good clean comfortable accommation. ", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r676773416", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good hotel", "review": "The hotel is in a good position a couple of minutes walk from the main road which itself is a couple of minutes from the lake. My room was at the back overlooking the pool with its own balcony (table and chair). The room had a flat screen tv with many channels but the only English speaking one I found was 420 a German channel. The room had tea making facilities but no coffee of milk. The room had everything I needed for a 6 night stay. The restaurant was on the ground floor, breakfast was from 7 am and the evening meal from 7 pm. Breakfast was the usual continental style plus egg and bacon (not the same bacon as in England). The evening meal was multi choice ordered the night before, the meat dish was usually pork. Overall the food was good. There is a small bar area but entertainment was on the night of the Gala dinner only, prices were reasonable and the system was to run up a tab which was paid at the end of your stay. All of the staff I had contact with spoke reasonable English and were good and helpful. Overall a good hotel.  …", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r675152339", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Very Nice Hotel & Great Staff", "review": "We had a lovely 14 night stay at this very nice hotel.  On arrival we were met by two very welcoming ladies at the front desk who explained everything to us.  We had a comfortable room with aircon on the 3rd floor with a large balcony.  The room and en-suite were spotlessly clean and were kept in tip top shape by housekeeping staff.  The beds were very comfortable and I slept well with no intrusive noises as the hotel is located back from the main road.   The breakfast in the morning included a wide range of hot and cold dishes from a buffet bar.  The food was good quality and the waiting staff were very friendly and attentive to our every need.   The hotel has a nice pool area though the number of sunbeds is limited but with the surrounds of beautiful Lake Garda a short walking distance not too many choose a day at the pool.…", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r648566240", "sub_review": {"Location": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Bug what bug", "review": "After a very long journey to arrive at the hotel arrived at 9.oopm. Nice hotel staff helpful ,but after only  1 day people coming down with a so called bug!!! one after the other sickness & diarrhea  struck the staff were very good very annoyed by National Holidays drivers ,surely a plan is in place for such an event ,yes they did  buy hand wash ,& wiped the coach down ,but was that the sort of infection?I would have thought they would have got a medical practitioner to examine suffers ,then report it to  the relevant       Authorities .People were having to go to drivers once they were informed that was that.", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r645330036", "sub_review": {"Value": 4, "Rooms": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "6* service & quality 4* price", "review": "My wife and I wanted to visit the north of Lake of Garda and Riva seemed to be good location so we search web for a good hotel that would be 'PET FRIENDLY' as we have a dog, As there were a few we settle on the ROYAL this was a 4* hotel but with 6* quality and service, the staff was not only welcoming but made us 'ALL' feel like royalty. The room was very large and well kept and a very good balcony with a small view of the lake, Now we come to the best part the breakfast and dinner, there is so much to choose from and excellent quality, Breakfast is all buffet cold/hot and the sweets are heavenly. Overall this is 6* value at 4* cost or less ", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r622589639", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Seven day stay", "review": "Spent seven days at the hotel royal.found the hotel very pleasant and the staff really cooperative.the food was good with a good selection on the buffet and waiter service for the main course.All in all an enjoyable stay", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r593596539", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Four star???", "review": "Small hotel, small dining area.  Food was ok, but not much variation at dinner, pork was on the menu four nights out of seven! Reception staff extremely helpful and friendly. Dining room staff also very friendly and helpful as were the housekeeping staff.  Bedroom and public rooms very clean.  Bathroom rather \"snug\" - had we been any taller than 5'6\" we would have struggled! There was not even a hook on which to hang a towel! Very disappointing that no hospitality tray in the room; we expect this from a four star hotel.  The hotel is in a quiet area of Riva but very handy for the beautiful lakeside walk. It is ok for a week but not any longer. One definite bad point was that dogs were allowed in the dining room.  Other people on our tour travelling with Newmarket staying at…", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r527200611", "sub_review": {"Value": 3, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Very Clean ", "review": "Stayed here before and it's as we remembered very clean . The rooms are good and the staff are very welcoming. The beds are very comfortable. Bathroom is fine with no frills .  The evening meals are definitely worth checking out . Plenty of choice and a good selection.  The breakfast is plentiful just not to my taste . ", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r520294619", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "3 night stay", "review": "Our third hotel in Riva Del Garda. Firstly may I say how friendly all the staff are, the rooms are spacious and very clean. The breakfast is plentiful but not really to our taste. The pool and area is an excellent Sun trap, it also helps when you can order drinks while by the pool. We chose to eat in the hotel on the last evening and we were pleasantly surprised with the quality of the meals on offer. Excellent location, with free wifi  Will we stay again? Most certainly and look forward too it! We recommend it.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r507458192", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Friendly staff and spacious rooms but....", "review": "Hotel located in a quieter spot away from most of the Streets noice. The room was spacious and clean, but unfortunately the air conditioner was noisy as a concrete mixer. The staff was welcoming and friendly. Great selection in the breakfast buffet.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r502204562", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Overall a pleasant stay", "review": "Stayed 5 nights on a coach trip. As a single traveller my room was reasonably spacious, as well as very clean and comfortable. Pity there are no tea/coffee making facilities in the room. Every room has a balcony. Mine was at the back, which was very quiet - I gather this wasn't always so at the front. Good views. Staff were friendly and very helpful, especially on reception. Food was varied. Apart from the rather greasy bacon due to sitting in grease, the breakfast was good - hot and cold food, all the usual continental breakfast, and lots of cake. Evening meal was less good - rather mediocre. It was edible, but not very exciting or Italian and vegetables were salty.  Only a few minutes walk to the lake and about 20 minutes walk from the main town.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r433377687", "sub_review": {"Value": 4, "Location": 4, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "friendly staff", "review": "Stayed her 29/6/16 to 6/7/16 in room 9, Lovely small and friendly hotel. Clean rooms although a little small all rooms had free wifi, air con , tv and fridge. The swimming pool.was cleaned every day Great buffet selection at breakfast and evening meal. a short stroll to the lake. I have recommended the hotel to to several friends. would stay here again it was very nice", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r396147759", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "German food in Italy ", "review": "Hotel is functional and clean with a good situation near the lake. Free Wi-Fi. Good red wine, just a negative point for the food with a lot of German influence. We would appreciate more Italy in the plate.  Personal is very kindly with the children   Swiss point of view ", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r393283043", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "travelling to the mountains", "review": "were only two nights  location is very good near the shore of garda lake and all the activities . good place for vacation and travelling to dolomtties - good starting point .plenty off nice bars and good food ", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r389973460", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Family run.", "review": "I was a little apprehensive after reading that it is an Italian 4 star hotel, not an English standard 4 star, but I need not have worried. The hotel is run by Emelia whose mother runs the Oasi, 300 yds away. There is a small staff here & they are all very friendly, polite, & bend over backwards to help. You only have to mention something that is not quite right & Emelia, one of her lovely receptionists, or another staff member, are right on it. It is not a huge hotel & the rooms are not the biggest. But they are clean & very comfortable. Every room has a balcony & even though i only want a hotel room to sleep in, not to spend all my time in the room, it was rather nice to sit on one of the provided chairs on the balcony, early in the morning, & take in the quiet, beautiful…", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r281175268", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Lovely people", "review": "This hotel is just a few meters from the lake side , very close to Porto St Nicole,  it's right next to the hotel savoy palace so if there no entertainment on at the royal you can always join in with the garden entertainment next door.  The food at the royal is/was  self service when we stayed there,   They try to accommodate most  people with the food, don't always get it right but sometimes I think we Brits expect too much English food when abroad.  There is a lovely pool area, not huge but plenty big enough for this hotel and it us a real sun trap.  I think you may have to book this hotel well in advance as it gets booked up with coach parties.  We found the rooms over looking the pool were the best, they get the afternoon sun.  The rooms at the other side over look the savoy…", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r256921917", "sub_review": {"Value": 4, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Clean, Cheap, and Cheerful", "review": "Stayed here for the first three nights of Newmarket Holidays excellent '7 Cities in 7 Days' tour. Riva del Garda is at the northern end of the lake, and the hotel was relatively close to the lake, with some rooms (sadly not ours) overlooking the lake. Having read previous reviews we were a little apprehensive, but the hotel was functional and clean, and the food much better than we had anticipated. The service was reasonable, especially for what we paid for the holiday. I'm afraid some people seem to expect Rolls Royce service for Ford Fiesta prices. It's not going to happen. That said, we'd recommend the hotel either as a tour base, or even for a few days stop over with the opportunity of discovering some of the delights of Lake Garda.", "date": "November 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r238366766", "sub_review": {"Value": 5, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Fab holiday *Nadine, Sarah, Katie*", "review": "The 3 of us have just come back from our holiday with Newmarket Holidays coach trip, 7cities in 7days.. WOW... thats all we can say! Each hotel we stayed in were very clean, very friendly staff! Spoke good english and very helpful.. havent got one bad thing to say about this holiday atall. We loved our driver Paulo.. he didnt speak much english but was an excellent driver and very friendly! Our rep Diane was amazing.. spoke fluent Italian with a Manchester accent it was brill! Gave us all the information we needed daily and more.. cant fault it at all. She is fab and will definately be doing another coach trip with them next year :D", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r237949039", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "A functional hotel", "review": "Stayed three nights during a recent tour of Italy. The location is great for walking the shores of lake Garda. The hotel is clean and comfortable with friendly staff but the food is mediocre and the swimming pool is really just a toddlers pool. 3€/hour for wifi is expensive when you can sit in the lovely bar of the Savoy Palace next door and get free wifi (also at the nearby Sailing Bar). ", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r234378291", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Not a high standard, but staff friendly.", "review": "We visited as part of a tour. the rooms were clean, but very old fashioned with lots of scuff marks on the wall, and poor paint work. The staff were great - especially the younger of the waiters in the restaurant bar area that speaks lots of english. He made an effort to make everyone feel at home, was friendly and chatted to EVERYONE, and nothing was too much trouble. The food wasn't great, and would have benefitted from having some traditional italian options rather than just odd buffet style we got  (small pizza squares, and hash browns?) However the average age of customers within the hotel seemed to be 65, so i can understand why there were lots of safe english options. The wifi is too expensive at 3 euros. stand near the front of the hotel and get onto the free wifi of the…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r229299837", "sub_review": {"Value": 2, "Rooms": 2, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Nice hotel, shame about the food.....", "review": "This holiday was fantastic in that it gave us a whistle stop tour of a lot of Italian cities, we knew before we went it would be hectic but not so hectic as it was! It would be better as a 10 day holiday so there was a free day in the first base at Lake Garda and a free day in the second base in Tuscany to have a day or two of leisure. People should be alerted to the very early starts, the amount of walking (lots of it uphill) and the very lengthy coach rides, as the trips were to places a long way from the base hotels.  The hotels were not of the standard expected for such an expensive holiday (we paid almost £1000 each for a week), first hotel (Hotel Royal, Riva del Garda) was quite nice but the food was very mediocre, the second hotel (Cristallo in Chiancamo Terme) was very…", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r228978890", "sub_review": {"Value": 3, "Rooms": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Newmarket 7 cities tour and the wonderful rep Diane", "review": "This is without doubt a great value for money holiday made up of visiting seven wonderful cities. The Newmarket rep Diane made our holiday. Such a wonderful lady her knowledge of wine and the region was superb. Nothing was to much trouble for her from purchasing first aid supplies to supplying detailed maps and directions for the days tour. Me thinks this northern gem made 43 people happy no one in the tour party was left out. Diane the rep even organised a birthday card and cake a lovely touch me thinks. Even expertise knowledge of film locations and DVDs to show locations on trip .  This tour is a wonderful and very touching experience me thinks I be back", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r227363678", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Worst hotel ever the savoy is much better!", "review": "On arrival there was a dismal welcome from a grumpy receptionist. We had arrived on the saturday and were expecting to be going to church the next day. We were obviously unsure where the church was and times of mass as we had never been in riva before.We asked the receptionist and she laughed at us and mumbled something in italian to her co-worker. She said that we would need to take a taxi to the old city, there was no need because the old city was around a 15 minute walk away. She was unsure of the times so we ended up not going to mass.  Food is terrible not much choice for food especially not vegetarians  The breakfast is a huge  miss  nothing but oily scrambled eggs and soggy fruit that has been lying out for a couple of days as well as  random flavours of juice that you…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r226953514", "sub_review": {}, "travel_purpose": "", "rating": 1}, {"title": "Friendly staff", "review": "when one compares a hotel you should also compare the price! thank you", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r225767983", "sub_review": {"Location": 4, "Rooms": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Lovely staff, spotlessly clean & super location", "review": "We stayed in Hotel Royal for 1 week at the beginning of August. Just to clarify a 4 star hotel in Italy is different to a 4 star in Ireland or the UK. We really enjoyed our stay in Hotel Royal, the staff could not have been more helpful & accomodating. They really made us feel welcome. The rooms were spotlessly clean, with cleaning every morning and fresh towels each day. Food was good, buffet breakfast with fruit, eggs, ceral etc to choose from! One evening when we were travelling to Verona, the staff prepared a huge packed lunch instead of dinner as we had half-board. Location is great, just 2 minutes from the Lake. Riva is a beautiful place with easy access to Verona & Venice if you fancy a day excursion. Italy is a beautiful place & we highly recommended this hotel. ", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r222736754", "sub_review": {"Value": 4, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Great englIsh style breakfast", "review": "Thank you very much for your feedback . very kind", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r222036754", "sub_review": {"Value": 4, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Good position, friendlyness and very good food", "review": "There is scrambled and boiled,eggs, toast, cereals, ham, cheese, fruit and cakes, can't understand why people,slag the breakfast off as absolutely fab!!!! Personally the breakfast was better than what I have at home, staff very accommodating and no complaints!", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r218484148", "sub_review": {"Sleep Quality": 5, "Rooms": 3, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Seven Cities of Italy..newmarket travel", "review": "We got there a short vacation. The hotel is in a very good position; very close to the beach at 10/15 minutes walking from the downtown of Riva del Garda. The people of the staff are friendly, well trained and let you feel even welcome. The food is great and so various. The room was clean, large and quiet... and that is all what we were searching about in a hotel. Honestly speaking the hotel itself is not the newest one; however it is well furnished and in good upkeep level; it just needs to receive some attention to some details like the box of the shower and to the frame of the sliding door. For the rest, we felt good there and we do suggest it", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r213473580", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Good Hotel", "review": "Three of us have just returned for the Seven Cities of Italy tour, with Newmarket holidays.  Yes it was hectic, a few early starts, but we packed in 7 cities in 3 days.  The hotels were all fine, all had pools which we used every day before dinner.  Dinner wasn't the best I've ever eaten, but more than adequate, and I had a fussy teenager in tow! Lots of choice at both breakfast and dinner.  Diane the rep was fantastic.  She was informative, funny and very helpful.  I had my purse stolen in Florence, and she lent me money out of her own account, and my useless bank (Nationwide) took 7 days to refund her despite promises of transferring money to her within one working day.  Without Diane's kindness the holiday would have been ruined. It was our first ever coach holiday, and we…", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r211692011", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Lovely big rooms", "review": "We also stayed here though New Market travel. I have to say that the rooms were fab- lovely and big and clean. The staff were helpful although the waiter was confused and everyday insisted we move to another table even though he had told us to sit that that particular table to start with. The foo though I have to say was very poor and the breakfast wasn't the best. We didn't venture out on our own so I cannot comment on how far it was to the town. The hotel I think is OK for short stays.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r209297858", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Medium range hotel with everything you need", "review": "We had a three night stay as part of the Newmarket Seven Cities of italy tour. The hotel is tucked away from the traffic noise on the main drag out of Riva Del Garda and a few minutes walk from the lake, although the town itself is a little bit of a hike - around 20 minutes. The hotel is a little tired and to be fair should be classed as a three star but it offers reasonably-sized rooms with the usual self-service continental breakfast. Dinner is a little more formal but the menu is limited and not something we looked forward to - although a bottle of vino was set at a reasonable price which helped with the digestion of the otherwise uninspiring cuisine. Newmarket kept dragging us back to this hotel for three nights rather than choosing hotels closer to the attractions - Venice …", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r204930575", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Perfectly adequate", "review": "Stayed here right at the end of October 2013 on a Newmarket 7 cities of Italy tour.  As previous reviewers have noted it is a little tired, but clean and after a busy day the bed seemed comfy enough. Its a little bit out of the town centre, but its a lovely walk by the lake to get into town and this also provides justification for the ice cream ;-)  Breakfast was pretty good as far as continental breakfasts go with some tasty breads and rolls to accompany the usual cold meats cheese, boiled eggs etc. Dinner was fine for the budget with self service starters and slightly un-inspiring main courses and desserts.  All the staff were pleasant and welcoming and overall we felt the hotel was perfectly adequate  for our needs on the tour and value for money.", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r185496467", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "NEWMARKET HOLIDAYS 7 CITIES OF ITALY TOUR", "review": "We have just returned from 'doing' a Seven Cities of Italy tour in 7 days with Newmarket Holidays and stayed at the Hotel Royal for 3 nights. The tour is promoted as an 8 day holiday, but if like us you leave Aberdeen late afternoon on a Sunday, and spend the Sunday at the end of the trip waiting in a hotel near the airport for your return flight home at 18.30, I’d prefer to describe it as a 7 day holiday. It’s a bit swings and roundabouts though as some people from other UK airports arrived much earlier at the start, courtesy of having to get up about 3.30am, and had another ‘early hours of the morning’ rise for their return journey.   Having said that, this was a really wonderful trip! It is extremely hectic and exhausting, so certainly might not be for everyone, but what I’d…", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r180049194", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "newmarket 7 cities", "review": "This was such a wonderful little hotel. A truly hidden gem. From the minute we arrived we were made to feel welcome. It may look a little tired in places but the staff, cleanliness, food, surrounding area and the helpfullness that you receive more than made up this. Would defiantly go back.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r178241935", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A 4 star no-no-no", "review": "Crumby 60's building quite a long walk from Riva. Windows do not close completely so you end up joining in on the fun sing-a-long party from the hotel next door (which btw looks much nicer than this one). There are many nicer, cheaper and more up dated hotels nearby. Don't waste your money on this one. ", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r178059276", "sub_review": {"Value": 1, "Location": 2, "Rooms": 1, "Cleanliness": 3, "Service": 3}, "travel_purpose": "", "rating": 2}, {"title": "Great Experience", "review": "I was on a trip organised by Newmarket Travel. This was the best of the 3 hotels I stayed in. I had paid a relatively small single supplement, so my expectations were low - I have had small single rooms in the past. What a surprise, a double room with a balcony overlooking the pool. The room was clean and big enough, the bed was low but comfortable and the shower room (no bath) was clean. Two English channels (BBC and CNN) on the TV The food was good - buffet breakfast and \"choose your main course the day before\" for the evening meal. The service from the reception staff was exceptional. Even though our party was only there for 3 nights, the reception staff recognised us by face and handed us our room keys without us asking. WiFi was available in the public rooms at EUR3 per…", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r177527587", "sub_review": {"Location": 4, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Comfortable friendly hotel", "review": "I had the pleasure od staying at this hotel last week must admit I was a trifle concerned after reading some of the older posts. The hotel is warm and friendly the rooms are clean and tidy. the food is delicious with a good selection for breakfast and evening meal. Spectacular views from all angles of the hotel and is close to all amenities Would definitely stay here again if visiting this area", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r171701231", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "good overall hotel with friendly staff, clean rooms and plentiful buffet breakast and dinners", "review": "I have stayed at this hotel as several times as part of a coach tour and cannot fault it, the staff are ultra friendly, the rooms are clean and spacious, the buffet breakfast is fab with eggs, meats, cheeses, croissants, cereals etc and the dinners are mainly buffet style with choice of 1st and second course which are served to you waiter style. The bar is cheap and the staff are very helpful. There is a great pool area at the back of the hotel nice and quiet and in a great location, The lake is literally mins away and is near lots of bars and restaurants and ice cream parlours, so if you want a late night drink or snack, you wont be disappointed. I cannot fault this family run hotel and will be happy to go back again. Made me feel very welcome and at home. Love to all the staff…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r170720584", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Do not disturb notices needed", "review": "We were on a very ambitious and short Grand Tour of Italy with a UK coach holiday company. The hotel was on the small side,but adequate. The food was good and plentiful. It's a shame that the tap water made fizzy on site was expensive. They must bring themselves into the 21st century by offering free Wifi connection.  My wife wanted the cleaning staff not to come into the room as, in line with the hotel's environmental policy, as we did not require the towels to be changed and the bed was easy to make. An hour before the shops closed, we discovered that the compression tights which we had washed on put next to the towels to dry, had been removed together with the towels which we were intending to use again. We were setting off home early the next morning and needed the tights.…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r168435642", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good spot in Garda", "review": "Stayed for 2 nights as part of a tour, this was a good spot to stay in Garda easy walking to local resturants and the Lake Garda walkway. While the hotel is showing some wear and tear the staff were very helpfull and it was great to have a drink beside the pool after a tough day touring around the area. The pool was clean and a welcome swim after a hot day.The TV was unwatchable being so high on the wall. Probably not a 4 star hotel but worth a look depending on the price.", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r165627422", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A gem of a hotel", "review": "Stunning location with views of the Dolomites and within walking distance of Lake Garda.The room was clean and spacious with a balcony with scenic views across the mountains. The only problem was that the TV in the room was so close to the ceiling you had to be a giant, or stand on a chair to switch it on and then crane your neck to see it ! The food was plentiful and well presented, and bar prices were reasonable. The receptionist was very accommodating, and even gave me two of her own English novels to read on the way home. I would definately go there again.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r162134603", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Like the curate's egg - Good in parts", "review": "Having read the reviews for this hotel we were looking forward to a 4 star stay but this was not what we got, don’t get me wrong the hotel isn’t awful, it just isn’t 4 star! If we start with the good points, it was spotlessly clean, the staff were very friendly and helpful (especially the head waiter who seemed to do everything) service was generally excellent and the hotel was quiet with good access to the lake with about a 20 minute walk to the town. However when we got to our room it was rather tired with well worn melamine furniture more reminiscent of student accommodation. The dressing table was shoe-horned into a corner so that it was not possible to open the cupboard door or drawer. We had room number 6 which had an enormous balcony which looked onto the mountains. The…", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r138760915", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 4, "Rooms": 2, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "PERFECT LOCATION, FOOD, SERVICE. PERFECT HOTEL.", "review": "We (party of 4) stayed 7 nights at Hotel Royal and give it ten out of ten.  Perfect location close to beach, shops, bars, restaurants etc.  Perfect food & service.  Perfect mountain views from the balcony of our rooms.  What more can we say ?  'Asta la vista'... We'll be back!", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r135157504", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "ROYAL HOTEL TREATED US LIKE ROYALTY", "review": "Just got back from 7 nights at Hotel Royal.  Can't fault it.  Great position in the town.  Close to shops, cafes, bars.  Most important just metres from the beach.  Few minutes walk to the boat stop for boats to/from the other resorts.  Our room was unbelieveably clean, in fact it spakled each day.  We had a balcony with wonderful mountain views.  Food was excellent and served by efficient and friendly staff.  As we said at the beginning, we felt like Royalty for our 7 nights at Hotel Royal.", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r133359845", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "7 Cities May 2012", "review": "Location was good being close to the lake and within easy walking of shops and restaurants.Room was okay and more like a suite.Pool area was good.The food was pretty grim.We were expecting authentic Italian but got poorly presented basic English fare,and not very appetising.Breakfasts were however very good,if a bit crowded around the self-service. TedW595", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r129644359", "sub_review": {"Value": 2, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "REGAL TIME AT THE HOTEL ROYAL", "review": "This was the second time I have stayed at a hotel in Italy which has received some poor reviews.So again I approached my holiday with some trepidation but I need not have worried.I really must say I sometimes wonder if the people who make such terrible comments on TripAdvisor stay at the same places as me.As with the Hotel Imperiale in Fiuggi the experience I had at the Royal was in total opposite to the reviews I had read. All the staff were friendly,helpful and spoke good English.The food was good with plenty of options breakfast and evening. Bar prices were no worse than hotels in the UK,in fact probably cheaper and better quality lager. The room was comfortable with a balcony overlooking the pool and glorious views of the mountains.The air conditioning was tremendous with 3…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r116651506", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great holiday", "review": "Pleasantly surprised with this hotel after reading some of the reviews.Good location only 5 minutes from Lake Garda.The hotel was comfortable,quiet and relaxing. The air conditioning was working well . The food was good with plenty of choice. Staff were friendly, helpful and spoke English well. We would definately visit this hotel again.", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r78242794", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "Worst hotel experince ever", "review": "Booked holoiday with Travel sphere who are a reputable travel company. Should have checked with Tripadviser before booking where there are many negative reports  but in view of reputation of travel company we did not bother. Hotel location is good, just a short walk from the shores of the lake. But the Hotel is very poor, paricularily as regards food.  We upgraded  to this Hotel to give ourselves a treat. How this can be classed as 4 star is beyond belief. More like a down grade to 2 star. There was an evening meal main course selection each day which you had to pre-book. This was  always Fish or Pork. No gravy. One day an option was given as a roast. We selected this thinking roast beef but guess what? Roast pork.There was only one vegetable each day which was potato. My wife…", "date": "May 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r68177640", "sub_review": {"Value": 1, "Location": 4, "Sleep Quality": 2, "Rooms": 2, "Cleanliness": 2, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "A little disappointing", "review": "I went on a Leger tour to this hotel recently. Staff were friendly and helpful, but the hotel room was quite basic and had very little space. There was too little choice of evening meal, and I was forced to eat outside the hotel on one occasion. On one evening there were three fish courses, and very little alternative choice. The packed lunches provided were very poor, and there was no free WIFI access at the hotel; which is something people increasingly expect these days.", "date": "April 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r62079354", "sub_review": {"Value": 3, "Location": 2, "Sleep Quality": 4, "Rooms": 2, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Perfectly good Hotel!", "review": "I don't understand the bad reviews. Room wasn't huge, but it was big enough. Wardrobe, chair, bed, desk and safe.  Really liked the balcony with mountain views.  The staff were very friendly and all spoke great English. The rooms were cleaned well daily.  The food was fine. Buffet style except for the Thursday night, but there were so many restaurants to eat in, it didn't make sense to eat there every night, and as the hotel was so cheap anyway, you don't really loose money by not eating there.  The one day that we did need to stay in the Hotel, there was enough to keep us occupied. The pool and hot-tub were empty during the day, and the bar was open. Very quiet and relaxing. It's not a hotel for staying in all day, it's a base for sleeping in-between days out! It really is two…", "date": "June 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r57970505", "sub_review": {"Value": 5, "Location": 3, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Expect to be under impressed.", "review": "2 friends and I stayed at this hotel with Leger Holidays.  Their brochure described the hotel as 3*, this we think is over generous and would suggest a 2* or even 1* would be more appropriate. The staff were very friendly, the hotel was clean but the rooms we were allocated were very small and shabby. I had a single occupancy room and had to make a conscious effort not to stub my toes when moving around the bedroom.  The double room shared by my friends was a little better space wise but not much.  The furniture in both rooms was very tired and basic.  The air conditioning in our rooms was so weak it made absolutely no difference and as a result very uncomfortable to be in and sleeping at night was a real struggle.  The air conditioning in the dining room also was totally…", "date": "July 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r47387314", "sub_review": {"Value": 2, "Location": 4, "Rooms": 2, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Don't believe all you read", "review": "Have just returned from a Leger holiday at the Royal, and can not fault the place. Staff were friendly very helpful and hard working. Our only gripe was the air con needs seeing to.", "date": "July 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r35687916", "sub_review": {"Value": 5, "Location": 4, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "no air conditioning", "review": "no air conditioning we went with leger because we trusted them to use a good hotel but the room was that hot one night we slept as close to balcony as possible spoilt holiday shower door wouldnt shut, bedrooms a bit grotty but food ok", "date": "July 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r35375734", "sub_review": {"Value": 3, "Location": 3, "Rooms": 2, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Newmarket tvl(Norwich division) 14-6-09.", "review": "Just home from a pleasant stay at this hotel. We were A,O,A  in Verona booked a month earlier, travelled up the Brenner motorway arriving 3hrs later, delayed by an accident/roadworks other tourists etc. Most of the previous negative  reviews have a valid point, e,g, rating etc, but this did`nt stop us from having a good time!! The food was adequate, afternoon coffee and cakes.  Staff very helpfull. The rooms could do with a good refurbish. Not a 4* (had to settle bar bill with cash as cards not accepted) No pool towels provided so take your own!! The hotel is situated about a 2 min walk fom the lake edge and 20 mins to ferry point in the old town.                            \" You get what you pay for\"", "date": "June 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r32824314", "sub_review": {"Value": 4, "Location": 4, "Rooms": 2, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Not sure why people are complaining!", "review": "Recently returned from a stay - also through Leger.  Not sure where all the complaints below have come from.    Firstly - star ratings on the continent are different to what we're used to in the UK.  Their standards are lower - remember that it was not rated by Leger but by an Italian tourist company (hence the stars on the hotel's sign).  Secondly I want to address the food issue.  As our English tour guide (who's lived in Italy for 30years) pointed out to us - any food you get is as a result of many years of foreigners going over and asking for omelette's.  Italians (especially hotelliers) are aware that many people visiting their country don't want to eat Italian food - heaven knows why someone wouldn't want Italian food!!!!!  They are trying to cater for us but don't…", "date": "April 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r29632729", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Worth two twinkles not four stars", "review": "Stayed here with Leger holidays having paid a single room supplement of £139. On arrival thats what I got, a single room with a single bed. When I complained to the receptionist the reply was straight out of Fawlty Towers, \"but its got a lovely view\". About 20 minutes later I was given another room which was the same size but with a double bed which  restricted any movement in the room. The room could have done with a lick of paint and the shower screen was broken . I don't know how this hotel was given four stars. Prior to arrival we had stayed at the Holiday Inn Express in Rheims which had a French classification of two stars and was far superior to the rooms at this hotel. From Looking at the latest from Leger, they are now describing it as a 3 star hotel. Perhaps they should…", "date": "April 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r28594289", "sub_review": {"Value": 2, "Location": 5, "Rooms": 1, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Avoid - Food is very poor!", "review": "I agree with the  reviewer below on most points. These include the breakfast  (yes the eggs are cold and have black in them) and the dinner. How many ways can the food be re - served the following night. Left overs were put into a salad the following evening. (Including fish!) We had pork every night apart from one.  The food is  served buffet style and is cold and tasteless.  Yes the walls are very thin.  Want to go on a diet then go to this hotel as you certainly wont eat much. Some  people did not even visit the dinning room after the first two nights.  The good points very clean.  Very friendly staff.  Beds very comfortable The location is only a 15 min walk along the lake to the centre.", "date": "April 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r28065300", "sub_review": {"Value": 1, "Location": 4, "Rooms": 3, "Cleanliness": 5, "Service": 3}, "travel_purpose": "", "rating": 1}, {"title": "Not impressed, would not go there again", "review": "Reading through the last reviews of Hotel Royal, Riva del Garda, I can only assume that there must be two hotels going by this name!  Believe me,  I was not happy.  It's not a 4*, more like a 2.  I booked a single room through Newmarkets holidays, and I will not be travelling with them again.  I do not believe I spoke to a single person on my flight who actually got the hotel of their choice on initial booking.  They all ended up in different hotels in different resorts and none of them were impressed either.  Listening to some of their stories, i got away lightly!  I was allocated Room 1 on the first floor which was a teeny tiny single the size of a shoebox.  This room is next to the stairwell so through the apparently wafer thin walls I heard everyone coming upstairs to bed…", "date": "September 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r20703239", "sub_review": {"Value": 2, "Location": 2, "Check in / front desk": 2, "Rooms": 2, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled solo", "rating": 2}, {"title": "Good hotel why all the negatives?????", "review": "Just returned from this hotel, after reading other reports was rather dreading staying at this hotel, however I was pleasantly suprised..The food was good, rooms clean, and staff very friendly, I did find the rooms rather small but as there were excursions every day bar 1 all we used the room for was sleeping.  I am not the type to go on  holiday to spend all my time in and around the hotel, as there is too much to do and see.  The hotel is situated close to the lake and 15 min walk to the main town so really it was ideal.  September is a good time to go as there are less crowds in and around the place and weather was in the low 70's throughout the whole week however the eveinings did get chilly so a light jacket is a must.", "date": "September 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r20504176", "sub_review": {"Value": 4, "Location": 4, "Check in / front desk": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Hotel Royal", "review": "Spent a week here as part of a Leger coach party in Sept 08 and was more than pleased with the hotel. We were a bit doubtful at first after reading all the negative reports about the Royal but as far as we were concerned it was1st Class. Good choice of food and the staff were very friendly. Our room was very clean and comfortable, towels changed every day if needed. Very close to the foreshore of lake garda which was also a plus point.", "date": "September 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r20175002", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 3}, "travel_purpose": "", "rating": 5}, {"title": "Had a fabulous holiday.", "review": "We booked our stay through Newmarket Holidays.  We arrived in the early hours of the morning after a long journey from Scotland. Our room was lovely, it was a family room although there were only two of us. There was food laid out to welcome us and a carafe of drinking water. The staff were delightful and nothing was too much trouble.  The evening meals were plentiful, I am vegetarian and there were always lovely fresh salads and pastas, there was varied meat and fish dishes for the non veggies.  Our room was spotless as was our shower room, towels were changed daily and soap and shampoos were replaced daily. There were mountain views and our balcony looked over mountains to the left and right and an olive groved hillside straight ahead. It took minutes to walk to the lake …", "date": "September 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r19981713", "sub_review": {"Value": 4, "Location": 4, "Check in / front desk": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 3}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "pleasently surpirsed", "review": "After reading the reviews I was a bit apprehensive about stopping there for 5 nights.  However, it was a pleasent surpirse. The staff were very very friendly and helpful. Rooms were cleaned each day.  They dont take credit cards which was helpful saved spending too much.  Overall a fantastic hotel that made our stay in Lake Garda the more enjoyable.", "date": "July 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r18564579", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Better then some of the reviews suggested", "review": "We had an hotel change 2 days before flying. I looked up the web for the Hotel Royal and worried for 2 days about the holiday. When we saw our room, we thought this isn't as bad as it could be. Quite basic, but you don't spend your holiday in the room. It was one of the smaller doubles overlooking the pool. The food was better than some of the reviews suggested. Evening meals - soup (but I never had that), a good variety of salad, usually 3 choices of meat or fish, a pasta dish, potatoes (really good roasted with rosemary one night) and a vegetable. A different pudding each night all good. Breakfast didn't have a lot of variety, but it was a continental breakfast with meats and cheese. Never had the egg. For the money it was very reasonable. Location was fine for us. The walk…", "date": "June 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r16892179", "sub_review": {"Value": 4, "Location": 5, "Check in / front desk": 5, "Rooms": 3, "Cleanliness": 5, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "dissapointed with this hotel", "review": "We were very dissapointed in this hotel from the food to the accomadation it was more like a 2star hotel than a 4 star! The food was edible but not alot of choice and the breakfast wasnt worth getting up for! we certainly will not be returning.", "date": "April 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r15075099", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Not Regal...more like a Travel lodge", "review": "We stayed one night at the Hotel Royal for our final night of a tour. Although the room was clean it was more like the standard of a Travel lodge than a four star hotel. The food was reasonable. The location was disappointing as it is not in the centre of Riva itself. The part of the lake the hotel is located on is more for windsurfers and campers than for your average hoilday maker. Having said that we were only there for one night so it was adequate and the staff were pleasant enough. ", "date": "August 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r8508271", "sub_review": {"Value": 3, "Location": 2, "Check in / front desk": 3, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "", "rating": 3}, {"title": "Good for a short stay.", "review": "The Royal is in a really good situation, not front line, but within easy walking distance of the promenade and other attractions.  The room we had was serviceable, with a clean shower room and we had a balcony overlooking the swimming pool. Dinner was a buffet style service with plenty of cooked options as well as salads and fruit, with the ubiquitous ice cream for dessert. Breakfast again was buffet style, but looked much better than it tasted. We were here for only one night as part of a tour and the hotel served its purpose very well. ", "date": "August 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r8492889", "sub_review": {"Value": 3, "Location": 4, "Check in / front desk": 3, "Rooms": 2, "Cleanliness": 3, "Service": 3}, "travel_purpose": "", "rating": 3}, {"title": "Good for older people.", "review": "August 5th 2007. We returned from our holiday 28th July 2007, after a 2 week stay in riva del garda, Italy. We had a good holiday over all(2 adults & 2 children, 5 & 2yrs). The hotel was clean,4 star rating, but it was really a 3 star. The staff were nice, the food was ok for adults, but children found it hard, breakfast was only meat, hard rolls, solid boiled eggs and well done scrambled egg,with cereal, sometmes left over dessert from night before! Lake Garda its self was a lovely place, just not a lot for children,but that was our fault for booking and not checking. We went on a trip to the capital Verona and the dolomites, that was good. If you are into wind surfing, this is the place to be and for those who are not (like us) they are fantastic to watch on the lake, late…", "date": "July 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r8355538", "sub_review": {"Value": 3, "Location": 2, "Check in / front desk": 3, "Rooms": 2, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Lake Garda and Riva are Beautiful but the Hotel does lack...", "review": "We have just arrvive back on Sunday night and it sounds like we may have taken over the room mentioned in the previous review. Room no 31 in case anyone is interested. It was difficuly trying to squeeze your bags past the dressed in the tight corridor and the room itself was very small, but was cleaned everyday and the en-suite toilet  was a good size with a decent powered shower. There was also a TV and air con. We also asked to be moved and despite the alternative room been  bigger but it was on the 1st floor and over looked the hotel car park and had no balcony so we stayed put. We only did B&B as we enjoy going out to different places to eat and drink , but we did eat one night at the hotel which was nice enough and saved us having to walk into the old town of Riva. The old…", "date": "July 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r8225474", "sub_review": {"Value": 3, "Location": 3, "Check in / front desk": 4, "Rooms": 2, "Cleanliness": 4, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Royal Hotel Riva del Garda - Give it a miss!", "review": "Just back from a 'half board' holiday staying at the Royal Hotel Riva del Garda.  It seems that if there was a corner to cut to save money, then this hotel did it! The 1st room we were offered was on the 3rd floor overlooking the pool. However, to squeeze between a dressing table and the wall to get to the bed was not an ideal start. We asked to change rooms and were given a bigger room overlooking the trailer park, but it was a lot better. Breakfast was not much better, with powdered juice and powdered eggs made to look scrambled, accompanied by slices of meat - not the best start to the day! Dinner was not great either, again powdered soup. The staff were, however, lovely, helpful and friendly. The pool was not very inviting as it was surrounded by red and white hazzard chain.…", "date": "July 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g194883-d665075-r8134063", "sub_review": {}, "travel_purpose": "", "rating": 2}]