[{"title": "Beyond our expectations", "review": "We felt welcome at the place. Room was good. Internet in the lobby was descent. Reception service is perfect. Food is very tasty. Sea is nice. Animation is normal. Water sports are availible at the beach. Horse and camel riding at your service.", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297945-d679317-r718925941", "sub_review": {"Rooms": 3, "Cleanliness": 3, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Night club", "review": "Club staff has very bad attitude to customers. Took my money 20dh for 1 beer and didn’t gave me my change. Just told me to get off.  But souvenir shop staff was the best!!was so friendly and helpful, even gave us small gifts when we left! ", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297945-d679317-r715426412", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Diana Beach Hotel & animation team", "review": "Food choise is great & hotell is run so smoothly, great service in the eatery and cafeteria. Especially great customer service durind all day you face from animation team: Coco, Willy, Rico, Billy, Aziz, Moris, sorry, don't remember name of lifeguard  near swimmingpool. They keeping contact with customers, entertain children & parents, doing work on the beach, saving swimming tourists lifes even from near hotel & in general doing great work.  Evening performances of animation team for children & later on for all guests are great. A good experience in Hotel Diana Beach, Zarzis.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297945-d679317-r683834571", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Awful holiday! ", "review": "I was with my family on holiday in this hotel. We paid for room with view on the sea but we got view on the swimming pool. The room was untidy, sticky and absolutely disgusting. On the website they lie about almost everything. And Food? I think it was the most terrible thing on this holiday. Everyday we had the same food. I’m vegetarian and there were no food for me. No fruits, because melon is a vegetable. Unhelpful Staff, horrible behaviour. Restaurant was dirty as well. No cutlery, no plates. I was so disappointed and not feeling well after this food. And it wasn’t just me! My brother had stomach problems. So for me this was the most terrible holiday where I have ever been. ", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297945-d679317-r609525251", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "THE BEST HOTEL FOR EVER", "review": "I was with my family last summer . IT was the best holiday . all the staf from reception restaurant  bramen .......alll super perfect thx to all for the nice lovely funny time .and special thx for mr abichou the big boss for all his help In any time we asked. And biiiiig respect for our superrrrrr animation team with there lovely professionnel experience chef mr moez . we looooove u allll Kissss to alllll see u this summer", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297945-d679317-r482830828", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Worst Hotel I've ever seen", "review": "First of all i should mansion that this hotel should be rated as 2* star hotel or less and no more.  So what is it inside? We are a couple of students from Russia, stayed here for 11 days in july 2016. Advantages: Quite normal animation for 3* hotel, but the head animator did'nt know russian or at least english.  Guys on reception were wonderful, they always try to do their best. And maybe the beach. Mention - NOT THE SEA! Finally, that's all  Disadvantages: Rooms are outdated at all, TV did'nt work still the maintenace changet it physically (not repaired, just changed the tv box), There were a number of insects in the room. Spidets, Ants. View on the village and desert feels not very comfortable, also for 3* hotel.  Litter on the territory (bottles, etc.) A lot of flies on the…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297945-d679317-r393673690", "sub_review": {"Value": 2, "Location": 2, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Perfect place for the children holidays.", "review": "If you're expecting luxurious timespending it's better to choose another hotel. But if you want to spend great summer holidays with your children - this place is exactly for you. Very kind personal is speaking in every languages, even in czech or russian:) nice animation program dioring the whole day. Rooms are big, but correspond for 3 stars. Anyway you'll not spend you time in the room:) perfect beach and nice sweeming pool just next to the hotel building. For us it was a good new, cause we have to small children and we didn't want to walk a long way to the beach. So many thanx to Mr. Abichou hechmi for our family holidays:) ", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297945-d679317-r322690763", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Never more", "review": "Hotel is outdated with worn-out furniture in the rooms. Communication at the reception is very poor - you must be French tourists to get prepaid room, otherwise you get noisy pool-view or ground floor. The dining room looked like a canteen - trays and long lines for food. Although the food (chicken, lamb, beef) used to be tasty, but it was full of finely chopped bones, so it was not eatable. Thankfully there were pasta and vegetables. Pool bar was for fun - 3 tables with 10 robust iron-chairs, flies and re-washed disposable cups. Ugh. Disgust.  The beach was the only nice place, but only till came seaweed. Five meters wide black and smelly carpet remained lying there more days. Thankfully there was maintained and clean Eden Star´s beach in the neighborhood.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297945-d679317-r178536244", "sub_review": {"Value": 1, "Location": 2, "Sleep Quality": 2, "Rooms": 2, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "We love this hotel", "review": "This hotel was our best choice. Beach was beautiful, the sea was clean and warm, the people were friendly, the man did not ever get bored. The room was clean, smelled wonderfully . The food was fantastic. We were there with a baby who ate everything and had no problems. The evening program was  different every day and we were there 14 nights. Animators were great, friendly. The only thing we would have been criticized was hotel receptionist (female), who could not speak English well and some times they gave us wrong information because they did not understand what we wanted.  It was a wonderful holiday, we will return, but next time it will be for 3 weeks :)", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297945-d679317-r171844841", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Better than a dream", "review": "This hotel offers a variety of activities for everyone, no matter age, physical condition etc. You can either spend the whole day on the beach or near the pool but you can also choose to play petanque, beach volleyball, football or attand dancing course, aqua gymnastic, aerobic or archery. The animators are always willing to help, entertain, conversate - french however is a great advantage.  The rooms are clean and the staff is making their best.  Plenty of food for breakfast, lunch and dinner - poultry and fish meat, vegetables, fruit, sweets. Harisa!!  We are definitely comming back and I hope it will be soon.", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297945-d679317-r141637757", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "I have seen happier places", "review": "This hotel gives you the impression to enter into a chinese hotel. It's the combination of green glass doors, the wrong furniture and the rooms smell of dettol combined with anti-moth-balls. We were happy to leave this hotel for the one further up the coast, hotel Sangho. Walk-in prices are 45 Dinar per person which isn't bad but we preferred to spend double the price to have a lovely cabin on the beach.", "date": "March 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297945-d679317-r59662135", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 2, "Rooms": 1, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}]