[{"title": "Great Hotel", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r710633387", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Wonderful hotel!", "review": "We wanted to do a quick stop over for 2 days before heading over to cappadicia. For what we paid, it is a super hotel in the heart of Sultanahmet. Breakfast was great too.  Thank you  AJ and Rani England", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r692415558", "sub_review": {"Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nice place", "review": "What a great hotel! Small boutique hotel in a great location. The staff were so helpful and lovely and friendly. Our room was perfect. We had a different room the first night which wasn't so nice but it was because we arrived very late and were moved the next morning to a room next door. I am guessing that theres some renovation going on hence the first room being not as nice. Air conditioning was working fine so no problems there. Breakfast was gorgeous! Lovely fresh made omelettes every morning prepared by a great lady!..along with an array of fruits/pastries/juices/egg/toast and everything else. And the view was very special. Theres a terrace open to all at all hours and we had a few lovely nights up there watching the moon rise...just spectacular! Location was right beside all the sights and walking distance to tram/train to everywhere else. Tours arranged and airport transfers too by reception. Thank you to the whole team there that made our holiday so enjoyable!…", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r634303461", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great! Отлично! ", "review": "Upsides There was the best breakfast I tried in Turkey. The room was nice and clean. There was a water dispenser with cold and hot water in the lobby.  Downsides Only cold water in the sink, but there was hot water in the shower.", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r577835741", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "strong recommending hotel", "review": "We were here from 28.04.2018 to 04.05.2018. Hotel has got good location, good stuff, good breakfast, right rooms. I advise you this hotel, this is the best offer for this price. Сообщение для русских: отличный отель, хороший персонал, прекрасная терраса с видом на море, простой но хороший завтрак, великолепное расположение!", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r440263956", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very bad hotel", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r427999551", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Great location, but that´s all", "review": "I boked this hotel for 12 nights. When i arrived the rooms was terrible and the door was broken the lamp was have working. The phone didn't work and the rooms was small. The mirror was broken. The bed sheets had hole in it. The power socket was broken. And the hotel was old. And the pictures dose not fit the reality. When i told them about these problems they said we will fix it. But where were they before we arrived. So i had a problem with them. And i had to cancle the reservation and pay a fine because the room was non refundable. And by the way the reception gay was good but the owner was a very bad person.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r423520803", "sub_review": {"Value": 2, "Cleanliness": 2, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Good location and best breakfast during our trip", "review": "The hotel has really prefect location, with very friendly and helpfull staff, the price is for that location average, the room was really small, with very old demaged furniture, bathroom was quite dirty, there was a terrible smell in whole hotel, the breakfest served at the roof top is rich, but not very tasty, I won´t reccomend this hotel, I don't know the standard for Istambul, we were here for the firt time, but if this hotel was in Europe, it would be really expensive for value youľl get, definitly can´t reccomend.", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r357740671", "sub_review": {"Sleep Quality": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Very good", "review": "Very nice welcome on arrival with quick check in times. The rooms are a bit old and could use some improvement but it was sufficient to act as a clean place to sleep and explore the city from its great location. The breakfast was great with daily home made pastries with different condiments and was the best we encountered during our trip at different budget hotels.", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r352314139", "sub_review": {"Location": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Bad experience!", "review": "At first very nice welcome, staff was very funny, helpfull. Room was clean, comfortable bed, maybe bath was quite small, but everything was fine! If I had a chance to travel to Istanbul once again, I would choose this hotel. By the way, the location of hotel is perfect.", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r347128430", "sub_review": {"Sleep Quality": 2, "Rooms": 1, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Lovely and very good location ", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r324073677", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "FANTASTIC", "review": "Very good welcome,excellent service & convenience ! We have very fun the stuff are very friendly and cooperative. Is the best location for me because every thing are close.Morning was very diverse and do more special appearance on the tarrace. ", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r324069584", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "The BEST customer service that I've ever experienced.", "review": "This hotel had a fantastic location, fantastic staff,  the rooms were very clean and very comfortable. they just make you feel home. A terrace for breakfast with the mosque view si really great.  The Blue Mosque, The Hagia Sophia Basilica Cistern Grand Bazzar were just 10 min away with walking. great restaurants and great caffe bar in the area. i stayed for 4 days and absloutely would choose the same hotel in my next visit. A big thank you to the owner Sercan who was very helpful in everything we needed.  Great Job.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r316951820", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Lovely & Central", "review": "An absolutely faultless stay. I arrived in Istanbul at 10.00 AM, and headed to the hotel to dump my luggage as check-in was only at 1.00 PM. The owner kindly allowed me to check-in early, upgrading my room and telling me to help myself to breakfast. First impressions speak the loudest and working in the hospitality industry myself, I was immediately impressed. The next day my bank card was blocked due to fraudulent activity, resulting in the owner being very helpful and calming, arranging airport transfer and even offering me some money from his own pocket. He really went above and beyond. Not only is the service faultless, staff friendly and pleasant, location serene yet central, atmosphere warm and inviting, hotel majestically furnished, rates extremely reasonable - the…", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r314296628", "sub_review": {"Sleep Quality": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Super location and service", "review": "Very close to many attractions & all historical places and many restaurants around. Sorrounding area is calm and quite.. Terrace for breakfast and night views is really great. If not looking for luxury but relax and calm destination then you will have a good choice with Apex hotel.", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r298349338", "sub_review": {"Value": 4, "Sleep Quality": 3, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Fabulous place,fabulous staff,perfect location!!", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r297093108", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Friendly and well located", "review": "Fantastic location, within 5 minutes of walking distance to Arasta Bazaar, Blue Mosque, Hagia Sofia, 15 min walk to Grand Bazar, 5 min walk to Bascilia Cistern...loads of great Restaraunts, Cafes, shopping places, metro links all within minutes of walking. Also few minutes walk to Sea if you fancy a stroll. Great Shisha gardens around. Apart from the location, Sercan, the owner, is a fantastic host. A truly great guy with a good sense of humour, who cannot do enough for you. We travelled in a car( which was rather an expensive make) Sercan drove with me to different car parks to find a secure parking for me. When we weren't satisfied with the security of these car parks he very kindly moved his own car and gave me his space in front of the hotel. Gave us lots of valuable advice…", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r292547788", "sub_review": {"Location": 5, "Rooms": 3, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Great location ,friendly people", "review": "Very friendly and helpful staff, location very close to Blue Mosque and other sites, very nice breakfast, roof terrace. Was told that the owner was taking back charge after having outsourced management of hotel for a couple of years with bad results. Wants to bring back of the level-quality of service, and I believe they are on the right track! :)  Rooms were small and in need of a little love though.  They've already done some, but still needs a bit.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r285189143", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great location, great staff, super breakfast for super value", "review": "Apex hotel is a nice hotel with small rooms, no elevator, no water to drink in the rooms, you have to buy from outside but great location , near to restaurants,supermarkers, blue mosque, agia sophia, underground city and the sultan palace transformed to a museum. The breakfast is good not a lot of variety but it s delicious and clean . The most important is that they are so friendly and helpful specially to the kids.  The last night we wanted pizza delivery and the night shift guy sergent ( i don't know if i write it right) helped us . he was so nice calling from his own phone to pizza hut that was closed then to dominos pizza and came up to our room to take the order . Thank you so much Mr. Sergent .   Not to mention that the wifi is very good and the hotel is very clean", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r282032034", "sub_review": {"Sleep Quality": 3, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Mcquaids", "review": "This is a small little hotel run now by the family who owns the place so they are investing more into it. The owner, a young Turkish guy from Holland is very friendly and helpful, taking care of everything that you need without pushing you to take one tour or other. This place has the best breakfast we had in our entire Turkey trip in a rooftop cafe with a nice view which encourages travelers to talk among each other - we made several long conversation with Canadian, Pakistani, Iranians families staying at the hotel at breakfast time. Only downside is that the rooms are small but this is the most prime area of Istanbul, right behind the Blue Mosque so it is reasonable for the price. We had some disturbance on the first night due to whirring of aircon from other room but it was…", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r281587475", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very Welcoming", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r280401430", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "clean and cosy", "review": "Apex Hotel is in a great location within easy walking distance to Blue Mosque, Hagia Sophia, Basilica Cistern, Palace..... Owner and staff are super nice. Free WiFi and breakfast on rooftop terrace included. A taste of real Istanbul.  Had a great stay.", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r278418659", "sub_review": {"Location": 5, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "A warm welcoming place to be", "review": "Apex hotel is located in the heart of Istanbul offering you time saving trips to the main tourist's attractions such as SultanAhmet sq. Blue mosque, AyaSofia, grand bazar, arasta bazar, very close to metro transport, .....etc.  it is a renovated hotel clean and cosy, with picturesque terrace on which an inter-continantal amazing breakfast is served every morning to satisfy every diet and taste , with very friendly manager and staff who speak Eng. and give you useful info about the town and transport routs.", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r263568293", "sub_review": {"Location": 5, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nice Hotel", "review": "Situated near the Blu Mosque in the heart of Istanbul it's a fantastic place to spend your time and share magical experience with your loved ones. The staff is so welcoming, charming and pleasant. The breakfast was rich and full of everything. I highly recommend it and me and my family will definitely go back there on our next vacation. A wonderful experience. Lots of love from a couple from Niksic, Montenegro.", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r261336281", "sub_review": {"Value": 5, "Location": 5, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Value for money!", "review": "Small hotel but with strategic place , in the center close to everything ( Close to metero , blue mosque , Hagia Sophia Museum , le grand bazar and shopping places )  Rooms very warm with confortable beds , the staff was so nice , friendly , always smiling and so helpful , it was my first time in istanbul and i felt so comfortable at this hotel Just one thing  the Buffet restaurant hasn't lots of choice for 7 days always the same and there's no Bar in the hotel ! just reception and rooms  but Generally it's a nice hotel", "date": "February 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r257629143", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Super hotel", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r254636746", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great hotel! Nice & helpfull staff.", "review": "This hotel is a real family atmosphere!This hotel has a soulThe most beautiful experience I had a room in this hotelClose to museums, restaurants, public transport...all in a circle.The rooms are great, clean bathroom.Breakfast was good.The staff was very friendly and helpful.Good and fast internet.I do not have any objection.If I go again to Istanbul.We will be staying there again", "date": "January 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r251850942", "sub_review": {"Value": 4, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Average Hotel, You pay for the location", "review": "Thank you for your interest.", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r250356342", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Great location, improper booking process", "review": "Recently i had a short stay at Apex ( this was my third time) and i left very happy again. İt seems that the hotel has been taken over by the true owners, so this could only be an improvement, and so it is!! Before the service etc was good too, but now it seems like it got even better, because my room was so much cleaner then it was during my last stay (last year). The new owners told me, they are improving and renewing the hotel (also the interior of the rooms), so i am so curious about what it is going to look like when they are finished 😄! İ will surely book another stay at Apex, within a few months to see for myself😊  İf you are looking for a very central, nice hotel that's not too big, you should try this one! You can go walking to the most \"must see\" places in İstanbul,…", "date": "January 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r247893173", "sub_review": {"Value": 3, "Rooms": 2, "Service": 1}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "great location,rubbish hotel", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "November 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r239216383", "sub_review": {"Location": 5, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "apex is ok but the manager is a cheating liar", "review": "Room 126, is very small for a deluxe tween room. The hotel is worn and tired. In our three night stay, we needed to ask for towels, the shower room lock to be opened, the extraction fan does not work, no rubbish bin in room. At night I could smell cigarette smoke. Breakfast is limited, at 8.30 they ran out of cheese, butter and milk.", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r238922394", "sub_review": {"Location": 1, "Sleep Quality": 1, "Service": 1}, "travel_purpose": "Traveled solo", "rating": 1}, {"title": "Apex means high - this place is LOW!", "review": "DO NOT STAY HERE  I booked 3 nights, fiorst night it went well in the apex. the manager then moved me into another hotel 10 mins away which was disgusting.  with the single bed in there there was no room for me unless i was lying down, stains all across the walls  i compl,ained and got nowhere  when i got back i took it up with booking.com who at first were helpful, the mamager of the hotel lied on his emails saying \"i had requested a move\"  If i go to istanbul again I would rather sleep in the street than stay here", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r234332546", "sub_review": {"Value": 2, "Cleanliness": 2, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Great little hotel in the heart of Sultanahmet!", "review": "This is one of the worst hotels I've ever stayed in - and I've stayed in the remotest places in the world in a few dire places.  But, this is Istanbul which isn't remote and which I've visited many times over a 40 year period. This dreadful hotel almost destroyed my love of the city. Shall just list the faults in no particular order: Curtains hanging off rails, no volume on TV, bathroom light worked intermittently, room coffee/tea not replenished, windows would only stay open if held by a curtain, antiquated shower with shower head that would not stay in hold, toilet roll holder at ground level behind toilet, bathroom sink with dreadful ugly repair, room furniture should have been trashed years ago, poor lighting, the duvets had no covers, the toilet seat (cheap plastic rubbish)…", "date": "November 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r219811286", "sub_review": {"Value": 4, "Location": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Monica & Val Apex Hotel great place to stay in Istanbul", "review": "My husband and I stayed one night here since we opted to do an overnight layover with Turkish Airlines and then get a free tour of the city the next day. The hotel rooms are small and the décor is a bit old but that's the charm of being in the oldest part of town. The room was clean and the bed was not the most comfortable but it was just one night and you are not there to sleep. We wanted to get up early and hear the call of prayer \"which sounded amazing\". The night we arrived the front desk reception was very helpful we asked if they recommend a restaurant and he did and they came and picked us up and droped us off for no fee because we had dinner at their restaurant. The hotel is in an excellent location literally walking distance from the Blue Mosque and Hagia Sophia and the…", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r210314380", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Nice place in the historic Sultanahmet", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r206832455", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Worth the price.", "review": "Apex hotel: The good things first. Neat and clean, exclusive location, very close to the main attractions Hagia Sophia and the blue mosque. The reception is very cooperative and is always trying to be helpful. Secluded street and quite and peaceful locality. Breakfast not bad, though the arrangement is quiet basic. Don't expect elaborate stuff, but that's ok considering the price.  The bad things. The room could do with a little renovation. Room sizes are quite small with even smaller bathrooms. But that shouldn't matter really, coz the beauty is outside. But yes renovation is a must. The wall finishes are quite old. There was one scary experience though. When we came back in the evening after our day out, we were told that our rooms have been shifted due to some leakage…", "date": "November 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r204218391", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "priceworthy", "review": "We had a large room, with a functional toilet with hot water. I only paid 30 euro a night on booking.com. Room was quite pretty and beds were comfortable.  Location and view was fantastic.   Breakfast spread was basic. Cheese, olives, coffee and tea and toast. The view from the restaurant was amazing!", "date": "December 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r201853989", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Bad rooms and breakfast", "review": "Standard hotel in sultanahmet. Very good location, price is absolutely okay. Friendly staff. Rooms are big and comfortable. Cleanliness could be more better. But otherwise priceworthy. I paid 200 chf = ca.160 euro for 4 nights, double room with couple bed.", "date": "March 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r201647175", "sub_review": {"Value": 1, "Location": 3, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Comfortable well priced hotel very close to Sultanahmet", "review": "it was one of the worst hotels i have ever been , i was with my family , the shower has´t got a door so every time you go to shower you will find yourself in a big pool ! blinds fall down just when we arrived  it could hurt my mom but she was lucky . breakfast is very basic and they even has no oil !! , the best thing about it is it near to Sultanahmed", "date": "March 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r199750050", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "APEX, fabulous hotel I have ever seen", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "February 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r196331119", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "cozy place in city centre!", "review": "3 months ago I stayed in this lovely hotel. It was absolutely prefect to stay in this hotel. Rooms are so comfortable and clean. Breakfast on the terrace aganist to Bosporus is unique and hotel is next to city center. Thanks to helpful and genial receptionists, especially Nijat. Everything was excellent. I don't want write anymore, just one more thing, if you travel Istanbul, certainly you must stay at APEX HOTEL.", "date": "January 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r196125924", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Not worth the effort", "review": "one of my friend has request this hotel to me and when i was in istanbul i choose apex hotel with my girlfriend,we stayed there 5 nights and it was like a dream.. staff was excellent,they serve a breakfast on terrace with amazing view and breakfast was so fresh..room was so clean and i like especially location! every where on foot.. if i'll come to istanbul again i'll chose apex hotel exactly!!!", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r190890226", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 2}, {"title": "Excellent location & decent hotel", "review": "Location was good, walkable to most sultanahmet locations. But considering a great number of hotels in that area, this hotel is a poor choice. My bedroom was fairly clean, but toilet shower was clogged and remained so even after I informed reception. One of the reception persons didn't understand English, so communication was hard on days when the English speaking receptionist was away. Breakfast was below average, with the cheese spoilt. Also it'd become very noisy in lobby after midnight, and I had to call reception twice during my one week stay, to tell them that I was getting a lot of noise in my room. They told me that the hotel will book shuttle for my trip back to airport and pay it as well, but I later learnt that they never paid the shuttle. Overall, it wasn't worth the…", "date": "December 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r188412555", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Hotel worth of money spend", "review": "The best thing about Apex is its excellent location. Within walking distance of the Blue Mosque, Hagya Sohpiya & Top Kapi, it provides easy access to major attractions of Istanbul. Metro access is also nearby for travelling to other parts of the city including airport. My allotted room was of appropriate size with nice ornamental decorations. Breakfast on the rooftop was not grand but decent. Rooftop provides good view of the sea & Blue Mosque. The hotel staff was also nice & welcoming. All in all, this is a good choice considering the price range on offer.", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r180817849", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "We didn't get what we booked", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r180773374", "sub_review": {"Location": 4}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "LOVED the Location - Good Value", "review": "At arrival at Apex hotel, we were asked to sign the note - the already drawn amount from the Visa - we didn't get a receipt - but afterwards the receptionist kindly told us, that the bathroom was out of order. He advised another room, at the hotel on the opposite site of the street (same family/company, he said), as we had already paid, we felt we had to accept. We chose this hotel partly because of looks, and the description of rooms with balconyview, but were told, that no rooms had balcony. Unfortunately the bathroom at the other hotel was also out of order. We believe that Apex Hotel might be using this as a trick once in a while.", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r176320054", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great location, small rooms, awful breakfast", "review": "We stayed twice at this hotel, at the beginning of the trip for three nights and again at the end of the trip for two nights.  The rooms are small and the decor run down - but clean and functional.  Being that you are just a VERY short walk to the Blue Mosque and Hagia Sofia, and around the corner from a street of restaurants - we spent so little time in the room that it didn't really deter us in any way.  Camilay is a sweet lady that takes care of breakfast. I loved sitting st breakfast with a view of the water on one side and the Blude Mosque opposite with a cappuccino in hand.  The breakfast food was fresh, classic Turkish breakfast, but simple and minimal.  The shuttle service was an efficient and inexpensive way to get to the airport. It feels like a step up from the…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r173025910", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 3, "Rooms": 2, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "cosy Apex Hotel", "review": "We stayed at this hotel for three days last week. The location is excellent, but the rooms are on the small side, with an odd decoration that I do not think will suit all tastes. Prices are quite reasonable for Istanbul, though. By the way, the shuttle bus to the airport never arrived and we ended up taking a taxi!", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r166937703", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Best location of possible", "review": "The hotel has a very good location;you can reach the tourist attractions easily and sightsee the Old City comfortably.Hotel staff is really friendly and they make you feel home.On the terrace, partly overlooking the sea, you can enjoy your breakfast which is prepared very well by the kind lady who I really liked.Hotel is clean but rooms are not too large .If you like you can sit ,chat  and have a rest in the  verandah  designed in the  authentic oriental style . It  is certainly a budget- friendly hotel.I highly reccommend it to everybody who would like to visit İstanbul without spending much money.As a big family  (9)we all enjoyed our stay.", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r166251098", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Great little hotel, wonderful staff", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r159649847", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Best & Safe location; Clean but very basis and small rooms", "review": "Stayed here with my wife in the beginning of May 2013. The hotel is perfectly located with restaurants and sights within minutes' walk, in the wonderful old city of Istanbul. Although small, the room was clean and the service top notch and super friendly. Would recommend this to anyone looking for a weekend in Istanbul.", "date": "March 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r157313953", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 2, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "renovation", "review": "We stayed here for 3 nights in March 2013. The location was fantastic and its a 2 min walk to Blue mosque AND hagia sophia (yes! it takes you 2 mins to reach that park that divides blue mosque and hagia sophia so it takes you right in the middle)  The lane was clean, safe and very sweet and quiet. View from terrace was terrific and you could see the marmara sea.   Our purpose was to have a decent room with clean bed and bathroom. We only used the room to sleep at night and shower in morning before we left. This hotel adequately did that job.  Cons: Shower drain was clogged; breakfast was namesake and very bleh; room very tiny. NOTE: None of this bothered us and if we were to return to IST, we will happily rebook in APEX", "date": "December 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r148039080", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "they renovated hotel", "review": "it was nice trip with my husband coz this hotel was just located at center of sultanahmet area where is most histrical place in istanbul.  thats why we could turn back to hotel so easily when we bought lots of gifts, then we went back for sightseeing again. even if we forgot something...  and we didnt expect so much about hotel coz price was good, but hotel was just renovated, so the guest room was looking nice and clean. hotel staff were friendly and smiling.  we had good impression about Apex hotel. thank you.", "date": "December 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r148037719", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good location", "review": "i stayed there wit my wife first i afraid to make a reservation about bad comments but price is very good thats why i made reservation and when i arrive hotel stuff was friendly and smiling all the time its makes me feel like family hotel shower is little small but rooms and television and breakfast is great about location it takes just a minute to rich blue mosque and hagia sophia also topkapi palace thanks apex and apex hotel stuff i definilty will recomed all my family and friends.", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r145039995", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "This is a quite nice hotel", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "November 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r143982918", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "small room breakfast is poor", "review": "We satyed there for 5 nights in 2011. actually i booked a standard room at the first floor but they gave us a better room at the 2nd floor with a nice balcony. the breakfast menu includes very basics like cereal , sliced tomatoes, cheese ,hot coffee or tea. but its free and the place where they serve the breakfast is amazing and i also can say everything was so hygienic.the hotel staff is very helpful and friendly even if you have no idea what to do in the city  they always have some activity to offer with a reasonable discount.all in all you will get more than what you have payed.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r143507521", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Fantastic Hotel!!!", "review": "the location of the hotel was very nice. the room was tiny...breakfast was so poor. it was only 1 night to stay there but it is ok.. the price was reasonable .The staff is very friendly, warm, and welcoming..", "date": "February 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r139105440", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great hotel in old town", "review": "We stayed at Apex several times, and really enjoyed our stay. The staff is very friendly, warm, and welcoming, especially Nadim. He us some great tips on getting around the city, and allocated hours in chatting with us about the Turkish history. He even took time to resolve our conflict with a tour company that double charged us. We very much enjoyed our stay in Apex, and would recommend this place in a heart beat. Again, great staff, and great location. Hope you enjoy your time in Istanbul just as much as we did.", "date": "August 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r139009291", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "strongly recommend", "review": "We were picked up at the airport even though our plane was1hour late.  We were greeted by incredibly friendly staff.  Because we arrived early our room was not ready but once it was cleaned we were offered several rooms to choose from.  Breakfast is not over filling but satisfying.  The rooms are clean and comfortable.  Very easy to get around old town from this hotel.  Good restaurants are nearby.  My wife and I highly recommend the Apex to anyone looking for a relatively inexpensive hotel.", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r137779435", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Nice, quaint hotel in an excellent location that lacks a bit in the breakfast department.", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r133509914", "sub_review": {"Value": 4, "Location": 5, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Not clean and very run down!", "review": "Good budget hotel located central in the Sultanahmet area. Friendly and helpful staff. Overall good room quality. Breakfast could have had better selection though. Was OK.   Close to the tourist attractions. I would give the hotel my recommendations for a mid-budget oriented traveler.", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r133406881", "sub_review": {"Value": 2, "Location": 4, "Sleep Quality": 2, "Rooms": 1, "Cleanliness": 1, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Very nice people. Not very nice hotel.", "review": "Our room was not clean at all and our bathroom needed major renovations.  The owner was friendly but I would not stay there again!", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r132970865", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 2, "Cleanliness": 3, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Absolutely Disappointed", "review": "How do I begin? Hotel manager is one of the nicest person I have met in my travels but the hotel is something else. It has taken me more than a month to decide to write this review of my stay at Apex Hotel in Istanbul, Turkey.  I would strongly recommend that the hotel owners give all their bathrooms a complete overhaul. This is to save the business. Do it during the winter period.  I would like to come back to stay with Apex Hotel again. I will come to Tripadvisor and look at pictures to see if improvements have been made.  Thank you.", "date": "May 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r130249395", "sub_review": {"Value": 1, "Location": 5, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1}, "travel_purpose": "Traveled on business", "rating": 1}, {"title": "A very pleasant stay in impeccable conditions", "review": "A total disappointment, i was on a trip to Istanbul. I stayed in Apex Hotel for two days. The Stay was a total disappointment. The Room was shabby, small and poorly furnished, The AC was not working, despite promises made by the staff no one came to rectify the AC. The Shower glass door was broken and all the water spilled into the washroom while i took a bath which made me slip. The Breakfast time was told as 7 to 10 AM but till 8 am no arrangements were made despite various reminders given to the staff. Room wasn't cleaned on both days. There is no Lift in the hotel so one has to climb all the floors by stairs for breakfast or going to the room. Will surely cause huge trouble for elderly people. The standard of teh breakfast was below average. The only plus point the hotel has…", "date": "March 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r129633950", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Great place", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "March 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r125619061", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Nice Hotel, very friendly receptionists", "review": "Great place to stay while on visit to Istanbul. Perfect service, professiona and kind and incredibely informative. Perfect location, walking distance from most available sites. In the heart of it all! I was exspecially happy about the fact that requested outside takeaway ordering was available for just inside my hotel room when needed. And the minibar was excellent in its mulitple choices at offer as well as the walk out balcony was a plus for any attraction worth viewing from my street overlooking room.", "date": "December 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r122277177", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "wow amzing i m very enjoy in istanbul", "review": "we stayed one week, nice experience,   the receptionists helped us a lot especially Ceyhan, Luqman and Nedim.  Very good Breakfest  the hotel is located only two minutes from the Blue Mosque and Hagia Sophia in the Sultanahmet district", "date": "December 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r121880788", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Old and dirty", "review": "hotel apex i very enjoy apex hotel staff is very good service  Excellent. İn morning roof was so nice with sea veiw and blue mouqse evry think was great and aur room was so perty ,, if i come again in istanbul i will stay in apex hotel............,", "date": "December 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r121601001", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 3, "Rooms": 2, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled solo", "rating": 2}, {"title": "Great Location, excellent staff", "review": "I stayed there for one night, since the hotel I had booked had a problem and it wasn't a great night. The place is quiet but the place is so old that you feel as a (poor) sultan. The breakfast was also very poor, which I had to share with many birds.", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r120505114", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "professional staff, clean hotel in excellent location", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r119031089", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "True valued for money hotel", "review": "Excellent service from reception staff, who telephoned me when our coach was running 3 hours late, aid not to worry that the rooms were ready and waiting. Arrived at 3.30am, exhausted to be greeted by lovely staff member who checked us in quickly provided us with basic information i.e. map and breakfast times and showed us to our clean rooms. Wonderful location, nice roof terrace for breakfast with good choice of cheese / olives / cereals (what more do you need?) and plentyful hot coffee.", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r118259363", "sub_review": {"Value": 5, "Location": 5, "Rooms": 3, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Find somewhere else", "review": "Just ignore all bad comments, if you come to travel around Istanbul and not expect to stay in hotel much....this hotel is a must choice!!!! Room is fine, some problem with AC but still a good sleep. Breakfast also fine....but the most impressive thing is Staff which really generous and helpful....  Stay this hotel if you are real traveller!!!!!!!", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r117508030", "sub_review": {"Value": 2}, "travel_purpose": "Traveled solo", "rating": 1}, {"title": "Great Hotel, Excellent Location, Quiet Street, and Awesome Service", "review": "Before booking this hotel through expedia, I read some of the reviews here on trip advisor.  I ignored the people who had had bad experiences with this hotel, assuming it wouldn't happen to me. Unfortunately, it did: I paid for a room at the Apex but was placed further down the hill at their affiliate, Sultan's Eyes.  My single room was very small, had bad hot water, and had the constant company of ants (first discovered crawling out of my computer (!), which I had left in my locked suitcase on the floor (no opened food in it)), then making their way up my legs as I sat on the bed.  Don't believe the hype--find another place, there are plenty nearby.", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r116557709", "sub_review": {"Value": 5, "Sleep Quality": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "not a place go back to", "review": "Although there have been previous reviews of this hotel not being up to par, we had an excellent stay here and would stay here again. You cannot beat the location, it is less thank a KM away from the Blue Mosque, Hagia Sofia. And only a short walk from the nearest tram station called Sultanahmet. We got upgraded to a nice room on the third floor which was awesome as well. If you are looking for a spacious room then here is not where you want to go. But if you are like any adventurous traveler you will not spend much time in the room anyways. The shower and toilet were okay although we did have some problems nothing to major. You will hear the 430 AM prayer calls if you keep the window open so I would just close it.  The staff was great and helped us whenever needed. The FREE…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r115586841", "sub_review": {"Value": 2, "Sleep Quality": 2, "Cleanliness": 2, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "great choice", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r114673088", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Beware!!  Bait and Switch", "review": "The hotel is located at a quite street very close to agia sofia and the blue mosque. The employees at the reception were exceptionally polite and they could speak english rather fluently. The manager of the hotel was also very helpful when we asked him  to make a reservation change. The room was cosy and was being cleaned every morning. The breakfast is served on a balcony on the top floor with great view. I would suggest this hotel with no second thought!", "date": "June 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r112441563", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 1}, {"title": "Stingy management", "review": "So you know how you sometimes you read that lone trip advisor review that's horrible and you're like \"that sucks, but what are the chances that will happen to me?\"  Well, apparently they are pretty good!!  Another reviewer wrote about a bait and switch about 1 month ago, and I read it, and still booked because of all the other positive reviews.  However, when I arrived to check in, the couple ahead of me was having trouble.  They had booked at APEX, but there was no room for them, so they would have to stay 100 meters away at the \"sister\" hotel.  Off they went.  So now I go to check in, same situation!!  how many rooms are they going to overbook? and I was staying more than one night!  So i'm laid back, I go with the flow, go to check out this other hotel.   It's called the…", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r111166318", "sub_review": {"Value": 2, "Sleep Quality": 2, "Cleanliness": 2, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Excellent location, service and value", "review": "Good: Location is good being very near many of the most desirable attractions and the price is lower than some surrounding hotels.  Bad: stingy beyond belief. It became a joke between my wife and me saying: \"sure we have \"x\" ....- but you can't use it!\".  There are fan/AC units but they removed the remotes because \"it is not hot enough for ac yet\".  There are shower jet panels but the valve handles have been removed.  There is a glass cabinet proudly displaying the yogurt, milk, etc that you would like to enjoy for breakfast at the rooftop but  it is locked.  The server hardly ever gets around to setting these things out and if you ask you can be sure to never have them.  Maintenance was lacking also. The shower hose and nozzle were broken so that you could not secure it…", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r110628415", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "What a Sweet Hotel", "review": "We stayed at the Apex hotel for 5 nights.  We were very happy with our choice.  The location of the hotel is perfect.  The service was amazing.  Ceyan, who works at the reception desk, was extremely helpful and kind.  He is possibly the nicest and most helpful person we have ever met.", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r106865889", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Bait and switch? No, more like Sell and then switch", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r106404465", "sub_review": {"Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Best Location, Friendly Staff, Great Price", "review": "I feel aggrieved at what this hotel just did to us.  We went to Istanbul for the Easter weekend and when we arrived with our printed out direct confirmation from the hotel itself were told that there was no room for us. What are people meant to do in such circumstances, wonder off and try and find another place on a rack-rate at 5pm?  We were told that we would be put up at an associated hotel 100 metres away, and upgraded from a standard double to a suite. But the place we ended up is ranked something like 150th in Istanbul, versus 50th for the Apex. Plus we had the rigmarole of re-checking in with reception who could not seem to grasp that we were referred at our booked rate and not simply walk-in customers on the rack-rate. Then the 'suite' well it was their best room, but it…", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r106312225", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Lovely staff, perfect location", "review": "I stayed at the apex 4 nights at my 4th visit to the most beautiful city in the world. We were 2 women traveling, we never felt unsafe at the hotel, Lockman, Yacob and Yassin took care of us and helped us. Our room was perfect, the location was great and the price was very affordable. I will go back to the apex next year during my 5th visit to Istanbul. I loved the hotel and the staff.", "date": "March 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r102215518", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Perfectly located hotel for a long stay in Istanbul", "review": "I spent 2 nights in this hotel and I was extremely happy and satisfied with everything. Service is excellent, everybody is willing to do the extra mile to make your stay comfortable. They are really like a family and the hotel is like staying at home - with a lovely balcony used for breakfast. Breakfast is really good, good variety and the view is second to none. Perfect beginning of your day! My room was spacious, clean, comfortable, quite with all the necessary amenities. Great tea selection!  Location is perfect, few minutes walking distance from the most popular hisotrical buildings in Sultanhamet, from the seaside, etc. I will be back to Istanbul and I would not stay anywhere else. Thank you, all of you, who looked after me during my stay.", "date": "March 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r101474044", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Great recommendation from Trip Advisor", "review": "I stayed at this hotel for 1 night more by chance. Wondering whether to stay in a hotel at all with a flight at 5 a.m I decided to go for the cheapest hotel I could find in Istanbul. It was a fantastic choice. Located 5 minutes walk from the Topkapi, Blue Mosque, in a quiet street in Sultanhamet, a quiet area away from all the hustle and bustle of Istabul. A taxi to the airport took 20 mimutes and cost 40 lira. I wish I had stayed here for all 4 days of my long weekend. The whole hotel is spotless, the rooms have all amenities you could wish for.", "date": "March 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r99572929", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "nice hotel in old city", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "February 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r99021011", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Great hotel in fantastic location", "review": "We found the hotel by a online agent. it is in the old city of Istanbul with nice rooms. The staff is also friendly and welcoming. Especially very handy to tram station. good value for vacation.", "date": "February 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r94706635", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "I LOVE APEX HOTEL !", "review": "I have been remiss for not writing this review sooner.  My mother 75yrs and myself stayed at this hotel for two nights before we headed to the shipping docks to board a cruise liner.  Our experience of this hotel was 1.  very close to the tram statıon.  2.  very close to tourist attractions like the Blue Mosque and Cistern.  3.  Our room was nıce and clean.  Although we were there in the winter we still had our breakfast outside on the upstairs deck, by the way breakfast was delıcıous.  4.  The staff were great from my online booking with numerous emails through to carrying our bags to and from our rooms.  I also received a Blue Mosque statue which has pride of place among my many travel treasures.  5.  I would not hesitate in returning.", "date": "January 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r94649610", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "very nıce hotel!!", "review": "Apex hotel is really lovely the staff is friendly , the rooms are comfortable , clean and really beautiful !! it's because of this hotel that i enjoyed my holiday at Istanbul for the very first time!!  wish all the best to all the staff over there !! i will always go there every time i go to Istanbul , Love you apex hotel !! <3", "date": "January 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r92549880", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "I don't recommend!! We didn't get a room!!", "review": "were came to thıs hotel. very close tram statıon& blue mosque  nıce vıew, and room ıs very clean and every day breakfast ıs delıcıous.  and every day clean room survıce ıs best! staff ıs very kınd and frıendly were a lot of request to staff, they are always kındly reply    tatal - very nıce hotel .we wıll comback!!", "date": "December 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r92269293", "sub_review": {"Value": 1, "Location": 1, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "nice little hotel in a good location", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "December 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r92219128", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Above and beyond", "review": "Stayed here for one night in December 2010. This is a nice little hotel, within 10 min walk of the Blue Mosque and Aya Sofia. A bit hard to find at first, but once you find it the location is great. Had a lovely stay for my last night in Istanbul!  Amazing little rooms with heat and a good clean bathroom. Terrific to have internet in the room!   Just a few little FYIs for future travelers looking up this hotel on Tripadvisor that are no means criticism of the hotel and absolutely have not been considered in my review :   The rooftop terrace, where breakfast is served, can be a bit chilly in the winter as the plastic sheeting that serves to help keep out the elements does not keep out the cold. You may want to bring your coat the first day you are there if traveling in the winter…", "date": "December 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r91140401", "sub_review": {"Value": 4, "Location": 5, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "Lots of room in this hotel, but only for improvement.", "review": "We booked online so didn't know what the rooms would be like in reality. They're not great but they're clean and comfortable. The big plus here is that the staff are very helpful in fact they are more helpful than most staff at 5 star hotels.  ", "date": "December 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r91082366", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 2}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "perfect place for sight seeing.", "review": "In my book a good budget hotel must have unquestionable cleanliness, a comfortable bed and a decent bathroom/shower. Rating the Apex hotel against these I would give it a 'fair' rating.  My first impression of the hotel was soured by the smell of bad plumbing that pervades the lobby and staircase. Luckily our room was odor free and looked generally clean. The decor was nice, if a bit kitschy. Our triple room had three single beds set in a row and felt a bit cramped at times. The bathroom was small but not tiny and had a modern looking shower. Unfortunately the fancy shower didn't work properly and the water trickled out of the shower head rather than exploded. The hotel has a free wireless internet connection, however the connection on our floor was not working. We reported it…", "date": "December 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r90727470", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent value for money", "review": "didn't had big expectations about this hotel to begin with. but they turned around my views and was very happy that i have chosen this hotel. first of all, it was located near to blue mosque which is one central part of istanbul and so close to many sight seeing places. hotel is small, but their service is very good. rooms are well decorated and comfortable. prices are very very reasonable and you have added benefit of free wifi acess.  but the big plus point for the hotel is their staff. very pleasing, helpful, always pleasant and they will make you feel so comfortable.   to end with, some not so plus points...the bathroom was small ( probably not all ). they have lot of breakfast choices, may not be to your liking. but i liked their choices. it's not like 5 star variety, but…", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r88957183", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Cozy hotel in the heart of Old City", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "November 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r88717321", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "", "rating": 4}, {"title": "Thank you for the lovely place", "review": "My husband and me spent 3 nights at the Apex Hotel and it has been a great deal! The hotel is nice, room clean and breakfast tasty. You get everything you need.    Location is fantastic just few meters away from Blue Moschee, Saint Sophia and Topkapi Palace. The staff was really friendly and ready to satify our requests or to advice us where to go.", "date": "October 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r88403450", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great location and super-friendly staff", "review": "Very nice cozy place - small and friendly. The whole area though is full of nice little hotels like this one. It's a great destination in Istanbul.", "date": "October 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r85460146", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "comfortable hotle", "review": "Apex is a good mid-budget hotel that is very conveniently located for all the sights of Old Istanbul. What makes it special are the people who work there. They make a great effort to be helpful and personable. For example, on my father's birthday, they surprised all of us with a cake.", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r81971571", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Home away from home!!", "review": "Apex is a perfect place to stay. The staff was very nice and friendly and helpful. hotel location is excellent, Breakfast was good on the roof top terrace very nice view. The staff speak English . Free internet.  Room and bathroom was clean. Thank's for Mr.Ibrahim , Mr.Lukman , Mr.Elias and Miss.Ozlam. Thank's for every body in Apex hotel.", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r81420851", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Nice boutique hotel", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "September 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r80665560", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great location and reasonable value", "review": "I stayed here for one night at the very end of my trip, in the hopes of saving some money.  The rest of my time in Istanbul, I stayed at Millennium Suites, which was wonderful, but cost more.  Overall, excellent for the money.  You'd never consider this a five-star hotel, but that's not what you should expect given the very low price.  I think of this as a very cozy, serviceable boutique.  The front staff is extremely friendly (almost a bit too friendly when you're exhausted, but can hardly blame them for that).  The rooms are not huge, but comfortable enough.    The beds are a bit on the hard side.  And the bathroom is tiny tiny.  Still, I enjoyed my one night here, and would stay again on this budget.", "date": "March 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r77854415", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "harika.....!perfect......hotel at the best place!tessekur enderim from greeks!", "review": "This place has a great location, with a central location but also quiet enough since it is further back from the main street. The staff are reasonably helpful, although at times I wondered whether they completely understood my questions. They, thankfully, helped us print our plane tickets the night before. We had difficulties with a missing plugin on the main computer, but in the end it was figured out.   The rooms were small and my gripe is mainly with the washrooms. We couldn't figure out how to use the shower. The breakfast was buffet-style but fairly minimal. We had a hard time getting an early breakfast. The staff were usually still putting things together after we had finished and left. I don't think we were able to have anything that was served hot.", "date": "August 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r76824815", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Terrible - worst hotel experience ever", "review": "It was really very friendly the people and the place at the hotel......I m from Greece and really...I couldn t beleive that in turkish I would have the best vacations ever! The hotel has the anatolian character and the rooms as well...with very beautiful and hot design! Turkish people at the hotel very friendly!.....I m looking forward to go again there! Tessekur enderim kardasia", "date": "July 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r72849616", "sub_review": {"Value": 1, "Location": 4, "Sleep Quality": 1, "Rooms": 1, "Cleanliness": 2, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Quiet, lovely staff, great location", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "June 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r68597530", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "A customer friendly small hotel in a location convenient to the main sights.", "review": "The hotel is in a great location near all major sites in Sultanahmet. We were able to walk to all sites from the hotel. The staff is wonderful-- they made us feel welcome and made us laugh as well. The rooftop terrace is lovely with great views of the Sea of Marmara and the Blue Mosque. There is also a quiet, shaded sitting area in front of the hotel, which is a nice place to rest, talk and have a cup of tea (which the staff always seemed happy to provide). The rooms were a bit small, but comfortable, quiet and clean.", "date": "June 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r68097560", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Warm hospitability", "review": "We were greeted like family on our arrival  and throughout our stay treated almost as family by the hotel team. They went out of their way to help make our stay memorable. They were able to recommend good restaurents local to the hotel, provide travel tips and suggestions  for sightseing. Rooms clean and comfortable, with working aircon. Ideal position for the main sights.", "date": "June 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r67036897", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Excellent staff good location rooms require some attention", "review": "The hotel is clean, nice and near to the most important touristic attractions located in the old city of Istanbul. The staff is very friendly and ready anytime to meet the guests requirements.", "date": "May 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r66253339", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 3, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "location, location, location", "review": "In common with other reviews the staff at the Apex are the hotels greatest asset, helpful courteous and friendly. The location is excellent for visiting all the main touris sights in Sultanahmet. Our only reservation was that our room was 'tired' and would have benefitted from a degree of decorative refurbishment and  maintenance of the fittings.", "date": "May 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r65751614", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Fantastic service makes all the difference.", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "May 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r65053966", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent location with outstanding service", "review": "My wife and I have stayed in all sorts of places, backpackers thru to 5 star hotels.  And, whilst the Apex is certainly not a 5-star hotel, our stay there was one of the best we've had anywhere.  The staff there are the best - friendly, attentive, courteous, helpful.  They made our stay in Istanbul very pleasant.  We also got a great rate, at which we believe it to be a bargain.    Negatives:the breakfast wasn't the best we've had in Istanbul, and it is a little difficult to find at first, but hey, thats Sultanhamet.  We'd recommend the place to anyone.", "date": "May 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r64015130", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Brilliant hotel!", "review": "I just stayed at the Apex Hotel for the second time in a year and thoroughly enjoyed my time there. It is just a short walk to the seaside, fish restaurants, and pubs and restaurants below the Blue Mosque. The hotel is located on a quiet street. The service is impeccable. Emrah is forever helpful at the front desk and Ibrahim makes sure everything is in top order for you. These guys are more like great friends or family! They make me feel at home in Istanbul, and I will certainly stay there again. See you guys at the White House! David", "date": "March 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r63681537", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great location and wonderful staff", "review": "I don't have enough nice things to say about this hotel. It was clean, excellent location, quiet (we were on the top floor) and the staff were unbelievably friendly and helpful. It's about 5 minutes walk from the Haga Sophia and Blue Mosque, and not far from other sights.   Rooms are fairly spacious, clean and the decor is great. We had a few cupboard door handles come loose, but even that just seems to add to the charm! The staff are fantastic, will offer any amount of help and welcome you to sit and order pizza with them! Really nice place, great atmosphere.", "date": "March 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r63212991", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Warm welcome, excellent service, remodeled rooms!", "review": "We thoroughly enjoyed our stay at Apex Hotel.  The staff was very friendly and helpful.  The room we stayed in was clean and spacious.  Emrah had excellent recommendations on restaurants and directions how to get to them.  The location is perfect for all the main sights.  There really is no other place to stay when in Istanbul then the Apex!", "date": "April 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r63000221", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Extremely nice staff and very good location", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "April 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r62796002", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Turkish hospitality in its best", "review": "Our stay was part of a quite long trip. We had a not pleasant surprise at first as the double room was not available. After a friendly discussion we got the room.  The staff, mainly young people, Emrah and the other guys, were extremely nice and helpful all the time. All the stay was very good. The hotel, a tipical boutique is ok, but could be better. The location, in old Sulthahmet is very good, close to a lot of historical places and not far from the tramway, which is very useful.", "date": "April 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r62558371", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Enjoyable hotel", "review": "A lot is written about hospitality of people working in this hotel. What can I add? I can only assure you that it's really true!  I has just asked about possibility of changing room to the one with the city view and in five minutes I was moving my luggage without any additional charge.  And finally before my leaving I got a wonderfull turkish coffe from guest relations girl who really cares about all guests.  The only thing which can bother is that everything what is screwed in the wall do not work :) I mean they need to take new screws and make it again.", "date": "February 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r62542354", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Unexpected delight", "review": "Apex is a perfect place to stay - nice and warm atmosphere, friendly staff, comfortable (not large) rooms, good terrace view, calm street, near most of Istanbul attractions.", "date": "April 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r62359466", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Great location, nonexistent breakfast", "review": "I stayed here 'by accident' due to the volcanic ash cloud but really fell on my feet. It is the perfect place to explore the historic part of the city. You can have breakfast with a view of the blue mosque. It is in a quiet road, but also a short walk to some busy, party, streets with the youth hostels etc, so you can choose to enjoy that side of the nightlife, or to go elsewhere as you see fit. The staff in this hotel were great fun and very helpful. They even offered me some delicious home cooked food that they were having for their lunch! I would be happy to stay at Apex again with its interesting (if compact) rooms if/when I return to Istanbul.", "date": "April 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r60228634", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 2, "Rooms": 3, "Cleanliness": 2, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "romantic heaven to stay with", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "March 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r58147603", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "An excellent little hotel with very friendly staff in a great location", "review": "A stylish cozy boutique hotel with great room accommodations, polite and helpful staff and excellent pricing. Centrally located to all essential sightseeing of Istanbul right in heart of historical part of Istanbul - Sultanahmet, this is a MUST stay for those in on personal travel and even romantic vacations. By the way, it is located in a quiet area surrounded with fairy tail and other beautiful small hotels within 5 minutes from Aia Sofia, Blue Mosk and may be 10 minutes from Grand Bazaar. I have stayed at this Apex hotel on several occasions now and rate it very reasonable. Why? Because the service is excellent, the staff are consistently pleasant and helpful, go out of their way to assist and the room I continue to choose has excellent light and views (such as they are).…", "date": "February 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r56835770", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Great hotel! Great people!", "review": "An excellent little hotel with very friendly staff in a great location in central istanbul.", "date": "January 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r56050525", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Comfortable clean, well located and good value", "review": "This is a nice little hotel in the heart of the main historical district in Istanbul. Our room was clean and comfortable. The breakfast (Coffee, tea, bread, cheese, meats, etc) on the rooftop was fantastic way to start the day. The hotel staff are fantastic, going out of their way on many many occasions to help, give advice and make our stay more enjoyable.   If we go back to Istanbul we would definitely stay here again!", "date": "February 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r55578790", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Good hotel for its price. Excellent staff who go out of their way to help tourists", "review": "I agree with the other reviews that the great thing about this hotel is the pleasant and apparently genuine nature of the people running it. The room was about three star  but the staff, the convenient location, a comfortable bed, and nice views from the rooftop breakfast area meant that it was a five star place to stay.", "date": "January 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r54772156", "sub_review": {"Value": 4, "Location": 5, "Rooms": 3, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "You will not find a better hotel...truly amazing", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "January 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r54386553", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Best value in Istanbul!", "review": "If you want peace of mind...choose Apex hotel If you want to feel at home.. choose Apex hotel If you want a beautiful buffet breakfast overlooking the Bosphorus and Blue Mosque... choose Apex hotel If you want staff to meet all your need... choose Apex hotel If you want spotless clean rooms... choose Apex hotel If you want to be picked up from the airport... choose Apex hotel If you want advice on what to do during your time in Istanbul... choose Apex hotel If you want value for money... choose Apex hotel If you want free internet... choose Apex hotel If you want a hotel that is 2mins walk from Arasta Bazaar, 4mins from Blue Mosque, 6mins from Hagia Sofia, 7mins from Sultanahmet tram station, the Hippodrome, the tomb of Sultanahmet, the Turkish and Islamic Arts Museum, Topkapi…", "date": "December 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r54320723", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Excellent french fries for breakfast", "review": "The staff of the Apex Hotel were wonderful, the free buffet breakast was generous and the location of the hotel is incredible!  Easily the best value in Istanbul!", "date": "November 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r54308001", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Friendliness of staff and close location to all major sites", "review": "Staff extraordinarily friendly and welcoming.  The breakfast was very good and tasty, clean rooms, nearness of the historical sights, free transfer from Attaturk Airport.", "date": "January 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r53936352", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great Value, Great Hotel", "review": "Even though the room was a litle small, the friendliness of  the staff and closeness to all the major sites was worth it, as we only used our room for sleeping.  The breakfast buffet on the hotel Terrace had a breath-taking view of Miramar Sea.  The breakfast was very goo too, lots to choose from.  The manager was so gracious and met our every need from getting my new laptop started up to making phonecalls.  If every hotel treated their customers this way they would  all be repeat customers.  Coffee was provided in the lobby 24-7, which was nice.  This hotel had the ambiance and romance of  a bed and breakfast only quieter.  Hotel is on a back street, away from th noise of any trafic so that was nice too.   The morning call to worship didnot  disrupt my sleep either,   Like…", "date": "January 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r53770982", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nice, caring and helpful.", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "December 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r52025651", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Excellent Experience", "review": "I stayed at Apex hotel for four nights and I must admit all the staff were very friendly and helpful. They do not speak English as good as I would expect in England but you can communicate quite easily. They arranged hotel for me in Cappadocia and gave them personal assurance that I will not cancel the booking. They helped me find an economical flight to Konya and helped me book on Turkish Airline's Turkish website, as the same flight was TL100 dearer on the English website. I stayed at three more hotels in Turkey but their breakfast was better than all others.  My parents are planning to visit Istanbul this April and I have already suggested them to stay at Apex.", "date": "November 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r51594773", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "This Hotel Lives to its Name", "review": "I booked this hotel, reviewing the comments on the hotel on Trip Advisor. I found the experience of staying in the hotel excellent. The front desk is extremely helpful and gave us good advice on the tours and transport arrangements. The rooms were decent and we found our stay very enjoyable. A great bargain for the price we paid.   Zahid", "date": "December 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r51585008", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Loved It", "review": "Apex is an Awesome experience for us (me & my wife). We got more than we expected after reading reviews about hotel from the hotel and its staff. I would specially like to mention about the kind of guidance Emrah(receptionist)has provided us in exploring Istanbul and its lesser known places. He has answers to all our queries during our stay in Hotel, and more importantly the answers were perfect. Thank you Emrah & entire Apex Hotel staff for all your support during our memorable stay in Istanbul.", "date": "March 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r50657947", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Excelent hotel and wonderfull staf, the best option in Istambul", "review": "I only stayed at the Apex for one night.  In the middle of the night I had an allergic reaction to medication.  The staff went out of their way to care for me.  They called a doctor to my hotel room and bought food to the room as well.  They would not let me leave my room until they took me to airport the next day.  I have never been treated so well by hotel staff in my life.  The hotel is in a great location and although I only had one day to explore the city before becoming ill, everything was in reach so I actually did manage to explore some of the important sights of this great city.  An email from staff before my arrival actually said at the hotel it is warm and friendly and like family.  This turned out to be so true.  I will always look to this hotel as my first choice on…", "date": "November 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r50463818", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Very good hotel, exceeds expectation,", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "November 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r50393417", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great place to stay!", "review": "Location amazing 2 minute walking from Aya Sophia and sultan ahmet money value amazing, staff friendliness beyond expectations, room have an amazing design, i recommend it to any budget traveller family, the  Manager Ibrahim and the working staff Emrah and Osman were very friendly people and i would go there again,", "date": "November 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r50181416", "sub_review": {"Value": 4, "Location": 5, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Friendly, Hospitable, Clean, Excellent Location & Well Priced!", "review": "We stayed here for 5 nights, the room was lovely, not very big but you're out and about during the day. The staff were excellent, very very helpful and friendly, the location is fantastic-right in the heart of Sultanahmet, lot's of restauraunts and bars just around the corner, yet at night it was very peaceful. It's very near the Blue Mosque-no better location! The attention to detail in the rooms was great, slippers, fluffy dressing gowns, toiletries, kettle, tea, coffee etc- TV too! There's also a safe- not that we felt like we needed one but it's there anyway, minibar too- everything you could wish for and 24hour reception staff who actually want to help you. GREAT TIP- to get back to the airport- taxi costs 30 Euros- get on the tram near the Blue Mosque to Zeytinburnu, then…", "date": "November 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r49881867", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "a warm and intimate stay in an ideal location in the heart of historic old town istanbul", "review": "Great little place!  Stayed with my girlfriend and another couple.  We had orange juice and coffees on arrival, all the help possible during our stay and sandwiches  on departure!  Staff are lovely, rooms are traditional and very clean.  Would definitely go back and would Definitely recommend!", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r49855008", "sub_review": {"Value": 5, "Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Friendliest staff", "review": "We had a wonderful time at the Apex Hotel.  It exceeded our expectations in its charm and hospitality.  Ibrahim, the manager, consistently went out of his way to offer information, services, and friendliness.    We felt exceedlingly well cared for by the entire staff.  One evening the cook prepared special homemade food and we were invited to share dinner with the staff celebrating Ramadan.  We received helpful information that enabled us to make the most of our visit to Istanbul.  For the money we couldn't think of a better place to stay in Istanbul.  Give Ibrahim a call.", "date": "October 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r49834630", "sub_review": {"Value": 4, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Ideal location with perfect ambiance", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "November 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r49705245", "sub_review": {"Value": 4, "Location": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great place at great price", "review": "Located just steps from the Blue Mosque, Hagia Sophia, the historic cistern and Topkapi Palace.   The rooftop terrace breakfast buffet affords a breathtaking view of the Sultanahmet district, the Sea of Marmara and the Bosphorus.  The Apex is a jewel with a friendly knowledgeable staff.    ,", "date": "November 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r49694292", "sub_review": {"Value": 4, "Location": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Quiet well run hotel convenient for all the sites", "review": "After reading the other review online, I decided to book this hotel.  My email inquiries were always answered in a timely fashion, and were always polite.  Upon arrival, we were greeted by Lokman Yunushan, the person whom I had been emailing with.  He could not have been any more hospitable or polite.  We were treated like family, and offered our choice of a double room or a triple.  Although there were just the two of us, we chose the triple room.  It is about the size of a standard US room, but there are three twin beds.  The double was very small with only one double bed, so we opted for the extra space.  The room was clean and comfortable, with a modern shower and clean bathroom.  In the morning, you can go up to the terrace to experience what a breakfast in Istanbul…", "date": "May 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r49512725", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A home-away-from-home in the heart of historic Istanbul", "review": "Whilst possibly not the most glamorous hotel you could book it was well managed and very very hospitable. The manager and staff were ever helpful without being pushy, in fact when a better room became available at short notice we were offered it at no extra cost. The rooms were comfortable and breakfast was enjoyable one the roof terrace. And it was conveniently located near the blue mosque so site seeing was easy.", "date": "November 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r49503586", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Great location, friendly owner/staff, great value.", "review": "We recently stayed at the Apex Historic Hotel for five nights, and appreciated finding it on tripadvisor.com.  The location is perfect for exploring Istanbul, and the neighborhood was charming, friendly, and felt very safe. The staff was very helpful, breakfast was lovely, and the room was quite comfortable. We felt like we were \"at home\" while there.", "date": "July 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r49416816", "sub_review": {"Value": 5, "Location": 5, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Don't Stay Here", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "October 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r48990587", "sub_review": {"Value": 1, "Location": 4, "Rooms": 1, "Cleanliness": 1, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Good hotel, but not great hotel....", "review": "We can't understand the good reviews this hotel has received in the past on TripAdvisor - which was the only reason we chose it!  This hotel is overpriced, not particularly clean and across the road from two excellent hotels either of which would be a much better choice.  The friendliness of the staff does not compensate for the tired rooms, average breakfast and scruffy decor.  If you are looking for an hotel in this area of Sultanamet try the Ferman or the Aveccina across the street which are a similar price and of a much higher standard.", "date": "October 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r48804897", "sub_review": {"Value": 3, "Location": 4, "Rooms": 2, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Front desk staff the most helpful ever found", "review": "First time to Istanbul, wonderful city!! Hotel was good, but cannot see why it is so popular with Tripadvisor reviewers? It is a good three star hotel, no more. The room was probably the smallest I have ever stopped in!  Breakfast was on roof top, it rained the last two days and was quite cold. I realise that for most of the year Istanbul is sunny, but there were no area to eat indoors? Staff were very helpful and friendly, and excellent location. I appreciate the price we paid, 50 Euro's per night, for the area we were stopping was very good value, and some great restaurants also, but sorry, cannot see what all the fuss is about.", "date": "October 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r47883860", "sub_review": {"Value": 4, "Location": 5, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Average at best. Great location but hotel left a lot to be desired", "review": "Stayed at this hotel with another couple. We are all well travelled & rated the hotel highly. Ideal for a short break visit., and within easy walking distance of Blue Mosque & good restaurants. The rooms were modest, but clean and the beds the most comfortable we have found in some time. The staff were so friendly & helpful...the owner vetted my list of suggested restaurants, and the desk readily telephoned attractions to check on opening times etc. & to book restaurants.", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r47399268", "sub_review": {"Value": 4, "Location": 5, "Rooms": 2, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Cozy", "review": "Booked this hotel based on price and strength of the reviews. I can't fault the helpfulness of staff but this really is not a great hotel. Rooms are very small, we were moved out of the first room which was so small it had a mini wardrobe propped up near the door.   Location is fantastic but the hotel is very basic. Not boutique in any sense of the word. Next time I will pay more and have a little bit more comfort.", "date": "July 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r47108548", "sub_review": {"Value": 4, "Location": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "If you go once, you will go again!", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "October 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r47095200", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent service!", "review": "Very nice boutiqe hotel, in the historical centre of Istanbul, in a quite and beautiful little street, only 5 minutes walk from Saint Sofia and the tram stop.  The personel is very friendly, kind, willing, helpful, polite. The rooms are very clean with nice decoration. A little bit small but no problem. The breakfast is full of goods, what I expected to find. Nothing more and nothing less than a good hotel breakfast! Thank you Apex, I enjoyed my visit to your hotel and I hope to visit Istanbul again soon!", "date": "October 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r47067183", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Like going for a visit to friends", "review": "Excellent location and friendly, helpful people managing the hotel. Lots of good restaurants near by.", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r46745242", "sub_review": {"Value": 3, "Location": 4, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Happy Hotel", "review": "A very nice and cozy boutique hotel. As expected, the rooms were relatively limited in space (especially the single ones). However, the friendliness and politeness of the owner and staff were outweighing the space limitations. Very close to the main attractions of the medieval town. Clean and quiet.  Maybe the price could be a little cheaper. Still, I totally suggest it, especially if one doesn't require amenities of a luxury hotel and can cope with something more modest. I am definitely coming back again soon!", "date": "October 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r46539821", "sub_review": {"Value": 5, "Location": 5, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "A fantastic hotel, in a perfect location with excellent staff.", "review": "Very friendly, very convenient , happy hotel. And a bargain. Only problem ? I could not for the life of me work the shower properly. But that could just be me.........", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r46345760", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "A wonderful small hotel and staff.", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r46310023", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "One of my best hotel experiences in my travels", "review": "We have never stayed at such a friendly hotel.  We spent four days in Instanbul and Ibrahim and his staff were delightful.  They could not do enough for us.  We came in late one night and his family was having a wonderful meal on the terrace and they insisted  we join them.  The food was all home cooked and was great.  The location was great and the air-conditioning worked great.   Jack and LInda,  Granbury, Texas", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r45689753", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Wonderful Hotel", "review": "I saw this place on Trip Advisor when I was planning my trip to Istanbul and thought I'd give it a shot.  I was very impressed with this small, intimate hotel.  While I was there, I had a touch of bronchitis and the hotel manager walked with me to the pharmacy and bought me some cough medicine.  I've never had anyone go that far out of thier way to make me happy at a hotel before.  Not only is the service incredible, the location is perfect for travelers looking to see all the sights of Istanbul.  I can't say enough nice things about this place.  If I ever go back to Istanbul, this is the place I'm going to stay.", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r45651965", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Incredible hotel", "review": "Ibrahim and his colleagues at this wonderful hotel could not have done more to make us feel welcome and comfortable.  I would go back here again in a shot if I could!  Thank you all.", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r43912631", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "A wonderful hotel- the staff were amazing!", "review": "First of all the hotel is in a very good spot.It is five minutes away from many sightseeings like Hagia Sofia and Blue Mosque.The staff also was very polite and very helpful.", "date": "August 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r41822002", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "The Hotel with a heart and soul", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "August 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r41366934", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "A home away from home", "review": "This hotel was like being at home, Ibrahim and his staff treat you like family. When I originally arrived at the hotel I was very distraught, first by the nightmare of a flight from Casablanca to Istanbul, and that topped off with lost luggage. By time I got to the hotel I was in tears, it was 7 in the morning and I hadn't slept for over 24 hours. The first thing I was told to do was get some sleep and we would take care of everything after I rested. When I did wake up I felt a lot better. Ibrahim contacted AMEX for me to discuss my luggage protection plan. He then offered me food, but what was really amazing was that he sent one of his staff to take me shopping for some replacement clothes etc. I was taken from store to store, my bags were carried for me and also my receipts.…", "date": "August 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r40455938", "sub_review": {"Value": 4, "Location": 5, "Check in / front desk": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Genuinely friendly  - couldn't do enough to help", "review": "Superb!!! I stayed alongwith my family for three days at the hotel. And I was amazed by the hospitality of the staff who seemed to be no less than a family. Situated close to most of the tourist attractions, it was a perfect place to be. One of the most memorable stays i had away from home. The hotel facilities were immaculate and the services highly appreciable.It all made us fall in love with Istanbul and its people. Wish all the best. Dr Hamid.", "date": "August 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r40264191", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Four Seasons service and experience at 1/4 of the price!! Absolutely Wonderful Hotel!", "review": "We travel a lot and choose to stay in the smaller \"character\" hotels in the centre of town. From previous experience choosing the right boutique hotel can be quite hit and miss -but the Apex was a delight. The facilities and location were really good and the cost the best we experienced this summer in Europe - perhaps more importantly the service was fantastic.  Just ask.", "date": "August 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r40042701", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Nice hotel with super views and even better service!", "review": "I stayed at this hotel after reading the good reviews on TripAdvisor and must say that Mr. Imbrahim Billik and his Staff definately over delivered! This hotel is located in the old town Sultanahmet and is 5minutes walking from Blue Mosque and Sofia Mosque, and there is so much to do just walking around and experiencing the history of the old town.  When you stay at a 5 star hotel, you pay for plush accomodation and location, but most importantly, its the personailzed service and attention that usually differentiates such hotels from the rest. Apex Hotel far exceeds the level of service, attention, and care than I have recieved at 90% of 5 star hotels i have stayed at, I cannot reiterate how accomodating and willing the staff are to make your stay as pleasant and comfortable as…", "date": "August 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r39775688", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great service, charm and views", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "August 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r39722552", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Perfect location and a comfortable stay", "review": "We loved the hotel. Staff was extremely friendly and attentive. We loved having the delicious breakfast on the rooftop terrace with views of the Blue Mosque and the Marmaran Sea. Location was perfect for seeing the main sights and the street was very quaint. Our kids felt most welcome, too. Rooms were on the small side but very clean with comfortable beds. We would definitely stay here again!", "date": "August 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r39509951", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "My favourite hotel ever", "review": "A perfect location within minutes walking distance of the Blue Mosque and the historical centre of Istanbul.  The hotel is in a very quiet cobblestoned road  that fortunately misses out on traffic and crowds.  The staff were extremely friendly and welcoming.  They kept a low profile; always on hand to help if needed but without imposing themselves.  The rooms were clean and comfortable with amazing character.  We felt at ease throughout our stay; it provided a base for a very relaxed, comfortable and enjoyable stay.", "date": "August 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r39353361", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Location, Location, Location and above all super friendly staff.", "review": "M wife and I stayed at the Apex hotel this month for 7 nights. It is an absolutely fantastic hotel, with everything you could possibly need. Great location on a lovely little street, clean rooms (which are full of character) and a roof terrace for eating breakfast on.  The staff are friendly and helpful and so welcoming. I really couldn't reccommend this hotel any more highly.  Brilliant.", "date": "July 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r39118585", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Very good service!!!", "review": "We stayed for 2 nights at the Apex Hotel, we have just returned from our European holiday and I can honestly say the hotel Manager and staff are a credit to the hotel and we did not receive the same level of service on any of our hotel destinations in Europe. The room was very clean and a very good size ( we were 3 travellers ). The noise level was very minimal and the bathroom was a good size as well. The hotel is in close proximity to all the major tourist attractions and we were able to walk almost anywhere and still be only about 15 minutes from the hotel.The ocean could be seen from the hotel's balcony where breakfast was served. ( breakfast could be improved upon ) I would recommend this hotel highly for its cleanliness, friendliness and courtesy of the staff however my…", "date": "August 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r38833679", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Wonderful place in the old city Istanbul", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "August 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r38501659", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Amazing hotel, exceptional location and the best service I have ever experienced", "review": "There was a four days where we spent our times in a plesant way. Our guests made us to feel in their hotel like in our home. Many thanks to Mr. Ibrahim and his nephew.", "date": "August 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r37716508", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Great hotel, amazing service and location.", "review": "I have travelled quite extensively and I can honestly say that the Apex Hotel is the best hotel I have every stayed at. What differentiates this hotel from all others is the customer service which quite simply is at a level which I have never experienced and doubt I will ever again. As this is a small boutique hotel, run personally by the owner and his fantastic staff they truly treat you as though you are part of the family. I was welcomed with drinks and fruit and given a detailed description of what to do and where to go in Istanbul, and on the day i left they provided me lunch as i waited to go the airport. The staff were always there to help with any question I had.  The rooms are great, the airconditioning fantastic which is vital considering the heat of Istanbul in…", "date": "July 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r37672705", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Wonderful stay in the heart of the city", "review": "I stayed at the Apex hotel with my wife and two friends for two nights.  There is no better location for a hotel in Istanbul.  The service and the cleanliness in the hotel was above anything I have ever since and I have stayed in many hotels before.  The concierge and the manager were very friendly, we felt very comfortable talking to them and asking them questions.  Breakfast was average but good, and our room specifically was a little bit small.  We strongly recommend this hotel.", "date": "July 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r37321540", "sub_review": {"Value": 5, "Location": 5, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Good hotel!", "review": "We loved our stay in the hotel.  In particular Ibrahim and his staff made sure that all of our travel needs were understood and addressed.  He provided an impromptu lunch when we didn't hav time to go out, suggested places to visit, and was simply helpful.  A great place.  For example, he helped us find a great Turkish Bath.", "date": "August 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r37161483", "sub_review": {"Value": 5, "Location": 5, "Rooms": 3, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Honest and hospitable staff, amazing service, and beautiful location!", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "July 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r36926883", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Great Little Hotel", "review": "I cannot say enough about the integrity and friendliness of the owner and staff of Apex.  They assisted us with every aspect of our stay, from river cruises, to dining recommendations, and advice on where to find the best values (and hidden treasures) in Instanbul.  The rooms are clean, the air conditioning is great, and internet is free!  Best of all, they have comfortable deck space overlooking the skyline, including the Blue Mosque and the Bosphorus river.  If you stay more than three nights, they'll either pick you up or drop you off at the airport, for free (about a twenty Euro fare per person otherwise).  To give you an understanding of how honest and hospitable the owner is, he offered to pay for our ride back to the airport after one of our other friends had already used…", "date": "June 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r35613602", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great location and helpful staff", "review": "Boutique Apex is a great place to stay for a visit to Istanbul. It is superbly located within easy walking distance of the Blue Mosque. Rooms are clean and comfortable. There was wireless internet available. Importantly the staff were the friendliest and most helpful of any of the hotels we stayed at during our trip.", "date": "June 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r35303577", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Caring staffs, clean, nicely decorated rooms", "review": "Apex hotel was great.... it is as the photos show. It's situated in a great location to explore Istanbul.The staff are friendly, polite and very helpful.  Free wifi is a great advantage as well. I will recommend this hotel to everybody. :)", "date": "July 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r34839656", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Why is this hotel so popular?", "review": "I stayed there for 12nights, thoroughout my entire stay in Istanbul. I stayed with my boyfriend and we had a wonderful stay there. The room is very clean and nicely decorated for a romantic stay. I once returned to the hotel with an upset stomach and the receptionist showed concern of my well-being and called up to my room to ask how I was doing after four hours I returned to the hotel with a pale and ill countenance and even offered a hot drink at the lobby if I need one. The staffs are all very polite and helpful esp the hotel manager Mr. Ibrahim who speaks very good english too. I highly recommend this hotel for anyone even for extended stay.", "date": "July 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r34674940", "sub_review": {"Value": 2, "Location": 4, "Rooms": 1, "Cleanliness": 4, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Great Friendly Staff", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "July 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r34198956", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Pleasant Hotel with Accomodating Staff", "review": "Great hotel.  Great staff, and great location.  The first few nights I was there I had jet lag and cold not sleep. At 4 am, starving to death, I wandered to the lobby to see where I could get some food.  The staff was nice enough to prepare me a plate of food, with juice and water all free of charge.  They did this a few nights (until I ended up being able to sleep on a normal schedule).  They were extremely, extremely nice.  We shopped around for a number of hotels and this one had one of the best prices.  I stayed for a week with my wife.  The location is great.  The rooms are small by North American standards, but average size for European standards.  We ended up staying in a \"triple\", which has 1 double bed and 1 single.  I would definitely recommend upgrading to this size,…", "date": "June 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r34176336", "sub_review": {"Value": 4, "Location": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "APEX Hotel", "review": "I booked my stay at the Apex Hotel to spend my last night in Turkey and I could wholeheartedly recommend this hotel for the service alone. I arrived in Istanbul from my excursion in Bodrum early in the morning and on my way to the hotel I ran into the service staff who served breakfast who kindly assisted me with my luggage in one hand as he carried fresh groceries in the other. While they did not have an extra room available for me to do an early check-in, they invited me to their breakfast buffet consisting of various juices, coffee, cheeses, sausages, fruits, etc. and some fresh produce / bread from the local market. A modest breakfast overall and a bit different from the Western breakfasts I am accustomed to, but pleasant nonetheless atop the rooftop terrace.  The room I had…", "date": "June 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r33755122", "sub_review": {"Value": 4, "Location": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Canadian Viewpoint", "review": "Spent five wonderful days in Istanbul at APEX Hotel.  Hi to Ibrahim and his staff.  Staff had lots of good ideas for sightseeing and restaruants.  Central location close to all the Sights.  Istanbul was very warm, we found a lovely sea wall walk about five minutes from the hotel - felt about 20 degrees cooler by the ocean!   Great  view of the Blue Mosque from the rooftop patio.  Our room was on the third floor facing the street, it was quiet and comfortable.  I recommend this hotel.", "date": "May 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r33744317", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Perfect holiday", "review": "The service was excellent begining with check-in and throughout our stay. All the staff were extremely helpful, friendly, and upbeat. They volunteered suggestions and directions as well as educating us on the use the transit alternatives (and when to be alert). Location is excellent (1-2 blocks from the major sites). The room was spacious enough for two staying for 4 nights. Liked the personal service from the Manager and the staff. The breakfast location on the roof worked out as we had very good weather conditions. The breakfast selection was basic but ample. We have already recommended this hotel to others. If you don't frequent the Ritz or Hilton, this is a great place to be.", "date": "May 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r32603156", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very nice hotel", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "May 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r32509938", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Awesome location, great staff :)", "review": "I stayed at Apex hotel  in the end of May, 2009. Very nice small  hotel, only 12 numbers.  An  ideal location - 5 minutes walking distance to  historical places of Istanbul.  Bedrooms and bathrooms are not so big, but comfortable, very clean with fresh towels every day. Free wireless Internet is also a nice touch. Breakfast is included  up  on a roof terrace  with an  incredible  view  to Bosporus and the Blue mosque.  Very friendly and helpful staff.  In a hall of hotel always suggested to drink a cup of tea or coffee. I think, that it is very good hotel under quite reasonable price.", "date": "June 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r32509016", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Cannot see what others see in this hotel", "review": "Istanbul became one of my favorite cities because of its special atmosphere, numerous world - famous historical sights, delicious cuisine, great music and of course, very friendly people. All in all, city itself is wonderful to explore. :)  As for this hotel, I must say that it was a good choice. It is a nice little hotel with family atmosphere. The best thing about Apex Hotel is its location - in Sultanahmet, so everything that is worth seeing in Istanbul is within a short walking distance. For example it takes just approximatelly 3 (!!) minutes to walk to Blue Mosque, isn't it amazing? :)This hotel is situated quite close to Topkapi Palace, Grand Bazaar and Hagia Sophia as well.   Rooms are decorated in a classical Turkish style, they are clean and beds are veeery comfortable…", "date": "May 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r32184185", "sub_review": {"Value": 1, "Location": 4, "Rooms": 1, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Decent Hotel.  Perfect Location.", "review": "Firstly let me say that the management and staff are warm, pleasant and do their best for you.  Many thanks to the lovely young man, Tosun I believe, who serves breakfast.  For us, the accommodation was really not up to par, nor was it good value for money.  Our room was dark and cramped.  It was one of 2 on the ground floor.  The lighting was really very deficient within the room.  The floor was extremely uneven to walk on.  The toilet seat, in the bathroom was broken.  The sink leaked over the floor, from its base, perpetually.  The bathroom, like the room was extremely small.  Realising that this situation may have been confined to our particular room, when ascending the stairs to the breakfast room, where there were open doors, we did peer inside to see if there was imprved…", "date": "June 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r31880936", "sub_review": {"Value": 3, "Location": 5, "Rooms": 3, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A friendly base in the heart of historic Istanbul", "review": "My wife and I stayed at the Apex Hotel for 3 nights from June 1-4.   When we arrived, we were shown a couple different rooms and were given our choice.  We were shown a decent size room with 3 single beds or a smaller room with 1 double bed.  We choose the one double bed.  The room we had was pretty small.  There was barely enough room to walk around the bed and no space to really put down our suitcases.  I think it all depends on which double room you happen to get though.  My wife said she saw another double room which was being cleaned and she said it was quite a bit bigger than ours.  Also, the shower itself was pretty small and cramped.  The cleanliness of the hotel and the rooms were alright.  The hotel may have recently opened as advertised on their website, but the…", "date": "May 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r31451144", "sub_review": {"Value": 3, "Location": 5, "Rooms": 3, "Cleanliness": 3, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Fabulous location, wonderfully friendly staff and a good value too!!", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "May 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r31334555", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "What a lovely owner!", "review": "We just returned from 4 nights in Istanbul; the last three spent at the Apex Hotel. This hotel is in a great location , so close to everything important to visit in Istanbul. My husband and I were really overwhelmed by the helpful and friendly staff.  They even filled our request for a bucket of ice late at night so we could try some Raki!  Where does THAT happen in Europe? a BUCKET of ICE !   This place is a good value too; the rooms are comfortable with T.V. ( if you really must watch the news) and the rate includes an adequate breakfast on their rooftop terrace. We would absolutely recommend APEX to anyone traveling to Istanbul.", "date": "May 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r30103919", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "We have made a right decission, feel like home.", "review": "I think I will just be reinforcing what everyone else has said! This is a quirky lovely little hotel slap bang in the middle of all the tourist sites, but down a little (safe) side road, so it is quiet. It is clean, super comfy beds. The breakfasts are fine, but was the one thing that could be improved on. The best bit about Apex is the owner Ibrahim. We had to return to the UK urgently whilst in Istanbul and he could not have been more helpful or kind in what was a difficult  time for us. I doubt very much that the four seasons up the road would have helped us in the way that  the staff at the Apex did. Do yourself a favour and stay at the Apex- we certainly will be should we go to  Istanbul again.", "date": "May 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r29823188", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great location and value", "review": "After we have searched for a lot of hotel in Sultanahmet area, we have read almost all comments in each hotel and finally we selected this hotel only from their high rating and reasonable price for us. We were impressed by their hospitality and helpfulness from Ibrahim (the owner) and his staff which you can asked for their help 24 hours a day. The location was within 5 minutes from Blue Mosque and Hagia Sophia but in the quiet part of the area. The room we have was clean and airy. The roof top breakfast was breezy with Mamara sea view. We will be there again.", "date": "May 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r29748831", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great service and location", "review": "I stayed at the Apex Hotel from 30 April - 5 May with my brother. The hotel is a quaint small boutique hotel and has real character. If you want 4-5 star this may not be the place for you, but if, like me, you prefer hotels with some \"local\" character and none of the anonymity of the big chains, this is the place for you. Fantastically friendly and helpful staff who are more than willing to help out with maps, taxis (including free pickup from the airport!) and recommend and book local restaurants/tours, particularly Ibraham who just could not have done more to make our stay a truly wonderful experience. Free wireless Internet is also a nice touch. Rooms and bathroom facilities obviously old and small, but very clean and, once again, full of character and hugely comfortable…", "date": "April 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r29290401", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Promising little hotel", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "April 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r28846338", "sub_review": {"Value": 4, "Location": 5, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Great location", "review": "The young manager took charge of the place a couple of months ago and has already improved things. The new terrace on the roof has a view onto the Blue Mosque. While I was there, a kitchen and bar were being built onto the terrace which means farewell to the horrible, fake orange juice and average breakfast and hello to fresh products and food. The rooms are a bit kitsch but I prefer that to cold Heathrow Ibis hotel efficiency.  A very promising place with a dynamic manager.", "date": "March 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r27981849", "sub_review": {"Value": 4, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Couldnt be better:)", "review": "We spent a very enjoyable 4 nights at the Apex Hotel. The location is excellant and the staff friendly and very helpful. The room we had (we were given a choice of 2) was larger than average, with a very comfy bed and a good sized bathroom. Shower was good with plentiful supply of hot water, but some of the other fttings need a little TLC. Toilet roll holder only held in place by one screw, so roll kept falling on to the floor. Hairdryer kept falling out of holder and glass shelf above basin broken at one end. Only small things, but annoying! Breakfast was ok, bread, cold meats, cheese, boiled eggs, jams, fruit etc. Coffee and orange juice could be improved. Basically, the hotel was as described on the Internet and good value for the centre of the Old Town. A little quiet haven…", "date": "March 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r27386307", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Fantastic location, good value, staff very friendly", "review": "It may not be the best hotel of stars but i may say that it is the best place that we could stay and the only place we ll stay in the future. Perfect location (walking distance to historical places-sultanahmet-topkapi palace-yerebatan-ayasofya and many more)the friendliest ever and helpfull staff, it was a home away from home... we love u guys and hope to see u again soon.", "date": "January 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r27267701", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent Location.  Wonderful Staff.  Perfect!  A Must!!!", "review": "We came here on our honeymoon after a lot of travelling around Europe. We found this hotel to be much nicer than others we stayed at in this price range in Greece and Egypt. A very pleasant, small hotel with atmosphere and very helpful staff who let us use the internet for free and even gave us some Turkish delight and apple tea as a present. Breakfast was boiled eggs, salad, fetta cheese, olives and bread and jam. Location is excellent, a very quiet street but also very close (5 to 10 minutes walk) to the Hagia Sophia, Blue Mosque, Roman cistern, mosaics museum and Topkapi palace. There are also many restaurants nearby - I recommend Guvec and Ayran at one called Ocean's 7.", "date": "March 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r26939049", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Safe and Central Location", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "March 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r26640942", "sub_review": {"Value": 5, "Location": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "EXcellent, clean, friendly staff, close to historical places", "review": "The best part about this boutique hotel is its location -- near the main attractions and yet quiet and safe. There are several other boutique hotels along the stretch and around the neighborhood and yet, there's a casual and calm feel about the place. This is not a five-star hotel, but the friendliness of the reception staff -- Fikret, Ibrahim, and Yusof -- and the convenient location more than make up for it. The hotel has a family rather than a commercial feel to it. When I checked out, I had some leftover Turkish lira. They allowed me to pay in part in Euro and in part in lira. Because of the conversion, I didn't have the exact amount, and yet, they were so nice to close an eye about it. I would stay here again.", "date": "March 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r26601395", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very very nice hotel!", "review": "Hotel was very clean,comfortable rooms, 24hrs hotwater,sufficient spread breakfast,very friendly staff, arrange your sightseeing arrangements,value for money rates", "date": "March 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r26434468", "sub_review": {"Value": 4, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Great location, comfortable bed, friendly staff - ticked all the boxes for me!", "review": "It is a very nice, cozy and charming hotel directly in the heart of Historical center o the quiet street. Clean rooms decorated Cupidons, terrace with a view on Blue Mosque. Very friendly staff.We will come back to this beautiful hotel in the June!", "date": "October 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r26274580", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very good small clean hotel, friendly staff, centrally located (5 minute walt to the Blue Mosque).", "review": "There are certain things I want from a hotel - location (not necessarily near tourist sites), a comfortable bed that is neither saggy in the middle nor so 'firm' that I bounce and wake up every time my partner shifts an inch) and staff who are just nicely friendly, not rude and not fawning, which is even worse.  And the Apex fits the bill.  It's a casual stroll to the Blue Mosque (which you can see from the breakfast terrace) and on the way you can pop into a bazaar that's a lot smaller than the Grand Bazaar and a lot calmer too.  (Not that there's anything wrong with the buzzy atmosphere of the latter but a respite is welcome too.)  It's taken me so long to get round to this review that I can't remember what the bazaar is called but you can't miss it - turn left out of the…", "date": "March 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r26038587", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Funny hotel with angel's decoration right in downtown", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "February 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r25347621", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "It is very much in the eye of the beholder", "review": "When we were choosing the hotel, it was about 2 a.m. so it was extremely hard to find something. Finally we opened the fun photoes of Apex hotel with angels over the beds and 32-teeth smiling stuff. We decided to come here to look at them by our own eyes.  So we booked the room and after this minute didn't have any regrets about our choise. Right the next day after the booking, I received the confirmation about it and a question about details of the flight to pick us up in the airport by a free transfer. Actually I liked this moment, because I don't like to call to the hotel by myself to clean up all the details.  The hotel is situated on a very quiet street even if it's really located in the historical center, close to the sea also. A guest manager Yunus gave us a very good…", "date": "July 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r25324181", "sub_review": {"Value": 4, "Location": 5, "Rooms": 4, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Better than 4 stars, excellent hotel i would recommend .....", "review": "There have been very many positive reviews about the Apex Hotel Historical with the occasional poor review.  So how can this be? I think with the Apex the impression can very much be in the eye of the beholder and how they feel at the time.  I can see elements of everything that has been described, yet overall I feel that the Apex Historic is a favourable venue for a stay.  Although staying as part of a business trip, I was relaxed, the weather was hot and the sights & smells of Istanbul were intriguing.  In other words I was pleasantly disposed towards my surroundings.  Viewed in this light the hotel was small, attractive & had an air of cosiness and intimacy.  But fact – many of the rooms are small, the shower /toilet in my room was very small, as indeed was my room with the…", "date": "February 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r24661606", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Perfect friendly family hotel", "review": "It was first time in istanbul, my wife and i stayed at apex hotel 6 nights, we really enjoyed our stay. Stuff is friendly and always ready to help, room very clean, breakfast was excellent, airport transfer was appreciated, free wireless internet. free tea any time, decor is new, location is fantastic, the guest manager          ( Ibrahim ) is extremely nice, he did his best to make us happy, our flight was 11:30pm , we had to check out 1:00pm, he gave us free room to stay and free drink. If you wanna stay in istanbul go to apex. excellent hotel i would recommend.", "date": "February 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r24589653", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 3}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Weekend in Instanbul", "review": "From the minute we arrived and received a welcome fruit juice drink & turkish delight we knew we had made the correct choice. We chose this type of hotel because we wanted a  friendly family run hotel. We were not dissapointed. The management are only too happy to help with any request. The rooms are adequate in size with powerful showers. The beds are really comfortable and the quiet street outside, being just 5 minutes walk away from the blue mosque etc, makes it a perfect location.  If you want a  large corporate hotel do not chose this one. If you want small, cosy, comfortable, & friendly this is one of the best we have stayed in and would  strongly recommend it.", "date": "January 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r24372120", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Exactly as promised", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "January 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r24303458", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent!", "review": "great location, great staff and services, excellent organized pick up and drop off. we will be back to istanbul in fall and will definitely return to the apex hotel", "date": "January 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r24078019", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "the best there is!", "review": "Me and my boyfriend spent 3 nights in this hotel and I must admit that everything was perfect from the moment they picked up us from the airport (included in the price) until we left with a goodbye gift (!) from the hotel. I have never experienced such incredible service before - nicely furnished and clean room, tasty breakfasts, friendly staff always ready to help with any request. What is also important - this charming hotel is very well located in old Istanbul, just 5 minutes walk from Blue Mosque. I will come back there for sure.", "date": "January 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r23924589", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "I loved staying in this hotel", "review": "We spend 3 nights in this lovely hotel. After the excellent pick-up from the airprort , we had a  very warm welcome at the hotel. We reserved a double room but they gave us a bigger room for the same price. Good service! The Staff  is friendly and gives very good information and tips. Breakfast was very good, rooms, bathroom are very clean. Rooms are cleaned every day. The hotel is in a very quiet street, so no noise from the street at night and the blue mosque is just around the corner, and all the main atractions are within walking distance..,perfect. Our advice: stop searching  and go to this place, you won't be disappointed. Robert & Yvonne Amsterdam, Holland", "date": "January 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r23692413", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Friendly and helpful staff!", "review": "We stayed in this Hotel for our first trip in Istanbul. It was very clean, confortable and quite. The staff was very kind and always tried to help us. They were very helpfull. They can arrange everything for you.  The location is perfect: The hotel is about 2 minutes on foot from the blu Mosquee and Santa Sophia. I strongly reccomend this hotel. Special thanks to the staff for their kindness", "date": "December 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r23434002", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "A Romantic Treat!", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "December 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r23362461", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Warm welcome, great location", "review": "My husband and I stayed at the apex for 2 very romantic nights over christmas 2008. We loved the hotel, the staff and especially the room. The hotel is close to the most important sites in the old city area and very clean and well appointed. I would happily recommend it to anybody wishing to find accomodations in Istanbul and the breakfasts are terrific!", "date": "December 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r23353261", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Clean & Very Friendly Hotel", "review": "We enjoyed very much our stay at the Apex Hotel. Transfer from the airport to the hotel was organised and worked very well.  Had a very warm welcome up on arrival. Hotel is perfect situated. All major sights are within easy walking distance. Prefered the Sultanahmed area to Taskim, where we stayed last time.  Breakfast was traditional and Ok.  Good value for money! Alex/ Sweden", "date": "November 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r22583629", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 4}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "An \"Apex Hotel\" Honeymoon !!!", "review": "we stayed at the apex on our first trip to istanbul.  its situated ideally just a couple minutes walk from the blue mosque & aya sofia.  we took advantage of the free pickup from the airport and used their services (at a charge) back to the airport as well.  the hotel is modest and only has 8 rooms total - but clean with all that you need including free wireless. its not the four seasons, so don't expect those types of amenities, nor are you paying for those as the hotel is very reasonably priced.  the staff was unbelievably friendly and helpful in all ways.  i would definitely recommend this place if you are looking for a clean and well priced accomodation.", "date": "November 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r22572229", "sub_review": {"Value": 5, "Location": 4, "Check in / front desk": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "", "rating": 5}, {"title": "Good holidays", "review": "This review is for people who can understand: Before I book I checked  reviews and  photos of other guests and I decide to go there because of  the location-is my 14th time to Istanbul and I think is 1 of the best areas to stay.  First of all I appreciate the fact that on our arrival,the receptionist show us 2 rooms to choose where we like to stay...!!! (Tell me how many times happen to eveybody without to ask  first...). We choose the 131 room and our first impression was the kitsch decoration the tired furnitures but the room was spacious enough (we booked double room and not a suite!) for the price and turkish standards, clean and with a comfortable mattress, the sheets towels etc were smelling nice the cleaning woman-always with her modest smile change for us EVERY DAY the…", "date": "November 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r22128334", "sub_review": {"Value": 4, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 4}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "My best vacation", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "March 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r22066772", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "A very good choice", "review": "We stayed here three days and were completely satisfied with everything. Very friendly staff, cleanliness, quietness, good breakfast and good location, the staff were really helpful , they guide us and informed us what is the best in istanbul. they can arrange every thing for you.", "date": "November 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r22050643", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Very good experience", "review": "We stayed here five days and were completely satisfied with everything. Very friendly staff, cleanliness, quietness, good breakfast and excellent location near to the most important points of interest.  At the airport we were picked up and brought to the hotel with a red leather bolstered car, at the hotel we were offered a welcome drink and turkish delight and we could choose from two rooms the one  we liked better. At departure we even received a little present. The people here are really very kind and generous. All in all it was a very good choice and we would come back again.", "date": "October 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r21850632", "sub_review": {"Value": 4, "Location": 5, "Check in / front desk": 5, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Friendly & well located", "review": "We asked for an airport pickup and were quoted a price of 25 Euros, which seemed to be in line with what we expected. When they were unable to give us the room that we expected, they comped us the airport pickup, gave us a nice gift and apologized profusely. They gave us good advice about where to dine, didn't try to steer us to a particular restaurant. They were very pleasant and accommodating.  The location is great and we would stay there again.", "date": "October 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r21587821", "sub_review": {"Value": 4, "Location": 5, "Check in / front desk": 4, "Rooms": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Highly Over Rated / Poor Quality", "review": "It's 21 years since we last visited Istanbul, though we've been to several other parts of Turkey in recent years, and there's now a vast choice of good hotels (and restaurants) right in the city centre. The Apex came highly recommended on Trip Advisor and in the main lived up to it's billing. We flew into the grossly under-used Sabiha Gokcen airport, which is about 25km's outside Istanbul, and arranged a taxi with the hotel for 50 euro's each way (they agreed to drop their advertised price by 10 euros). We were picked up by a shabby Ford Transit van (a sort of semi-private dolmus really, as we shared with another couple being taken to another hotel) and on arrival were offered a choice between a twin-bedded, dark and quite small room, and a double-bedded room that was so small…", "date": "September 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r21534264", "sub_review": {"Value": 1, "Location": 5, "Check in / front desk": 3, "Rooms": 1, "Cleanliness": 1, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Loved the service ,cleanliness and location", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "September 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r21311067", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Wonderful location/service/room/views", "review": "We arrived by bus from Burgas, Bulgaria in the evening and took the metro and tram to the Blue Mosque stop and walked to Apex Boutique Hotel. We were met by a very friendly staff member that gave us drinks and turkish delight. Our room was in the back on the 2nd floor, with a view of the Blue Mosque. This hotel is small and quiet, but very friendly, exceptionally clean and the location is the best, within walking distance to all sights. The beds were comfortable. The staff went out of their way to be friendly and answered many questions for us each day. Breakfast was good and filling with fresh bread and many selections of cheese, meat, and salad, juices, coffee and tea. We would recommend this hotel and definately stay here again. Canadian couple 59 years old.", "date": "October 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r21074966", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Apex need renovation", "review": "Received warmest of welcomes as we checked in after a dreadful journey! Offered valuable tourist information, maps etc Thought the shower didn't work BUT it is different to home and we had not understood its method. (Perhaps like previous reviewer). It was explained to us and the next 4 days had no problems. Room in vibrant colours was so typically what I imagined Istanbul to be like, I felt like the holiday had begun. Fantastic views from the roof terrace of the Blue Mosque in one direction and the Marmaris in the other. The location was great, 2 mins walk to choice of quiet restaurants, 1 min walk further to restaurants with music and dancing, 1 min walk further Blue Mosque, then busy restaurants noise and bustle, whatever suits you! We travel extensively and this is the first…", "date": "October 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r20608034", "sub_review": {"Value": 1, "Location": 5, "Check in / front desk": 3, "Rooms": 1, "Cleanliness": 1, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Great location, excellent service", "review": "I requested my travel agent to book this hotel based on the reviews below, but I found my stay there was a total disappointment. I booked 2 twin rooms for my friends and i ( 4 pax), but we are only given 1 twin room and 1 double room near the reception area. My travel agent OK this arrangement without first checking with me. Both rooms were extreme small, (especially the double room ),there was barely much space to put our bags. The decoration of the rooms were hideous, too much red in the room, lack of calming effect. They properly want to go for the classical look, but end up looking like a cheap brothel.  Problems with the rooms: Twin rooms *the hairdryer broken. (My friend went to sleep with wet hair) *heater was working *wire with the water heater way too short to reach the…", "date": "August 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r20294566", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Byzantine, Konstantinopel and Istanbul", "review": "When I travel, I have very simple requirements : clean and confortable room, good service and great location.  The Apex Hotel in Istanbul offers all that and even more.  I was there for five nights late August.  The room was perfect for me.  And even though my room was on the front side of the hotel, street noise was not an issue.    The staff was very friendly and helpful.  Breakfast was always served on time on the roof terrace with the Blue Mosque on one side and the Bosphorus on the other.    As for location, you are less than five minutes away from the Blue Mosque and the neighbourhood surrounding the hotel is full of restaurants and bars.  I walked on those streets late at night and I always felt secured.    I would return to the Apex Hotel and I have a feeling that the…", "date": "September 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r19965430", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "One of the amazing surprise during our visit in Istanbul......", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "August 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r19562308", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Wonderful area of location and kind staff\"", "review": "Me and my mam had to visit IStanbul second time and we did nt want to stay in previous hotel becouse we didnt like it. We decided to search and choose the hotel in hotels website. And We noticed Apex Hotel and our choice of Apex was only course of its location, HISTORICAL location.  We did nt know what Apex is and decided just to book spontaneously.  And we didnt regret that we booked it! The hotel is very beautiful. The decoration of the hotel is fantastic , the oriental style amazed us. Especially the colors. The rooms are very beautiful and well decoreted, comfortable and home like.  The service is very friendly and kind! We want to say the the service of the HOtel everywhere - reception, housekeeping, restraunt is on the HIGH QUALITY!!! And if we will have chance to visit…", "date": "August 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r19408127", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Apex very nice small hotel", "review": "the location of the hotel is wonderful, right in the centre of Instambul in a pretty area. The hotel staff is very kind expecially with children. I really advice the hotel as one of the best accomodation I have had during my travels.", "date": "July 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r19373446", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Value for money is a problem", "review": "I stayed at Apex Hotel for one week at the end of July and I strongly recommend this hotel for the exceptional location, the kindness of the staff, the friendly atmosphere and the cleanness of the room. All interesting sites are really at walking distances, the staff and the manager are very helpful and gave us useful information. Small attentions such as the pick up at the arrival, slippers in the room, the tea /drink they always offered us give to this hotel an added value. If, in the future, I 'll have the opportunity to come back to Istanbul, I 'll return in this hotel with the impression to be hosted by friends.", "date": "August 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r19150563", "sub_review": {"Value": 2, "Location": 4, "Check in / front desk": 3, "Rooms": 2, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "I  Was Well Cared For at The Apex", "review": "Although Apex Hotel is comfortable, value for money is not a strenght of this hotel. The hotel is small, comfortable, clean, has a fantastic location and even some charm. But is also too expensensive for what offers and WC is so small that we couldn't move inside!", "date": "August 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r18986571", "sub_review": {"Value": 4, "Location": 5, "Check in / front desk": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 4}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Highly Recommended", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "July 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r18887524", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "such a friendly hotel!", "review": "We really had a fantastic time at the hotel. The staff are extremely friendly and will go out of their way to assist with any requirements.  The location is fantastic, very close to most of the tourist spots although the morning call is something to get used to!  I would definitely stay there again.", "date": "July 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r18843436", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Friendly staff", "review": "Loved staying at the Apex. really friendly and accomodating staff. will definately use the hotel whenever i'm in the city!", "date": "July 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r18830987", "sub_review": {"Value": 4, "Location": 5, "Check in / front desk": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "beautifull terrace", "review": "Very helpful and friendly staff. Accomodating to our travel arrangements.", "date": "July 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r18565970", "sub_review": {"Value": 4, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Apex big disappointment", "review": "we had a marvelous stays for 3 nights in this small and friendly hotel; the staff was very helpfull; the beds were fine and the proce was reasonable. The hotel is situated in a quiet street, considering it is a quarter of the city that is occupied with tourists. The hotel is an excellent point of starting to dicovever the city and the view from the terrace .... wonderfull. Will certainly book the hotel once again ...", "date": "June 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r17872987", "sub_review": {"Value": 2, "Location": 4, "Check in / front desk": 3, "Rooms": 1, "Cleanliness": 2, "Service": 2, "Business service (e.g., internet access)": 2}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Unforgettable!", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "July 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r17828115", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "We enjoyed our stay. Ozolu family", "review": "A charming little hotel  in the middle of the ancient part of Istanbul and many of the beautiful sights are only a few minutes’ walk away. The rooms are not too big but very comfortable and nicely air-conditioned. The typical Turkish breakfast at the hotel terrace (on the hotel roof) is a great experience every day because of the breathtaking views of the Sea of Marmara and the Princes Islands. Service is really friendly and they even help you to learn a few Turkish phrases to get along ;-) ... Highly recommendable!", "date": "June 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r17498574", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 4, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Would certainly return", "review": "The hotel service is simply amazing and very helpful. The staff goes out of their way to make your stay convenient and enjoyable.The location was perfect. The only thing we had to get used to was the singing call to prayer from the nearby mosque, but it  was not  a serious problem. We loved Istanbul and the hotel.", "date": "June 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r17181685", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Enjoyed the Apex", "review": "Stayed two days at the Apex Hotel and had a great experience there! Correspondence with the staff prior to arrival was efficiently answered. Staff was very helpful and willing to assist with all our arrangements (airport transfer, late checkout, etc). Breakfast buffet was a nice experience with the backdrop of the Blue Mosque. Rooms were exceptionally clean. The manager have us a gift of Turkish apple tea with glasses and a front desk staff member gave us free postcards of Turkey! Would definitely return again. :)", "date": "May 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r16925356", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Apex Istanbul", "review": "We stayed at the hotel for a short time and the staff treated us like royalty.  They even served breakfast to us at 2:30 AM as we had an ungodly early flight to catch.  The location was conveniently close to the “must see sights”.  I recommend  the Apex highly.", "date": "June 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r16899734", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "istanbul perfect at the apex!!!", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "May 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r16795548", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great little gem in Istanbul !", "review": "It is incredible to stay in a place for few days and feel like home.  My parents staid at the hotel and they told me it was absolutely fantastic. The location absolutely incredible!!! It was my mother's birthday and the trip was her present. The hotel arranged a rose and a cake on the date which made my mother nearly crying. I personaly asked for a rose to be found at breakfast and that I would have paid myself. It was a present from the hotel!!!! and on top of this and the free transfer from the airport my mother and her friend received a welcoming present! My parents told me it was so clean and so perfect and the people so nice that they would tell everyone looking for accomodation to go there. I personally hope to visit istanbul very soon and will definitely stay at the apex.…", "date": "June 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r16792156", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "our romantic week together", "review": "We spent a long weekend in Istabul at the Apex, the city in itself was lovely - but the stay at Apex really made our weekend.  Rooms are nice (we stayed in 134 a fairly large room with a clean but small bathroom.)  The breakfast is not much to cheer about, quite boring actually.  However the staff were wonderful - they really made that extra effort in making us feel welcome and at home.   Location is perfect - especially if this is your first visit to Istanbul, close range to the \"must see sights\". And also just a few minutes walk to the tram to take you to Beygolu (for night life).  We can really recommend a stay at the Apex !!", "date": "May 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r16706677", "sub_review": {"Value": 3, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Fantastic", "review": "me and my girlfriend stayed at this hotel for 7 days and it was the best 7 days of my life the staff were very freindly and kind the breakfast was lovely and our room was always clean the staff explained to us the beautifull parts of the city i dont speak very good turkish but the comunication was very good the last night i was there the staff were very helpfull because i was ill but my girlfreind did a very perfect job of looking after me i love her to bits we really had an amazing time and in october we are thinking of staying there again because we are planning to get married i hope we get the same room :)", "date": "May 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r16553399", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Highly Recommended", "review": "I visit Istanbul four times a year and have never found a Hotel to return to until now....I was greeted at the Airport in a beautiful car with leather interior the driver was very helpful and polite and genuinely pleased to see me, when I reached the Hotel I was greeted with a non alcoholic cocktail which was much appreciated and Harun the Manager helped me to settle in and was most helpful. The Hotel was immaculate I could see this straight away my room was just lovely, I noticed tea and coffee makingfacilities which Ihave never been offered in Istanbul Hotels before and a lovely well equipped bathroom and courtesy slippers for myself and my boyfriend, just little touches but you really felt like one of the family straightaway! My boyfriend was working most days and ordering…", "date": "May 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r16483043", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "What a great find.", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "May 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r16443370", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Perfect stay!", "review": "We ended our cruise in Istanbul.  Knowing that we'd have already spent a fortune, I needed to find something nice, but inexpensive.  I found the Apex on Trip Advisor.    What a gem this was for us.  It was the best price by at least 100 euros compared to any other hotel, yet no other hotel has perfect reviews.  For this price, employee friendliness, and central location - you will not do better than this place.  The Apex is in the same area as the 4-Seasons resort - this is a very nice area with old, restored buildings.  The streets are made from bricks.  Not only are all the main attractions within 5 minutes walk, but there are shops, restaurants, and pubs right around the corner.   This is a super little hotel, located in a very nice neighborhood, with everything close by.  …", "date": "May 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r16287361", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Four wonderful days in Istanbul", "review": "Our stay in the Apex Hotel was just perfect. We appreciated a lot the warm welcome and nice explanation about the hotel and Istanbul in general. The rooms are lovely decorated and very clean. We stayed in a room in the back which was very quiet but I think the front rooms are also nice because the hotel is located in a very quiet street. Just around the corner there are some very nice restaurants and shops and the Blue Mosque, Aya Sofia and Topkapi palace are only a 5 minutes walk! A pity that they were working on the roof terrace but the breakfast downstairs was also nice (French bread, cheese, salami, marmelades, honey, tea, coffee, olives, eggs,...). A special plus for this hotel is the friendliness of the staff. All of them were always very helpfull and friendly.", "date": "May 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r16165940", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Wonderful pace to stay in the remarkable city of Istanbul", "review": "We have just returned home after four wonderful days in Istanbul. Our stay there was truly memorable due mainly to the hospitaly shown to us by Harun and his staff at Apex Hotel Historical. All the staff were friendly and courteous at all times. We were a group of four people, a German couple and ourselves, an Irish couple. The staff were able to converse in both english and german.      Apex Hotel is ideally located -- a few minutes walk from Topkapi Palace, Blue Mosque, Aya Sophia and Basilica Cistern. We had no need for public transport or taxis.   Bedrooms were very comfortable, by day 4 we actually slept through the early morning call to prayer from the Blue Mosque !!!  Michael Mary Cox Ireland", "date": "April 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r16152595", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Just the Best - from the USA", "review": "We booked this hotel on the basis of the reviews we had read in Trip Advisor and we were very glad we did.  Our plane was 1 ½ hours late and when we arrived the manager was waiting for us, all smiles, there was no problem that we were late and kept him waiting.  He whisked us off to the hotel. When we arrived at the hotel there was a welcome drink and Turkish delight. A very nice start!!  The location of this hotel is ideal, very central to all the stunning attractions of Istanbul.  The staff were extremely helpful and friendly and made you feel very welcome at all times. After a day of sight seeing you were always welcomed with a smile and it was no problem for them to make you a tea or coffee. Nothing was too much trouble.  The room was very spacious and comfortable and there…", "date": "May 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r15960746", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Istanbul, The Blue Eye City", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "May 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r15953479", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 4, "Rooms": 5, "Cleanliness": 4, "Service": 4, "Business service (e.g., internet access)": 3}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "great position", "review": "A very comfortable and peaceful hotel in the heart of historical area of Sultanahmet. It's amazing the way we have been welcomed in Turkey by Hotel staff: a transfer from Ataturk airport to Apex hotel on a new Mercedes offered by Mr Harun Cadirci (Hotel General Manager), a welcome drink with a taste of typical Turkish sweets at our arrival, little briefing on Istanbul best attractions with informations about distances and means of transport given by desk clerk (all guys are very good, always smiling and helpful). The rooms are well equipped, with much space between bed and bath, kept tidy.... towels changed everyday, minibar, TV... The first reason why everybody should choose Apex Hotel? Because it is 5 minutes walking from the most important beauties.... and it's situated in a…", "date": "May 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r15913515", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Fantastic staff", "review": "Just returned from a 5 nite stay at the 'Apex hotel - the best thing about this hotel is the position - right in the middle of the Sultanhammet area,  also the  service the staff give you is a big plus.    The Apex is a small hotel, it has no bar altho the staff are so helpful they will purchase wine or beer for you if you require it - the roof terrace wasnt  quite ready for guests whilst I was there, but you can still use it - it has a good view - the rooms are very clean, and some larger than others - all with showers - breakfast is served downstairs and is simple but plentiful - the apple tea is great, I would recommend this small boutique hotel if you are looking for a good value base.", "date": "May 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r15833803", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "In the heart of Sultanahmet", "review": "Stayed here for five night. Brilliant position - easy walking distance to best sites but staff willing to arrange transport for you if you don't want to walk. Rooms were quite small but very clean. Breakfast was fine. Roof terrace wasn't finished with renovation but we were still able to use it. There is no drinks licence but ideal for being able to take our own duty frees on the roof terrace and having an evening drink. Staff were more than happy to bring us up ice and glasses. In fact the staff were the best we have ever encountered on any holiday, very friendly, helpful and polite. Brilliant. Would recommend the Apex to any one. Very inexpensive. From Jim & Jo Richards, Devon, England.", "date": "March 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r15740373", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "gentle", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "April 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r15254942", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Nice place on walking distance of great highlites and good restaurants", "review": "The hotel is situated in the middle of Sultanahmet (blue mosque ect) The rooms are very nice and the showers excellent. Every day we came back in a very clean room. The staff was helpfull, friendly and always wanted to make a small talk. In the morning you can have breakfast at the roof terrace. The breakfast is simple but there is enough choice and the bread was really fresh.All four of us enjoyed staying here and for sure we will come back again.", "date": "April 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r15159064", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Excellent service and location!", "review": "We stayed for 4 nights to visit Istanbul. (As firsttimers) We particularly liked the VIP Airportshuttle, wich took us without any delay within 30 minutes to the hotel. On arrival we were offered a drink. Check in only took seconds. Staff were very nice,polite etc. But it seemed that they really wanted us to have a good time. Breakfast was simple, but sufficient. The room offered everything needed. The bed slept very well. Real value for money. In walking distance not only Blue Mosc, Aya Sofia, Cisternes and Topkapi palace, but also a nice range of restaurants.", "date": "April 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r15097897", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "apex", "review": "Besides excellent location in the very heart of old Istanbul (few minutes apart from Blue Mosque and Hagia Sophia), hotel Apex Historical offers first rate service, and its very kind and pleasant personnel made our stay enjoyable during entire week - from the welcome cocktail to the farewell gift. Next time I visit Istanbul (and I hope it will be soon) I will know which hotel to book without Internet search :)", "date": "April 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r15095596", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Homely hotel!", "review": "Me and my wife just arrived from Istanbul where we stayed in this lovely hotel. The hotel is small (12 rooms) but very nice. On the arrival we were picked up up from the airport by hotel's free shuttle. No problems at all. All the staff was very frienly. The room where we spent 3 nights was big. We really enjoyed being there. 5 minutes walk to Blue Mosque and Aisophia. Very quiet. Thanks to all the staff again. Valery & Marina Lushchenko, Moscow, Russia.", "date": "April 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r15022398", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "There is no friendlier hotel on this planet!!", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "April 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r14781264", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "", "rating": 5}, {"title": "Charming little Hotel with great location", "review": "I'm just back from Istanbul, where my friends and I stayed at The Apex Hotel in the Sultanahmet area of the city. We stayed 3 nights in this hotel, which is in a quiet back-street, only 2 minutes from the Blue Mosque, and 3 to 5 minutes away from Ayasofia, the Roman Cistern, Topkapi Palace and the Grand Bazaar. The Ferries to the Asian side of Istanbul are only a 10 minute walk as well, so you can imagine how centrally located it is! The most impressive part of the Apex though, has got to be the owners and the staff. If you book for 3 nights or more, they will pick you up at the Airport free of charge as they did us. We walked out of the baggage area and they were waiting with a board with our name on it and whisked us away to the hotel, a journey of some 20 minutes or so. The…", "date": "March 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r14512756", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 4, "Cleanliness": 4, "Service": 4, "Business service (e.g., internet access)": 3}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Marvelous place", "review": "I just came back from Istanbul where i spent the Easter weekend. We stayed at the Hotel Apex boutique hotel, which is tucked away in a quiet street in Sulthanamet. On arrival, we were offered a local cocktail. The hotel is clean, quite basic but the beds were very comfortable and we had a very nice bathroom. The staff was very friendly, helpful and welcoming. There is a nice view from the terrasse. The breakfast is basic (cheese, yoghurt, tomatoes, bread, jam and honey and a couple of thypes of cereal). Great location, we were only few minutes away from the Agia Sophia and the blue Mosque. Would definately recommend for people to stay at this hotel. It was also very cheap 70GBP per night for a double room.  A quick note on Istanbul: sultanamhet is very expensive (coffee 3GBP,…", "date": "February 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r14495873", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "", "rating": 5}, {"title": "Beautiful Hotel", "review": "My recipe for spending good time on ur holidays... Firstly, choose Istanbul - amazing city, second - find a comfortable place to stay.   If you are here, being confused and asking yourself:  \"Which hotel i should choose?\"; searching for good location, pleasant atmosphere, nice staff?? As well as cosy rooms and delicious breakfast??   Hmm..I can recommend you The Apex Hotel!:) Here you will find everything what you are looking for. Great location - in Sultanahmet, so everything what is worth to see (Hagia Sofia, Blue Mosque, Yerebatan Sarnici, Topkapi Palace, Grand Bazaar etc.) is in walking distance from this accomodation. Personnel is very friendly and helpful. Thanks to  them the atmosphere is warm and welcoming every time. Also furnishings make it very cosy.  It was my choice…", "date": "March 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r14417797", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Lovely Apex in Istanbul", "review": "We are two couples and stayed three nights at this beautiful hotel. We have to say that the hotel has very good hospitality, nice and friendly staff and it is very clean. Also we all loved its style and decoration.  The hotel is very close to Agia Sofia, Blue Mosque and Topkapi so you enjoy walking inside old town, visiting the above. There are also near some nice shops with souvenirs and cafes with nargile and tea. Very close to tram stop for the city. Anything you want the staff is always willing to give you information.", "date": "March 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r14342401", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "FABULOUS!!", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "February 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r14170136", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "awol at the apex", "review": "I recently made a trip to Istanbul and thought I would try the Apex Hotel Historical after a recommendation from a friend.  I'm so glad I took their advice.  Firstly, I was very impressed by the airport transfer and  what a wonderful hotel.  The location of this beautiful accomodation is absolutely ideal,  very central and all the stunning attractions are nearby.     The staff were extremely helpful and friendly and straight away I was made to feel very welcome.  On one occasion rather late at night I felt a little hungry so I called reception to ask if there were any snacks available.  The receptionist asked if I wanted anything from outwith the hotel as they were more than happy to satisfy my appetite and within a short period of time the food was delivered to my room.  That's…", "date": "February 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r13994752", "sub_review": {"Value": 4, "Location": 4, "Check in / front desk": 5, "Rooms": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "AMAZING HOTEL", "review": "Fell upon the Apex in November 07 when soaked and bedraggled a previously booked hotel was full and took us to this one where we were received and welcomed handsomely.  It was indeed like staying at home - with a few catered comforts - but generally left to spend your your time as you will.  Very obliging when services were required and practical advice for getting around.  I was therefore well satisfied with a quiet unassuming hostelry, conveniently placed, once you worked out where you were, which was dead close to all the Sultan Ahmet main attractions.  So impressed was I that I booked it again for a further visit in Feb 08.  A few new faces on the staff but still with that inimitable friendliness and assistance which had made my earlier visit so enjoyable.  The sun was…", "date": "February 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r13572422", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Excellent Hotel", "review": "BRIDGET  IRELAND My self and some friends stayed at this fab hotel for 3 nights and  i had to let people know what a great place this is to stay from the time we got there until we left the staff were amazing they were on call 24 hrs booking restaurants telling us the best places to see /room service / nothing was a problem rooms were spotless breakfast was lovely we can highly recommend this hotel  we will be back", "date": "January 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r13344698", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Birth of a goog place to live in Istanbul...", "review": "I stayed in the Apex Hotel Historical in January 2008. I had an excellent stay. The rooms are really beautiful, very clean and very comfortable. The staff was very friendly and very helpful from the minute we checked in until the minute we checked out. The atmosphere in the hotel is warm and welcoming.The breakfast was very good.The position of the hotel is perfect, it is in Sultanahmet, very close to Blue Mosque and San Sophia. There is a wonderful view to the sea from terrace bar.   I honestly don’t have one bad word to say about this hotel, everything was excellent, and would recommend it to anyone whether you’re with a group of mates, or on a romantic weekend for two it really is suitable for everyone.", "date": "December 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r12414783", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Very good client service at Apex Historical", "review": "With so many unmissable attractions within a mere stroll of each other – and all set around the site of an ancient Byzantine hippodrome – Sultanahmet is an overwhelmingly popular tourist destination, and a prime location for visitors to be wowed on a truly epic scale. Beyond the wonders of the Blue Mosque, the Hagia Sophia, Topkapi Palace, and more, this relatively small area of Istanbul somehow manages to retain an air of peace and calm. It offers visitors a significantly less celebrated but nonetheless pleasant network of quaint lanes and side streets, majestic panoramas of the Bosphorus, and an impressive assortment of accommodation options for all budgets and tastes.", "date": "December 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r12379439", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 3}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Is just perfect", "review": "Apex Hotel Historical is a small lovely hotel in Sultanahmet, very close to Blue Mosque and other sightseeings (Ayasofya, Topkapi Palace, Yerebatan Sarnici, Grand Bazaar) are in walking distance. Staff was very friendly and helpful, I got answers to all my questions and much more. Rooms were nice and clean and breakfast very good. Actually, my room was cleaned already while I was having breakfast!  There is a great view to the sea from terrace bar. Public transportation also close to the hotel. Can recommend to everyone.", "date": "August 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r10071104", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "best historical hotel in istanbul", "review": "Everything functioned very well. The room was beautiful and very comfortable. The personnel and the service were excellent. I received all the assistance I could wish for at all hours and by all categories of the personnel and always in a very friendly way. When returning after long days out of the hotel it was like coming home. The atmosphere in the hotel is warm and welcoming.  I want to thank all personnel for making my stay so enjoyable and congratulate the management for having created a hotel environment with the qualities mentioned above.", "date": "September 2007", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d729891-r10039673", "sub_review": {"Value": 5, "Location": 5, "Check in / front desk": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5, "Business service (e.g., internet access)": 5}, "travel_purpose": "Traveled with friends", "rating": 5}]