[{"title": "Amazing honeymoon, modern villas, ideal location", "review": "We recently stayed at Magic Village for 12 nights, on our honeymoon. We can't say enough good things about this resort.   The location is perfect. So close to Disney parks, really close to a huge new Walmart, and a Target/Publix in the other direction. Parking is free, and each villa has clearly marked reserved spaces. Easy location for Uber too (although if you do, make sure you message the driver to say pick up from the Black Lake Road entrance, as their GPS doesn't recognise the front entrance).   Our villa was spotlessly clean, and had all the amenities we need. The outside BBQ was amazing, our hot tub was so well maintained with someone checking it most days so it was always working perfectly, and inside was perfect. We loved the fridge freezer with ice dispensers, and the utility room was ideal. Our aircon was quiet and worked without any problems despite it being especially hot during our first week.   Lovely shampoo, conditioners, and body lotion are supplied in each room, and you get a set of mini-basics (washing up liquid, laundry detergent etc) to set you up for your first day.   We had an issue with our TV and the front desk team, and Laura in particular, were so quick to fix it. We had a technician come the same day and everything was fixed and working perfectly.   We didn't use the pool in the main building but we did sit by it on our last day and it is a lovely space with lots of comfy seating around the edge.   We will definitely return if we come back to Orlando, and would highly recommend Magic Village to friends and family.…", "date": "November 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r727916966", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "OK", "review": "Room cleanness needs attention as well as maintenance, the front desk service was great! location is excellent. One of the rooms had the towels dirty, need better cleaning and overall maintenance of the facility", "date": "November 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r727770338", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Great vacation spot very close to Disney", "review": "Great spot, excellent place to stay. I will definitely go back there. Very close to disney and other great locations which were close by. Staff were very friendly and helpful, pool was very clean and accessible!", "date": "November 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r727747105", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Perfect Girls Trip", "review": "We were coming off our girls trip cruise and needed an extra day to relax before going home. This was a perfect ending!!!  We are already planning our next vacation with family to this location. Very close to Disney. ", "date": "November 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r726793110", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Never again!", "review": "Don't let the pictures on website fool you! The first condo had a bad odor, had not been properly cleaned, carpet badly stained, broken toilet and clogged shower drain. Complained to management and was moved to a different condo. The manager was very helpful. He moved our luggage and even left snacks for the children. Later that night I noticed a few ants in the bedroom. The next day, went back to office to inform them of the ant problem to see if they would come spray. They said had to call pest control and they'd be there that day. Pest control never showed up. I returned that night to find that the ant situation had gotten much worse! Could not sleep in bedroom! Pest control came the following day and the manager sent house keeping to clean first floor and change bed. There is a gate at the entrance, but gate was left open for 3 days straight. Although I was inconvenienced many times during my stay dealing with issues, I have to admit that the staff was awesome! Everyone was always helpful and extremely nice. It's clear that the property is not being maintained at a satisfactory level!! Someone is either not doing his or her job or is not allowed the funds to do do so. …", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r724454671", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 1, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Very clean and nice place", "review": "The best way to relax and enjoy your vacation specially while traveling with family and kids, the place is spacious, full equipped, you can even have a BBQ during your stay, they provide possibly everything you have at home", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r724440547", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Magic Village", "review": "Great place; lovely houses and amenities and super helpful welcoming staff. The pre arrival grocery ordering option was perfect  if arriving late or with unexpected delays from our flight from UK. The concierge team were fabulous- so friendly. Restaurant on site was very useful ; good choice of food and good value and delivery to the house quick and hassle free.  Good local amenities, easy to navigate to ( although the sat nav did try to take us in the emergency exit the first time!) good connectivity to the interstates for the other parks. ", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r723819176", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "A fantastic place to stay and enjoy all that Orlando has to offer!", "review": "This was my first stay at a Wyndham resort of this type. I have to say that it was excellent. We were in a 3 bedroom house with a hot tub. The accommodation was immaculate and clean. We also had a view across the lake which was fantastic as the sun set. The staff were very helpful and the hotel facilities such as the restaurant and pool were perfect for what we needed.  I would definitely recommend this accommodation for anyone travelling with their family. You will not be disappointed!", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r723814962", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Lovely property, superb location", "review": "We had a lovely stay at Magic Village Yards, meeting up with friends who live in Jacksonville. It was very quiet, which suited us perfectly, as we often had the pool to ourselves and didn't feel like our children were disturbing anyone; although others may not like staying somewhere so quiet, it was great for relaxing between Disney days! Great location for the parks, and also for lots of food and shopping options (the on-site restaurant menu is a bit limited). The house was fantastic, very spacious, very clean, lovely high-quality bedlinen, walk-in closets, beautiful carpets, plenty of room for the 7 of us (we had a 4-bed, 2 story deluxe). The only things missing were a toaster (as Brits, we need our toast!) and any way to stream internet TV - the TV was not a \"smart\" one,…", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r722745589", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great place for multi-family trip", "review": "Great place for multi-family trip. We were not expecting the place to be as big and new. The location is minutes away from the Disney Parks. Construction is still on going but it didn't interupt our stay", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r722576317", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Best Stay in Orlando", "review": "I would never stay anywhere else when I visit Orlando (at least once a month).  The staff, property, amenities, and restaurant rival any Disney / Universal Park stay.  Please keep up the great work and effort that you do and I look forward to staying at your new property in the near future.", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r722545719", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Extremely Nice Property Will Stay Again", "review": "My family and I stayed with Magic Village from the 18th -26th of October and had an amazing time! The accommodation was clean, spacious and absolutely beautiful on the inside and outside. The staff were all very friendly and helpful throughout the stay with any and everything we needed. We definitely had a magical time! Oh and the food was amazing as well.", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r721753894", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Quick stay", "review": "Although we checked in at 1 am and out by 11 (Disney trip), I would highly recommend this property as far as value.  We stayed in a 2 story, 4 bedroom unit.  My grandchildren were thriilled.  We live close, but if we chose to stay in the Disney area again for a length of time, we will definately consider this property.", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r719111507", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Amazing Villas close to Disney Parks at Great Prices", "review": "Thank you for providing us with great feedback regarding your recent stay at Magic Village Yards. Our staff takes pride to ensure our guests enjoy their stay. We look forward to your next visit ", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r718840922", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Awesome stay", "review": "We took our son and his girlfriend to Orlando and selected this little known gem of a hotel.   The villas are stunning!   We got a three bedroom/3-1/2 bath villa with a full kitchen, patio, gas grill and spa for an amazing price.  The concierge contacted us before asking if we needed anything.  They arranged to have groceries stocked in our villa before we arrived at midnight.   The fridge was stocked with beverages and we have lots of snacks. Just staying at this location made our vacation perfect.", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r718360162", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "My thoughts on Magic Village", "review": "I was so excited to stay at this resort.  These are just my thoughts on how the week went. We checked in Monday.  We were able to check in early.  That was a plus.  The grounds are neat but nothing outstanding.  I've been to other resorts where the grounds were beautiful, this was just nice.  We were assigned unit 3129; 4 bedroom with grill.  Entering the unit, I have to say, it was absolutely beautiful.  What they lack on the outdoors they more than make up for indoors.  The unit was spotless.  There was nothing lacking.  I had the downstairs bedroom and my family members had the 3 bedrooms upstairs.  For some reason, the a/c which worked really well didn't blow into the downstairs bedroom (I never called about that, so that's my fault).  I felt the view out of the patio was…", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r710689263", "sub_review": {"Value": 4, "Rooms": 5, "Service": 4}, "travel_purpose": "", "rating": 5}, {"title": "Excellent", "review": "Thank you for sharing your concerns regarding your recent stay.   We accommodate many guests each evening, and we strive to make their stay  a satisfying one. The principal goal of our hotel is to provide dependable service  to all of our guests at reasonable prices. Consequently, it's disappointing to learn that you're unhappy.  Please accept my sincere apology.  I want you to know that the comments and suggestions we receive from our  guests are taken seriously. They tell us what we're doing right, what we're  doing wrong and how we can improve. Your willingness to share your recent experience is genuinely appreciated.  Please be assured that the issues you've raised have been addressed, and the appropriate action has been taken.  Again, I want to thank you for taking the time to share your concerns with us.", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r707163421", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A Hidden Gem", "review": "great place! love you get your very own townhouse, it was basically brand new, and best part walk out your back door to your very own spa!!!     i would recommend staying here to anyone looking for your own home away from home", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r706176054", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Great family place", "review": "Thank you rstexx416 for sharing your review and recommendation of our great hotel. I’m pleased to hear you've enjoyed our facility and the upgraded spa villa. I’ll be certain to pass along your compliments. We enjoyed having you as our guest, and we hope you’ll visit us again soon! ", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r703529850", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great place!", "review": "My family stayed at Magic Village Yards for 4 nights while visiting Disney World parks and Universal Orlando the last week of August.  We were treated extremely well from beginning to end.  We had reserved a 3 bedroom suite, and upon check-in we walked into our villa only to discover that there were 4 bedrooms instead of 3!  This was a nice surprise.  The villa was spacious, with a beautiful kitchen and clean rooms.  Best of all, there were 5 bathrooms so everyone got their own in our family of 5!  We were able to eat breakfast and pack lunches in the villa, which saved us some money on food within the parks.  The location of this property is perfect ... 5 minutes from Animal Kingdom, 10-15 from Epcot, Hollywood Studios, and Magic Kingdom (close enough that we were able to…", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r703394008", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great Family Place", "review": "Got upgraded to the 3 story villa, kids were very excited for this place, great space and accommodations! would recommend for any family. Only 10 min to Disney. Groceries delivered to villa and ready for arrival.", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r703293690", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Best place to stay in the Disney area!!", "review": "We are delighted you took the time to share your kind review; we value your comments. It’s wonderful to know your stay was pleasant. I’m glad you enjoyed our friendly service and spacious rooms. Thank you for staying with us and we look forward to seeing you again.", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r702820457", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Excellent stay in Kissimmee at Magic Village Yards", "review": "Wonderful stay, had the 4 bedroom and was great.  Very clean and helpful staff. Was probably the best Wyndham property that I have ever stayed at. Close to all the parks. The restaurant was good, try the pizza. ", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r702004978", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Spacious", "review": "Thank you David for those kind words. Our associates make sincere hospitality their priority. We appreciate hearing from you and are glad to know you enjoyed our hotel and the level of service we provide. Thank you especially for recognizing the staff, I will be sure to share your kind comments. Our Villaggio restaurant's pizza is amazing and I am pleased to hear you loved it! We look forward to seeing you upon your return to the area!", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r698358984", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Location very good", "review": "We were very happy with the larger 4 bedroom 4 1/2 bath apartment we rented in Magic Village Yards. We were upgraded to a lakefront unit which was great, and even with 7 family members we didn’t feel cramped. The units are decorated nicely and are well kept.  Our only complaint would be the kitchen is lacking some basic items such as salt and pepper, but they do provide supplies for several pots of coffee. It’s a nice touch that each unit has a private patio with a built in gas grill. The pool is quiet, which we loved, and has a consistent depth of about 4 feet. There are plenty of lounge chairs and several umbrellas. Adjacent to the pool is a lovely restaurant with a Brazilian and Alitalia theme. The food is great—don’t miss the Brazilian buffet on whatever day it is offered.…", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r696851881", "sub_review": {"Value": 4, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "", "rating": 4}, {"title": "Awesome", "review": "I really love the property, it felt like home. Clean, quiet, nice area, nice scenery, and overall just a comfortable place to stay. My kids loved it!! I would highly recommend this property. I will definitely go back!", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r694917392", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Found 3 men in my villa - hotel did not notify me they would be doing work", "review": "Thank you for taking the time to share your experience at Magic Village Yards! We are glad to hear that you had a magical experience staying with us, and have enjoyed our property. It's always amazing to know that your family had a great time in our villa and it will be a great pleasure to host you back very soon.   Here, at Magic Village Yards, Trademark Collection by Wyndham we continuously strive to exceed our guests' expectation and comments like yours encourage our team to keep working to improve our product quality and customer service. We look forward to welcoming you back to your home in Orlando!", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r693344657", "sub_review": {"Value": 5, "Location": 4, "Cleanliness": 5, "Service": 1}, "travel_purpose": "Traveled on business", "rating": 1}, {"title": "The most value for my Whndham rewards", "review": "I returned to the villa during the day to find 3 men on the second floor. This was a very frightening and unsettling experience as a female to walk into your room and find three men there saying that they had been called to fix the internet when no one had coordinated their visit with us (by phone or email) and we had not complained about connectivity.   I ran to the phone in the living room to verify their story and the line was down.  I was frightened and extremely uncomfortable and felt unsafe.   After they left I called and explained what had happened to the front desk and they responded saying that since the hotel has trust in its employees I should as well. I asked to be contacted by a manager and a few hours later received a phone call (surprising that suddenly they know…", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r692362613", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Beautiful and perfect for Family", "review": "Thank you for reaching out to us about your recent stay. We ask that you accept our most sincere apology for what you have shared here, as your encounter is far from what we would hope for any of our guests.  Please know that excellent service is what we strive for.  It is of utmost importance that each of our guests feels well cared for and we truly regret if you experienced anything otherwise. Your comments will be shared with everyone here to reiterate our high expectations of service. We hope to regain your trust so we can welcome you back to our hotel in the future. Should you want to discuss in more detail, please contact us directly. - Naysla, Dual Rooms Coordinator.", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r692189186", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Thoroughly excellent stay", "review": "Amazing property with Brazilian restaurant on property extremely private amazing pool not too deep so is good for relaxing and children  I would highly recommend this property.   I will definitely go back !", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r691728674", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Loved the place but not the cleaning fees!", "review": "Really enjoyed staying here, villas are beautiful, loved the lake view. The things I really don’t liked were the cleaning fees and that the villas should be cleaned daily for the price of the rental, no hidden fees. The two things I would change would be the old kitchen stools and the mattresses firmness, need more softness. ", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r688619661", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 1, "Rooms": 5, "Cleanliness": 1, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Excellent Hotel... but not good shuttle service", "review": "Thank you for sharing your vacation experience with us. It's grateful to hear that you have enjoyed our villas structure and had a great time staying with us.   We apologize if we didn't meet your expectations on the kitchen stools and the mattress firmness. We will consider your feedback and check opportunities to keep improving our product. We will also make sure that the information about the departure cleaning fee is clear in all our communications channels, as well as on our partners' distribution channels.   Thank you again for sharing your experience, and we look forward to having the opportunity to serve you in the near future.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r687718220", "sub_review": {"Value": 4, "Location": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Loved this place!", "review": "Great Location, close to the parks.Really pleasant, We loved our stay in this lovely peaceful home but what makes this such a good place are the staff. All of the people are incredibly helpful. We traveled with two six year old boys, and we called in advance to be sure they have shuttle service, and they do but is not the best service, First, if you have kids you have to wake up before 6am to catch the shuttle at 720 OUTSIDE of the hotel and the shuttle stop in 2 more hotels before get to the park. This is a 5 starts resort the only thing that we didn't like was this service that should be improved", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r686570716", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Condo in Orlando", "review": "Thank you for taking the time to tell us about your experience with us. We are glad to hear that you have enjoyed our privileged location close to the parks and the main local attraction, as well as our villas structure and our customer service. Your comments will encourage our team to keep working to provide the best service, making each guest feeling at home in Orlando.  We apologize if our shuttle service didn't meet your expectations and needs. We will consider your feedback and check opportunities to keep improving our product.  Thank you again for sharing your experience, and we look forward to hosting you back on your next trip to Orlando!", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r686259343", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Just like home...", "review": "I stayed here to not go to the Disney parks, but to just relax and enjoy a girls week. This place was practically empty and we were definitely able to enjoy our time without a lot of people. Our townhouse was extremely spacious, comfortable and had everything that we needed. We spent 90% of our time at the pool. The lounge chairs are EXTREMELY comfortable. As a matter of fact, I rather have slept on the lounge chairs than the bed in my room. The staff was exceptional. The pizza at the restaurant was fantastic as well! ", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r685884802", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 4, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Disney Vacation Trip", "review": "We stayed at Magic Village Yards and we had a wonderful time.  We had everything we needed to make our stay comfortable.  The rooms were very clean and spacious. Staff was excellent. This place was literally close to all Disney Theme Parks. ", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r684965902", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Boredom Headquarters ", "review": "Thank you for your recommendation and for sharing your experience with us. It's amazing to hear that you had a magical vacation staying with us. Also enjoyed our services and our privileged location next to Disney's parks.   Your feedback is very important to us and keeps us motivated to continue exceeding your expectations. We look forward to hosting you back very soon! ", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r684631829", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Mike,Judy...", "review": "The place is very dull and is nothing close to a resort. We stayed for 1 night as we were changing hotels in Orlando. It was our worst experience in Orlando. The ppl in the reception seem to be forced to be working at the place, but I don’t really blame them the place is dead. To be also fair the villa is very spacious and loaded with amenities and if you don’t care about the atmosphere and whether the place is full of fun and life then this place may be right for you.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r684110198", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Hotel Review", "review": "Thank you for taking the time to tell us about your stay. We are sorry that your experience did not meet your expectations; please allow us to express our sincerest apologies.  Your feedback is critical to us, and I am saddened to hear that you didn't feel comfortable and the coziness of our property. We will consider your comments and work on opportunities to improve our product quality and our customer service.  Here at The Trademark Hotel Collection, we continuously strive to meet our guests' needs and expectations.   We appreciate the time you took to share your concerns, and we hope that you will allow us to better serve you in the future.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r684072383", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Prepare yourself", "review": "This place was wonderful had a blast of fun and have no complaints about this establishment whatsoever wonderful time thank you so much it's the best time we ever had in a while and had ever had in Florida !!!😁😁😁😊😊😊 and a special thanks to the rock station in Chicago the drive wdrv FM 97.1 for given us the opportunity of a trip of a lifetime !!! ", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r683862587", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Amazing Family Trip!!", "review": "This resort was beautiful!! The house was very clean and so spacious for my family. It was 6 of us staying there for 7 Days and my family has already said this was their best vacation ever! We’ve stayed at a couple of Disney resorts in the past and hands down this resort was definitely better than both of them!! I strongly recommend Magic Village to anyone planning a vacation in Orlando because it is an awesome place and it made our family vacation perfect.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r683720931", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great for large groups", "review": "Thank you for taking the time to tell us about your experience at Magic Village Yards. It is always a pleasure to receive positive feedback.  It's grateful to know that you and your family had a magical vacation time with us. I will share your comments with our team, who I am certain will be encouraged by your remarks.  Here at The Trademark Hotel Collection, we continuously strive to exceed your expectations.   Thank you again for sharing your experience, and we look forward to serving you on your next trip to Orlando! ", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r683019251", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great family trip", "review": "Safe and clean property perfect for large groups. We had 11, and staying in 2, 4 bedroom apts. was a much better option and value than multiple hotel rooms. Plus, all other properties in the area (other than Disney) are on the low end, whereas Magic Village is very nice...much better quality. I rated area lower just because Kissimmee doesn’t have much to offer other than Animal Kingdom, but other areas aren’t too far away (15-20 minute drive).  Photos and other reviews represent property very well.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r681710825", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Wonderful service and a great location for Disney Parks", "review": "Thank you for taking the time to share your experience at Magic Village Yards. That's amazing to hear that you had a magical stay with us and enjoyed our villa structure. It is always a pleasure to receive positive feedback. Here at The Trademark Hotel Collection, we continuously strive to exceed your expectations.   Thank you again for sharing your experience, and we look forward to welcoming you and your family shortly.", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r681547753", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Excellent Resort", "review": "Magic Village was extremely beautiful and right around the corner to Disney world. We had a 3 floor room and the elevator was extremely useful getting luggage upstairs. I would definitely recommend and will be reserving rooms in the fiture.", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r678911231", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Clean, Spacious, and a Great Location", "review": "Stayed here for a cheer competition at Disney.  The location is fantastic!  There is a Walmart right down the street for food, forgotten toiletries, and anything else you need.  The location to all of the Disney parks is fantastic!  I would definitely stay here again!  The food in the restaurant on site was great, and very prompt.  You will not be disappointed!  ", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r672846077", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great stay. Home away from home.", "review": "That's amazing to know that you have enjoyed your stay with us, Sally. We do have a privileged location next to Disney's park, stores, markets, shopping options and next main city attractions. We are glad to hear that you also had a great experience at Villaggio Restaurant and we hope to welcome you back very soon for the next competition or for vacations. ", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r672133555", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Beautiful Resort and friendly services", "review": "excellent property with exemplary staff. Beware of third party such as wonder vacations selling stay at new phase of Magic village. These properties are not managed by Magic village and are not ready. ", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r670801525", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great Stay", "review": "Thank you for you recommendation, Mohan. We are glad to hear that you have enjoyed your stay with us and had a great vacation experience. As you mentioned, we do not manage the homes rented by Wonder vacations. Please contact us when planing your next trip to Orlando. It will be a pleasure to arrange every detail of your stay. We look forward to hosting you and your family in your home away from home. ", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r670733942", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "The Wallace IV Family", "review": "Our stay at Magic Village have been wonderfull in all ways. Our House was on the lake and the balcony facing the lake and the pool was wonderfull, the BBQ setup with countertop and sink was really neat. The luxury interior finish was awesome.   As for the sevice,  the Front desk services was excellent the check-in took a few minutes and we were all set, the pool service was super nice, ordering from soda, beer, sangria to full lunch and even Pizza  Will surely suggest to everyone", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r670017512", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great place to stay.", "review": "Love this accomodation!!! More than enough room for a family of 4-7 people.  Extremely clean!!! We loved it. The staff was great and very attentive.  The rooms were spacious and there was enough room for everyone.", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r667394198", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Magic Village Yards", "review": "Thank you for sharing your vacation experience with us. That's amazing to know that you have enjoyed our villa's structure and our customer service.   I will share your comments with our team, who I am certain will be encouraged by your remarks. Here at The Trademark Hotel Collection, we continuously strive to exceed your expectations.  Thank you again for sharing your experience, and we look forward to serving you in the future.", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r667385484", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Would stay here again", "review": "Enjoyed our stay!  Quiet, roomy, close to Disney Parks/Water Parks and grocery. The villas were not a letdown. They are as beautiful as the photos!  We were beyond satisfied!  Nice pool. Nice grounds. Staff does not interfere with vacation but will assist if needed. Would be to your benefit to be prepared to buy washing machine detergent, dishwasher detergent and wash towels daily. I did not mind. Had to wash bathing suits, etc daily. Great time was had by all, ages six to seventy in our group!", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r666819496", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Best Kept Secret - Our summer home", "review": "Thank you for your sharing your recommendation and comments. We are glad to hear that you had a magical vacation experience at Magic Village Yards, Trademark Collection by Wyndham. It is always a pleasure to receive positive feedback.  I will share your comments with our team, who I am certain will be encouraged by your remarks. Here at The Trademark Hotel Collection, we continuously strive to exceed your expectations.  Thank you again for sharing your experience, and we look forward to serving you in the future.", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r664342548", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Location, size for the price and cleanliness", "review": "Great location, close to amenities, lots of room, beautiful view of the lake and great outside patio area.There is a full kitchen, lots of seating in the living room. Full laundry, Each bedroom has its own bathroom. ", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r664313692", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Good value for a 3-bedroom place", "review": "I came here with my brother and cousin.  We all preferred our own bedroom so when I started my search the Magic Village came up with great reviews.  There were many aspects of the property we didn't take advantage of like the restaurant and pool but the guest room itself was awesome - spacious and quiet with all the amenities you need.  We spent our day in DisneyWorld so we were on the go but when we relaxed at home it was very comfortable and clean.  I would definitely stay here again.  Hands down.", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r663098069", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Magic Village very clean", "review": "Thank you for sharing your experience staying with us and for your recommendation. We are thrilled to know that you had a great time in our villa relaxing after a busy day at the parks. We look forward to welcoming you back very soon and at this time to have you enjoying the pool and our restaurant. ", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r662658230", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "clean with zero extra", "review": "Jose checked me in late when I arrived in the evening. And checked me out when I left. Hard working guy. Staff is equally dedicated. Place was nice and clean inside and out. Be advised there is a $25 dollar a day cleaning fee. High, if you plan on staying 5 or more days ", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r662412386", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Excellent Home Away from Home", "review": "We appreciate your feedback and recommendation! We are glad you have enjoyed our villa, and also the services provided. We would like to clarify that the $25 dollar is put on hold on your credit card to cover any incidentals and if not needed is returned to the guest after the stay period. Depending on the credit card company it can take till a week after the check-out date. Please advise if you don't receive it. Our staff is at your disposal. We are looking forward to welcoming you back very soon! ", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r661857665", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Fabulous property", "review": "This location was good, condo was clean. Not enough bath towels. Bad hair dryers. Almost no extras except for the wine they try to SELL you in the kitchen. Too complicated to arrange rides to Disney and other parks also they don't serve breakfast, which is ridiculous. Food id pretty expensive and not very good. Takes a long timr to get service. Everyone was kind though", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r660231143", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Disneyworld Adventures", "review": "Magic Village was a great location is close to all the parks.  The staff was friendly.  The villa was gorgeous and provide enough space.  The pool area was nice as well. Overall my stay was great.  No complaints.  ", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r660183255", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Perfect for our family!", "review": "We appreciate your feedback and recommendation. That's amazing to know that you enjoyed our villa structure and design, besides the outdoor heated pool. We do have a privileged location close to the parks, shopping options, and main city attractions. It will be a pleasure to have you and your family back to your home in Orlando!", "date": "February 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r656996782", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Ideal for families", "review": "This property is great! Close to everything you need and just far enough from the hectic traffic and crowds. Very comfortable accomodations. Our 4 bedroom, 5 bathroom Villa was heavenly! We enjoyed our down time at the pool and just relaxing on our patio. We will be back!", "date": "February 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r655004280", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "An authentic Orlando's secret", "review": "We are glad to hear from you, Teri! We appreciate your feedback and recommendation. It's definitely great to hear that you enjoyed our privileged location, close to the main city attractions, but far from the traditional touristic crowded area. We work every day to provide the best vacation experience to our guests and knowing that you want to stay with us again is our main recognition. Thank you! We look forward to welcoming you and your family back very soon!", "date": "February 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r654401841", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great place!", "review": "Excellent Villa. It was clean and in top condition. Really close to Walt Disney World.   The staff was prompt and hekpful. Highly recommended. We booked the park tuckets via their travel desk who guided us and worked out a good package. ", "date": "February 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r653933450", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "A nice place.....but", "review": "We liked our stay at Magic Village. We had a 3 bedroom unit which suited our needs wells and was a nice place to relax after hectic days at the parks.    You can’t beat the location ...so close to all the Disney Parks...but beware that the shuttle they have to the parks only runs once a day...and we chose to drive ourselves....and then paid $25 per day parking.    The concierge and front desk were very helpful and attentive and the property is well maintained.   The unit was nice/comfortable, but it’s location was next to a very busy street on one side and the parking lot on the othe...kind of noisy and the master bedroom facing the parking lot did not have a darkening shade like the other bedroom...it was harder to sleep.    Little things that annoyed us were very thin/cheap…", "date": "February 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r653003080", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Magical time", "review": "Very convenient location to Disney, malls, stores, and fast food! Great service and exceptional unit layout! The hotel should hire better cleaning staff since this is an additional cost. Would reccomend and stay here again.  Mosquitoes in the rooms were a bother. ", "date": "February 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r652134123", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 3, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Well beyond expectations!", "review": "Wyndham Magic Village Orlando/Kissimmee Even with a few negatives, Magic Village Kissimmee deserves a 5 star rating for comfort of accommodations and welcoming and helpful staff! Let’s get the negative out of the way first: The internet would sporadically stop working. The TV had a bad sound bar which made it difficult to watch together as a family in the main area. The $150 cleaning charge at the end of your stay and the $85 cleaning service during your stay may be unexpected. You can have packages sent there, but you will be charged $5 per package for them to accept your packages.  Tips: Check to be sure everything works when you get there so you can have maintenance come and fix them before they are needed. Rent a car if you don’t drive to Kissimmee because it is not walking…", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r651563590", "sub_review": {"Location": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "pleasant stay", "review": "we stayed in a 3 bed room townhouse and it was great and rooms were spacious and had so much room and space to enjoy our stay with kids. Wish they had more ameneties like  breakfast and or free coffee for that kind of money but no complaints just a feedback. We would return next time.", "date": "January 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r649193556", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great property for large group", "review": "We appreciate your feedback and suggestions. We will share your comments regarding the amenities with our management team and we will work to always offer the best product and services for our guests. We are glad to hear that you have enjoyed our villa with the kids. We look forward to welcoming you back very soon!", "date": "January 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r648843303", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 3}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Excellent for families and large groups", "review": "It was absolutely a perfect experience. Close to all Disney parks. It is great for groups of up to 8 people. The rooms are spacious and comfortable and there is a bedroom on the lower level. Highly recommendable ", "date": "January 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r648380728", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Fantastic Villa", "review": "Thank you for your feedback and recommendation, Rubens! We are glad you had a magical experience staying with us. We do have a privileged location close to all Disney parks and shopping options. We will keep working to attend all our guest's vacation needs and to provide the best service. We look forward to hosting you back in your next trip to Orlando!", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r647052704", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Loved it!!!!", "review": "Our family stayed in a 3 bedroom, 4 bathroom and outdoor spa villa. My adult kids loved it. They each had a bedroom & bathroom. We were visting theme parks over the 5 days and it was very well located. Most days we would call an uber which was relatively well priced. The staff were friendly and helpful. The Restaurant at the resort was AWESOME!! Great food.", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r645505594", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Nice property, conveniently close to Disney Parks", "review": "We appreciate your comments and recommendation, Sandra! We are thrilled to know that you and your family have enjoyed our villa, the clubhouse structure, and our Villaggio Restaurant. Feedbacks like yours encourage us to keep working to provide the best vacation experience for each guest. We look forward to welcoming you back very soon!", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r645334483", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "WORST EXPERIENCE EVER!", "review": "Expedia actually found this place for us when they had to relocate us since the booking we did on their website ending in us being scammed!!!! We definitely would stay here again. Absolutely beautiful villas and very friendly staff!!!", "date": "January 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r645040328", "sub_review": {"Location": 3, "Cleanliness": 3, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Annual Family Christmas Vacation", "review": "I rented (paid in full) a house for my family's annual Christmas vacation. Enroute to the house I received an email stating my house was now unavailable. I had to find a new house 2 hours before check in for our vacation. Magic Villa Yards was able to accommodate us with 2 of their villas. Although, we had to split up between the houses, Jose placed us in villas next to one another. Needless to say, we were very stressed through this ordeal. Magic Villa Yards was a great resort.", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r644140855", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Lovely home for 2 families", "review": "Donna, Thank you for your comments and recommendation!  We are glad for the opportunity to host your annual family Christmas vacation! And thrilled to hear that despite the inconveniences you had to face with the other vacation home cancelation, you could enjoy your time with your family at Magic Village Yards. Your feedback encourage us to keep up working to provide the best services to our guests and we look forward to welcoming you back very soon!", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r635696181", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great Value", "review": "We recently stayed at the magic village 4 bedroom house. Awesome property. 21/2yrs old, clean, well maintained. We preordered grocery from Walmart n the concierge delivered everything into the house. We were celebrating my daughters 16th bday and the concierge put balloons n banner in room b4 arrival. There was a $30 charge for it. We had some issue with hot water and maintenance came quickly. Magic kingdom, Epcot and downtown are close. We used Uber everywhere, saved time. The only one issue we had was the glass and cups were not microwave safe so we ended up heating everything on the gas! Overall highly recommend this place.", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r633509332", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "exactly what we wanted for our Disney trip", "review": "We appreciate the time to provide a detailed feedback about your stay with us and also for the recommendation. We are happy to hear that you enjoyed our villa's structure and could personalize your stay with our concierge services, celebrating your daughter's birthday! We are glad to be part of this special moment for your family and we hope to welcome you back on your next vacations! ", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r632829359", "sub_review": {"Value": 5, "Rooms": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Fun Family Meet-Up", "review": "We stayed in a 4 bedroom.  It was large and clean (our unit had a grill and it too was clean). The grounds were maintained nicely and gated.  15 minutes to WDW parks, Uber cost about $14 off-peak to get to the park.  There is a shuttle but it leaves at 7:30AM and returns late in the evening.  The Village is situated off the main road so it is quiet but very close to stores and restaurants.  Walmart is 4 minutes and Publix is 10 minutes away.  Wawa is about 6 minutes away next to the Krispy Kreme. So you can pick up your souvenirs, food, coffee and donuts in one short drive.    The property looks just like the pictures and is a great value.  However, you should note that the Village is not in a posh upscale neighborhood (if that is what you seek).  It is in an area with other…", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r630294677", "sub_review": {"Value": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Fantastic and memorable", "review": "Love this place,clean organize just like a home. I recommend this resort to everyone 5 star experience.I felt so relax and peaceful.This was definitely a awesome experience. I will be back for sure. My 2019 vacation here we come. My family didn't want to leave we stayed an extra night. Great job on the up keep of the villas and property!!Bed feels like Marshmallows so comfortable!!!Oh bathrooms I love!!!", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r630174239", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Awsome stay ", "review": "Thank you for your feedback and recommendation, Alex! That's great to know that you enjoyed your stay with us and had relaxing moments. Comments like yours are the best recognition to our team efforts to provide the best vacation experience to our guests. You and your family will be very welcome on your 2019 vacation!  ", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r629960993", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "60th Birthday Celebration", "review": "Great place to stay only downside there was nothing for teenager to do they told us it will be fix on the next property which was cool only other thing was a little problem at the front desk but it was cool we will bring our family back they really enjoy the place ", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r627846991", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Spectacular ", "review": "Thank you for taking the time to provide your feedback and to recommend us! We are glad to hear that you enjoyed your stay with us and you're willing to stay with us again. It will be a great pleasure to welcome you and your family very soon!", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r620880755", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Luxury at it's Best", "review": "Beautiful, modern, and serene affordable get away. Magic Village is a home away from home. It has all of the amenities of your hearts desire. Stop by the market on your way there and you won’t need to go back out for anything!!", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r616300859", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great", "review": "The 4 bedroom house was excellent. The pool area was very good, pleasant and friendly staff. Excellent location. Close to all Disney  parks and main area for shops and restaurants. I would definitely go back. The only negative was the gym, not a lot in it and one item of equipment was  broken and wasn’t fixed within our 11 day stay.", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r605185870", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Excellent. Spacious modern", "review": "Thank you for your feedback and recommendation! We are thrilled to hear that you had a great stay with us and have enjoyed our privileged location. We are sorry for any inconviniece at our gym room. We are working to improve it. We look forward for your next visit! It will be a pleasure to have you back very soon!", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r598884573", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Spacious Comfort", "review": "We loved this resort. We were upgraded from a 4 bedroom with a master suite on the main floor to a 4 bedroom,  3 level, with an elevator.  Each bedroom had a full bath with double closets, half bath guest bath on the main. Washer and dryer, covered patios of three of the bedrooms. It also had s barbecue grill on the back patio with furniture.  There are plenty ok f glasses, cups, plates, cooking utensils, toaster, blender. Coffee maker, pots, and pans.  It was only about 10 minutes away from magic kingdom and animal kingdom.  Plenty of shopping nearby including Publix, Target, and Walmart. There is a shopping complex where Target is. We were able to get our Disney tickets from Disney online directly which was much cheaper than the vrndor on site. This is a great place to stay @", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r598527052", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great Place, but front desk was ehh! ", "review": "Thank you for your recommendation, Ruby! We are glad to hear that you had a magical experience staying in our 4 bedroom villa with 3 floors. Our location is privileged indeed, close to many shopping options as the Vineland Premium Outlet, markets, and to Disney parks. We hope to host you and your family back on your next trip to Orlando! You're super welcome!", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r598020306", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great Hotel", "review": "Most important for me when I travel is cleanliness and comfort. Magic Village Resort did not disappoint. During a mini-family reunion in Orlando, I shared with my 3 other siblings and their spouses a 2-level townhouse. The townhouse is well appointed with 2 king size bedrooms, one in the lower level, one upstairs and 2 twin size bedrooms. The upstairs king has a porch and the bigger of the 2 twins does as well. The best part - each room has its own bathroom and wall-mounted TV. The beds were super-comfortable and the bathrooms are spacious. The modern kitchen has a breakfast bar that sits 6 and a separate dining table for 4, that allows plenty of room to gather. The kitchen has a full-size fridge and dishwasher, a microwave, coffee pot, lots of cabinet spaces with dishes, pots…", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r596363909", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Perfect property really close to Disney property ", "review": "Stayed here for two weeks in a three-bedroom property. Property’s adjoin but they are large and we didn’t hear anything of our neighbours at all either inside or out. The property was finished to a high standard with a kitchen/ lounge running throughout the downstairs with a cloakroom and laundry room with washer and separate dryer. The kitchen was well equipped with china and glass had a large fridge/freezer, cooker, microwave and dishwasher. There was both a breakfast bar and a round table and chairs. Patio doors open on to a covered paved area with a large table and chairs and gas barbecue and sink. Upstairs there were three double bedrooms each with their own bathroom and the master bedroom had a door onto a balcony with two loungers above the patio. Good quality linen and…", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r591768293", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "luxury villa", "review": "Thank you so much for your awesome review! It makes us truly happy to learn that you had a great experience with us and we succeeded in achieving your satisfaction. Our location is indeed privileged and close to the main parks, besides lot of shopping options. We will keep doing our best to improve our services and product in all aspects. We look forward to your next visit! ", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r588604470", "sub_review": {"Sleep Quality": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Beautiful property but beware of fees", "review": "We booked this villa for our visit to universal stuido and disney magic kingdom. They have a free pick up (approx 10 p.m) and drop (approx 10 a.m) from the reception to disney magic kingdom which is not very far. Universal studio is not very far from here too. We took an uber for all our travels. Uber comes in like 5 minutes. We took a 4 bedroom apartment since we were 3 couples with 2 kids. The house is very comfortable with the basic amenities in place. Kitchen is fully furnished. They provide towels, basic toiletries, basic cleaning soap in kitchen.  Beds are comfortable, bathrooms are clean and spacioius. Their restarant has a small menue but still decent. The pool by the restaurant is also clean. They have a warm water pool too. The guide at the resort sits from morning…", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r584840995", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Great facility, needs to replace (or re-educate) receptionist", "review": "We appreciate your feedback! We are glad you have enjoyed our villa and our privileged location close to the main Orlando attractions, parks, and shopping options.  We are always looking forward to providing the best vacation experience to our guests and we will work to improve our service and correct our flaws. We hope to welcome you back very soon in your next visit to Central Florida! ", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r583499946", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Relaxing stay in a busy town", "review": "This is a beautiful property great for big family's. Short ride to animal kingdom lodge. Like most resorts in Florida their is a cleaning fee theirs is $150 plus tax and a $25 resort fee per day.(which they say you get back it's been 7 days haven't got it back yet.) Front desk was nice. Keep in mind you must make your own beds and they had a problem with us asking for extra towels. We did receive them though. The only way I would come back unless I had another big group. It's beautiful but not happy they told me I would receive my money back for the resort fee. Overall 4 out of 5.", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r582070831", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Beautiful ", "review": "The townhouse was beautiful and very comfortable.  I however was not notified prior of the $100 cleaning fee and the $95 incidental fee in addition to the considerable daily rate.  Beautiful, yes worth whats being charged, no!  Definitely not worth the money for a one night stay.  The community is under construction as well.  ", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r580934946", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great Choice!  Close to parks!", "review": "We appreciate your comment. It is grateful to know that you had a good experience in our beautiful home. We will review with our distribution partners the information about how the departure cleaning fee is displayed to assure the communication transparency with our guests. We hope to have the opportunity to welcome you back very soon! ", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r580837037", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "A wonderful luxurious base ", "review": "All the benefits of a condo and a hotel.  Front desk is 24/7....there's a restaurant, bar, pool, but the complex is set up like apartments/condos and you can park right outside the door.  Everything was immaculate - we stayed in the 3 bedroom/3.5 bathroom.  Every room had it's own bathroom.  There were two livingrooms, 3 patios/balconies, washer/dryer, full kitchen, dining room, and an elevator to get up to that 3rd floor.  :)  The only thing I would suggest is more kitchen items....like glasses, pans, etc.  It was there but it was kind of limited.  I would also suggest letting guests know that they need to buy the essentials like salt/pepper, coffee, coffee filters, sugar, etc.  It was easily bought at the grocery store that was close.", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r575682855", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Terrible Front Desk Before Arriving At Our Fabulous Room", "review": "Thank you for your recommendation and for taking time to share your experience with us, Shana! We are glad that you enjoyed our 3 bedroom villa with its own elevator. We will take in consideration your comment regarding the quantity of the kitchen utensils and we will work to have a clearer communication regarding the essential items mentioned. We hope to welcome you back very soon in your next trip to Orlando area! ", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r571760910", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Perfect hidden resort outside the busy city", "review": "We stayed here 9-20th April for a family holiday doing Disney/Universal. There were 4 adults and a 9 year old and we stayed in a 5 bed house all with ensuite bathrooms. The house was very well equipped with a massive fridge/freezer, coffee maker, toaster, washing machine, tumble dryer etc and a good selection of kitchen utensils and crockery. There is only one sachet of dishwasher tablets, washing machine powder & a small bottle of washing up liquid, so it was necessary to buy top ups at the local store. The house was spotlessly clean although with cream carpets and a cream suite, there was general signs of wear and tear and we were very careful not to make any spills.  The house is really modern with large showers and very comfortable beds and pillows. There was plenty of…", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r569170934", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "What A Great Place", "review": "We really enjoyed our stay at Magic Village resort.  The kitchen and outdoor grill are excellent and we really enjoy making some of our meals “at home”.  The couches were comfortable and make for a good place for the whole family plus friends to relax.   The beds and bathrooms were excellent as well.  It is a very short drive to Disney World which is very convenient.   We were even able to enjoy the hot tub to unwind after a full few days at the Disney parks.  They were offering a special summer price when we stayed here and it was worth every penny.  ", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r567743999", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Everything you want and close to the parks", "review": "We loved our condo.  It was well laid out with each bedroom having its own bath.  This made getting to the parks at opening very easy.  Our room had its own hot tub.  Wonderful for my 6-year-old grandson when no one could go watch him by the pool.  The condo was spotlessly clean and well stocked.  This is a great option for multi-generational families like ours.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r567718184", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "A great place for a large family of 8!", "review": "The layout is great, Two masters, one on first floor other on second floor. Very clean with a well equipped kitchen, washer/dryer in the townhouse. The units are individually owned and ours could easily be 5 star if the fabrics and carpets are refreshed. It is at least 15 minutes to Disney World. ", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r564029539", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Hidden fees", "review": "Thank you for your feedback! It's great to know that you have enjoyed our villa structure with your family and our privileged location near to the parks. We have a regular maintenance review to refresh furniture fabrics, carpets and other house items. We will share your comment with our operational team and work to have it done. We look forward to welcome you back very soon! ", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r557343257", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Best Hotel in Disney Area!!!!", "review": "This place is great for a family, its only a 5 minute drive to animal kingdom which is very convenient. I was caught off guard at check in when I was asked to sign a form to charge me a $150 cleaning fee, this was at check in not checkout. I am always on the road and saying at different hotels and I have never been asked to pay a cleaning fee upon arrival. I booked this through chase and no where did it state I would be charged a cleaning fee, not in the terms and conditions. This is make it or make for me to stay here again and I wont be because of this hidden fee.", "date": "November 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r555296534", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Caution - Mouse Print Ahead!", "review": "Received Travelzoo offer dated November 13th: Orlando: Luxe 4-Bedroom Villa near Disney for $229!  Booked for two people using 3-Bedroom Villa over Dec 8th weekend.  Arrived at location and immediately given notice there was a \"cleaning fee\".  Asked for fee to be removed, since said documentation was \"paragraphs down in the small print\" and I just did not see it until stepping up to check-in.  Both Manager \"Heather\" and Director \"Lyle\" listened to my concern.  I offered them time to review my request, received text next day declining $100 removal.  Asked to speak to director or corporate office, but was informed director was off rest of the weekend and no corporate information available.  I was then offered Lyle's email address, but with no help on first try and staff stating…", "date": "December 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r546708508", "sub_review": {"Sleep Quality": 4, "Rooms": 5, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Great stay awsome hotel", "review": "Dear VinCent2130  Thank you for taking the time to share with us your experience. It is only thanks to constructive feedback like yours that we can improve upon ourselves. We would like to extend our sincere apologies for not having met your expectations. Please rest assured that your valuable comments regarding the way the cleaning fee information is being displayed in the reservation confirmations will be shared with our partners.  ", "date": "November 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r545181934", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "ATTENTION MOMS!", "review": "Awsome hotel. Loved the aparment. It was clean and so nice. Great beds. Loads of space for the kids to play. Loved the grill. It was locaded away from main road so you didnt really hear cars or other noise. Its really close to Disney and about 30 min to universal, seaworld and the big outlet. Took about 15 min to the small outlet. There are loads of restaurants close to it plus target and Wal-Mart. I would for sure use it again.", "date": "November 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r540893641", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Perfection ", "review": "Thank you fro your feedback! The grill is indeed very popular among our guests", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r520778916", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "A bit disappointing.", "review": "This place lent heavily to my sanity for the long week of parks and wild kids. Quiet (aside from that one family, you know), peaceful, classy. Pool was glorious. Hot tub was heavenly. 8 days without contacting staff because this place is set up for us, we needed nothing more. Randy and Paul, staff members, wandered by to make sure we were todo bien. Muy tranquilo mi amigos! LOVE LOVE LOVED IT. Booked ahead so we got a stellar price too. Felt sorry for the suckers in the resort next door 😂", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r514843344", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "IT'S ABOUT MAGIC", "review": "This is absolutely the best resort in Orlando and the Disney Park area.  The three bedroom villa's can easily accommodate 2 families without distraction.  Villa's are done to perfection, plenty of glassware, dishes, and the appliances were outstanding even the gas grill on the patio, did not even have a propane tank hard wired, and an outside dining area and sink..  It was perfect!  They have every possible kitchen and bathroom amenity you could imagine, to include a rain shower faucet, that could fit 3 people.  The staff, I was greeting by Jose, he was so fast at checkin I was in and out in 3 minutes flat.  I must say that for the price even the villa's of Grand Cypress can't compare.  Pool was immaculate, I used the gym which was also specular, I checked out the children's…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r513269642", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Wow", "review": "Thank you for your detailed feedback and recommendation, Anne Marie! It is grateful to know that you have enjoyed the best of our condo and villas. Our main goal is to make our guest feel special and have a special time with us. We look forward to welcoming you back! ", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r511581605", "sub_review": {"Value": 3, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Wonderful Villas with Plenty of room Us and the Grandkids", "review": "We loved our townhouse at Magic Village Resort. We booked a 3 bedroom house that has everything a group of friends needed during an extended weekend.  Pool is very nice with restaurant service offering Brazilian food options and even a Feijoada on Saturdays.  Gym is very small and modest with only 2 treadmills that needed maintenance.   Very nice place and a good competitor for the Reunion houses and apartments that we love!", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r510561583", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Superb Accomodation", "review": "We appreciate your comments! It was a pleasure to know that you had a great time while at Magic Village. We will address your comments about the gym to our team and will work to improve our structure. We are glad you have enjoyed our Brazilian specialties by the pool and our famous Feijoada. We look forward to hosting you back!", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r504920164", "sub_review": {"Value": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Wonderful", "review": "The property is located right near Disney Animal and Magic Kingdoms. There are tons of restaurants and shopping on route 192 which is very close by. The villas themselves are beautiful, spacious, clean, and contemporary.  We chose the 3 bedroom, 3.5 bath and it provided more than enough space.  We all looked forward to going back to our temporary \"home\" after long days at Universal and SeaWorld.  The grandkids loved the pool and stayed there for hours.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r504344898", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Gorgeous place with super nice apartments", "review": "The Magic Village is a gorgeous place with super nice apartments. The village is very new and some apartments are still under construction; however, this was no problem concerning noise. The apartments are spacious and well equipped with everything you need to make your stay comfortable. Everything was clean and the staff was very helpful. I will recommend everybody going to Orlando to stay at MV. It is very good value for money.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r502570708", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "The Best", "review": "Thank you for your recommendation! We are glad you had a great time with us and enjoyed our service. Your comment encourages our staff to always improve our service standards. We look forward to welcoming you and your family back very soon!", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r501357627", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Very Nice", "review": "This is the best place to stay when visiting Orlando, Florida. I stayed at at the 4 bedrooms unit facing the pool and it was very spacious. I will recommended it, 100%.  It was close to all the parks. They also have a security officer at night.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r486264722", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Luxury and Serenity", "review": "Thank you for choosing Magic Village! It's very grateful to know that you have enjoyed our facilities and structure. Our location is indeed privileged and close to Disney parks. We are waiting for you and your family on your next visit to Orlando!", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r485433991", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "great place to be with family", "review": "Great place to stay with family and or friends.  Extremely spacious and clean. We rented the 4 bed 4 bath condo which was more than enough room. I felt like I was in a $500M luxury condo until I looked out my window and saw our rental car. Lol. I plan on staying here again on our next trip to Orlando. Staff was very nice and attentive. ", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r484397090", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Awesome experience", "review": "This was a beautiful townhome! Very spacious, updated, clean, and very comfortable. It included a large kitchen with plenty of bar seating. Two seating areas downstairs, laundry room and a bathroom downstairs. Upstairs was great too with 3 bedrooms and a private bath for each room. Plush carpeting and comfy beds and linens. If you share the cost with family or friends, it is cheaper than getting separate rooms and a lot more comfortable. My only regret is that we didn't spend more time enjoying the townhouse instead of at the theme parks.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r484390450", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great alternative to staying at the park", "review": "These town homes were spacious and great. We have little children (under 3) who still nap. This place was big enough for us and another family. It was nice to have a living room to hang out in while the kids napped. It's a quick hop to Disney and Universal Studios. The pool was nice but the hot tub was malfunctioning when we were there. The outdoor patio and grill is awesome. The carpets could probably use a steam clean but otherwise the place is nice and new. The menu at the restaurant is limited but the food was good. There are tons of restaurants and stores nearby. We would definitely stay here again. ", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r482718068", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Beware EXTRAs", "review": "This is great for families. Spacious, new houses. Comfy beds. Free parking. Close to Disney parks. But after four days we were hit with a bill for a \"departure clean\" of $150!!!!!! Outrageous. The extra charge wasn't highlighted on our booking, although it was noted in small print that was highlighted when I queried the charge. It wasn't included in the \"Total you will pay the hotel including all fees\" price on our hotels.com booking either and they still haven't responded to my email and were no use on the day of departure. Charges like this should be upfront and clear. It feels like a sly trick to get some extra cash out of you at the end - and it's not a charge you can do anything to avoid. The management were pretty poor at handling my objection so I don't think I'd stay…", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r475106823", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Solid but be aware of cleaning fee", "review": "We truly appreciate your comments, Keith. We are glad that you have enjoyed the house and could take advantage of our unique location. We will review with hotels.com how the departure cleaning fee is displayed to ensure it is more clear at the website, and not only when selecting the house to book. We have also shared your feedback with our management team in order to improve our services. We hope to have the opportunity to welcome you back again.", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r473389751", "sub_review": {"Rooms": 3, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "I wish I could of stayed longer!", "review": "Rented with my family, we ended up renting 2 of the 4 bedroom units.  It was a quick trip, 2 nights.  At the price, I was expecting a little more.  Unfortunately the pool was closed during our 2 days as was the restaurant.  There was some bad weather, so I can understand the pool.  But wish the restaurant was open.    Location is solid.  Lots of places around you and very close to Disney.  But if you want to use the shuttle, you may be out of luck, limited seating and it fills up (10AM and 10PM).  Room:  Had problems with our outlets.  1/2 didn't seem to work.  Room/space was clean though.  Bed comfortable.  But for what appears to be a newer room (or renovated), it wasn't aging well.  Service:  I was disappointed with cleaning fee.  There wasn't any mention of the fee when…", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r471197577", "sub_review": {"Sleep Quality": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Vacation", "review": "Excellent accommodations, clean, new. Staff very attentive and professional. Nice place with restaurant, bar, and nice swimming pool. This is not a regular hotel, it is a condo. We got a 3 bedroom condo and found it lovely, we had our own patio with our own barbecue pit. The kitchen was very modern. Granite in all over the place, nice furniture, very spacious and clean. Our condo has 3 floors and included a private elevator. Made me feel like home.    ", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r468436945", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Disney Trip Success ", "review": "We are happy hat you enjoyed your stay and look forward welcoming you back!", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r467226901", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Lots of space, quiet, close to attractions", "review": "Most likely if you plan to visit Orlando, Florida its to visit DisneyWorld or Universal Studios.  In my most recent trip we decided to do both.  However choosing a place can sometimes be a headache especially with so many options.  I've stayed on a Disney Resort before but this time I wanted to choose something different.  In this case we chose Magic Village Resort.   Now if you are traveling with other adults this place is for you!  Very clean and up to date condo like homes.  However you need to provide your own food and drinks.  They do offer a service where they can get you groceries.  But if you have a car I say do it yourself... if not then yes go with them for a small fee.  They do provide a shuttle to Magic Kingdom only but you have to request it a day before and shuttle…", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r461745688", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Frustrating Experience", "review": "Thank you for your detailed review and recommendation! It is very grateful to know that you have enjoyed our facilities and structure.Your comments encourage our team to keep the passion for our guests’ satisfaction. We look forward welcoming you and your family back!", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r461585204", "sub_review": {"Location": 4, "Sleep Quality": 3, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "So good", "review": "These are very spacious villas with 3-4 bedrooms with ensuite baths, kitchen, laundry, and outside patios. Very modern and nicely furnished. The resort is located central to all major parks and attractions. There are many great restaurants nearby as well as a onsite restaurant that delivers to your villa. The pool area consists of a pool and hot tub with comfortable lounge areas. No lazy rivers or water slides for children. We took our own wash cloths based on other reviews. They were correct- WASH CLOTHS ARE NOT PROVIDED so bring your own- very strange and our only complaint. ", "date": "January 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r459346077", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Better", "review": "I had been at Magic Village a few times and even thinking that the place are top I could see some updates that made the place even better. It's still a wonderful place for family who want a quite and a nice place to stay.", "date": "January 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r458319119", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent stay for families and big groups", "review": "Thank you for choosing Magic Village, Stuart! Our goal  is always to offer an exceptional experience to your guests, and we hope to welcome you back very soon! ", "date": "January 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r457939225", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Excellent Accommodations", "review": "My family and I staying here from the last week of January to the first of February. Generally speaking, we had a wonderful time.  We booked the 4 bedrooms villa which was very beautifully decorated and modern. It was very big, it had 4 bedrooms, 2 double and 2 twins, a large living room and a big kitchen. It is not a hotel, they are actually individual villas with all privacy and comfort. You will find everything you need in a house in it, towels, toilet papers, etc. It is like living in your own house. The houses don't have food, however after booking we received an email from the concierge offering to do a little shopping for us if we liked.  I do recomendo if you are staying in Orlando and are not a big fan of hotels or if you have a big family (the house fits up to 8 people…", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r456961500", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Magnificent Accommodation", "review": "We had a wonderful stay at Magic Village Resort. Since they were still a new resort, there was still some construction going on but nothing major to affect your stay. It's a very pleasant place with ample room for everyone to be very comfortable. The kitchen was equipped with plenty of dishes, silverware, pots, coffee maker, blender & toaster for use. They only provide you with a small dish liquid & one packet of dishwasher powder. But if your there for less than a week, it is enough if used sparingly. There is a small trash can in the kitchen but they only give you 1 trash bag. They only give you enough detergent for 1 wash load. There is a bathroom in each bedroom but only supplied with a towel & hand towel, no washcloths. The hotel does not have washcloths so you will need to…", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r454154413", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great place for the family", "review": "We are a family of 5 (children aged 11, 13 and 15) and had a three bedroom apartment (each with en-suite) which was extremely modern and well appointed.  The village was quiet and secluded yet within comfortable driving distance of all main attractions.  We cannot fault it.  The front desk personnel were friendly and helpful and the restaurant was good and convenient (including by delivering take away).  Thoroughly recommend.", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r442979864", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great 8 Days for the Lee Family!!", "review": "Wonderful Resort, clean, new, zero complaints.  Staff was great!!!  Very peaceful and quiet, just like a home away from away.  The four-bedroom villa is much bigger than you would imagine and is easily large enough for three to four families.  Very close to Disney as well.", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r441015700", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Luxurious Townhouse", "review": "We are very happy you enjoyed your family vacation with us and we look forward welcoming you back in the future.  Thank you!", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r440333100", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Modern, Clean, Quiet and Big", "review": "This new townhouse complex was very nice, modern, and well appointed.  The only things missing were washcloths and tissues (they had toilet paper).  Most of the rentals in Orlando seem to be time share high rises which are out of date and not comfortable.  These units are much more luxurious with comfortable furniture, nice linens, stainless steel appliances, full size washer/dryer.  It is located about 10 minutes from Disney and 20 from Universal.  There is a Publix a mile away as well as many restaurants and Target.  It didn't have all the bells and whistles like the time share condos - water slide, putt putt, game room, but we wouldn't have had time to use those things anyway.  The beautiful pool was heated to a comfortable temperature, there was a hot tub, and the lounge…", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r437077355", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Nice Property With Decent Location", "review": "Dear LaineO,  Thank you for you feedback and suggestions. Comments like yours motivate us to always offer the best to our guests. We look forward welcoming you back in the near future  Regards", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r436795880", "sub_review": {"Location": 4, "Rooms": 5, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "EXACTLY AS PICTURED!!!!", "review": "We booked a three bedroom with jacuzzi and BBQ here for three nights and spend the other three nights at Animal Kingdom Lodge. The lobby reception is high ceiling with golf cart like that in the typical Asia resorts. Each bedroom had its own bathroom and downstairs had a powder room and laundry. Even through there is only one living room, you get two seating area for adults and children. It was close to the Disney resort and I would definitely recommend staying here if you are traveling for for than 3 nights with a big family. The kitchen and space in the apartment give each of us plenty of space. At night it's quiet and you can rest up for another action pack day at Disney. Highly recommend staying here, and look I forward to another opportunity to coming back. ", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r432425980", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Clean, modern, quiet location ", "review": "Great base for the theme parks, restaurants and shopping. Staff were welcoming and helpful. Pool was clean and usually very quiet. We rented a 3 bed villa and it was spacious and clean and had laundry facilities. We also had an outdoor hot tub.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r430467518", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Magic Village Resort", "review": " Hello Scot1inOz,  Thank you for taking the time to share about your stay.  We are glad that you enjoyed it, and we look forward welcoming you back in the near future  Regards,", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r429514863", "sub_review": {"Location": 4, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Outstanding!", "review": "From day 1 to day 7, could not fault the service, the friendly staff, the surroundings or the condition of the apartments. Family of 6, (incl. 2 teenagers) accommodated in 2 x Queen, 2 x Twin rooms, all had ensuite & TV, large fully equipped kitchen, lounge with balconies upstairs and BBQ area downstairs.  Day 4 one toilet blocked but quickly fixed, day 5 A/C broke down, (required new parts), fixed following day. The family were offered an adjoining, no charge, (mirrored) unit across the road but offer only taken up by half the family. All issues considered, fantastic service, quiet location and would fully recommend.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r420200649", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Disneyworld visit", "review": " Dear Toko1942  Thank you for your comments and kind words. We are happy that our staff was able to prompt assist when the A/C broke down, and that you could continue to enjoy your days here in Orlando. We look forward welcoming you and your family back in the near future!  Regards,", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r409780540", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Beautiful villas close to Orlando parks", "review": "Magic Village exceeded our expectations.  It's is comfortable, clean and well managed.  The only thing we saw was our curtain rod seemed to be coming out of the wall in the living area but minor flaw compared to the rest of the amazing 4 bedroom, 4.5 bath condo.  It is really close to Disney and only 15 minutes from Universal.  We visited both parks so this was very convenient.  We would absolutely stay here again!!!", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r396126867", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Exceptional and fabulous", "review": "Our family took a road trip in to Orlando, and stayed here for a full week.  When we arrived at the gate of the property, we were instantly impressed.  The property is brand new, and very nice.  Although this is a hotel, they're really nice townhomes that are well designed and exceptionally decorated.  Our place was nice and clean, with spacious rooms, a bathroom in every room, and a laundry room that featured a full size washer and dryer.  The hotel is also located in a prime location which puts you close to all attractions, nice restaurants, shopping areas, and grocery stores. We had dinner brought to our town home from the onsite restaurant, but was not at all impressed with the food, and it was quite pricey.  Also, you have the choice of having housekeeping and receiving…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r394900504", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Wonderful place to stay in", "review": "Hello Thank you very much for your review of Magic Village. We are extremely happy that you enjoyed your stay with us. We are still growing and we strive to give the best customer service and a great product! Once again we thank you and we look forward to welcoming you back with us.  Kind Regards,", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r390460310", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great place to stay near Animal Kingdom ", "review": "Amazing newly built villas with 3 or 4 bedrooms. Very good price for what you get.  I had 4 bedrooms villa and it was like a dream, well equipped with all appliances you may need as if at home.  So clean and the views were fantastic.  Villagio restaurant in the clubhouse was great.   It is very near to disney.  We enjoyed our stay for one week.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r389562060", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Magnificent Stay and more", "review": "Hello Thank you for your review. We are extremely happy you enjoyed your stay. We strive to provide exceptional customer service along with a great product. Once again we thank you for staying with us and we look forward to hosting you in the future at Magic Village Resort.  Regards, ", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r386735983", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Loved this place!", "review": "We spent the 4th of July weekend here. We had booked a 3 bedroom townhouse but upon check in were upgraded to a 4 bedroom/ 5 bathrooms. The unit still had that new home smell. It was very well equipped, bathrooms were very modern and had high end toiletries. It is only 5 minutes away from Animal Kingdom if you use Sherberth Road. Close to a Super Target, Publix, Walgreens, Winn Dixie as well as lots of gift shops and restaurants. I would highly recommend it but be aware that they will charge you a cleaning fee upon departure.", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r383938062", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "A no-brainer; thank you Jose!", "review": "A stone's throw from Animal Kingdom and a short drive to Magic Kingdom? Check. New three and four-bedroom villas with grill and full kitchen gear? Check. A very nice pool with chairs with thick, comfy cushions? Check. An on-site restaurant with homemade pastas and wonderful staff? Check. The world's best onsite manager/concierge in Jose? Check. This place is a total no-brainer at current rates.  Book a room with the pool view. Construction is ongoing but rooms by the pool would never know.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r383817913", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Magic all the way ", "review": "Thank you very much for your comments.  It is wonderful to know that you had an enjoyable time with us and everything was to your liking. We strive to provide all of our guests with exceptional service and personal attention and we are just thrilled that experienced that first hand. We look forward to welcoming you back at Magic Village Resort.  Warmest Regards,", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r379329295", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Vacationing in Style", "review": "Wow! Have stayed in many places all over the world but this will take some beating   A brand new resort ( we got a great deal and no doubt it will quickly jump to the top of the rankings and not become such s hidden gem !)   Located at the back of I92 not on sat navs, tricky to first find ( on back road behind cici pizza on i92)   First impressions good, new complex still building to the right as you enter  Plenty of car parking space right outside the villa  We had 4 bedroom villa with terrace bbq.. Stunning! The layout was fantastic and well planned, downstairs bathroom, laundry room. Beautiful open kitchen / lounge very well equipped and hi specifications  Lovely terrace with table for 6 and gas bbq  Double bed with bath/shower downstairs and 3 bedrooms and bathrooms…", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r378296933", "sub_review": {"Location": 3, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Luxurious/ Modern and worth paying!", "review": "Thank you very much for your review! We are thrilled that you enjoyed your stay with us. Our aim is to provide great customer service along with a fabulous product. Looking forward to welcoming you back!  Warmest Regards, Mgt.", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r364875469", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Home Away from Home", "review": "Magic Village is a new , Quiet Community in a place you would not expect ! Right off 192 where the traffic is a headache You turn into this Small Gate with an AI greeting you.. I loved this stay ~ We had 4 Bedrooms & Four Full baths with a Guest bath and What a great Kitchen ! We cooked Morning & Night with the Grill working as well... Yes I said grill! I love that this rental Townhome offered a Gas Grill that was so easy to use and Clean up with a Table outside for a relaxing day in the Heat  ~   The Rooms and Linens were all Wonderful & The beds and layout of each room was so functional and so Relaxing ! It was kind of hard to leave the Home when we had to go to Disney because all we wanted to do was hang out here ....   For Kids its great there are many places they could all…", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r360392862", "sub_review": {"Location": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Family vacation", "review": "This was a very nice and spacious condominium . New and very clean with nice amenities. Very close to Disneyworld but not in Disneyworld. The pool closed a little to early. In a gated community ,with all the comforts of home. However if you are planning on cooking there was only one frying pan and no pot for boiling. Other than that I would highly recommend for families or even just a group of friends.", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r358017593", "sub_review": {"Value": 4, "Location": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "great!!", "review": "Hello  Thank you very much for your review. First, we are thrilled you enjoyed your stay with us! Rest assured we will address the issues you highlighted as we continue to find ways to improve on all our services and amenities. Once again we thank you for staying with us and we look forward to welcoming you back in the future.  Our Best. Management", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r354071670", "sub_review": {"Location": 4, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Amazing!", "review": "I almost did not review it as it would deb a great secret to keep, but they deserve a great rating. It is new, the staff was great and place was amazing. Very quiet at night we all slept great! I would recommend that they have some cleaning service because you can see that some guests do not take good care of the place. But we loved it!", "date": "January 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r344326087", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Disney and Universal fun trip", "review": "Thank you for taking the time to share about your experience with Magic Village Resort. We truly appreciate your feedback and it certainly motivates us to keep doing our best to pamper our guests. We look forward welcoming you back in the near future. Regards", "date": "January 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r343178511", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Excellent ", "review": "Brand New town homes less than 1 mile from Disney Animal Kingdom.  The town home was perfect.  All room had it's own bathroom.  The beds are very comfortable and it has everything you need.  We made breakfast every morning and then headed to the park which saved us money.  The staff is amazing.  Jose at check in was so sweet and the maintenance staff even came by to make sure we were ok.  I truly recommend this property to families that need more space than a hotel guest room.  The resort is close to all Disney attractions. I will definitely book again!", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r338313497", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Fantastic staff", "review": "We stayed here over the new year in a four bedroom villa with BBQ. The resort is in a fantastic location, minutes away from the Disney parks. The villa was comfortable and beautifully furnished with a heated pool and restaurant/bar area.  There is building work going on so it did get a bit noisy during the day but did not disturb us too much. The staff were really friendly and helpful. We had to move villas on our first night due to a maintenance issue which was irritating but dealt with very professionally and we were given a bottle of wine and complimentary breakfast to compensate.  I would suggest that the kitchen needs more equipment for people wishing to cook as we found it difficult to find bowls etc to serve food in.  All in all though I would definitely recommend Magic…", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r337355026", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "EXCELLENT FAMILY RETREAT", "review": "Sarah. Thank you very much for your review of Magic Village Resort.  We are extremely happy that you enjoyed your stay with us. We are working diligently to ensure all of our guest experiences are memorable, and we look forward to welcoming you back.  Regards,  ", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r337071340", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Hot tub users beware", "review": "Very nice and clean retreat.  Highly recommended for family vacations.  Centrally located.  Staff was very efficient and courteous.  The manager, Carlos Adorno, was very efficient and went the extra mile to please us.  I left something behind, and when I called, he immediately called me back and made sure he sent me what I had forgotten.  You don't see this kind of service anymore, I was very impressed by his kindness.", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r335128545", "sub_review": {"Value": 4, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Perfect family retreat", "review": "Rose We are thrilled you enjoyed your stay with us and we want to thank you for your comments. Our primary focus is our guests and we are working daily to ensure we provide exceptional customer service all the time every time.  Kind Regards, Management", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r334976009", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great holidays! ", "review": "Great resort, but DO NOT use the hot tubs. I just stayed there with my family and my husband and I both developed a MRSA skin abscess within a day of using the hot tub. Thankfully, my husband is a physician and was able to call in a script for antibiotics. I attempted to contact management and have not gotten a return call.", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r334196295", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "First timers to this facility", "review": "Yes this is a new facility and there is construction going on. My wife and I had a three bedroom condo and our son, his wife, and four children stayed in another unit close to us. All of us enjoyed our units with one having a hot tub. There is also a beautiful pool and we were told a soon to open restaurant on the resort grounds. The staff were wonderful and very helpful. We would highly recommend this resort to any family. One last thing. An uber car to the Disney park is around $7 and he drops you off in front of the park.", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r333753707", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Complete Scam", "review": "Dear First Timers. We are extremely happy that you and your family enjoyed your vacation with us!  Our number one priority is customer service, and we continually work hard to ensure we deliver the best we have to offer.  We hope as we continue to improve and complete our Resort, you will return to experience the Magic!,  Thank you, Management", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r331117377", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Brand new complex was good for our needs", "review": "Booked this hotel on short notice after another plan fell through. On another website Magic Village Resort has a 5 star review and based on the pictures it looked like a great place to take a family for a Disney vacation.   Once we got into the area the taxi driver used the GPS to locate the entrance. The entrance is gated and we were not given a code. There is a telecom system, but when we pressed the connect to the front desk no one answered. We had to drive around the back side only to see that the resort is under major construction.   This place isn't even close to being completed. The hotel listings are completely inaccurate.   Most of the listed features are not completed. No restaurant, no fitness center, or no bar. Those are just the things we found out once we got there…", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r325822539", "sub_review": {"Value": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Perfect location and accomodation", "review": "Dear Guest,  We would like to thank you for taking the time to place such a detail review of your recent experience at our Resort.  The resort is presently being built on phases and phase 1, which is the phase were all the amenities, Club House and services to our visitors are provided is complete at 100%.  Phase 2 is almost complete and most of the buildings will be delivered this month.  Our fitness center, kids club, concierge, pool, hot tub as well as our free internet service and cable system are fully functional and operational.   Our restaurant is on schedule to open this upcoming week and we will offer a variety of fine dishes and drinks to satisfy the most demanding pallet.  We would’ve love to have had the opportunity to host you and your family and to provide you with our distinctive customer service and superb accommodations; we are certain you wouldn’t be disappointed.  We hope you can give us an opportunity in the future so you can experience the best that Central Florida have to offer.  Have a great Holiday Season and thank you for your visit.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r317312110", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Under construction don't book", "review": "We were a group of 3 adults & 3 kids who booked and then got worried about lack of reviews on TripAdvisor. but things turned out fine, so long as you are prepared that the site is under construction but your unit itself will be fine. Right now only a small fraction of the units are ready which was fine by us as we had the pool to ourselves. I wonder once it gets busier how the amenities will manage.    The common kids room was barely finished, small gym was open and restaurant not yet open. Outside bbq not yet hooked up to gas. Business centre is really 2 computers in the lobby with a printer. Because the complex is under construction, there will be workmen passing by all the time. Of the 5 units in our building, I'm guessing 2 were occupied.   Things to know - extra charge for…", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r271449359", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "\"Not open but booking rooms\"", "review": "Booked vacation for July 13th to July 19th . Called today  5/11/2015 to pay trip off. They tell me the resort want be open to august ,when are you going to call me and let me know. I cancel a great reservation at Marriott Grande Vista to try this resort big mistake. It's hard this late in the game to find accommodation up to the standards I'm used too. Don't book until you know it's open. Quit taking people's money if you are not open!", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r271440855", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Dumped by Property", "review": "I made this reservation back on January 4th 2015. Since this was a new property, I check often to see if there are any reviews on the property as of yet. On April 10th after still not finding any reviews. I decided to contact the property directly to find out why. This property is currently under construction. Also it will NOT be ready for guests until JULY 2015. I asked the gentleman on the phone, \"When did you or did you even plan on contacting people who have reservations for May & June\". He told me \"Oh yes we were going to start calling on Monday April 13th, we are prepared to offer travelers to stay at another one of our properties\"  Well if you plan trips months out like I do, because we travel in a large group.  You will know that it is hard to find nice accommodations…", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34352-d7303068-r265467379", "sub_review": {"Value": 1, "Rooms": 1, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}]