[{"title": "excellent hotel", "review": "this hotel is so good we passed 6 nights in this hotel ; so calm ; near from taksim square   and the neightbor are so helpful and so  kidness thanks for here and thanks a lot for the personnel of this hotel we return again next year to this hotel –  brothers  from Algeria -", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d7380584-r308252084", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Basic accommodation close to Taksim Square", "review": "The apartment is located 500m away from Taksim square and Istiklal Caddesi. It's on quite a steep hill, so beware if you have lots of luggage! The area is quite run down, but felt very safe. The owner, Burak, is very genuine and tries his best help out, but does seem to lack basic common sense. Wifi was good and Burak was also kind enough to let us use his computer and printer.   Overall the room was ok value for money; very basic and close to Taksim. The top floor room we stayed in was quite small with a large balcony; this would be perfect for a summer stay.   During our stay there were a number of things that we had cause to complain about. We had booked a twin room, but on arrival there was a double bed. Splitting the bed should have been fairly simple, but we had to direct the effort as Burak just watched the maid try to move all the furniture in the room and leave us with a door blocked by the wardrobe! The bathroom had been painted with a water-based paint and a lack of decent extraction meant that the room was constantly wet and the ceiling was wet paint. The bathroom ceiling was so low that we had to shower sat in a chair or risk covering our hair with paint from the ceiling. Burak offered to move us to another room but didn't seem to grasp the problem - or solution of using better paint in the room. The room was only cleaned once in our three day stay, however, our towels were not replaced with cleans ones. Instead they were hung up in the wet bathroom so we came home to damp towels. On our day of departure the maid asked to clean our room while we were still present (and getting washed and dressed). It was only 9am and cleaning the room before we and all our bags were out did not make sense. Also, the key code for the front door only worked intermittently, so we had to wake up the maid in the middle of the night to get in. Burak didn't seem to think this was a problem and suggested we try the code at least five times before expecting it to work.  Burak constantly asked for our apologies and said that he was only an amateur. We don't know how much was lost in translation and cultural context but all these little problems could be solved using common sense and a little forethought.…", "date": "January 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g293974-d7380584-r247327223", "sub_review": {"Sleep Quality": 3, "Rooms": 2, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 3}]