[{"title": "Lovely hotel", "review": "Great place with its own parking, we were lucky to chose our room so we chose the bigger one with sea views. Breakfast is very simple (Bread, butter, Jam) but the coffee is great with lots of choices (cappuccino, hot chockolate, latte, etc). Great location close to restaurants. The bed sheet and towels smell amazing. 5*", "date": "November 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r727742602", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "very clean and friendly", "review": "Very friendly and helpful staff. Rooms big, clean and comfortable. Nice bathroom. Good location. I recomend that place. Nice place for breakfast and afternoon tea. Cofee machine. Microwave and fridge avialiable. ", "date": "November 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r725518314", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very cosy place", "review": "It's really great place to stay, room was super clean, they don't serve breakfast but you can have complimentary coffee and toasts every morning.  But the most important are absolutely amazing ladies Ana and Sonia, always nice and helpful,  taking best care of their guests. I highly recommend this place and will come back for sure!", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r718581088", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely guest house - good facilities ", "review": "The guesthouse is spotlessly clean and offers excellent value for money. It is conveniently located and next to bus stops but also offers parking if you have rented a car. Ana the proprietor along with Sonia were welcoming and ever pleasant. A pleasant breakfast room offers complimentary drinks and toast and there is a separate kitchen if you want to prepare your own food", "date": "February 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r653168085", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "good price / quality ratio", "review": " Dear Mr Draviwake,  Thank you very much for your positive feedback and we look forward to welcome you again in a vert near future at Quinta Mar & Sol  Best Regards The Team Quinta Mar & Sol", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r583580266", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Perfect", "review": "The place is well located, around 10 mins walk from Funchal centre and in an accessible road. The rooms are amazing. A loooot of space, always very tidy, everything very clean and smelling fresh, and flowers everywhere outside. It's really beautiful. However the main reason I'll hope I'll return is Ana and Sonia. They are the most welcome you can be and they are always asking if everything's perfect or if they can do something to help you get a better experience. For my family they really invested a lot of time and patience explaining us about the levadas -which ones were prettier and easier etc -as well as restaurants advice and places to visit.  If it was not for them this trip would have been really good. With them it was perfect. Couldn't be better. Congratulations", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r569449996", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great stay!", "review": "We enjoyed our stay at the  Mar Quinta & Sol very much. We had a room with a balcony which was very spacious and clean.   Great location with pubs and restaurants nearby and a 15-20 minute walk to the center of Funchal.  We hired a car and were able to reserve a parking space at the hotel which was very convenient.  Breakfast was good with fresh bread and fruits although the choice was very limited. However, for the price we paid, we cannot complain.  Special thanks to Ana and Sonia for their hospitality and recommendations which enabled us to make most out of our stay in Madeira.   We are already looking to go back!", "date": "December 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r551867043", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very friendly.", "review": "A fantastic place to spend holidays. We enjoyed the friendly atmosphere and tasty breakfasts. Ana and Sonia thanks for all your advise and hospitality. The hosts also recommended car rental company which was helpful", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r524272188", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Cosy and affordable accommodation", "review": "The owner is nice to everyone, easy to talk to and happy to help with anything. Room was tidy and clean (not large, but we expected that), there is a PC connected to the internet, which was helpful. Breakfast was tasteful and served in a pleasant place. The only slight disadvantage is proximity to a noisy street, but quality windows solved the problem. Great accommodation for the money. Definitely recommend.", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r520311342", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "It felt like home!", "review": "I've been there twice and loved it both times. I will always remember Ana and thats why I came back the year after my first stay with them. The rooms are clean, the breakfast is good with fresh bread and they will prepare your breakfast in advance when you have to leave early in the morning.  You can walk to the city center and restaurants are close.", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r520000272", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Homely guest house", "review": "Guest house has very friendly and helpful personal with family approach. It's in a walking proximity to city center. The rooms are clean and breakfast is fine. The only negative was loud roundabout nearby.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r499696024", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Pleasant and nice stay in Quinta Mar e Sol. Thanks to its very nice crew.", "review": "- No lift in the house - Part of the room below the roof not convenient for some people as they may hit their head against the ceiling.  = We knew it but just to mention that there is no swimming pool. = Parking available but small (3 spots) = The location is not close and not far from downtown (approx. 20min by foot)  + Host kindness, availability and flexibility. When we were not able to take the breakfast the day we left, they prepared a take-away breakfast for us. + Quick reaction. When I asked the owner by mail if they can book me a parking spot, they quickly answered and provided us the pass. + Clean rooms + Nice refurbished house + Rooms are equipped with bathroom (except room 6, the bathroom is private but not included inside the room), TV, large cupboard, balcony for…", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r493916834", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "B&B in Funchal", "review": "This B&B is like feeling home. Anna en Sonia are the best hosts.  They help you with all you ask. It's a great place to stay when you are in Madeira.  It's very close to Funchal en to many restaurants.   They have a private parking when you are hiring a car.   Hopefully we go back to Quinta Mar & Sol.   ", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r493736695", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nice and great value for money", "review": "This place is lovely with super nice hosts. The guest house is very comfortable and clean. Breakfast is good. The only issue can be for people who cannot sleep with noise as the main street is right next to it and at night it is not a big issue but in the morning when traffic gets busy, you do hear it in the rooms. This did not bother us as we could sleep with this much noise. ", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r489925435", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Overrated by other visitors", "review": "I booked this place based on the excellent reviews stated both in TripAdvisor and Booking.com, which turned out to be way overrated. The place itself would require some facelift, including the rooms, that had almost no windows and very limited access of daylight. The house is very badly ventilated and smelled of a mold the minute you opened the door.  They serve same breakfast everyday, very modest one, and way to late, at 8:30. For the visitors that wish to go for hiking or travel around the island, this is too late. The most upsetting thing was after coming back to my room in the evening, I realised that my hairdryer had been broken and parts are missing, and neither Sonia or Ana had told me about it. That's not very nice.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r488999229", "sub_review": {"Rooms": 2, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Quinta Mar & Sol 4 days stay", "review": "One minus: breakfast at 8:30 is actually too late. When people want to take a trip, especially inland, an early departure is often necessary to enjoy the best weather conditions. When asking they will provide in an earlier breakfast. Ask on time a parking place for your car. (only 4 places available)", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r485956212", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Place to be in Madeira/Funchal", "review": "My 100% recommendation! Amazing staff- ladies do everything to make your stay as good as possible. Delicious breakafasts (everyday fresh fruits). Not in the city center but very close- by walk 15minutes and when you can visit a lot of good quite cheap restaurants. Additional services- ironing, washing and of course Wi-fi connection. Best wishes from us Adam, Agnieszka (Poland).", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r482545643", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Best stay I've ever had", "review": "Sonia and Ana were really friendly and are allways there to help you, they make you feel as confortable as at home. The stay was absolutely perfect and the home is really clean and confortable.Totally recommended.", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r479568447", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "B&B worth the money", "review": "Central location, brilliant staff, very helpful and knowledgeable of the attractions on the island nice room with comfortable bed, tea and coffee facilities available in the kitchen, adequate breakfast and good but limited parking", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r478622197", "sub_review": {"Sleep Quality": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Just a great place", "review": "Great location for visiting Funchal. You can walk downtown. The hospitality is super, we enjoyed the breakfast and tips from Ana. There is a private parking which is handy in the busy surrounding. I warmly recommend this place.", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r477487875", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent friendly hotel in Funchal", "review": "We stayed 4 nights in the Quinta Mar& Sol.  Ana and Sonia were very friendly and helpful. The hotel was comfortable, excellent breakfast, we could make tea and coffee. The location is about 20 minutes walk to the centre of Funchal but there are a lot of restaurants nearby. We will be back.", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r459915624", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent stay in Quinta Mar & Sol", "review": "Me and my girlfriedn had a lovely stay in room no. 2 in Quinta Mar & Sol. Hostess was really friendly and nice. She made us sandwiches every evening for the next breakfast, because we were leaving appartement before 8:30. Rooms were clean and nice, there's even a laptop in a living room. The bathroom is also very clean.", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r459631199", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Spotless guesthouse", "review": "Perched a little up the hill above Reid's, on a bus stop, with good parking and a 15 min walk down to the Lido area., or the Marina in the other direction.   The hill walking back up is steep - about 150m long.   We had room 7 which was spacious and quiet - the road outside is busy. The housekeeper hostesses, Ana and Sophie were the biggest plus factors - they were warm, welcoming and very hospitable - couldn't do enough to make one's stay comfortable and provide answers about what to do and where to go.   They keep the place spotless.    For us, they made the visit.  Breakfast was prepared fresh fruit, juice, very nice breads, ham and cheese but it was the same every day (except Saturday when we got a croissant)   Seems OK from the description but we agreed with the earlier…", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r459564163", "sub_review": {"Value": 5, "Location": 3, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good Value Guesthouse", "review": "This is a basic but clean and comfortable guesthouse. Anna was a fantastic host giving recommendations for things to do and places to visit.  It is located a short walk from the marina area and is equally close to the Lido part of Funchal. It is a fairly step walk back from town which may not suit some travelers but there are plenty of tuk-tuks one can take should this be a problem.  The sunny breakfast room is a comfortable venue to enjoy the breakfast which consists of fruit, yoghurt, ham, cheese, bread and tea or coffee.", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r452539514", "sub_review": {"Location": 4, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Strategic position", "review": "The b&b is very nice, clean, and the owners are very nice and very helpful. It is positioned very well, (just a little hard to spot with the navigator) on request there is possibility of a parking space, which is very convenient if you have a rental car. Was very nice to stay there, only breakfast was a bit disappointing.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r449122077", "sub_review": {"Location": 4, "Sleep Quality": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "four ladies visit funchal", "review": "We had a wonderful time.  Everyone was so kind and the hotel was so clean.  Anna and Sonja were so helpful  - Thank you.  Could I perhaps mention the Role and Coffee Cafe opposite.   The evening we arrived we were quite hungry and had not worked out where we were in Funchal.  We went to the Role and Coffee as they were closing they reopened and made us a light meal.  A few days later we prebooked dinner .I had espada for the fourth time and the role and coffee was by far the best.  I can highly recommend good food at reasonable prices.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r434740759", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "True Hospitality", "review": "We are from Louisiana in the United States where we pride ourselves on our Southern Hospitality, but Marta and Ana really outdid themselves. The accommodations were very pleasant and Ana really puts herself into taking care of the place. We especially enjoyed her homemade liquor.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r411800617", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Looking for a bargain base in Funchal", "review": "We needed a 1 night stop over and booked here. Ana who runs the place is absolutely lovely and the place is comfortable with good basic facilities. Our room over looked the road and was a tad noisy but we could deal with that for a night. If you are looking for a base which is cheap with breakfast thrown in then it may be worth a punt for 40 euros for room, bed and breakfast.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r403387026", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Most customer friendly people", "review": "From the moment we arrived, we felt at home at Quinta Mar & Sol. Ana and Marta are very kind people who would to anything for you. We stayed two weeks at Madeira and decided to come back to Quinta Mar & Sol after our trip to Porto Santo.   The rooms are very clean and neat. The breakfast is very good, every day different kinds of fresh fruits and bread. Also possible to eat yoghurt with muesli for example.   Quinta Mar & Sol is quite close to the centre, which is a 20 minute-walk away. It is also possible to take the bus that stops right in front (for example bus 8).  When we had to take the boat to Porto Santo, we had to leave very early so we couldn't eat our breakfast. Instead, Ana made us some sandwiches the day before and she put them in a refrigerator. Also there were…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r393687338", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "The most friendly accomodation", "review": "Very simple, but traditional and clean. Very clean bathrooms, and good bed. Marta was superhelpful and gave us several very good tips. The breakfast was a bit more simple but still tasty. Definitely recommend this one.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r391123385", "sub_review": {"Value": 5, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely !", "review": "My husband and I have just returned from a weeks stay at Quinta Mar & Sol. We enjoyed everything about it, location ,great with a bus stop just outside or a steady walk into Funchal. We were made very welcome by Ana and Sonia. Our room was kept very clean and fresh daily. Breakfast was simple and very nice ,fresh fruit, local bread, ham and cheese and cake,cereal, yoghurt.  Ana is a hostess in a million ,kind, warm and considerate ,even preparing us an early breakfast on our departure day. Sophia looked after us for two days ,a gentle lady with a lovely smile . We have been to Madeira  many times but usually in an apartment or 4 or 5 star hotel  We enjoyed our stay that we would certainly go back to the Quinta Mar & Sol . Thank you to Marta for booking us a taxi ,sorry we didn't…", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r378986641", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Extreme hospitality", "review": "Ana and Marta did eveything for us to feel the best. They explained places to visit just upon our arrival. We had a great chat with them. Ana asked about us every day and he is a very kind person. Since the parking is almost impossible in Funchal we have requested a parking place in the property. The breakfast was very good especially the fresh bread and buns however the food selection was always the same every day.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r376023804", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A gracious old inn that's fully up-to-date in all the right ways", "review": "This little jewel is tucked away to the west of the city centre, and a walk to the Funchal shoreline is a good twenty minutes or more (and requires a long stretch in a tunnel). But the inn is truly a gem. We were on a budget, so we took the smallest room -- and it was small! -- but it was spotlessly clean with a huge bed made of two twins put together. For my daughter and I (who were catching a plane the next day) it was just fine. The bed was very comfortable, sheets crisp and clean, the bathroom (which was separate but private) very modern and also spotless. The inn itself is a charming old Funchal house that's full of history and character. The complimentary breakfast was served in a lovely sunroom with all-round windows that gave you a glimpse of the ocean as well as views…", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r361810085", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "nice week on Madera", "review": "It was a realy nice place to stay on Madera. It was easy to go by car (there was a private parking area) or by bus (the stop was on the corner) or by walk to down Town Funchal. The staff was very helpfull :) ", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r352056890", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great accommodations!", "review": "The house, room etc were wonderful. Breakfast was lovingly prepared and served. The house is a bit far from downtown so if mobility is an issue this isn't the place for you. There is also a fair bit of traffic noise but when your windows are closed it is fine. ", "date": "February 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r348950778", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Great place", "review": "Good location (15 minute walk to the city center), perfectly clean, comfortable beds, amazingly friendly staff. They welcomed us with cookies, juice and a friendly chat :). They also immediately gave us a map, and offered great advice on what is worth seeing.", "date": "January 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r346132844", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Amazing place", "review": "The localization of the hostel is quite good - in about 15 minutes of walk we were in the city centre. The hostel is very tidy. Our room had a very cosy bed and a big wardrobe. The staff is very kind and eager to help. One of the best part of the place is the terrace where we were eating breakfast (which was delicious! fresh fruits everyday!) - it had a view on Quinta Magnólia, a garden full of flowers and palm trees and behind the garden we were able to see the ocean. Really nice!", "date": "January 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r343085527", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great place from where to discover Madeira", "review": "This is a very nice hotel and great value for money. It is close to the city centre and in a good location to discover the rest of the island. Our room was lovely and clean. The bed was very comfortable. The free private parking was very helpful. Best about the hotel was probably our amazing host Marta who greeted us warmly and made a lovely fresh breakfast every morning. ", "date": "January 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r341514005", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A splendid welcome", "review": "A very comfortable place to stay, convenient for the old town, easy to walk to or catch the bus. Don't stop to talk to the timeshare touts on the bridge who are a minor nuisance. We were well looked after by a very friendly and helpful staff. Able to come and go as we wished. Breakfast was plentiful with delicious bread and cakes.", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r336482423", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Home from home", "review": "My partner & I stayed here for a week. We chose it purely on location (as we were there to see Maritmo play and it's close to the stadium). What a find! A lovely property, spotlessly clean we had the superior room in the 'turret' but from what we saw all the rooms are immaculate. Breakfast was lovely served in the conservatory by Ana who was so helpful & friendly.  We loved the location and happily walked both into Funchal and along to Cama Lobos more than once! There are plenty of restaurants within a 10 min walk. So all in all a perfect place to stay in Funchal.", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r332586948", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Ten days in Madeira", "review": "Great and very welcoming staff, delicious breakfasts and a clean nice room with a great fan to ease the heat. We could also use the parking space when we decided to rent a car. No disadvantages, strongly recommended!       ", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r315959128", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent value for money", "review": "This was our first visit to Madeira and we thankfully found this accommodation. The Quinta Mar & Sol was excellent value for money. We had a very warm welcome from Ana & Sofia. Our bedroom was better than we expected. We stayed in room no 5. The room was big and spacious. We had a complimentary bowl of fruit in the room when we arrived. The bed was very comfortable, and the bed was bigger than a standard double sized bed. The whole house was cleaned to a high standard every day. Ana & Sofia were very helpful with travel advise. Ana works very hard to keep the whole house organized & also to keep a high standard in the house.The B&B is 15-20 minute walk from Funchal centre. Don't let that put you off. We walked home most nights, which was a nice walk. But if we felt a little…", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r296432155", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "dolce fare niente! :)", "review": "we stayed one week in quinta mar & sol in funchal.its located about 3 km from the center.there are a lot of small shops and restaurant near by.the room was very clean..the blanket was been changed every second day.the breakfast was very tasty (bread, cold meat&chees, fruits, coffee and pastry). sofia and ana are very friendly and good persons.thank you for hosting us..it was a pleasure to meet you.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r294903396", "sub_review": {"Sleep Quality": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Definitely worth the stay", "review": "I had been to Madeira in January 2015 for one day on a cruise and liked it so much I thought I would come back and spend a bit more time. I found Quinta Mar & Sol on Trip Advisor.  It had good reviews and looked nice so I booked it.  They offered to pick me up at the airport and take me back at the end of my trip for £25 each way.  The B'n'B is very centrally located.  You can walk everywhere.  It was a 20 minute (estimate) drive from the airport.  The B'n'B has only been open since February 2015 and has nine rooms.  It is extremely clean and tidy.  I was in Room 9 which was very spacious and well appointed.  There is a TV with several English channels.  There is not air conditioning, but with the ceiling fan and windows open it was fine.  The breakfast was plentiful with juice,…", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r293639666", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Wonderfull place to stay :)", "review": "When you come, you will be welcomed by very nice ladies - Marta and Anna. They will be there for you all the time you need. Clean rooms and very tasty breakfast will surprise you every day till the end of your stay. Parking place is big enough to manipulate and park the car. I have enjoyed it in here a lot! Anna always recommended me some places to visit and how to get there the most easiest way. Recommended by 6* out of 5 :) (and say hi to those ladies from me! :))", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r289336847", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A good price for Funchal", "review": "The price is very interesting for Funchal and it's close from the center (15, 20 min) The room is perfect, cleaned every day, good bed The inconvenient : it'seems close from a big road so there is noise during the day but not during the night so it'should the most important !!! Don't stay in Funchal more than 2, 3 days ! ", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r288780185", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice place", "review": "We had a very good week at this B&B. So if you want to go to Funchal, choose this place if you don`t like hotels you can find everywhere. The breakfast was good and the staff very kindly. Comfortable beds and very clean rooms.", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r284414083", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Excellent location, amazing staff, definitely recommendable!!!", "review": "We've just spent 5 days in Madeira and stayed @Quinta Mar & Sol. It is very well located. We rented a car so we could enjoy the most out of this amazing island. QM&S is just a few minutes driving from almost anywhere; we didn't find a problem driving to any part of the island so there's no need to change hotel if you plan to visit the whole island. The room was big and was always kept very very clean. The bed was huge.  Breakfast was simple but complete: coffee and milk, bread with butter and jam, ham and cheese, yogurt and muesli, juice and a big dish of fresh fruit.  Marta gave us a lot of advice and travel tips even before the arrival; be sure to ask for her advice ! :) Just after we arrived Marta was waiting with a city map and she was restless marking must-see spots on it…", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r274955031", "sub_review": {"Location": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very recommendable!!! Best Choice in Madeira", "review": "We felt like at home. The room was big and the bed comfortable. The breakfast was simple but with all we need. Fresh fruits were served alldays in the room and also for breakfast. The Quinta ist near to the city and reachabable in 15 minutes by feet. Thanks to Ana and Marta for the lovely b&b", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r273653684", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Best place !!!!", "review": "I spent two amazing weeks in this B&B. Nice and lovely staff. Clean rooms and area. Great beakfast. Not far from the city center. Free Wi-Fi. It is the place to be. And I'm looking forward to visit this place and people as soon as possible. Thank you! Simon", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r265978725", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Nowhere better to stay in Funchal!", "review": "We have just returned from our first trip to Madeira. We chose to stay at Quinta Mar & Sol, and are so glad we did, we were delighted with our choice. Marta, the owner, arranged for her brother to pick us up at the airport, and we were greeted by Marta and her daughter, who were extremely pleasant and made us feel very welcome from the minute we arrived.  The accommodation is very nicely decorated, and very homely. There is a sitting room which has a large, flat screen TV and computer for the use of guests. Our bedroom was large and very comfortable, with en-suite shower room. All exceptionally clean. Breakfast, in the breakfast room, consisted of cheese, ham, rolls, fresh fruit and yoghurt, and was overseen by Anna. Anna was delightful, so pleasant and helpful. If we asked a…", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r261882151", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Best place to stay.", "review": "We entirely enjoyed our stay at Quinta Mar e Sol! Just outside the centre of Funchal (but not in the Hotel district!) lies this lovely and gracefully refurbished BnB, which perfectly fit our needs. Big beds, clean baths, short walks into the centre, restaurants nearby, the beautiful countryside just around the corner and obliging staff let us have an excellent stay. Last but not least the amiable housemaid, making you a perfect breakfast and letting you have a pleasant holiday. If ever coming back to Funchal/Madeira, this would be the favoured place to stay!", "date": "February 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g189167-d7613530-r258598003", "sub_review": {"Sleep Quality": 4, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}]