[{"title": "A real 5* hotel", "review": "Having stayed at this hotel in 2018 with my family, we were all very impressed! Would very happily stay here again. This is a real 5* hotel. There are some hotels in Turkey that state they are 5* when in reality they are more like 3* hotels but this hotel is amazing.", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7809477-r710487128", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Amazing hotel and wonderful stay", "review": "Our room was truly awesome because of the seaside view. The hotel has so many different possibilities to relax. For example the pool, the spa area or at the beach. Just take a walk for a few minutes to swim in the ocean.The evening program was really nice and everbody was very kind & pleasant.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7809477-r710157474", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Zuzka Buchova", "review": "Second vacation in this beautiful and modern hotel.Super animation program.Rooms spacious, regular cleaning, minibar constantly replenished.Everywhere employees and managers were on a professional level.Always smiling on his face.The beach was kept fine.On the beach are umbrellas,not pergolas. Food and drinks great, I think everyone chooses what I like. Drinks from bartenders were great. I am already planning to have a holiday in this great hotel with excellent services.", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7809477-r697045695", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Excellent 5* Hotel", "review": "Stayed at Side Sungate in April 2018 and my family and I were very happy with everthing at the hotel.  The only aspect that travellers should keep in mind is that there is only 1 restaurant. But the food is varied and tasty.", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7809477-r668816680", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Could have been better. Definitely not 5*", "review": "Stayed here with my family for 11 nights, from last week in August to first week of September.  My first impression was that this hotel was very clean and still relatively new. The decor and design quality of the building was quite impressive from the outside and inside the lobby. And although quite small compared to neighbouring hotels, the building  seemed of a much higher standard than the others. But the man at reception was not very professional - certainly not what you would expect from a 5 star hotel. He couldn't even manage a smile when we approached him. He just stood behind his desk and made no effort to help me get our luggages and pushchair through their awkward revolving door into the hotel from the taxi.  We arrived very late at night (around 1am) after a long drive from Antalya airport with 2 small kids (3 and 5), all very tired, and no one at reception to help us with our luggages. Even though we had reserved our room well in advance and prepaid, the man at the desk spent ages trying to find our booking. He kept asking me if I had any other documentary proof of the booking. Finally, after what seemed like ages, he found my reservation and showed us to our room. To my surprise and disappointment, the room was quite small for a family of 4, and had only 1 king size bed and 1 single. When I asked for a larger family room, I was told I would have to pay more money as my agent had only reserved a standard room. But I was led to believe I had paid for, and would get, a room which could accommodate a family of 4 comfortably. Anyway, we were far too tired to argue at that time of the night and just accepted the room. The following day. I went to reception and requested an additional bed. The man at reception said he would take care of it. By the time we returned to our rooms later that afternoon, they had put a bed sheet over the 2 seater sofa with a pillow. That was obviously not what we had in mind when we asked for an additional bed.   I had contacted the hotel several days before our arrival to ask if it would be possible to have some food when we arrive, and got a reply saying they would have some snacks for us in the restaurant at that time. But when we got to the restaurant, there was no food there - just some cut pieces of old fruits on a plate.  The beach was tiny compared to others we've stayed at in Antalya. Instead of putting up proper sun shades, they put these extremely annoying umbrella-type shades which do absolutely nothing to protect you from the blistering sun and heat. People were constantly moving the shades to avoid the sun.  But on a positive note, the quality of the sand was absolutely amazing. Very soft and smooth. No stones or shells at all.  Another big negative was the lack of ice cream served at the beach or the hotel. A very limited selection of Ice cream was only served at the beach between 3pm and 4pm. That was pretty poor.  Food in the main restaurant was quite good overall. There was a decent variety on offer each day. But I was very disappointed to find that both A la Carte restaurants were closed for the entire period of our stay, even though we had paid for an all inclusive package which included 2 meals in the A la Carte restaurants.  The staff at the Spa salon were a bit too pushy when it came to selling their services, which put me off a little. But I decided to treat my wife to a massage anyway. The man from the spa showed me their list of services and individual masseuses. I chose a female masseuse and booked the massage for the following day. My wife went alone the following day while I looked after the kids. When she arrived at the spa, she asked for the female masseuse, but she was told she would get her all over body massage done by a man because the lady I chose was not available. While I was sure the man was very professional, I was still very uncomfortable with the idea. I paid and even gave him a tip, but decided never to return.  All in all, I would say this hotel is not really the best for families with small children. They have a very tiny kid's club with a great lady (Julia) looking after the kids, but after a few days my kids were starting to get seriously bored. We had to take them out of the hotel to other resorts and amusement parks to keep them entertained.  Staff in general did not speak much English but mainly spoke German and some Russian. The majority of guests were German. Some waiters in the main restaurant would rush to find you a table, then blatantly ask for tips, just for doing their jobs. I did tip them a couple of times, but then they expected me to do the same every day, and when I stopped, they began ignoring me and my family. One of them actually ignored me when I tapped him on the shoulder and said hello at the beach. I was shocked! My fault for being too friendly with the help I guess.  On 2 separate occasions I tried to take my 5 year old to the games room which has a pool table and some games machines. I went to reception and a lady called Ayse said I needed to pay extra for the games. 10 Euros per hour for the pool, and 2 Euros per game for the machines. I had to pay cash in advance but I only had Turkish Lira on me at that time.  I asked if she could change my 100TL to EUR so I could play the games machines with my 5yr old. She said the exchange rate would be 5TL to 1EUR. I gave her a 100TL note, and she just gave me 10EUR in coins instead of 20EUR, and walked away. When I asked for the rest of my EUR, she said \"you should give that to us as tip\" I went to the games room and discovered that the games machine did not work - it was not accepting any coins. i went back to reception to report it. Ayse had left but another rude lady just said to me, \"it's kaput!\" and walked off. They never even offered to give me back my money. My 5yr old was very upset.  When we returned a couple of days later, the machine was still out of order but they had not put a sign on it warning guests about this. People were still putting 2 EUR coins in. Then my son wanted to play the Nintendo game on their computer, but that didn't work either. Strange games room!  Another rather irritating thing about this hotel is the water slides at the kid's pool. They kept closing it and switching the water off after only a couple of hours each day. I really couldn't see the point of this. Everyone (kids and adults) would be enjoying the slides when suddenly they would shut the water off and close it for a few hours.  To summarise, I would say this is a very clean, small hotel with the potential to be much better than it is at the moment. It is better suited for adults only, with decent food, terrible drinks (they have no idea how to make the most basic cocktails, no fresh juice unless you pay extra, and all drinks were lukewarm), located quite far away from everywhere, with some very poorly trained staff. The general manager was neither available nor approachable. i sat next to him once in the lobby area, and he never once spoke to a guest or made himself available when there was a problem. He just sat on the balcony staring at his phone.  Would I ever return to this hotel? I'm afraid not. Much better hotels in Antalya for families.…", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7809477-r617675256", "sub_review": {"Rooms": 3, "Cleanliness": 5, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Excellent 5* Hotel in Antalya", "review": "My family and I had a fantastic experience here and cannot recommend it highly enough. If you want a true 5* experience, then go here. The staff were great. The rooms were wonderful. The decor was similar to the Sheraton hotels. Food was very good. I can go on and on....", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7809477-r607683014", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Excellent experience", "review": "We spent the first week in July here and it was great! The hotel is very new and clean, the food is very good with a lot of variety, the beach is close by and the staff is really friendly and helpful. We always felt like we could get whatever we wanted whenever we wanted. We wanted a shisha the last night but it was kind of late...they had already stopped. But the manager went out of his way to get us one. The animators were amazing, especially Mehmet, Jay Jay, and Julia. We felt like they were our friends by the end of the trip. Highly recommend taking the trip to Karma night club if you like to dance. Quality place, very good music. We usually don't like house but the mix was good and we had such a great time, we went again two nights later. There was one review about the…", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7809477-r594470465", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Lovely hotel", "review": "Stayed for a week in mid April,  The good hotel clean and modern. Rooms spacious. Pool clean. Beach close by. Beach bar and cafe has good selection. Staff very attentive. Quality of food and alcohol good. Plenty of sun loungers around pool and beach.  The bad Hotel geared to German guests. All entertainment in German. Beach towels very old and every time you change your towel your harassed by the male for a spa treatment.  Summary All in all a great hotel and would definitely return and recommend if you can get a booking!! This is a Thomas cook hotel that never appears on their website (Germans only....).", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7809477-r579591223", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Family holiday", "review": "We had a nice 1 week holiday at this hotel. The hotel appears classy, is very clean, food is good, lovely sandy beach a short walk away and staff are helpful. The only downside is we were sold this as an all inclusive package, but their food is restricted to specified mealtimes and ice cream- just the cheap prepackaged stuff and that too only between 3-3:30 pm, if you come a bit later, its all gone. Fizzy drinks are available in plenty but an iced coffee or fresh juice at breakfast is charged extra!! Kids entertainment is quite boring and repetitive and when their time is over, they just send the kids away on their own, even if the parents aren't around!! Swimming pool slides run only at specified times. The evening entertainment mainly caters to German or Turkish speaking…", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7809477-r574129497", "sub_review": {"Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great service and food for a very reasonable price", "review": "I was here in May 2017.  This hotel is new and clean. Even though the territory is quite small, it doesn't disappoint you. The pools are not deep, as well as the sea near the beach. But the beach is great, the food is yummy. I still remember their chicken - mmm. Didn't check out their a-la-carte restaurants, but there are two of them. Both of them you can enjoy for free. The rooms are spacious (I was staying in the standard room). The animation team works here till 11 pm. It's one of the quietest hotels around. Almost no Russians :))) (I am talking about Russians that are very and VERY loud).  I also loved the design of the hotel. So chic. Plus, 10 minutes of free massage is included.  The wi-fi is very bad. You should buy a local sim-card in the airport.  I totally recommend…", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7809477-r548374962", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Five Star", "review": "I stayed in side sungate hotel &spa, on booking in , one noticed certification of this hotel, 6 stars, oh great thought I ! Reception very impressive and nice staff! Shown to our respective rooms, all very nice and clean, with all what you would expect from a 4 star hotel, not a 5 star! Asked for an Iron , but not available, anywhere , only if you send it to laundry !! Drinks, I doubt if you drank all day you would never get tipsy! Even the beer tasted watered down!  Swimming pool, outside temperature in the shade 32 degrees , the pool was always empty of people , why ice cold water ! Heart attack I thought, so never swam! Asked why so cold , it’s winter!!!  Food looked great, but was tasteless , and all tasted of nothing!!! If you like turkey meat you get it in abundance…", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7809477-r539142978", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Awesome", "review": "Stayed here with family in August 2017. Everyone loved it, great food, snacks, entertainment, service, kids activities. Everything on site so didn't even leave the hotel for 2-3 days. Would recommend to all with young families :-)", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7809477-r509916108", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Third stay, better then ever !", "review": "Our third stay at Side Sungate Hotel in Evrenseki/Side/Antalya. Our previous holidays were great, but this time it was even better. The modern and stylish hotel concept is just a pleasure you can't get enough of it. The food is probably the best you can expect. The hotel is very clean overall. This uears animation team is very good. This hotel is only 2 years open and they already have changed all outside, pool and beach furniture with new  furniture of amazing style and quality. Just amazing ! Definately recommended if you want to enjoy a relaxing holiday in a top quality hotel.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7809477-r492946174", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent hotel + great service = amazing holiday", "review": "Very nice modern hotel. Its a new hotel so everything is new and clean. All facilities are state of the art. Very luxurious and spacious rooms. Great staff and very high quality service. The restaurant is also very spacious and very nice design. Excellent food with great variety. All meals were delicious. The swimming pool is very nice and stylish. The hotel has its own private beach with beach bar and beach restaurant; the most beautifull we gave ever seen! The wellness area is really amazing too. Definately an hotel where we would like to return ASAP. Recommended !!", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7809477-r463856762", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Enjoyable holidays with few deficiences", "review": "This hotel is very nice, because it´s new. For the first time I had visited this hotel in September 2015 - it was brand new, we liked it there cause it was special and up to the mark. This year we have visited this hotel again in August, some things have changed, e.g. services in restaurant, sometimes we were just waiting till the waitress showed up and served us, what should be in 5 stars hotel certainty but few times I had to go on my own and ask for drinks. As regards the food in main restaurant, dinners were always delicious, lunches I mostly spent at the beach and breakfasts were good as well, but once I´ve had not quite pleasant experience. The youghurt I ate turned out being sour. I liked beach bar service, but in comparison with last year I would say hotel abolished some…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7809477-r410093903", "sub_review": {"Rooms": 5, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Beautiful new hotel - 2015", "review": "Excellent nice 5-star hotel - total 210 rooms - all included at a very reasonable price - about 50km from Antalya airport - spacious rooms with balcony - airco - flatscreen and free WiFI - 5 minute walk from sandy private beach with beach bar and snacks - 2 nice restaurants Turkish and Italian a'la carte and buffet  - bar, patisserie , disco - wellness and spa - hairdresser  - two big pools and kids pool with water slides - indoor pool - mini club - etcetera. - excellent extensive food and very friendly staff. - strongly recommended", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7809477-r318518758", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}]