[{"title": "Great hotel.", "review": "We , my wife and I had a wonderfull stay with all inclucive, cant find anything to be grumpy about , the room exelent, everything was clean , staff was verry friendly and helpfull.. Local bus stops right infront of hotel.. We had a wonderfull stay , verry relaxing with the sauna , turkys bath , hammam. we will be back for sure", "date": "November 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r729463108", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "21st century, charge for wifi ??", "review": "I don't know why they charge on the internet 5 euro / day. Maybe because we're out of season. I don't know what it's like in the summer. The rooms are comfortable and sleep well. There was too much food at the Hotel. There were six people on our team, and two of them poisoned themselves with food. I don't want to blame the Hotel, because it could have happened at other restaurants in Antalya, and Alanya. But you always have a bad feeling. Poor rating goes to WiFi charging.", "date": "November 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r728152142", "sub_review": {"Location": 2, "Rooms": 3, "Service": 1}, "travel_purpose": "", "rating": 2}, {"title": "Holidays", "review": "I liked the hotel, very good animators and always interesting shows in the evenings.  Large assortment of food for breakfast, lunch and dinner.  All this is very tasty.  Animators never let you get bored.  Always held interesting contests and games.  I am happy with my stay", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r702116724", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good choice", "review": "We only stayed two days as we are buying a property in Antalya and we needed to do some viewings.  The room was ok - food was fine and the grounds were nice.  The spa and massage was good value.  I would book again.", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r677977289", "sub_review": {"Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Stay in may 2019", "review": "Very good hotel, great meals and a large selection of dishes. Beach close to the hotel with deckchairs, bar and restaurant. Evening animations are also very interesting and varied. The staff is very kind, smiling and helpful. Special thanks to Denis, Ramazan and waiters Melike and Mohamed. Thanks to them the stay in the hotel was even better. I really appreciate their professionalism and commitment to work. I hope that one day I will have the opportunity to meet them in Turkey. This hotel was a really good choice. A large swimming pool, numerous games and animations. It is also worth to appreciate the hotel's SPA. I was on a very relaxing massage with a hammam for 30 euros. It's really a very good price. In the hotel different shops and doctor. The only minus, but independent of the hotel, is a large number of Russians who behave terribly without respecting any cultural principles. They waste food, take it to the room, take full plates and don't eat everything. They listen to music from portable speakers without paying attention to the fact that they are in a public area. They litter, dirt, and don't respect the presence of others. This does not apply to individual cases, but to the vast majority. Nevertheless, I consider a very good hotel and a very good holiday. I recommend it with full responsibility.…", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r676767956", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Right choice for family vacation", "review": "Very comfortable hotel situated at Titreyengol area.Rooms are nice, furniture is modern and bed is exvellent.We have 2 coonected rooms instead of family room on 4th floor.Food is fresh, there is a lot of opportunities to make a good choice of meal.Receptionist is very nice and helpful with lots of understang.We spend there lovely holiday and beach is lovely, too.Higly recommendid.", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r662716316", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Nice", "review": "Really nice stay, room big enough, good food. Worth to recommend. Staff is friendly and nice to guests. Not that far from Side and Manavgat. Bus going each hour to both places. Clean rooms, clean reception and surrounding area.", "date": "January 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r648813335", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great week with friends", "review": "Very impressed. Got a very good deal! Shown to our room, helped with bags, room freshened up daily. Balcony had a pool and lobby terrace view, where disco was at night. Always food available (including pizza at 2am if you’re hungry)!!! Restaurant got busy but nothing was too much for the staff who sat us at a nice table, the food is okay, lots of choice but it depends how fussy you are. As the only English people, they made an effort to speak English. Pool nice, music playing and bar not far away, activities like water polo, volleyball, water slides and darts etc and entertainment, bingo, mini disco, disco and the club. Beach is a 5 minute walk, free sun beds, towels free from hotel, food and bar at the beach all inclusive. The staff are helpful and friendly! Busses every 5-10…", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r623745926", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Hudge disappointment", "review": "On contrary to the majority of reviews here, i had a bad experience staying at the hotel, which i would like to share here. Generally hotel is nice, rooms are spacious, clean (at the beginning at least), bathrooms are nice, hotel is quite close to the beach situated in quiet area, and that would be it about positive things. Now some negatives: 1. Service- employees speak very poor English, if you don't speak German or Russian you have problems with communication.  Room service is poor, they only change towels and fill up the mini bar. My friend accidentally spilt some juice on sheets, and her sheets remained unchanged.  Once my friend got stuck in the elevator, she was sitting there for hour and a half, only when i came to reception yelling that i will call fire department if…", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r623386776", "sub_review": {"Value": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Only cater for russian", "review": "This hotel is a complete let down with the entertainment completely catered for Russians everything in that language there are other guests too but this seems to be overlooked. Even turkish guests complaining! Dinner time food was alright but like a cattle market with people rushing for food like they have never eaten before. This hotel caters all day long you really wouldn't starve. The only person from the entertainment team that engaged with everyone was Alex he went out of his way to speak to all gueats. The rest of the staff need to learn to engage with all guests. It's as if the hotel do not want other nations at the hotel a disgrace we all paid for a holiday! This hotel is probably a 3.5 star. Other than rude staff it would have been fine. It was my son's birthday whilst…", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r617727784", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Not to be recomanded", "review": "The hotel is nice but the rooms are small not for a 5 star hotel maibe for 3 stars,the personal is friendly until got tip and after that they forget about you,the food is not for 5 star ultra all inclusive,we eat better in 4 star all inclusive.The toilettery is not replaced,the AC  working only God knows how( you cannot fix tempreture) stops when ever...I don't recomand not even for last choice of vacation!", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r610412762", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "The worst attitude that I have ever seen!", "review": "This hotel is the worst experience that I have ever had! I even do not know how to start - the food was awful, the staff is the unfriendliest that I have ever seen, the hotel itself is bad and dirty and is located in the middle of nowhere! I had a stain on the pillow and a whole in the blanket! When I asked for an iron, I was told that I should wait until next morning when the cleaning ladies will come and borrow one from them! You had to pay if you want to use a towel for the pool and when you do so, you are getting a dirty towel. There is no decent coffee in the hotel, the dinner is poor and all ingredients are the lowest quality that you can get! If you want to ruin your vacation, proceed with a reservation in this ridiculous hotel.", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r581967664", "sub_review": {"Value": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "My first trip ", "review": "Thankyou for an amazing experience my first trip to your hotel  very friendly staff so helpful  food was very delious  me and Michelle felt so welcomed  transfers was easy   lovely views  loads of shops  nice indoor swimming pool    very friendly photography   we will be back again ", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r554957026", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent", "review": "I have stayed at their sister hotel Lake and Riverside which was awesome, this hotel is just the same awesome. The service here is excellent, quiet right now because of Season but still looked after so well and catered for. The team that work here are amazing, rooms are kept clean every day, and the food is excellent. Will be returning to this hotel later in the year. Thank you Port & River Hotel. 😃😃😃😃", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r554138070", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A disaster!", "review": "The hotel looked great in pictures when we viewed it online. It promised to be \"all-inclusive\" with some or the other snacks flowing at all times. When we entered the hotel at 3:30, we were given a cold welcome and sent up to our room which was still being cleaned. So we came down to a very sad looking cafe/bar to kill some time.  Our family room was laid out very nicely, rather aesthetic to look at. Unfortunately it had a rather nasty smell that hung around for the 2 nights we were there. The lady who had been cleaning hadn't mopped the floor, nor had she emptied out the bathroom bin....super yuck!! The sheets looked unclean and the side tables looked like the ash hadn't been cleaned off them.  Anyway, so we went to the 4:00 \"coffee and cake\" down at the patisserie, which was a…", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r550567991", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "June holiday with daughter", "review": "I rested in June this year with my daughter at the Port River hotel. I would rate the hotel for 4 stars. Territory is small, no place to take a walk.We went to the sea for a beach holiday. We liked the beach. it is wide, comfortable. Pebble beach with a convenient entrance to the sea. Many sunbeds and a good cafe on the beach.The food in the hotel is good, varied, there is a children's menu. The rooms are comfortable, cozy, clean. It's nice that the music and noise stopped at 23.00. it suits us, because we go to the beach early.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r546856520", "sub_review": {"Location": 3, "Sleep Quality": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "No comment.", "review": "We just stayed 4 days in this hotel. About personel we don't have any problem. But about hotel owner. He is not professional. We were here 2 boy and we enjoy our time together. I don't wanna say that but hotel owner told us that leave from hotel we said why he said I want that. We know that why? But we don't wanna explain this. Every evening same foods. Just chicken patatos and salad... about drinks also same. House keeper was nice... this is only good thinks. .. I just wanna say that don't come to this hotel.... with this money you can go another hotel.... First time I saw that ,hotel owner told to guest leave from my hotel.... normally we stay 1 more days and they didn't give us our money.. ", "date": "November 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r541056545", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Can't not recommend this hotel", "review": "The hotel supposedly is a 5 star hotel, but the room we stayed in was not up to the standard, and the same goes to the rest of the hotel.  We stayed at room 2101, just above the lobby. The entire section, where we stayed was noisy from 8 in the morning until 11pm with loud music. During the evening show, it was impossible to stay in the room, because of the noise from guest and music.  Around 12 pm and till 4 am in the night, you can clearly hear the cleaning crew, vacuuming and washing the floors in the lobby and the basement.   The food at the buffet restaurant was eatable, but it is clear that the food from dinner buffet was reused from lunch. Food at the pool restaurant is not eatable at all, the burger was served cool, with funny tasting meat; pizza was okay, the fries was…", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r538510584", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Nice hotel but", "review": "We arrange to stay in there sister hotel but when arrived we got told that they were closing half way through the holiday. Reception staff was great and arrange a transfer to there sister hotel the next day. This hotel was so much better clean and bar and reception was amazing. Fab hotel room clean towels every day and the bed was changed every day.  The only thing that let it down was the entertainments team. They Never spoke to us even though we tried to talk to them. We notice if you was young attractive and certain look the bothered with you. The shows was in the conference centre which was in the basement and smelt horrible. It was my partner birthday the hotel arranged fruit and a bottle of wine. The reception staff and bar staff brilliant but the rest need a little work.…", "date": "November 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r538260682", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Animasyon❤❤", "review": "Mati It was very great, the best holyday i've ever had, i'm glad to meet DAVUT he is a really good man and really funny, very friendly. The food is brilliant i like all the cocktails, I will come back for next few years,  the food is really good, The chefs are perfect, also my family enjoined this holyday.  Good bye", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r522616828", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "As good as ever", "review": "It's not often that we return to the same hotel as we like to try different places but we were so impressed with this hotel that we returned after seven months. We were not disappointed. The staff and the facilities were as good as ever.it was o nice to see some familiar faces and to be remembered. Simply put this hotel is well worth a visit.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r487658214", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Ladies break", "review": "Loved the hotel it was clean and the service was superb 😁 staff were friendly  and helpful and you could get Wi-Fi thro out the whole resort which is rate in Turkey would defo recommended and not far from the beach  and neighbouring beaches like side and Mansgavat ", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r475629151", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "They should improve on their staff", "review": "I hate giving negative reviews but I was disappointed by the staff. They could do much better with better staff, especially the night staff. But generally It was a great experience. Rooms are big enough, internet is relatively good and stable and pretty much everything was good except for the staff. ", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r472822575", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Nice and spacious hotel", "review": "Nice architecture, nice staff, average food. I recommend this hotel. Built in 2015. Spacious rooms. Was a good selection for spring holiday. Surely good for summer. not in the seaside but Very large swimming pools outside the hotel. Also indoor pool was ok. Staff are friendly and helpful. Buffet was average but acceptable.", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r466434498", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Rude and unhelpful staff", "review": "If you are in Turkey just to bask in the sun, sit by the pool and accept the standard formula, have all food at the hotel etc then you might enjoy a visit here. Just don't ask the personell to help you and you'll be fine.  However, if you fall outside of the standard you are in for trouble. I have never visited a place where the staff was so unwilling to help. The management has a serious problem and needs to look into their attitude.  An example to illustrate (there were more incidents): We wanted to see more of the surroundings and asked the evening we got there if we could rent bicycles, which our guide had said should be possible. No problem, according to a guy that I later think I recognised as one of the top management. They would phone some people that would bring the…", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r459571444", "sub_review": {"Service": 1}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "I will never come back to this hotel", "review": "Staff poor, impolite in the restaurant and in the swimming pool too. To get sun bed near the pool it is impossible unless you come at 6 in the morning.  Vacation was spoiled on the staff. The food is good, the rooms are great.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r453339738", "sub_review": {"Location": 3, "Sleep Quality": 1, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Quiet, new hotel", "review": "We visited this hotel for 5 days in November. New, modern and quiet hotel. Kitchen is not bad as well. But in 5 days I couldn't eat any meat properly. Mostly chicken. :))) but price was ok. Maybe because of that.  There are must be improvements about staff in this hotel. The bellboy who took our suitcases to our room, next days pretended that he doesn't know about us. :) bartenders has to be more polite and helpful...  thanks anyway for the hotel for a holiday!!!!", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r444209286", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Good resort, a well spent holiday", "review": "Dear Guests,  at first of all we would like to thank you for choosing our hotel as your holiday destination. Only with your construktive criticism and ideas, we are able to improve our service for you. We would especially look forward to welcoming you again. We wish you a wonderful time. With best regards, PORT RIVER MANAGEMENT  ", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r437462574", "sub_review": {"Value": 4, "Sleep Quality": 3, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Superrrr!!!Everything was perferct!", "review": "We traveled to Turkey in the last week of August (minimum 35 degrees Celsius / 95 Fahrenheit), but worth it, the water was perfect. They had a hard time handling the people at reception and we waited at least 1h-1h30m before they got us a room. In the morning we needed to change the room because it was in front of the dance floor, we have a toddler 2 years old, the noise was really disturbing. These were the hardest moments, the rest of the holiday was just relaxing, happy time. The resort was abundant in food, people and happy time. The food was particulary good, they had a wide selection at every meal and the chefs made sure that everything is presented well. Once a week they had a special turkish night when they served traditional turkish food at dinner time. The food…", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r434678047", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Amzıng holıday  at Port Rıver", "review": "Perfect hollyday!!I bought the last minute stay in a hotel offer did not seem too straluicit but when we got there everything was superb at the entrance, rooms, restaurant plaja.A to be around was the best ever!", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r431469533", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nıce Hotel shame about the food.", "review": "Lovely Hotel wıth nıce rooms and lovely Lobby and Bar areas. Food not good, cold and the sam choıces everyday Omer from Anımatıon ıs the best member of staff ın the place. Always has a good mornıng for you and a chat every day but wıthout hasslıng you to do anythıng you dont want to do. Wıth ımprovements ın the restaurant thıs could be a very good hotel", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r428629180", "sub_review": {"Location": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Absolutely fabulous", "review": "Dear Guests,  at first of all we would like to thank you for choosing our hotel as your holiday destination. Only with your construktive criticism and ideas, we are able to improve our service for you. We would especially look forward to welcoming you again. We wish you a wonderful time. With best regards, PORT River Team ", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r427282257", "sub_review": {"Location": 4, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great holiday", "review": "Having read some reviews of the hotel we were not sure what to expect but any fears we may have had from previous reviews were unfounded.  The hotel was great. Although we arrived in the early hours of the morning we were made welcome and speedily and efficiently checked in and shown to our room. The room was lovely, clean and well presented.... Everything in it that we needed. Housekeeping did a great job and kept it spotless for the duration of our stay. The buffet restaurant was great and kept up a great selection of meals at every serving. We found the food good fresh well prepared and presented. The beach bar and grill are excellent. The bars were all very good and most of the staff were very helpful...... One or two of them need a lesson in customer relations but I could…", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r427140830", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good hotel overall with some minuses", "review": "Dear Guest missmydogs, First of all, Thank you for taking the time to write a review about your experience at Port River Hotel &Spa on Tripadvisor. Many thanks indeed for your fantastic comments following your recent stay with us. We are delighted to hear that you liked so many aspects of the hotel. We are also particularly pleased that you enjoyed the service you received throughout the hotel. It is the staff at the hotel that truly make the difference. We will certainly share your comments with all team.We thoroughly look forward to welcoming you back in the very near future.  Your Sincerely Guest Relation ", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r413785974", "sub_review": {"Sleep Quality": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Horrible experience", "review": "We have just had a 7 day stay here After reading past reviews we did have a few concerns. But all we can say is the hotel staff work really hard to make you welcome.  We had a standard room which was cleaned every day and towels changed.pool towels provided.our room overlooked pool.lovely view.other side of hotel overlooks cornfield. manavgat river a few paces away . All inclusive options for food good.this is a foreign country so some dishes will not be to everyone's taste. Alcoholic drinks own brands.beer tuborg. Very few English but still involved in activities. Free shuttle to beach which was also clean.look forward to coming back next year. Dave and Becky  Portsmouth UK  ", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r412865310", "sub_review": {}, "travel_purpose": "", "rating": 1}, {"title": "A decent holiday with nice services", "review": "We booked our holiday in our last days and we had no idea what to expect from it. We found a good looking hotel with a very nice room and nice restaurant and pools. Is not a luxury hotel but it is a clean one and food was more than decent. Very good beer and we loved the beach bar and restaurant. The room was cleaned on a daily base and we had good WI Fi in the room. We traveled with 2 kids and they enjoyed the pools and the small water park. We also enjoyed the 5 minutes stroll to the beach. It was very nice to have a tourists desk opened 24/7 with very good English speakers. They were very helpful in the 1-st day and showed us everything we needed to know. i would definitely recommend this hotel for families that are looking for a peaceful holiday with a good quality for the…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r408527537", "sub_review": {"Value": 4, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "best stay home.....very bad service and very sad staff", "review": "Dear Guests,  Thank you for a nice review about our lovely hotel.See you soon,  Kind Regards, Hotel Management.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r407462449", "sub_review": {"Location": 2, "Sleep Quality": 1, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Dirty hotel... Very bad service", "review": "very unfriendly staff , they do not know english, junk food and more .i belive is a hotel by 2-3 stars maximum. the only thing is ok clean rooms at bar bad drink  in the restaurant at 20,30  almost everything is finish .i I do not recommend this hotel .i stay in this hotel in period 11.085.2016.-18.08.2016", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r406156945", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "never go here never, ever", "review": "Dear Guests,  Thank you for a review about our hotel,Not all staff in hotel can speak English but on Reception ,Guest Relations Department all time ready to help you,if you give us one more chance ve will try to help and make your holiday unforgatable,  Kind Regards.  Hotel Manager.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r406134453", "sub_review": {"Value": 1, "Sleep Quality": 1, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Great week amazing experience", "review": "There is a big hygiene issue at this hotel, especially around the pool and in the restaurant.   In our 7 day stay, we never saw the pool being cleaned or tested for ph, and they only washed down the pool area and sun-loungers once.   There are significantly less sun-loungers than the hotel capacity numbers, so we witnessed many arguments between other guest for sun-loungers. By 7 am, all the sun-loungers had been reserved even though the hotel supposedly doesn't allow this.  The restaurant had very little variety and by day 2 we were bored of the food. There was not enough seating for the hotel capacity, so we had to make sure we got there at opening time to avoid disappointment. Even when we went in the restaurant at opening times, it was very obvious that the staff had only…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r405208099", "sub_review": {"Value": 5, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "it's a plesant place to spend time with you're loved one/s", "review": "First of all, you have to know that this is my first experience at a ultra all inclusive.  Hotel: - it's near the beach(4) - I can't say I had a nice view.  But it wasn't the worst I've ever seen. I l give it a 3 (very bad1-5 very good) - really clean rooms (4) - good air conditioning but bad room temperature (but again, it's august) (3)  -good food, to much food, diversity (4) - pool was nice (3-4) Staff: - very pleasant,  helpful,  joyful (especially the kitchen and the info point staff) (5)  It's a good pleace to spend time with you're loved one/s.", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r403322834", "sub_review": {"Location": 3, "Sleep Quality": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Won't be back", "review": "Dear Guests,  Thank you for a review about our hotel.We hope to see you again in our hotel,your advices  and cliams will checked by our Mangement team to improve service for our guests,  Kind Regards,  Hotel Management.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r399081716", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Good value for money", "review": "Hotel itself is lovely and staff are pleasant. Hotel is greatly understaffed, dinner time is complete chaos. Quality of some of the guests is what brings this hotel down. Beach is very dirty and rubbish etc is not picked up regularly. Definitely will not be back.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r398882169", "sub_review": {"Value": 4, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Don't you dear have vacation in this hotel Tha staff is not professional and not friendly  .the food is allways recycl", "review": "Dear Guests,  We are happy that you spend a great time in our hotel and of cource we re wait for you again,  Kind Regards, Hotel Management.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r386115767", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "noisy and far away from downtown and other hotels", "review": "Compact all inclusive hotel.  Rooms are ok, beds are not very good. Clean hotel. Pool area OK as the water slides, but there are no staff keeping eye on it. (2 kids walked up the water slide as the same time I was sliding down... Yes it heart). Beach is near, 5min walk. Beach is nice: clean toilets, bar&food.  Staff doesn't speak english very well. But they are friendly.  Food was tasty for an all inc. consept.  I could go again with that price.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r375701926", "sub_review": {}, "travel_purpose": "", "rating": 2}, {"title": "Holidays", "review": "New hotel-clean and calm-various food-reasonable-disco 's time isn't enough-hotel's access is far from cities-receptionists are great-view isn't perfect- ultimately, it needs time to improvement-most of the guests are Iranian- this hotel isn't u all-", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r362962159", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Clean very good food", "review": "Dear Mr Huseyin,  Thank you for a nice review about our hotel.We hope to see you again here,  Kind Regards,  Hotel Management.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r316877559", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "The say it's ultra all inclusive but it isn't", "review": "New hotel. Nice clean rooms. Big clean pool area. The spa area is clean and good. Very tasty fresh food. Tasty and lots of variety. The mattress un the room isn't the best (ppl with back pain will have trouble). The beach is ok. Its rubble stone sand. Typical hotel beach. But free sunbeds, umbrellas and beach bistro with good fresh food.  Non alcoholic drinks are fine. Alcoholic drinks are cheap. Non brands. Not that tasty. So we sticked to beer. To avoid headaches. All in all i would recommend the hotel. If u want to relax, eat, sleep, swim, sunbathe ... Repeat! ", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r311465421", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Nice Hotel, improving all the time, staff are friendly", "review": "Dear Mr Patrick,  Thank you for a review about out lovely hotel.We are Happy that you spend a nice holiday.  Kind Regards,  Hotel Management.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r309771972", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Fine hotel but still things to be improved!", "review": "+ the hotel is new so it's very clean  + the have a big pool and a water park and entertainment programme  + they staff are very friendly except the receptionists who don't know English and they are friendly only if you pay them  + the food is good  - They say it's ultra all inclusive but you won't find any imported drinks, they have only Turkish drinks that they say are imported, even if on the bottle is written made in Turkey. They have a whisky called bazooka (very bad),  they said they have Malibu but it's a fake called Maldive and if you ask them if they have other imported drinks they say they have Bailey's,  but it's another Turkish fake -The beach is far, but they have a shuttle bus  - The beach is very dirty, even the bar, and there are a lot of rocks  -The…", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r301908310", "sub_review": {"Sleep Quality": 4, "Rooms": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Nice but still place for improvement", "review": "We had 7 nights stay in this hotel.  Nice: - clean hotel and room - outside pool and sea side (5 minutes walk) available - places with shadow everywhere - bus available at every 5 - 10 minutes to go to the center of Side - nice stuff, always smiling and ready to help  To improve: - the entrance in the sea is artificial. There are some big stones in the water in order to make 5 meters place available where you can touch the ground. Not recommended to kids - evening music was terrible excepting 2 evenings were live music was playing. Still in these two evenings we heard the same live music playlist.  - English language is poor. German works better - I was expecting more games available. You could play table tennis all the time (one table available) but darts only once a day.…", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r301394364", "sub_review": {"Value": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Clean and new Hotel", "review": "The hotel and staff is great. Clean and cosy room. The food was also great. The pool is big and the water slides are fun. The beach is quite close to the hotel. Only about 5 minutes walk. There is also a bus but we didn't have to use it. The only thing which disappointed me is the music they put in the evening after the evening show. There was the same playlist (bad music) for a couple of evening in a row. It seemed liked they wanted to send us to sleep.", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r300545475", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "good hotel", "review": "Dear Guests,  Thank you for a nice review about our lovely hotel.See you soon,  Kind Regards, Hotel Management.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r296519357", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great hotel, but major issues", "review": "It was a very pleased hotel. free Wi-Fi  at the pool. beach not so well whit a lot of stones. beach at 300 meters from the hotel. lunch and dinner very well. breakfast not so many choices. employees verry   frendly", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r289540006", "sub_review": {"Location": 2, "Rooms": 5, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Luxuary holiday", "review": "Dear Guests,  Thank you for a nice review about our hotel,we hope to see you again,  Kind Regards,  Hotel Management.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d7910023-r287840825", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}]