[{"title": "The best choice to spoil your vacation", "review": "We have stayed at this hotel from 07/23/19 till 07/30/19. Even though Smile park is a 3 star hotel, I could not even imagine how low  its personnel competence would be and to what extent service offered there is poor. I would like to share with you a couple of examples. Perhaps my experience will prevent you from making a mistake and urge you to find a better place to stay on vacation. For the whole period of my stay there (which is 7 days) DAILY cleaning came only twice (no pun intended). Such a great honour was granted to us on the first and last days of our stay (after previous residents' departure and before next residents' arrival - what a sweet way to reduce your staff energy consumption). The most unpleasant thing about it is that when I got tired of living in a 'trash bin' I came to  reception desk and informed that I had waited for cleaning  on previous days but noone came and I would stay in the room and wait for cleaning today to have it for sure. The receptionist said no problem. I have been waiting in the room for more than 4 hours and it was already 5 PM (cleaning hours were till 4 PM everyday) and when I returned to the desk and kindly asked what the matter was, the receptionist (a different one this time - very tall man, whose name I unfortunatelly don't remember) ignored my questions and started to talk with his coworker in turkish giving me glimpses and laughing. When I tried to repeat my request he continued to ignore me for some time and finally said that room cleaning would be tomorrow (on the day of our departure). To make you feel my pain I would like to picture  you how bad our room condition was at the time: sand and long hair all over the floor, trash falling over small bins - partially lying on the floor too. So I decided to take the cleaning into my own hands, emtied the bins content into one of my bags and put it out of the door next to the reception desk (our room located very close to the latter). Later in the day, right by the beggining of the dinner, someone knocked at the door and  asked if we need cleaning. We let the man in and he went to the bathroom directly. The worker was absent for more than 20 minutes and I decided it's strange since last time it had taken the staff 5 minutes to clean the bathroom and proceed further. So I decided to check. When I came to the bathroom I saw nobody - the man just exited through another door. The floor was still dirty. The hotel's workers flagrant incompetence shocked me many times. I could continue describing other incidents but I think it would be excessive. To conclude, Smile park hotel *3 does not suit anyone who is used to respectfull attitude and at least modest service.…", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8473177-r696856992", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Avoid if British, fussy eaters, sun lovers don't tolerate bad manners and rudeness", "review": "We arrived on 10th June to be told that the only other English couple here were eagerly awaiting our arrival.  Our room was no 610, over the Bar, it was clean and spacious, but basic - glad I brought our travel kettle (coffee, tea, sugar & milk available next door at the supermarket - smile, please & thank you - show the other nationalities up for their rudeness???)  there was a fridge in the room, but not particularly cold.  All I can say is that we had a friendly welcome and all the staff were friendly when we smiled, pleased and thank you'd.  But this is not an all inclusive location from our personal experience - there are strict timings for meals and drinks and the Eastern Europeans were like ants, lining up ready to pounce on their prey!!!  Under the advice of the other Brit couple we were advised to try The Melissa Gardens, & other than one day/night when we treated ourselves to The Crystal Sunrise Queen Resort, this is where we spent most of our time, paying for food & drinks.  The drinks were tasteless in alcohol unless you ask for large vodka & little sprite, the one evening meal we experienced was worse than a McDonalds takeaway - soup had run out, plenty of salad, wait for hot food to be replinished (no sweets - these are only served at 4pm) was told no hot breakfast choices.  Also the pool area lost the majority of it's sunshine by 2pm.  Take your own towels.  Hairdryer in bathroom.  We won't be back.…", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8473177-r493988941", "sub_review": {}, "travel_purpose": "", "rating": 2}, {"title": "Rainbow Castle Hotel Side", "review": "Had a wonderful holiday at this hotel the first 2 weeks in June, we were sent there because the hotel we had previously booked, went bust, I am pleased it did, we had a wonderful holiday at this hotel, the food was varied and plentyful, still heard others complain about it, but if you want English food, holiday in England. It was all inclusive, and the range of drinks was limited, but there was an unlimited flow of Beer, Vodka, Raki and wines. visitors should respect that this is predominantly a Muslim Country, and we should respect that. We arrived at midnight, the man on reception was most helpful, I explained that I needed a ground floor apartment, he carried our luggage to a wonderful 2 bedroom apartment with 2 balconies and a large bathroom.absolutely fabulous, The staff were very pleasant and helpful, Why do people complain about this hotel, ask them what they paid, I paid £600 for 2 people all inclusive at this hotel for 2 weeks, including flights and transfers, a bargain , if you want 5 star hotels, pay 5 star prices. will highly recommend this hotel, We had a wonderful experience.…", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8473177-r427380576", "sub_review": {"Value": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Don't go", "review": "Arrived late on night 11.20.pm was offered no refreshment and had to go shop next door.  Room was on the 4th floor and there is no lift.  All inclusive bar is very poor only serving wine, beer, vodka or Raki. The food in restaurant is not hot and I only got to eat meat which was chicken once in the 7 days other days was kidneys or a strange substance that tasted like pork ish . The staff have no uniform and some actually wear dirty clothes . some staff have a smile some don't . This hotel is mainly used by Russian and German people  The room was clean the shower was hot the air con was old but worked  The local beach is lovely  The hotel pool is clean looking but they play really loud music around the pool every day I had to put ear plugs in  Staff do not understand any English  There is no evening entertainment at this hotel  The local shops are ok but very repetitive  I'd say if you British you will not enjoy this hotel and don't go  Hotel reception are very polite and try to be helpful…", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8473177-r423174316", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "Thank you for an unforgettable holiday:)", "review": "We had an amazing time here. Checking in was simple and quick. All the staff are polite and friendly. The hotel is kept up to a very good level, the staff worked there with a smile on there face all day and night, brought whatever you wanted and really tried to make everything as good as it could be.  The setting was nice close to shops and to the beach. Food was always fresh with a wide variety of dishes being well presented and with lots of fresh fruit on offer. Rooms were enough comfortable,  well appointed with a very good bathroom, shower and a reasonably comfortable bed, and what is important, always clean. Brilliant first trip to Turkey. Only fault, holiday was not long enough.I would certainly recommend this hotel. Will definitely go back in 2017", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8473177-r404010193", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "For that price ok...", "review": "We payed not so much and the quality matches the price... 3* hotel. Not far from the beach. But on the nearest beach you have to pay for chaise lounge.. on the other beach there is a servis bus (3 times in a morning and afternoon). Beaches are very good )) So.. about hotel.. It's small 4 flats houses coloured in rainbow colours... looking nice. But inside  not so good furniture especial in bathrooms :(( our bathroom didn't close... and the entrance door was broken before us..  no elevators Meager meal.. its good but small selection. In the bar there are \"Marmara\" beer (so so), wine, gin, vodka and rakı.  Personel are not professional. .. of course for this money they can't be. So... If U deside to leave here just for stay somewhere near center it's not so bad... But seating in…", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8473177-r400557788", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Great hotel", "review": "Great hotel. Staff are lovely. If you need anything ask Borak. He gets things done immediately. Good food. You will always find something to eat. Bed was so comfortable. Could do with entertainment at night", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8473177-r385475000", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 3, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Lovely hotel", "review": "I was recently here this month and really enjoyed it, my room was gorgeous and big and the staff were lovely. The water slide was so much fun. The food was good and there was something for everyone. The gorgeous beach was only 5 minutes walk away from the hotel .. I would have just liked there to be entertainment .  ", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8473177-r383928688", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Nice hotel", "review": "Was put in this hotel after my other hotel was closed Staff were lovely rooms were good. Showers could do with updating as pressure was a bit off. Borax  (apologies if that's not how u spell it:') was lovely too. Not sure why people are giving very negative reviews as I've stayed in much worse conditions. Thanks guys of rainbow castle! Xx ", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8473177-r383197034", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "You get what you pay for, No complaints from me", "review": "I stayed in room 410 which was the top floor of the light blue painted block!  my room was an impressive size, clean bedding and fresh towels, the rooms were spotlessly clean, the bathroom was clean but did look a bit \"tired\" and the tiled floor of the shower was very slippery when in use! so perhaps place a small towel in the shower to help prevent slipping. The staff were very attentive friendly and polite, although the same cannot be said for the cleaning staff, mainly scruffy looking women, which hung around all day but didn't actually do any work!!  they also don't like to clean your room if you are in it!!! If you are not a fan of Germans, Russian or Kazikstanis then this will not be the hotel for you, the place was very quiet when i was their a few days ago (first 2 weeks…", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8473177-r382809788", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Unrateable ", "review": "Very disfunctional hotel. Don't bother going. Was given sleeping quarters used by hotel staff as a Economy apartment . Hotel staff distanced themselves from us or looked over our heads while enquiring about the apartment was totally blanked out. Could cut the atmosphere with a knife. Food. Not worth explaining. Was eventually moved to other hotel ", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8473177-r381546040", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Tin pot place", "review": "This hotel/hostel as I've stayed in better hostels than the room we we're given. The room was dirty, the fridge was unusable due to the bad state it was in. The bathroom was dirty and tiny. There was another room containing somebody else's clothes and a load of junk(obviously staff room) when we complained they said we shouldn't go in the room with the clothes in!!!! We were eventually given a different room which was slightly better(cleaner). The food was and is terrible. The worst I've been served in Turkey and to top it off its all inclusive!!!!!!! The web pictures of the hotel must of been photo shopped as they are nothing like. I advise any British person not to stay here. ", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8473177-r381164174", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "visited turkey", "review": "Visited turkey at least 30 times and have always given accurate reviews. All I can say is there must be another hotel that looks exactly the same.  The food is probably the worst I have ever been served in turkey always cold  .when asked at reception if ee could at least get hot soup he thought we were picking on him.our holiday was cancelled and we were taken to this hotel. If we had known how bad this place was we'd have quite happily stayed at home .this is a german and Russian hotel only we were treated by staff and guest very rudely because we were not german or Russian .the staff didn't want us there and they didn't try to hide their feelings all entertainment was in german .we were never asked to participate. When going to the bar for a drink they didn't rush to…", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8473177-r321347669", "sub_review": {"Sleep Quality": 1, "Rooms": 3, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Interesting hotel", "review": "The hotel is located on the main street that connects Side and downtown. Opposite the hotel is a beautiful sandy beach. The hotel was renovated, the rooms are new, but small. The food in the hotel is excellent and varied. Great choice of fresh fruit, vegetables, salad and meat. The hotel has a outdoor pool and water slides for children.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8473177-r317307216", "sub_review": {"Value": 5, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great holiday ", "review": "Stayed here in May with my two children (3&13). Rooms were lovely, spacious and newly renovated. Housekeepers came daily, even left us flowers , spotlessly clean, new fluffy towels no complaints. We found the staff here to be excellent, male manager always around and a big help, phoning to confirm taxi's/pushchair hire ect. All staff always had time to give my toddler some extra attention, bar waiting staff also very good.  Pool area clean and well maintained, plenty of chairs and sunloungers. Five min walk to a lovely beach with plenty of bars ect. Also lots of shops & restaurants just a min walk away. Look forward to staying again. Thank you all :-)", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8473177-r305105277", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Cheap and cheerful", "review": "There's not much that you can say that is wrong with this place as it's very cheap to stay.  It does appear to be a place where Turkish workers stay during the season.   I can't fault the staff as they were very helpful. This area of Side was perfect. The beach isn't far away and the restuarants & shops are around the corner.  It's a great base to explore the local area.  People are very friendly.", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8473177-r121208405", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 3, "Cleanliness": 3, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "gunesli apartmets in side", "review": "We arrived at 3 am for a 2 week stay on the 13th of october 2011 and after checking in were guided down a dark over grown pathway and up 2 flights of even darker stairs to our room.We had booked self catering but on looking around found we had no kettle,stove or pans so had to go out for a coffee.We got up the next morning and had a really good look around and the room was absolutely filthy,the shower was full of mould and the drain was blocked with other peoples hair,we daren't use the kitchen sink as it had mouldy stagnent water left in it and wouldn't drain properly,the first thing we did was buy cleaning fluids.Three days into the holiday while sunbathing round the filthy pool a man arrived with a gadget which we thought he was going to use to clean it but no he was actually…", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8473177-r119869560", "sub_review": {"Value": 1, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled with friends", "rating": 1}, {"title": "terrible do not stop here!!!", "review": "the rooms portrayed on the photos are not what you  necessarily get .we have just got back fron a week there and the place is dirty cupboards hanging off the wall air con not working shower was dirty. we got locked in the room had to break out  by forcing the screws in the locks on the door. curtain rail wa s slanted socurtains slid back when you tried to close them/ no hob to c ook on  no kettle no television. had ants crawling out of the electric sockets. sheet on the bed wasnt even big enough to cover one person let alone 2!!!!! we told the management and they were not interested although they did move us to a room that was not much better. we had ants crawling out of the wall sockets still no telly but at least the air con worked. there was mould around the shower and the…", "date": "September 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8473177-r118024931", "sub_review": {"Value": 1, "Location": 1, "Rooms": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}]