[{"title": "Perfect service and comfortable", "review": "Considering the 24/7 service and the perfect food , this is maybe one of the best hotels in the Side/Antalaya side , moreover the daily specialities and the organized program are part of the fun, if you are planning a good holidays do note hesitate to book earlier in order to get better prices ..", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r727687306", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Turkey 2019", "review": "Our 6days vacation in this hotel was excellent. We were 4 friends and all of us are more than satisfied with our stay. First our family room was very neat and clean, we got every day clean towels and our mini bar filled. Food was very delicious, for everyones taste. We loved so much the gözlemes and the donuts at the snack bar. Everything was perfect. The staff and everyone was so friendly. We made new friends as soon as we stepped in the hotel. Hotel is filled with great energy and positivity, its impossible to not feel good while you're there.  As a group of firends we would like to thank everyone who made us feel like we're at home. Ibo from the vitamin bar and Onur who sells Spa packages are the ones who lifted up our good energy. Definitely would come back if we have a chance. Until next time. 🙋🏼‍♀️…", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r714951824", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "A review for the English ", "review": "I am mainly writing this review for the English as I was concerned about going to this hotel being English due to the reviews from English travellers so I would like to clear a few things up. Firstly yes this hotel is mainly Russian with a few German and Dutch and hardly any English so if you want to be with other English holiday makers then this isn't for you the reviews I read stated that the staff don't speak English this isn't true in fact we had quite a lot of conversations with some. I would also like to point out that you don't have to tip to be given good service unlike the Russians and Germans who seem to think this is the way to go. We didn't tip anyone until the last day giving to those that we found to be the best and we were treated very well and I can't complain about that. The only rudeness we experienced was from other holidaymakers but not the staff. I would like to give a special mention to gacdas who worked in the terrace bar not only does he make the best cocktails but he was really friendly had a good chat about football with us and always remembered what we were drinking. Ibo who works on the vitamin bar around the pool was an absolute delight and made us feel very welcome.  Onur who sells the spa packages what a great guy he always sat and talked to u everyday he's fab. The hotel itself is very good clean nice decor the rooms are lovely there's a fridge with soft drinks and tea and coffee making  facilities the bed was big and comfortable we had a pool view which was very nice. The food was good although we did get a bit fed up of it after 10 days  There's 3 Al a carte restaurants but I only went to the Italian which was a nice change the menu is the same everyday so wouldn't bother going more than once tho.  There's a patisserie with river facing outdoor seating which was lovely the Turkish delight is a must.  There are plenty of bars to choose from so never a problem finding somewhere to sit and have a drink.  The hotel is a bit out of the way nowhere in walking distance which is a shame but I defo recommend taxi ride into side old town very good shops and restaurants and a lot more English people there. A taxi costs 12 euros or you can get the bus for 1 euro each.  Green kanyon trip is great very relaxing with a nice lunch included.  Now the entertainment for us was a disappointment daytime was ok activities around the pool and slides open twice a day but the evening entertainment was poor and let's the hotel down unfortunately. Its done in outdoor theatre so you have to move from the bar to go watch it and its very amateur I've seem so much better in other Turkish hotels. So the evenings are quite chilled we mainly just sat and chatted together. They have a foam party near the pool once a week but we didn't get involved just watched from the terrace.  So to recap lovely hotel great friendly staff good food and rooms just let down by the entertainment and if you want to be amongst English this isn't for you but all in all we had a great holiday.   …", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r713369912", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Can you relax at diamond premium hotel?", "review": "If you want to relax on your holiday, don’t go to the diamond premium hotel. The hotel is playing loud techno music at the pool area from 10am to 10pm!  And let me make one thing clear, you can’t escape the loud techno music anywhere at the hotel area, because it is loud!!! Ok if you are staying in your room with doors and windows close, you will only hear it whisper in the background...  Besides that, everywhere you go (on hotel area) they will try to sell you extra services.  On the positive side:   The hotel deliver almost barely to the promised 5 stars.   And the buffet has a great variety of foods.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r710781130", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Best Family holiday in a long time! ", "review": "Dear Thedayly,  We deeply regret your recent stay with us haven’t met your expectations in terms of some services and also saddened to hear your comments about hospitality and service. We are usually known for our attentive and friendly staff, who treat each guest with respect. We are truly sorry you’re felt differently and therefore we apologize.  Do hope you will reconsider and give us another opportunity to welcome you back.  Kind regards, Diamond Premium Hotel & Spa Team", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r704065282", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great food, great service, terrible hygiene standards in rooms!", "review": "This is going to be one extremely detailed and objective (as much as possible) review.  Staff:  The staff is very polite. The receptionists speak Turkish, German, Russian, Polish (as far as I can remember) and some English. The rest of the staff mostly seemed to speak Turkish and German and some English - most of the staff speaks German better than English, which is a plus, if you are a German tourist. I’d give the staff 5/5 – very lovely people.  Room amenities:  The balcony had a bolted stainless steal rack, if you want to dry your clothes, as well as a table+2 seats, if you are a smoker or just wish to spend the evening out on the balcony. The minibar contained soft drinks, which were include in the all-inclusive package. You can watch different TV channels in different…", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r701118265", "sub_review": {"Sleep Quality": 3, "Rooms": 1, "Service": 5}, "travel_purpose": "", "rating": 3}, {"title": "Absolutely LOVED it!!!", "review": "Dear BluntAna,  First of all we would like to thank you for having chosen the Diamond Premium Hotel & Spa for your stay in Side.  Our staff members take their roles in our industry very seriously and try, every day, to provide that quality customer service, that our guests expect.  We are, as well, happy to know that you were pleased with our food & beverage service offerings.  All feedbacks from our precious guests are so important and help us to improve our quality of service.  We truly look forward to welcome you back and demonstrate you our high standards of Diamond Premium Hotel & Spa. Your Diamond Premium Hotel & Spa Team", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r698108030", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Perfect", "review": "The service, the food, the location, the stuff all was 👍🏻 great)) we came in May and it was our first experience but we absolutely loved it. Nothing to complain at all. Every day activity does not make you feel boring, and be ready to gain extra 1-2 kilo)) the food is so yummy 😋", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r695794048", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Lovely hotel, terrible service", "review": "Dear JuliaTurkey,  Thank you for writing a review and of course, for choosing the Diamond Premium Hotel & Spa.  Our staff is always at the guests disposal and will for sure help with words and deeds.  A great pleasure to read you had overall a good time with us and enjoyed so the culinary offer cooked by our chef who does an incredible job to offer you fresh and high quality food.  It will be a great honor to welcome you soon again and offer you another amazing vacation.  Warm regards, Your Diamond Premium Hotel & Spa Team", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r692713458", "sub_review": {"Value": 2, "Sleep Quality": 3, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Nice and good", "review": "Everything was perfect. Super service. The food was top of the line. The animation team did a perfect job. All personal was so nice and friendly. Very good place to go on holiday with children (family) We will come again...", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r691289826", "sub_review": {"Value": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Hotel in a beautiful location by the river", "review": "We were at this hotel and my wife's room 7138 top floor during 22.6 – 6.7. The hotel room was quiet and very clean.  The hotel had the majority of foreign speakers of Russian or German. of course a few Finnish-speaking families were found.  The hotel is beautifully located on the banks of the Manavgat River.  The hotel's food is typical of the All Inclusive Hotel, but especially desserts were good.  The A Guest Relation Officer of the hotel avoided English-speaking people. I do not know why it was. It is worthwhile for the hotel to invest in the elementary skills of English.  Prepare for cash, there is no ATM near the hotel", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r690365345", "sub_review": {"Value": 5, "Location": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Dont go there !", "review": "Dear MarkkuOjala,  Our team was thrilled to read your wonderful review!We are honored that you have chosen our hotel for your holiday.  We are glad you loved our culinary offer and our team who always work hard to give the best service to our guests.  Our hotel is close to everything.This is one of the reasons why our guests prefer to stay with us.  It's always a pleasure to welcome you in our little paradise in Side and we can't wait to welcome you here soon again.  Kind regards Your Diamond Premium Hotel & Spa Team", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r661987550", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Will not recommend", "review": "I was there with my frind 5 days  Staff are rude and bar mans are mostly not friendly  Food is awful mostly its fish and vegetables and only two fruits exist  Apple and grapefruit  Sweats taste like water and bad cream  Drinks are all bad quality and made me sick and bad headache The hotel area is nice the river and beach is cool  Mostly i hate staff which are not doing they’re  job well Also u cant smoke there  Only outside is allowed     For Iranian new year it was poor !  ", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r647247378", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Not felt welcome", "review": "My friends and I spent a week in this hotel last May. At first, we liked it, everything seemed to be new and nice. The beach, the pool area and the slides were the best for us.  Service was the worst. One evening at dinner it was so stuffed in the main restaurant so we tried to get a table at the terrace. We were lucky and found one table nicely decorated with flowers and napkins. We sat at the table and in a minute were told off in the rudest way by one of the waiters. Apparently, the table has been reserved (though no sign on the table or similar). I decided to talk to the manager. He tried to escape me at first which I found quite shocking. But when I finally got his attention and tried to explain what happened his answer was rude and it was obvious he didn’t care at all. I…", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r624301280", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "wonderful holiday", "review": "It's not a 5* hotel at all. Bearing in mind that we are not picky food was not the best, depending on staff working how quickly they will clean up the tables in buffet restaurant, you might not get a seat for more than 5 min, well clean table. When you go to the rooms there is a leaflet that says breakfast is from 8 or 7 I cannot remember till 9-or 10 o clock and then late breakfast so one morning we woke up late made myself a sandwich put it in the toaster and kitchen staff unplugged everything without saying a word.  Just the barmens seem to speak English. Spa would not recommend it in a million years, everymorning if you want to get fresh beach towels you have to go to spa to get it and every morning they try to speasvide you to get a Packard which we did... Not going to get…", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r618683184", "sub_review": {"Value": 5, "Location": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "From experience this is one of the best hotels at this price range", "review": "Hello everyone! We have stayed at this hotel from the 9th of September till the 14th of September 2018.  I have been to many hotels in Turkey, such as Bellis, Rixos Sungate, Alva Donna and many more.  From my experience this hotel ranks among the very best, it is clean, the food is just fantastic, the snack bar on the beach offers some variety such as vegetables, fish, grill etcetera.  The rooms are nice, cleaned daily, the minibars offer 2 flat waters 0.5, 2 sparkling waters 0.33, 2 fanta 0.5, 2 coca cola 0.5, 1 coca cola zero 0.5 and 2 beers, it is replenished daily between 10:00 and 10:30.  The pool is cleaned and checked daily, they take samples for testing at different times during the day.  The hotel is very big but it doesn’t have big grounds, it has a small yard and you…", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r616163457", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Not a 5 * hotel definitely", "review": "Dear radulescubogdan,  Thank you so much for such a wonderful review and most of all detailed description of your recent stay at Diamond Premium Hotel & Spa. We appreciate this very much!   We have read your review with great attention and can only say \"thank you very very much.\" We are so proud that we have made such a great impression on you. It is our concern that our guests feel 100% comfortable and we are always happy if we could achieve that. Our staff, which made a huge contribution to making your holiday go smoothly, really does a great job. We will pass on all your nice words to them. We thank you once again for your full recommendation and we hope to welcome you back soon to offer you another beautiful holiday.   Kind regards,  Your Diamond Premium Hotel & Spa Team", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r611813121", "sub_review": {"Sleep Quality": 3, "Cleanliness": 5, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Relaxing summer holidays", "review": "We stayed in this hotel end of July 2018 together with the family. 1.First of all the hotel staff are very rude and they don't speak English well. The ladies at the reception and the employee at the towels  are very arrogant and they lack respect towards the guests. We booked our vacation with a river side view room, which is the best in my opinion and the receptionists put us in a room above the pool with a view to the restaurant roof which was covered in birds dirt... It took them one day to move us to a room that we paid for after a huge hassle. 2. The bathroom stinks so badly, that almost unbearable, no matter how much they cleaned it. 3. The food is tasteless, most of the choices is chicken, not many types of cheeses or fruit or salads that you would expect in a 5* hotel.…", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r611196942", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "When Diamond, it's not just the name", "review": "Dear Diana P,  Thank you for your detailed feedback.  First of all, we are glad to read that you liked our great location close to Manavgat river, the clean pool as well as Side. On the other hand we deeply regret that your stay were disturbed by some issues. Kindly accept our sincere apologize for not meeting your expectations this time.We took note on the suggestions you are directing us regarding your stay and we would like to assure you that your comments will be carefully shared and reviewed from our management for providing our best level of service!   Last but not least: Your most important aspect regarding the sea is very surprising, because the sea has nothing to do with our hotel. It is clear that the sea is deep, but without the parents' care, no child should bathe in the sea alone. Everyone is responsible for the safety of his kids!  Nevertheless we look forward to welcome you as our guest in the near future to offer you an even better experience.   Kind regards,  Your Diamond Premium Hotel & Spa Team ", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r606778257", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good and nice hotel.", "review": "Hotel was great in every way, the only complaint I have and it’s hallway and corridors where not air conditioned, but its no ones fault except the architects who design it. See the pictures its all looks beautiful and rich but the temperatures inside where too high to enjoy the beautiful views and decor. However, all the restaurant lobby and rooms has very cool air con, staff are nice and speak english and german so would definitely return back to Diamond Premium again. 5 stars from me", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r605594323", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Not a 5 star hotel", "review": "I was expected a 5 star hotel.This is definitely not for 5 star because that was not clean i have to get back glasses several times for being not clean ,bathroom smelled very bad the staff not friendly ,the pool is very small the indoor pool was not open,very hot inside the halls.I definitely I will never visit this hotel again.", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r602344412", "sub_review": {"Value": 2, "Rooms": 3, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Nice surprise!", "review": "Dear teutaasllani2018,  Thank you for taking the time to write a review of your holiday at Diamond Premium Hotel & Spa.   We regret and apologize that you were disappointed with your stay. The satisfaction of our guests is very important to us.  We do always the maximum to satisfy all our guests especially with the cleanliness of our hotel and every one of us is doing the best to let every guest feel welcome and comfortable. We are sorry if you haven’t had this impression. We will try to do our best to ensure standards met all time.  We hope to welcome you back again someday in order to show you the differences we’ll have made by then.  Best regards,  Your Diamond Premium Hotel & Spa Team", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r602179107", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Everything you need", "review": "Very nice hotel! Small but very clean and excellent services! Rooms modern, very clean, beautiful view. Food very tasty, variety of choices, clean in the restaurant and snack bars. Pool clean not very big but wasn't crowded and we could find sun beds at any time of the day. To reach the beach( sandy ) you have to walk a few minutes thru a beautiful path thru pine woods.  Amazing animation shows in the evening. It was a very nice surprise and we had a beautiful holiday!", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r599741097", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great for relaxing holiday", "review": "Dear bissouss,  We are very grateful for your wonderful feedback regarding your recent stay.  It is a joy to see that we met all your expectations and that you especially liked the ''amazing animation show in the evening.'' We will forward your motivating words to the entire animation team as well as our hardworking staff because of their ''exellent service.''  Thank you once again for choosing us. We would love to be your host again.  Best regards,  Your Diamond Premium Hotel & Spa Team ", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r599003792", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Nice hotel", "review": "Stayed at this hotel for three days. Wish I stayed more. Everything was amazing, you wouldn't even have to leave the resort and can stay here days on end. Rooms were clean with amazing views. Amount of food choices were unlimited so much to choose from made fresh in the spot. Pool area was vibrant and was great they had a kids section with a play ground near by. Resort offered cafes inside aswell as a mini bazar. Prices are in euros but you can pay in tl. The entertainment they offered every night was great with different shows and kid shows. Would definitely stay here again. Location was good about a 10 minute drive from side Merkel. ", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r595306653", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Nice, Nice, Nice ", "review": "food excelent, servis excelent, staff excelent.  for family holidays best place. 100% satisfaction. neer the beach. neer city. The only problems is few russians that have problems with good manners, but this is not problem of the hotel. Big respect for hotel managment and the staff.   ", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r593675051", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Cute holidays", "review": "Dear Martin R,  Many thanks for your 100% review!  Great that we could offer you a wonderful time and that you liked our and staff. We thank you, too for having chosen our hotel and your very kind words! We will foward this to our staff and management.  We hope to welcome you back soon to offer you another beautiful holiday!  Best regards,  Your Diamond Premium Hotel & Spa Team ", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r591363017", "sub_review": {"Value": 4, "Location": 4, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great vacation", "review": "Everything was fine. Most of all I did not like the work of the main waiters of the restaurant. I used to bring drinks to myself and my family. We received the room on the 6th floor, ,,Family room'' with one bathroom, spacious rooms, and the bathroom is also large. We bought a view of the river, I do not regret Bed linen and towels changed every day in the room. Each day the mini bar was supplemented with  water and cola.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r589059230", "sub_review": {"Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Lovely hotel", "review": "Dear rutadobke,  Thanks a lot for your kind review.  We are glad that you had overall a nice stay with us that \"everything was fine.\"  We hope to welcome you back soon!  Kindest regards,  Your Diamond Premium Hotel & Spa Team ", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r588717259", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "2nd stay... & was even better 2nd time round.", "review": "It was a very good experience. Stayed there with my family - wife and two kids. Room had a great sea view! Enjoyed variety of food a lot! Activities were also great! And we happened to meet the owner of the hotel personally (still keep his business card) - great and humble man with great vision of good service.", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r581302269", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "LOVE IT!", "review": "Our lovely room was every day a clean and towels were always in different shape.  Club at the downstair was awesome, especially bartender Mihael! Indoor pool was nice and quiet and lovely for cooling down.  Food was also lovely, they even had snack at the restaurant in midnight !! Beach was very clean and path to the beach was lovely. They also had organized activities for kids and adults. They also had arranged club trips to local bars.   A good choice for couple, friends or family !", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r570653835", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Really discusting", "review": "I have to stay in your hotel for my business. But i couldnt eat anything because your food is really bad. And the room cleaning is not enough. Housekeeping is not doing his work and she is just changing pillowcase and the towel. I am sure about that I will never stay in this hotel again.", "date": "November 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r540861142", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 1}, {"title": "Bernadette", "review": "Visited this hotel in October it was fantastic  arrived early11 am  ask if we would like to up grade to suite for50 pounds said yes and was given room straight away staff where brilliant food could not fault it some thing for everybody and loads of choice had private beach with food and drinks only thing l was disappointed with was the spa very expensive and would not budge on price try number of times wold recommend this hotel ", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r539662828", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Very good", "review": "Dear Bernadette W,  Greetings from Diamond Premium Hotel & Spa in Side. We are delighted to hear that you also were fully satisfied with our food and beverage offer.  Furthermore, our team is comprised of hard working individuals aspiring to leave an impression. We were happy to see that were able to show you our hospitality and you were able to enjoy the overall experience.  All the pleasure was shared with the entire team and we hope to see you again in the future.   Best regards from Side,   Your Diamond Premium Hotel & Spa Team ", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r536342845", "sub_review": {"Location": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Thank you!", "review": "Diamond Premium was my first big all inclusive experience and it was great! My wife I  normally books a smaller hotel with breakfast. But with our son in the mix, all inclusive is good. This hotel does not deserve the bad reviews here in my opinion. Yes it is located in the middle of nowhere, but the Dolmus drives to both Manavgat and Side for 1 euro/3.5 Lira pr person. from the large road next to the hotel.  The English skills for the staff could be improved, but we could always find at least one who understood us.  The restaurants have some dishes on repeat, but there is atleast one new dish every evening, and some speciel dishes most nights. It is both international and local food. The waiters are busy but helpful, a big thank to Osman Bediz, with helping us with drinks and…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r516727680", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "A very nice hotel and friendly staff and great service", "review": "We had a great time at the hotel as a couple. The hotel itself is amazing and very big, LOCATION - the location is quite and great for couples, its outside the city and it is a resort like building. We wanted a silent getaway and we enjoyed being inside without going out for 7 days.  FOOD - The food is very diverse and tasty. As it is a UAI service you basically get food three times a day plus they offer beach bar, patisserie and pool bar with great snacks.  Don't miss the sweets - they are amazing!   DRINKS - I loved that you can get little ice waters from every bar in the hotel and refresh yourself as its humid all day long. The cocktails are made with some bad quality liqueurs and juices and we didn't like them. Another minus was that the fresh smoothies were not included in…", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r515152910", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "We were there", "review": "Dear Zorica B,  Thank you for the positive review that you have shared with us.  Mentioning the friendliness and efficiency of our employees particularly we do appreciate very much, and will continue to work on our areas of improvement in order to be perfectly ready for your next stay.  We are pleased to hear that our team were professional, helpful and interested in guest satisfaction.  It was certainly a pleasure looking after you and we hope to welcome you soon again.   Warm regards,  Diamond Premium Hotel & Spa Team", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r506816257", "sub_review": {"Sleep Quality": 4, "Cleanliness": 4, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "NO!!", "review": "The hotel is big one, clean and with diversified food. Spa center was disappointing, we payed 50 euro for Hamam but we recived one bad shower. Beach towels had a very bad smell ;(....Hotel staff dont speak english, is very hard to have an conversation with them and say your problems. The room was cleaned only in the afternoon when peoples came back from beach and if you are in the room they dont clean anymore.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r503680538", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Great Family Vacation June 11-18, 2017", "review": "Dear Nicolescu M,  Greetings from Diamond Premium Hotel & Spa in Side  Special thanks for pointing out the cleanliness of our hotel.  Also, thanks for your kind words and mentioning that hotel generously offers a good choice of menu throughout the week.  However, be sure that we are continually working to resolve all minor problems in our establishment to assure you the best stay as possible.  All the pleasure was shared with the entire team and we hope to see you again in the future.   Warm regards,  Diamond Premium Hotel & Spa Team", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r495212219", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "not for the english", "review": "Well, the hotel at first looked new and beauty..i have expected it to be as it looks like..but unfortunatly i was dissapointed! First..the reception stuff don't speak English!!!!! Only one or two speaks very little English but others looks at u as u are an ellient... Second..they give you wrong information..they don't know how to do their job! We arrived as a group of 10 people..they were frustrated and the check in was slowly and exausting!! I was with one infant and one 4 month baby..they even didnt try to make my check in go faster.. They dont smile..and this is the same with almost all the hotel stuff..no one smiles to u..till u give him TIP. If u ask the waiter in the resturant to bring u a drink...be ready to wait forever.. The location of the hotel is no where...u can not…", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r494464309", "sub_review": {"Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Avoid if you're British!!!", "review": "The staff in the hotel do not speak English and fully take advantage of this language barrier. When we arrived they tried to make us pay £135 for an upgrade which just meant a room with a pool view. Once we declined their offer they spent another 2 hours encouraging us to pay for it. We had to constantly draw on a piece of paper to try and communicate with the staff. The hotel is also in the middle of nowhere (25 min walk to the nearest shop) and you have to rely on the shop on site which is expensive as everything is in Euros rather than lira! The spa staff and photographers also pressure you to pay for their services and we tried to kindly explain we didn't want photos. Once they realised we weren't going to pay they didn't even bother saying good morning or simply look at us…", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r493340284", "sub_review": {"Value": 2, "Location": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "The perfect hotel in a perfect location!", "review": "Dear  Zwynne,  Thanks for writing some notes about our hotel. First of all we would like to say you we deeply regret that your stay with us didn’t met fully  your expectations. Our hotel is accommodating many guests from different countries  and this is taken into consideration regarding  the standard of service. Therefore, all our guests are provided equal services.  We gave to our staff members trainings to increase our service quality because our first goal is the guest’s satisfaction. Also we are happy to hear that you are satisfied with our hotel complex. However, you can be assured our entire staff would be very happy if we would welcome you again in the near future.  Kind regards  Your Diamond Premium Hotel & Spa Team  ", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r492957198", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Excellent Hotel", "review": "My family and I stayed here for 5 days and I must say, it was one of the best hotels we have ever stayed at. This is out second time in Turkey and the most memorable, all thanks to this hotel and the staff. I was in awe of the beauty of this hotel and its location. It was clean (spotless), modern and very beautiful. It is in a great location, 5 minutes from the beach. The staff are so helpful in every way and always available to help or offer advice. The selection of food is endless with several different cusines available at various hours of the day. All in all, this was a fantastic hotel and I would highly reccommend it.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r485240420", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Good and spacious hotel.", "review": "Dear tayebahbashir,  Many thanks for the wonderful review and for taking the time to share your experience with us. It’s a big honour our staff served you well and you liked  especially the food offered and the perfect location. We really do appreciate you taking the time and effort to post it and are glad that we will have the privilege of welcoming you back again.     Best regards  Your Diamond Premium Hotel & Spa Team  ", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r482927830", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "The best hotel ever", "review": "I have just returned from a week in this hotel.It is spacious and immaculate. The food   quality and presentation is of the highest and caters for lots of different nationalities.The staff were without exception first class.My room had a river view so I could watch the Pirate Boats .Actually I live in North Cyprus and an unlimited amount of fresh water comes to us by an undersea pipeline from this very river.I only have good memories from my stay.The Guest Relations Manager Hasan Bey was very helpful and I used local buses to go to Side Town and then some fantastic waterfalls up river.Actually if you do not want to leave the hotel you do not need to.  I reccomend this hotel without hesitation for excellent value and service", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r482436456", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "A nice hotel but too big", "review": "Stayed here for 9 nights aft having  8 nights in the J'adore hotel next door. Room was nice but not very big for a 5 star and no slippers. Nice view overlooking the river. Only one cover on the bed and no top sheet. I asked and room service brought a sheet and blanket. Toiletries were not replaced until I asked. Walls very thin and for 3 nights I had someone next door who snored loudly. Food was nice and I had a very nice waitress who worked very hard and served the tables near the door. A manager walked up and down the restaurant everyday not acknowledging any guests and never smiled except to staff. More like a security man in a supermarket. Liked to stop people carrying an apple out of the dining room and returning it. He spent all his time on his 2 mobile phones. Lovely guys…", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r480445960", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Perfect price performance ratio ", "review": "Dear Ellis M,  first we want to thank you for your review. Many thanks for the kind words about our hotel, our team  and for the varied food offer.We also thank you for the recommendation. We would appreciate in the near future, to offer you again an unforgettable time.  Warmly greetings,  Your Diamond Premium Hotel & Spa Team  ", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r479893661", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Really poor ", "review": "If you make reservation in advance price goes almost to zero which appeals all the tourists. For my case it was around 25 euros per person per day. Here are pros and cons:  Pros Rooms are really spacious. If you are a vegetarian there is a vast variety of food in the restaurant. Clean hotel Turkey lover are welcome cuz It is served everyday Restaurant Staff are extremely helpful.  Cons Snacks were really poor and of low quality I asked the reception about minibar the guy first tried to accuse me  Waterslides were just open for 2 hours and one of them wasn't working. Constantly gave false information related that. After 7, life is almost over. I can't understand why the fitness centre is closed at that time.  Beds were not that comfy but ok ", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r478995879", "sub_review": {}, "travel_purpose": "", "rating": 2}, {"title": "Worst customer service ever! ", "review": "Dear Fatih E,  Thank you so much for choosing the Diamond Premium Hotel & Spa. We are pleased to read that you enjoyed your stay and that we met your expectations. Also we are happy to hear that you liked our very good performance ratio. We truly appreciate your comments and hope we will be able to welcome you back to experience another wonderful stay with us.  Sunny regards  Your Diamond Premium Hotel & Spa Team  ", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r476123236", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Fabulous hotel & facilities", "review": "No variety of food and really bad alcoholic drinks, staff is really bad and not friendly. I will never come back. Rooms are clean and comfortable, waiters and barmans are always not ready to serve you. Hope to replay someone the message ", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r473554420", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Amazing", "review": "Me and my boyfriend stayed here 7 nights in July 2016 and we enjoyed the stay very much. The hotel is new and nice, nice food, great pool, helpful staff, nice beach, unlimited free cocktails, morning yoga, beach volleyball. Highly recommended.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r456097853", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Loved it", "review": "Dear ainur90,  Thank you for taking the time to write your review of our property, your comments are very much valued.  We are glad you loved our culinary offer and our team that always work hard to give the best service to our guests.  Moreover, it is a delight to know that you were especially satisfied with our staff’s work and service, as we always do our utmost to accommodate our guest’s needs.  It’s always a pleasure to welcome you and we hope to see you in the near future.   Happy regards,  Diamond Premium Hotel & Spa Team", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r454867198", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Horrendous experience with SPA staff", "review": "I had a great time in this Hotel everything was amazing , do not hesitate to visit it . The beach is close the food is delicious the staff are great . Anything you need is inside the hotel. The view also is beautiful.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r441082440", "sub_review": {"Value": 1, "Sleep Quality": 3, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "OUT OF THIS WORLD!!!!!!", "review": "Dear Rita D,  Thank you for the candid and refreshing review left on our TripAdvisor page recognizing the important attributes of the hotel.  Mentioning the friendliness and efficiency of our employees particularly we do appreciate very much, and will continue to work on our areas of improvement in order to be perfectly ready for your next stay.  Great that you enjoyed the pool area and our excellent sea view.  Hearing from a valued customer like you are proves to us that our team is on the right path.  It was a big pleasure for us to read your feedback and to see your good notes.  It was certainly a pleasure looking after you and we hope to welcome you soon again.   Happy regards from Side,  Diamond Premium Hotel & Spa Team", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r439280356", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Nice hotel with things to improve", "review": "I have stayed in this hotel with my family from 22nd Oct 2016- 29th Oct 2016. I do agree with the positive review in terms of nice hotel & good food. Unfortunately, there is absolutely no leadership from the management in this hotel. My family got several times horror experience with the SPA staff. The SPA staff was rude, arrogant, discriminating and even challenge me to fight him in front of the public and my 7 years old daughter. I have reported this to hotel management (they call it 'Guest Relations') verbally and also by email. The person I have emailed was Hasan İLKAYA (Anika). Firstly, they tried to run from any responsibility and mentioned that they are not responsible for the SPA staff and they 'hire' the SPA staff. After several email they just ignored me. This hotel is…", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r432962192", "sub_review": {"Value": 4, "Rooms": 4, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Nice hotel.", "review": "The hotel is new and it looks great. One of the best looking in Side area from what we saw, although is not in the city, is 7 km away from it. Don't expect an European 5 star hotel. Although it looks great, it is very clean and has mainley trained,good staff, the rooms are small for a 5 star hotel, the bathrooms are very small for a 5 star hotel, but, as I said it looks very nice and clean. They have no slippers or robes in the room, or in the hotel, since we asked at the front desk. We went at the end of Oktober and we had great weather but you must know that in the evening and during the night it gets chilly. We were cold during the night since they only have very thin sheets to cover. We asked for another one, but it didn t help a lot. The air conditiong, although had a…", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r432623953", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Fab hotel staff food & location.", "review": "Dear Oana M,  Thank you for your feedback and that you have taken the time to describe your impressions. We are glad you loved all hotel facilities and services especially our friendly staff which you mentioned by name . We hope to see you soon with us for another great vacation in our hotel, the Diamond Premium Hotel & Spa.  Best regards  Your Diamond Premium Hotel & Spa Team ", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r427024256", "sub_review": {"Value": 4, "Location": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "great! it really is as it looks on photos", "review": "Myself & hubby stayed at the Diamond 20th Sept to 30th Sept 2016. We had a fantastic time & would highly recommend the place.  As with everything there are some great points good points & room for improvement points.  Food fantastic great choice & excellent quality. Midnight snack was available all night which consisted of tasty soup a choice of breads different cheeses & cold meats. Hotel look & decor & design great (modern & spacious). We had a ground floor room with a river view which we loved. Woke up to the sound of a herd of goats every morning which I loved & had hours of fun waving down the boats as they sailed passed our room throughout the day. The cupboard space is fantastic in the rooms & the shower is a large walk in shower. Bedding however left us cold most nights…", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r411168261", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "A nice hotel nothing more nothing less... ", "review": "Dear Lynziswez,  Thank you very much for choosing our hotel.  What a pleasure to read your wonderful review. We are thrilled you had such a great stay with us and you loved the food offer and  the excellent service you received during your stay. We are glad that you also so appreciated our team member because our first goal is your happiness. Your good ratings make us happy and we thank you for your nice words. We are honored that you have shared your experience on TripAdvisor and we look forward to seeing you at the Diamond Premium Hotel & Spa soon.  Sunny regards  Your Diamond Premium Hotel & Spa Team ", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r394551715", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Amazing hotel ", "review": "great, really good staff, tidy and clean rooms. good service :) no complains :) everything  was really great :D:D:D we really appreciate our staying there  :D:D:D it is good also for families and singles. quite close to antique centre of side (bu dolmush certainly)", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r394212171", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Good hotel, but with some problems", "review": "Visited this hotel last September. Food is Turkish, a lot of spices and mostly not tasty. We been with 1.5 years baby. Had to wait 3 days before we got it. And still we got broken bad. Brilliant! Poor management ...   The hotel is new, great rooms, excellent pool, a great tree park on the road to the sea.", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r393149553", "sub_review": {"Value": 4, "Rooms": 5, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Really nice hotel...", "review": "Dear Splague,   Thanks for writing a review our hotel. We are very sorry about the broken bed. That’s not our usual hotel standards.  We will discuss this with the hotel manager. Our hotel is very new and has a very modern equipment in which you can have a dream holiday. We are happy that you liked our hotel rooms, pool and the park. We are are looking forward to impress you in on your next holiday with the finest vacation experiences.  Warm regards  Your Diamond Premium Hotel & Spa Team ", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r391057240", "sub_review": {"Location": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice place", "review": "New, nice,clean hotel,with excellent service,food and whatever you want!Rooms not so big but in modern style,so for two weeks enough.Food for me very tasty(turkish,international)Big,clean pool(in high season too crowdy),beach enough big, with bar where you can drink sth or eat many dishes.Hotels interiors very spacious and made with taste.Place not so far to Manavgat or Side,where you can visit bazar or ancient things.I recommend this hotel for vacation in TURKEY.(better not in high season)Special thanks to Ms.Anika for her care,GM for gift and Mr. Celal Seiy from lobby bar(he is the best bartender i have ever met).In conclusion,i hope that someone from the hotel will read this opinion(i do not see feedback as yet).Thanks Diamond for nice vacation", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r388737877", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Incredible - well above my expectations!", "review": "Dear Piotr67,  Thank you for taking the time to review our hotel. It is an honor for us to read  such beautiful words about our hotel . The modern designed rooms and the cleanliness are our standards for  to make our guests happy. Great that you liked our Turkish food and international offer to too. Specifically Ms.Anika and Mr. Celal will be happy to hear your lovely comment  Thank you for your recommendation and we hope that we can inspire you soon for a second time.  Lovely  greetings  Your Diamond Premium Hotel & Spa Team ", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r385064639", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Fran shaw", "review": "beatiful structure but can offer more with a better managment.The place is to quite for beein at summer vacations ..i would preffer to be more funn .Butt for the price ...im not surprised becouse the difference in services and details is something i have expected when i booked this hotel ", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r384645096", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Top class hotel", "review": "There is some construction going on in the area but nothing to disturb you. Top class hotel excellent pool area with water park but very easy to find a quite spot. Or if you prefer the private beach with bar and food facility. Excellent groomed area very good sun beds and shades. Rooms are to a high standard super maid service you want something just ask. Very nice restaurant good food and service. Overall a very high hygiene standard. The hotel is a bit out of the way if you want lots of shopping but bus and taxi outside the door.  If you want a relaxing holiday  good food, service and cleanliness highly recommended.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r374039698", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good enough... But not really a 5 star location (yet)", "review": "Arriving: the road is not yet paved. Checking in: fast, but full knowledge seems to be lacking, and be advised, I did not get a good map or schedule for all the restaurants and bars. People behind the counter do not always speak German or English fluently (but this is the case for most of the staff working here). Breakfast/lunch/dinner: arriving early means queuing, but at least you have a table. Arriving late means you'll have to flag a waiter to get the cutlery done again. Bars: staff seem not always too friendly. Pool: great size, 5 water slides for the kids, really fun. Be ready for Turkish popular music though. (And if you're open-minded, you'll end up with a couple of them in your spotify playlist afterwards!) Note: there is a bar by the pool but it's no real poolside bar…", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r371360740", "sub_review": {"Value": 5, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Kunne ikke vært bedre", "review": "We had a Nice rom. With good beds. TV and wifee, The people working there are very pleasant and helpful at all times.  The Food was very good at each meal. Sommuch to choose from, kids liked everything. Nothing to complain about, i am not happy about the phitographer, you are agree at one price, but after the price is trilles and more. And not the best pic,i have Get to the price . Rest of the stay was the best.", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r364898534", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Definitely not 5Star Living but Accommodation 5Star!", "review": "this hotel is stunning but accommodate more Germans than British so language mostly German very few understood English.food was repetitive but all inclusive can  be this way although the star basis it should have been much better.If you need to get any currency the hotel has no facility for this they only accept Euro andLira for safe payment(should say for safe in your room) and as with all A/I way out from most things!", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r363798981", "sub_review": {"Location": 2, "Sleep Quality": 1, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "5 star let down", "review": "We returned to Turkey for a holday after a few years  We have visited Turkey for over 20 years. This hotel looks very impressive and our room was lovely and very clean. Food the snack bar food is cold and the pizza chef couldn't keep up. Restaurant was very busy and seating was a problem we were told not to sit at certain tables because of a party but the waiter had his favourite guests he wanted. Food again cold the water baths under hot dishes not switched on . It was chicken and chicken and chicken.                                                   Bar service pool bar couldn't cope lobby bar found it difficult too. We had difficulty getting served at pool and lobby bar. 2 probs not many staff speak English we started ordering in German. There was also a problem getting…", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r362296740", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Still so far", "review": "About this hotel is that: the new hotel but with problems that maybe related to lack of proper management. Everything in the room are excellent but the staff all non-professional, WiFi so bad, not so lovely staff behavior,terms of location of so far the city, very wrong at the reception  for exampel for me and my wife have considered two singel beds. If for a week stay this hotel the food are very repetitive that you are prefer to not eat. Swimming pool is not warm .( in march)  Summary perhaps the next time will have a 5 stars hotel of this standard hotel stars but still so far.....", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r358536477", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Not bad not good as expected!", "review": "The hotel was new, and has good decoration. We went there March 2016 for  Nowrooz holiday.  The rooms doesn't have suitable blanket, so you feel cold throughout the night in this season! Moreover, bars, lobby , halls and every where that you can imagine was so cold because there was not any air conditioner system. I was too far from Antalya about 1 hour. Also far from Manavgot, about 40 min. There was not any free shuttle bus from hotel to Side, Manavgot or Antalya. Actually for going to Side or Manavgot with Paying 3 lire to dolmush is accessible. Also with paying 14 lire to bus from manavgot  You can go to Antalya. If you want to accommodate near Antalya, this hotel is not good option. But for relaxing and visiting the historical place of just Side, it would be ok. At the end,…", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r358482798", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Fun & Luxury ", "review": "I was at the hotel with my family including  my husband  & my two kids. We stayed at a family room with view of the river. All the rooms in the hotel have great view in their own way - pool or river . Also beautiful seaside view for pool side rooms which was 5 minutes walk right in front of the hotel in special stoned sidewalk . The pool was big and pretty.  Indide pool wasn't warm enough because of the weather in march, and the fact that inside pool doors were not automatic so the cold weather wouldn't let the water to become warm but we used inside and outside pools anyway.  It was great pleasure to use the waterpark even in cold weather of march.  Another interesting thing was the animation group. They were so friendly like all the staff in the hotel. They amused children…", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r358201781", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "nouroz holiday visit", "review": "considering the price and also the fact that the hotel is super new, I can say it's pretty great, great food, great design and decoration,... the staff are friendly and u will certainly hear from this hotel more in the future because it has great potential. the problem is that the location of this hotel is pretty far from some attractions of antalya and It takes at least 1 hour to get to bigger cities around. facilities are almost complete ( almost anything u expect from a 5 star luxury hotel)", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r357887003", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "not ready", "review": "i was there on june 2015  the hotel was very beautiful and was new and clean . all members on all parts of hotel were try to startup hotel because of this many of guests were on trouble . the pool and bar and food was excellent  . beach was 5 minute walking but clean with a good bar and restaurant .", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g297968-d8690499-r328330857", "sub_review": {"Sleep Quality": 4, "Rooms": 5, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 4}]