[{"title": "Nice hotel near Orlando airport ", "review": "I love to stay in holiday inn Orlando airport nice location and very friendly staff members also the location is very nice near by shopping area hotel and hotel provide shuttle service from airport  The room is very big with bath tub and also nice view  I love to stay here such a lovely hotel ", "date": "November 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r725245881", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Great Customer Service", "review": "Stayed here recently on a stopover. Hotel is in a great location and offers a very handy airport shuttle service. I was especially delighted by the great customer service on the front desk..they were all very welcoming!! Kalista was extremely officiant and friendly. My only negative was that the food could be better.", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r722123967", "sub_review": {"Location": 4, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Good for a quick stay", "review": "This hotel was recently renovated, so it is very nice looking. The room was very conformable and had nice details. I was close to the elevators and it was a bit noisy at night. There's a large pool, hot tub, and gym outside and hotel restaurants for any time of day. It's very close to the airport and they offer shuttles, but get there early to get a seat!", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r722044686", "sub_review": {"Value": 4, "Location": 4, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Short but nice stay", "review": "Amazed how big this property is and close to the airport. I asked for a room with a pull out sofa bed during my online reservation and upon checking in, the request was accommodated well.   Lots of parking.  There's an outdoor pool but didn't have time to use it.  Breakfast was okay and servers were courteous, always asking what else we need from a coffee refill and making pancakes. So giving them a tip didn't bother as they deserve it. Though there was a little confusion as we have 12 year old kids and at the desk we were told they were free but were told should be 11 years and below upon arriving at the dining area. But still, they accommodated are kids to eat free.  Room is clean and with a good view from the 7th floor. Bed was comfortable and with a nice wide TV.  Bathroom is spacious with a walk in shower.   I won't mind coming back here if i'll be in the area again.…", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r720132757", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "8 day business trip.  No 'real' complaints.  Good place to stay.", "review": "We picked this hotel due to being close to the airport and the number of food options within short walking distance.  The room and bed were adequate, but the A/C didn't really keep the room as cool as I would have liked.  Parking was easy, but 10$/day.  Check In/Out was easy.  I would avoid buying drinks at the bar.  They are pretty expensive and there are many places within a 5 minute walk to go have a drink.", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r719462330", "sub_review": {"Sleep Quality": 3, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Husband and I stayed here the day before we flew home.", "review": "Everyone was very nice and very helpful. We enjoyed a relaxing evening at the hotel and enjoying the bar area and big screen TVs. Shuttle to the airport was very prompt and dropped us off right where we needed to be.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r716825979", "sub_review": {"Location": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Exceeded Expectations", "review": "I stayed here for three days while attending training close by. I had stayed at about every other hotel in the area over the past 15 years of annual recurrent training.   This by far was the best in terms of accommodations , room , staff , dining.  The room was top notch, breakfast was fresh and changed every day and all employees were very customer service oriented  I would definitely make this my hotel of choice next year", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r711669792", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Happy 45years to Lena Bartender", "review": "Wanted say happy early 45 years to Lena at the bar on 9/11/19!! If you ask me, that is ONE dedicated employee!! She is one of the very best!!  Has always been dedicated employee and all her guests LOVE her.  Not many people can even stay at job for more than one year. So this is huge milestone! Happy anniversary!!", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r708083013", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "overpriced", "review": "Billed for parking when I had picked the parking and room package which includes self or valet parking-had front desk remove from bill. My room rate jumped from $106 to $136. Questioned front desk at check in amd was told the rates go up this time of year-really during hurricane time? The restaurant was terrible-poor service and took forever to get food-waited 20 minutes for a salald!!!! The couple at next table waited 40 min for 2 hamburgers and was not comped a thing and in my opinion the staff was somewhat rude. Ordered vegetable tempura 2 nights in a row and was told did not have-also ordered green beans fried and was told did not have-rerally.    Since the remodel it has gone down hill and is to me very uninviting-the bar is not a bar as we would know it-its a long slab…", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r707783775", "sub_review": {"Location": 4, "Rooms": 2, "Service": 2}, "travel_purpose": "", "rating": 2}, {"title": "Hurricane evacuation ", "review": "Hi! fdcphc,  Thank you for looping us in your experience at the Holiday Inn Orlando-international Airport.    We promise to bring the joy of travel for all and I'm glad that you found our location accessible to where you need to be on this visit.   I read about the slow service at the restaurant, the pets around the dining area, and the bar that made you felt uneasy. I also regard the unpleasant behavior of the staff. I'm sorry about your dismay. IHG sincerely cares about your experience, and what you described certainly isn’t what we want for any guest. Moreover, the parking charge also baffled me since you said you booked the rate with parking (valet & self-parking). Can you please send me your reservation details for me to look into this. Kindly include: your IHG Rewards Club member# (if a member), full name on the reservation, confirmation# (if any) arrival & check out date, name of the hotel and location.  I'll be waiting for your response, and I hope to share the joy of travel on your next stay and make the value of your experience worth it for all the right reasons.   Warmly,    Jeraldine R.   Case Manager   IHGService  ", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r706611348", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Morning Front desk lazy and airport shuttle issues", "review": "I have stayed at this hotel three times now.  Rooms are nice but each time the airport shuttle has been a problem.  It fills up quickly and once it’s full you have to wait 30 minutes for the next one.  One poor lady was worried about missing her flight and the front desk was like oh well.  No, they should have paid for an Uber.  The air was broken the night before and this morning again on the shuttle.  Of course front desk lied and said it was working.  I asked about an accident I heard on news stopping traffic from going to airport, first from my room and they were to contact me and didn’t, then again when I went to desk, took until driver came back 15 min later to find out.  Isn’t that why they have radios?  The lack of professionalism at morning front desk is ridiculous. …", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r700628440", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Excellent service", "review": "Dear larryandjayne,  Please accept my sincerest apologies for the problems you encountered during your recent stay with the front desk team. We certainly fell short of delivering the guest experience we strive for. I have shared your comments with my Front Office management team and rest assured, immediate corrective action has been taken to correct the service issue you mentioned. I hope that you will give us another chance to prove ourselves and show you why we take great pride in the service we provide to all our guests, every day. Please join us again soon!    Bob McCoy General Manager", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r700495107", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great place to stay near the airport", "review": "Lena was amazing. She was extremely accommodating and made us laugh. We loved having her serve us and I hope she gets recognized for how wonderful she is. We need more people like her in the world!!!!", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r693916775", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great Resort style hotel near the Orlando Airport", "review": "Dear Megan B,  It was wonderful to read your comments, especially about the impact Lena at the bar had on your recent stay at the Holiday Inn Orlando - International Airport. We know that our service and hotel amenities set us apart from our competitors so I am happy to hear that [name of staff] was able to personalize your experience, leaving you with a lasting impression. We appreciate your business, and I hope that we have the opportunity to exceed your expectations yet again on your next stay.  Bob McCoy General Manager ", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r692651216", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Clean, Affordable, and super close to the airport", "review": "I stayed here because my airline canceled out flight and I was given a hotel voucher and meal vouchers.   I wanna say a huge thank you to manager Matthew. Me and my family were dealing with canceled and delayed flights spending 10 hours at the airport. No luggage.  He put me at ease when I was checking in. My hotel vouchers were getting declined for payment and then my meal vouchers were doing the same. He checked me into the room and gave me credit for my vouchers. He said he would deal with the airline. He made us the priority and getting us into a room. This was huge to me. He made a nightmare of a day better by his attitude and kindness. If you read this Matthew thank you again!  Restaurant has good food. That chipotle dressing from the cob salad is amazing!! Bar has a cool…", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r692621568", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great start! ", "review": "Spent the first night of our 3 week holiday here.  Great location, just minutes from the airport and surrounded by numerous bars and restaurants, all within easy walking distance.  Our room was modern and very clean. It was also very quiet even being so close to the airport. We had a great nights sleep!  Bar area is nice and reception staff are friendly and polite! Pool also looks good.  Didn’t eat in the restaurant so can’t comment but Denny’s is directly across the street and we had a great breakfast there. Only issue was a powercut the next morning but the hotel got the generator on and power was soon fully back on!  We normally stay across the road at the Doubletree but I think I would come back to the holiday Inn next time!!", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r692393979", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Restaurant service", "review": "Dear karengshropshire,  I sincerely appreciate your glowing review of our hotel. I am particularly pleased that that our location was so perfectly matched to your needs. We get great marks for our excellent location — just a few minutes drive or shuttle to the Orlando International Airport, not to mention Walt Disney World Resort, Universal Orlando, and Sea World. And all the excellent shopping and dining choices downtown Orlando offers. Our location truly sets us apart, and we're glad you were able to take full advantage. Please visit with us again soon, with so much that Orlando has to offer, I'm sure you'll be able to find something fresh and exciting.  Bob McCoy General Manager ", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r688774670", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Very impressive hotel with one exception", "review": "We were on our way from Leesburg to Toronto and found a great place to say.Our room was clean and comfortable. Staff made our meal experience very pleasant. Spencer  provided a special breakfast time.Food was great!", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r687910581", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Front desk service", "review": "Dear Pathfinder725707, I sincerely appreciate your glowing review of our hotel. I am particularly pleased that that our location was so perfectly matched to your needs. Our location truly sets us apart, and we're glad you were able to take full advantage. Please visit with us again soon, with so much that Orlando has to offer, I'm sure you'll be able to find something fresh and exciting.  Bob McCoy General Manager ", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r687339897", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Texas Hold'em Poker Tours - Main Event June 2019", "review": "Clean, comfortable, convenient all that could be expected. Was disappointed that restaurant closed at 10 when there were probably 15 folks checking in from the airport. AND the shuttle driver, for some unknown reason,  had us walk from A terminal to the B terminal. When challenged by my wife, he admitted the hotel picks up at terminal A also.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r687039328", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Friendly and Comfortable", "review": "Greeted and made welcome by Marta at the front desk. Check-in was easy! Lena went out of her way to provide drinks in the bar area to us though we sat on the back couches to see the 25 multi-tv screens behind the bar full scale. I would highly recommend staying here. The room was cleaned perfectly and was well equipped with a Keurig and mini- frig. The a/c ran effortlessly. There were many charging ports for the phone and the cable included many channels including HBO The shuttle to the airport was included but we did have to pay for the shuttle to the port from the airport. We were not informed when booking the room that the shuttle from the hotel to be airport had to be done at least 3 days in advance and was not an option provided by the hotel. I blame this misunderstanding…", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r683815830", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "We love Lena at the Bar!", "review": "Dear Leslie L,   Thank you for such a positive review! I'm pleased you found all of our associates and amenities so much to your liking here at the Holiday Inn Orlando Airport. We take great pride in every aspect of our service and facility, and it's always enjoyable to hear that our guests  loved their stay with us. We certainly look forward to extending our hospitality again soon.                                                                                                      Bob McCoy General Manager ", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r683812605", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Morning service", "review": "Lena was so personable at the bar area!! She came to us and offered to make us a drink. She was so pleasant and made our experience delightful! If you get the opportunity to come to the bar in the Hotel go see Lena and order the Bahama Mama ❤️😍", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r681646319", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Amazing morning crew !!!!", "review": "Dear Pokiejoe11,  I appreciate the kind words about your stay, especially in regards to Lena at the bar. We take great care to only select the best possible team members and I'm very glad they met and exceeded your expectations. Please visit us again soon, we look forward to impressing you once again.                                                                                                                                                                Bob McCoy General Manager", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r681646117", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Updated and pristine hotel with a great staff", "review": "Spencer was the best service I had all day.woke up this morning to get breakfast and Spencer gave me more he gave me good laughs along with a good time👍👍👍👍👍altogether spencer to me feels like the next Kevin Hart.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r681568773", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Thank you", "review": "The front desk clerk, supervisor, was charming and helpful. I wish i had gotten her name to thank her personally for a good stay. She is an asset to your property. Any future visits will be staying here.", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r678577182", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Perfect before a cruise", "review": "Dear Robin O,  I appreciate the kind words about your stay, especially in regards to our front desk and supervisor team member. We take great care to only select the best possible team members and I'm very glad they met and exceeded your expectations. Please visit us again soon, we look forward to impressing you once again.                                                                                                                                                                Bob McCoy General Manager ", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r676585694", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Service ", "review": "We got into Orlando late evening prior to catching a cruise out of Port Canaveral. Called for the hotel shuttle as soon as we got the luggage and it was there  after about 10 minutes. This was good as we were tired after our flight delays. Check-in at the hotel was smooth and quick. The room was clean, quite large and fully renovated. The bed was comfortable and the bathroom clean and well stocked. The wifi in the room was very fast. Next morning we went for breakfast and the staff there were so friendly and helpful. Their buffet breakfast is a bit above the normal HI and reasonably priced. Went for a short walk in the area and noticed there are a number of close restaurants. Our Cortrans shuttle for the cruise terminal stopped at this hotel and was on time. I'd say this is a…", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r674686398", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Front desk", "review": "Dear bjay3,  Thank you for the great review and comments, it was a pleasure to hear how much you enjoyed your stay. I'm glad you mentioned the convenience of our airport shuttle. We recognize that the majority of our guests are coming from the Orlando - International Airport, and we couldn't be more pleased to offer complimentary transportation. It just makes things easier. Please join us again soon!  Bob McCoy General Manager ", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r674656350", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Excellent Staff and Service", "review": "Overall good experience happy with the bartender at the lobby LENA she was amazing had great time catching up at the bar .! She really good at her job hope this hotel recognizes the hard work that she puts in everyday . Best thing about her is she smiles at all the time !. ", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r674032128", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Quick visit", "review": "Unfortunately my flights didn’t go as well as i planned so I couldn’t really fully enjoy all this hotel offers. Lobby is beautiful. Front desk staff quick and attentive. Very comfortable beds and coffee in the room ", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r673138330", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Great Property and staff- Lena deserves a raise.", "review": "Dear 957tamiz, Thank you for such a positive review! I'm pleased you found all of our amenities so much to your liking here at the Holiday Inn Orlando Airport. We take great pride in every aspect of our service and facility, and it's always enjoyable to hear that our guests  loved their stay with us. We certainly look forward to extending our hospitality again soon when you can stay longer.                                                                                                      Bob McCoy General Manager ", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r672786018", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Excellent staff", "review": "I have stayed here before the renovation. The property is modern and the staff was amazing.  The bar was a great place to hang out after a long day. Lena the bartender had a full house and handled it beautifully.  We never had to wait for anything. I travel a lot and am a spire member. I dont write reviews often but this one was well deserved", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r671352186", "sub_review": {"Location": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Beware of additional charges", "review": "Dear Flupthree,  Thank you for choosing our hotel again while staying in Orlando. We appreciate the comments about Lena at the bar and for taking the time to write a review. As always, we appreciate out Spire Elite members and we thank you for your loyalty.   Regards,  Bob ", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r667288863", "sub_review": {"Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Pleasantly Surprised", "review": "Hotel was very nice. Close to the airport. Restaurants everywhere around the hotel. Clean room and front desk agent Marelix was amazing. She should be everywhere in that hotel. She couldn’t have been more accommodating. Extremely friendly and had us checked in quickly. I can’t say enough good things about her. Made sure we all had water and gave our little travelers snacks to hold them over until we had a late dinner. She was great.", "date": "February 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r665903262", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "One night stay", "review": "Stayed here for one night and was fairly impressed! Check in was smooth and the room was clean Had dinner in the Bistro bar and gotta stay the NY strip steak I had was awesome and cooked to perfection! Would recommend this hotel as the price was right and it’s really close the the airport ", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r664786534", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Very poor customer service", "review": "Dear 0Gman0,  Thank you for such a positive review! I'm pleased you found all of our amenities so much to your liking here at the Holiday Inn Orlando Airport. We take great pride in every aspect of our service and facility, and it's always enjoyable to hear that our guests  loved their stay with us. We certainly look forward to extending our hospitality again soon.                                                                                                      Bob McCoy General Manager ", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r664611167", "sub_review": {"Value": 3, "Cleanliness": 2, "Service": 1}, "travel_purpose": "Traveled on business", "rating": 2}, {"title": "Poorly managed, much needed upkeep", "review": "I don't remember writing a bad review before but there is always a first time.  I picked this hotel because it is just 4 miles from Orlando Intl Airport and offers a free shuttle to the airport every 30 min.  I stayed one night and left my vehicle for 5 nights at the hotel when I came back from an international trip I called the hotel and talk to the driver and told him I was at the pick-up location, he said he'd be there in 10 or 15 min.  After 20 min I called again and this time I talked to somebody at the reception and again to the driver, he said he'll be there in 10 or 15 min, after 20 min I called again and this time I requested to talk to the General Manager and they put me on the phone with Mathew (don't think he is the GM).  Mathew said that the shuttle will be picking…", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r664188767", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Gold member", "review": "Hi SavyViajero,  Thank you for choosing us. Our aim is to please each and every guest throughout their stop. I am aware that the delayed shuttle service cause frustration during your visit and I apologize for the inconvenience. Our hospitable staff takes pride in showing exceptional service with the attention to detail and I am sorry we fell short this time. We aspire to be efficient while you are with us and let me assure you that your comments will be used as a guide for improvements. I have alerted the proper departments to take steps in dismissing the issues. I have also alerted our shuttle coordinators to address the mishaps with the scheduled trips and I am positive proper actions will be done to fix the concern.   We would very much like you to return to our hotel to give it another chance so that we may turn around your initial impression.  Happy to assist,  Clarisse S. Case Manager IHGService", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r664099102", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Great Service", "review": "Probably the worst Holiday Inn I’ve stayed at in quite some time ... and I’m ambassador / spire member.  Seems to cater to cruise ship workers?  Bad check in experience, rooms and property needs cleaning and upkeep ..", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r662966978", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Affordable High-Class Feel", "review": "I stayed at this Holiday Inn from March 19-23. This Holiday Inn seems really focuses on producing a high-class feel without gouging ones wallet. The valet, the front desk staff, and Lena (behind the bar) all gave fantastic service.  The only reason I don’t give 5 stars is because the walls are very thin. I will never look at Delta Flight Crews the same after four nights in a room next to them... 😳", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r660627617", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Big things done right; little things...less so", "review": "Dear IowaTravelsWell, Thank you so much for being our guest and for sharing your experience. I was delighted to hear that you thoroughly enjoyed your stay at the Holiday Inn Orlando Airport. We love making our guests feel at home and it's wonderful to hear that we accomplished that goal. Thanks again for your comments and we hope that you'll stay with us again very soon!", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r658889665", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Awesome Hotel!!", "review": "My experience at this hotel has generally been positive, since they do get the big things right: my room is clean, the bed is comfortable, the amenities are well-maintained, and the property is updated.  However, those positives are balanced somewhat by numerous micro-inconveniences.  For example, I was not offered a room upgrade, though I am a platinum elite club member. I was given a \"welcome gift,\" but it was on the cheap side (water and Fritos). I complained that the painting that was happening across the hall gave off headache-inducing fumes and my room was quickly moved, but I was not offered any compensation for my inconvenience ( I had to re-pack all my belongings and move two flights). My keys suddenly stopped working after two days (fixed quickly), and my room was not…", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r657881397", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Average Hotel", "review": "Dear ProfFab,  Thank you for being our guest and also for sharing your experience. I understand there were several issues with your stay, I'm sorry we were not able to meet your and our expectations for excellent guest service. While it saddens me any time a guest has a less than stellar experience, I am grateful that you took the time to explain the problems you had so that they can be promptly remedied. I've personally shared this review with my management team -- I'm confident that the points you mentioned can be quickly remedied. Please, do join us again soon when your travels bring you to the Orlando area. ", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r656654922", "sub_review": {"Sleep Quality": 3, "Rooms": 3, "Service": 3}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "It's low rating (213/354) is deserved", "review": "We had a great stay. The staff was friendly and helpful. The room was very nice. Big TV in the room, comfortable bed, big shower,very nice lobby area with restaurant. I have no complaints. Great location as well.", "date": "February 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r655846196", "sub_review": {"Sleep Quality": 1, "Cleanliness": 1, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Breakfast", "review": "Anastascia gave me an excellent service in the breakfast every day that i was in the restaurant of the hotel , people there are very kind , good people on the hotel , the food was really good and delicious", "date": "February 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r654987678", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Excelent hotel, very friendly staff", "review": "Hi julioalvan,   Thank you for reviewing your recent stay at the Holiday Inn Orlando Airport. We appreciate your comments and especially the shout out to Anastascia about the great service. Please come see us again soon!  ", "date": "February 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r654976474", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Overnight After Flight", "review": "The hotel is really good, the staff is friendly and helpfull, and I had a good experience with mr. Joel an excelent host, very proactive and experienced.   Breakfast is plenty and tasty, well made, room is clean and confortable, wonderful.", "date": "February 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r654279565", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Fine for what it is", "review": "Hi David G,  Thank you for the great review and for letting us know about the service you received from Joel in the restaurant. We appreciate you letting us know how we are doing.   ", "date": "February 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r652359287", "sub_review": {"Value": 3, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Hotel needs some help", "review": "We had a very pleasant stay here. Rooms were quiet and a good size, and the bar / restaurant had a good selection of food and drink ( including craft beer). Checking in and out all very straightforward, and the front desk were very helpful with a problem we had with our hire car. We also made use of the outdoor heated pool and jacuzzi. One thing I would advise, is to wear something on your feet in the rooms. Our flooring was stained wood, and our feet looked dirty after walking around in bare feet. Other than that, no complaints and would return again.", "date": "February 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r651346523", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Holiday Inn on Business", "review": "Orlando is a regular destination for me, and this was my first stay at this (recently refurbished) Holiday Inn. The location is close to the airport, includes a beautiful outdoor pool area, is close to the usual chain restaurants and basic retail. The hotel room was comfortable, the staff were friendly, the food was moderate, but various services at the hotel we’re clearly short-staffed. Not sure I’d stay there again as my overall experience didn’t quite measure up to the cost of the room.", "date": "February 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r651086441", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Ripped Off", "review": "Dear CasMonaco, Thank you so much for your feedback regarding your recent stay. I am very sorry that your guest experience wasn't perfect. We truly take pride in our guest service, so thank you for pointing out a couple of things that you liked about the hotel and its amenities. I'm terribly disappointed that your overall experience was less than expected. We thank you again for your comments and feedback and would certainly invite you to stay with us again. ", "date": "February 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r650912918", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Great place", "review": "My husband asked for a cab.  We were already in the vehicle when we discovered that the “4th level of Uber” — something unknown to us — had been called. We were charged $50 for a short trip that should have cost under $20. We suspect a monetary reward to the bell staff for this ploy. Don’t be ripped off like we were!  Not happy.", "date": "February 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r650841279", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Lena is a rockstar!", "review": "Dear Dianeablonczy, I'm terribly sorry for the cab issue and will certainly address this with the valet team as I've never heard of a \"4th level of Uber\" either. I thank you for bringing this to my attention so we can have the opportunity to look into your comments further. Again, please accept our apology for this issue.   ", "date": "February 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r650794430", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "pre flight stay", "review": "After a tough day of flying in from DFW, heading to Orlando Regional Medical Center to help one of my guys, drive up to Daytona to meet with a customer and then drop his rental car off, Uber back to my rental, drive back to the hospital to get my guy. Drop him at his hotel as I got the last room at the HI, head to the bar.  Lena the bartender was awesome! Food was great especially near closing time.  Recommend the stay.", "date": "January 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r650379364", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great hotel - except the bathroom", "review": "Loved the location, the free shuttle to/from the airport, the sheets on the beds and the staff ~ every single one with which I came in contact was a rock star!  Only ding on the report card on this one was the bathroom. Zero counter space with a pedestal sink made getting ready in the bathroom a balancing act. Sad part was there was PLENTY of space in the room to have AMPLE counter space yet - nothing but a wide open space.   Unless this room (#131) is an exception, I wouldn't stay here again...yes, the bathroom setup up IS that important to me. And, yes, I am a female with lots of \"stuff\". So if you're someone that requires nothing more than your toothbrush and a shower - you're good to go!", "date": "January 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r647052033", "sub_review": {"Sleep Quality": 5, "Rooms": 3, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Lena would be the reason to return", "review": "Dear ITravel4Work365, Thank you for taking the time to give us such an awesome review about your stay. We certainly appreciate hearing from our guests. In regards to the bathroom vanity, yes in all ADA accessible rooms that is the standard vanity counter that is allowed to make the room ADA compliant. We have 17 rooms that have this pedestal style sink vanity and all other guestrooms boast a longer 72\" vanity counter. We would live to have you return and experience one of these rooms on your next visit. Thank you again for your comments. ", "date": "January 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r645042906", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent Hotel", "review": "Lena, the bartender was the friendliest staff member we had encounter with during our stay. We had food & cocktails with her. Food & drinks were great! Big hotel, clean hotel. Checkin staff, Super quiet, barely made eye contact with me.  I would return to have cocktails with Lena the bartender.", "date": "January 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r643408825", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Me and Mrs Jones", "review": "Dear skunkn12,  Thank you for being our guest and for the lovely comments about Lena that you mentioned in your review. We take great pride in our facility and amenities, but it is truly our staff that makes the Holiday Inn experience memorable. They work so hard to make every guest's stay as perfect as possible, and I really value the effort our team puts in every day and night. I'll be sure to relay your kind words. Thank you for recognizing their efforts and we look forward to having you as our guest again.  Bob McCoy General Manager", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r642721766", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Very nice Holiday Inn", "review": "One of THE best Holiday Inn’s, upon entering the lobby you don’t feel like you are in a Holiday Inn. Open plan spacious and the best layout I have seen at any Holiday Inn.  The rooms are spacious, recently renovated and the staff is very friendly. Lena at the bar is very graceful and she made the best virgin Bloody Mary I have ever had, it tasted divine.  The bar has an ice rail that keeps your drinks chilled to the last drop and also has a MASSIVE TV screen which i think is open to the public for viewing the games, I feel there is no better option for the sport guys.  Highly recommend this hotel and will surely go back especially for the Virgin Mary.  Sandwiches are great too.  Great rooms, good food, perfect ambience, ample parking and spotlessly clean what more would you ask…", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r641157145", "sub_review": {"Location": 4, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Great pre-cruise hotel!!", "review": "We were promptly greeted at the airport by the shuttle service and taken directly to the hotel.  When we arrived we were greeted by very friendly front desk staff who advised us where we could grab a quick bite or a snack.  Upon arriving in our room, we were pleasantly surprised by the quality of the room furnishings.  Everything was very well done.  Nothing gaudy or out of place and exceptionally clean! The bathroom was gorgeous!    Most important, the bed was a dream!  Super comfortable mattress and pillows.  My only complaint would be that the sheets were tucked in so tight at the bottom that I couldn't kick them loose when I needed to stick my foot out!!  lol  (you get it right?  too hot, too cold, just right!)  There is not a complimentary breakfast so we just enjoyed a…", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r640221412", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A nice spot near the airport", "review": "Dear Colleen L, I appreciate the kind words about your stay, especially in regards to our room furnishings, shuttle service and breakfast. We take great care to only select the best possible team members and I'm very glad they met and exceeded your expectations. Please visit us again soon, we look forward to impressing you once again.", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r639130459", "sub_review": {"Location": 3, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Good quality hotel near the airport", "review": "Overall, a nice hotel. It is a little old and is showing signs of age. The A/C in the room is an old style window unit that in my room groaned all night. But, it does look like they have updated and refreshed carpets and floorings recently. The lobby is nice and has a very large an open feel to it. It also has a restaurant and bar as well as as a pantry in case you need some snacks. And, of course, being close to the airport you will hears planes! They do charge $10 per night for self parking. A basic Holiday Inn but I would certainly return.", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r638506582", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Marelix)", "review": "Hi robert k,  Comfortable accommodations is our forte and I'm concerned to learn about the noise coming from your in-room AC. The inconvenience this caused and your observation about our upkeep are not what we expected to hear. Your feedback is important and be assured that this is shared with the management so we may promptly address areas that need improvement. On the plus side, it's great our hotel's convenient location, refreshed facilities, and F&B service are to your liking!  Thanks for choosing to stay with us and for the candid review. We'd love to welcome you back for a more stellar experience on your next visit.   Until next time,   Jillian I Case Manager IHGService", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r638191391", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "FL winter vacation ", "review": "A very good quality hotel very near the main terminal at Orlando International Airport. Very easy to find the mini bus transfer point and only 5 mins away. Although close to the airport, very little aircraft noise. Usual standard of quality for a Holiday Inn. I would use this hotel again without question. The staff were very welcoming and helpful.", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r638028595", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great airport hotel", "review": "I’m an intercontinental group member so to get points for future European travel I try to use hotels affiliated with that brand.first of all we came from Disney had very early flight out so criteria was near airport,close to Alamo drop off and bring us to airport.as well as good price nice hotel in safe area...I really never stay at holiday inn I mostly do Hilton brand..I was very pleased with this hotel with one exception which almost had me not going there..I called hotel directly got sent to reservations..first gal was fine but my call was dropped.called back told the man here’s the date,now,etc price she gave me etc..he had very strong accent and I don’t think he understood me even when I spelled things out! After 15 min of getting nowhere...I told him the quoted rate he…", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r637117723", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Awful service", "review": "Dear europeantraveler1953,  I'm so glad you joined us here in Orlando, and equally pleased you wrote such a positive review. I'm glad your stay was comfortable and that you loved how spacious and functional your upgraded room was. We want all of our guests to experience the Holiday at its best so it's great when we hear comments such as yours. We look forward to many more visits from you. Thank you and safe travels!  Bob McCoy General Manager  ", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r636933107", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "Just what you don’t need after 24 hours travelling", "review": "Stay started off nicely with a timely shuttle from the airport and a nice shuttle driver. It quickly went downhill from there...waiting in line (10 mins) to check in and there were four agents behind the desk, only one of them checking guests in? One was just answering the phone and the other two were chit chatting. Finally got checked in. Once we got to the room the housekeeper was still cleaning and on her cell phone in front of our door. We got recommended the Italian restaurant across the street...it was awful and overpriced. When we returned to the room we noticed our TV remote wasn’t working, we called the desk and they said maintenance would be right up...never came. We had to call room service four times to get someone to answer...only to be told that the menu provided…", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r636099117", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Overnight stay close to the airport", "review": "Dear 846kaitlinh,  Thank you very much for being our guest and for also for sharing about your experience. Please accept my sincere apology for the lack of attention from our staff during your stay. We failed to live up to your service expectations and our own standards. Please be assured we are taking immediate action to prevent this from happening again and I have shared your comments with our department managers to come up with an action plan for better training of our staff. We appreciate your business and would welcome an opportunity to restore a favorable impression the next time you are in our area.  Bob McCoy General Manager ", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r635191077", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Conference & Banquet Manager", "review": "After a horrendous length of time getting through Orlando immigration, we were very ready to get to our hotel and to bed. That wasn’t going to be easy at this hotel! I had phoned before we left the UK to ask about the airport shuttle, we were advised that we were just to phone once we had collected our luggage at the airport and the bus would be with us shortly. So, on getting our bags, we phoned and were told which stance to wait at and a bus would be with us shortly. 40 minutes later a bus appeared. Already half filled with people and with 6 in our party and a few people waiting before us, we were told we would just have to wait for the next one. Great. So over an hour later we arrive at the hotel. The bus driver was very nice though. We get to reception, we were asked our…", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r633845767", "sub_review": {"Location": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Excellent service!", "review": "The hotel was nice, but the staff and service is what stood out most! They were friendly, accommodating, and very helpful in helping us navigate throughout the hotel and surrounding restaurants/attractions. Marelix at the front desk was excellent and made us feel right at home.", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r632826798", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Went the extra mile!", "review": "Dear Discover18707626260, I appreciate the awesome review about your stay, especially in regards to our staff in particular Marilex. We take great care to only select the best possible team members and I'm very glad they met and exceeded your expectations. Please visit us again soon, we look forward to impressing you once again.                                                                                                                                   Bob McCoy General Manager ", "date": "November 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r632395184", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great stay, mostly flight crews & business travelers", "review": "We ended our Disney Cruise with my husband having a horrible head cold. We were not flying out until the following day. Had reservations for 1  night stay at Holiday Inn Airport Orlando. They allowed us to check in at 8:30 AM. My husband slept all day and all night. Up and ready for our flight back to Texas!  Thank you!", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r629706181", "sub_review": {"Location": 4, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Girls trip", "review": "Dear Vicki L, Thank you so much for being our guest and for sharing your experience. I was delighted to hear that you thoroughly enjoyed your stay at the Holiday Inn Orlando Airport and we were able to get you checked in ealry form your cruise. I hate to hear that about your husband, however we are glad he was able to recover quickly.  Thanks again for your comments and we hope that you'll stay with us again very soon!                                                                                                    Bob McCoy General Manager ", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r628606157", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "The best holiday inn I have stayed at", "review": "Good stay, good gym.  Great remodeled bar.  Lena the bartender is friendly and very helpful.  Common/bar area has been redone lately.  Flight/travel info screen with flight times is helpful.  Crowd is mostly business travelers and flight crews.  Laid back atmosphere.  Will stay here again.", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r627072464", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Good Amenities - Room Not so Great", "review": "Flight was cancelled and stayed just one night here. Pluses - about a 7 min shuttle from the airport, good breakfast, and fun decor in lobby, small fridge in room Cons - bed was uncomfortable (although nice touch with a choice of firm or soft pillows), room did not seem very clean, no microwave, and loud mechanical sound cutting in and out in room Would not likely stay here again unless the price was really good.", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r624549637", "sub_review": {"Location": 4, "Cleanliness": 3, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Early morning flight", "review": "Dear Tiffany H, Thank you so much for your feedback regarding your recent stay. I am very sorry that your guest experience wasn't perfect and the bedding was uncomfortable. We truly take pride in our guestrooms, so thank you for pointing out a couple of things that were troubling about your stay. We appreciate you mentioning the pluses about your stay as well. We look forward to welcoming you back to experience our hotel the way you should have during this visit. Thank you again.  Bob McCoy General Manager ", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r624415614", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent service.", "review": "the room was super nice and best of all extremely CLEAN! Natasha and her team really made our stay enjoyable with making sure we had what we needed in our room. The hotel was just renovated and it looks great! we will definitely be back.", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r623473567", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Good Hotel, but its Shuttle Pickup from the airport is poor with unacceptably infrequent shuttles", "review": "Dear whispers420, I appreciate the kind words about your stay, especially in regards to our housekeeping staff led by Natasha. We take great care to only select the best possible team members and I'm very glad they met and exceeded your expectations. Please visit us again soon, we look forward to impressing you once again.                                                                                                                                                              Bob McCoy General Manager ", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r623236703", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Good Breakfast Service", "review": "Stayed here for a few nights and was extremely pleased with the service received by Noemi, Coral, Marielix, and Bria were all amazing help. All were extremely helpful on anything when I asked for help and would go above and beyond for me and other guests as well. The recent renovations look very good as well. The rooms were also very nice and clean always. Very attentive staff... 5 stars and would definitely stay there again.", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r622851552", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Don't stay here!", "review": "I stayed overnight for a connecting flight to Sydney.  The aircon was just  jet plane! I had to turn it off in order to sleep for my long trip home! Considering it was 90° outside, I awoke hot. Then, under the door, was an envelope for 'quick checkout'. Opening it,I found a bill for my night's stay. So at 6.45 am I dresed and went downstairs to see why I had been charged when Flight Centre had given me a voucher for my paid accomodation. The man on the desk, if you could call it that, could find NO record of my payment. He said my voucher had no meaning to him. For 15 mins he kept typing in numbers. I explained that my interner banking showed a debit from the Holiday Inn for my stay.  No. Didn't make any difference to him. I had ro wait 15 mins until his manager came on duty at…", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r622222779", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 1}, {"title": "Noisy Near Lobby", "review": "Hi ElizabethP3632,  I understand how frustrating it is to be faced with an unexpected situation. I'm sorry this happened when you checked out. I want to discuss your concerns individually and ensure that everything is sorted. I sent you an email to obtain additional information. I'll be waiting on you response!   I'm sure our hotel shares genuine concern for the challenges you were faced with and they will not fall on deaf ears. Again, thank you for stopping by.  Kind regards,  Anna R Case Manager IHGService", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r621896244", "sub_review": {"Location": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Holiday inn", "review": "I stayed here one night to catch an early flight. Close to airport is a plus. Lot of flight crews checking in and out while I was there. Room was nice and clean. Only complaint is that my room was close to the elevator and the hallway there is open to the lobby. The lobby is very large and is multiple stories tall. This caused an issue with noise, which was made worse by the fact that my door did not shut tight. Recommend requesting a room away from the lobby.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r618799508", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Excellent", "review": "Hi JJM73,  Thanks for choosing to stay with us. Comfortable accommodations is what we consistently aim to provide. Sad to say that this was not met during your stay, issue with the door not being shut tight allowed noise from outside into the room. This is not good. Certainly, this is not the impression we would want to leave our guests. Your thoughts have been taken into account and will be used for further improvement. We hope to see you soon.  Many Thanks,  Ronald R. Case Manager IHGService\t\t", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r618799427", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Accommodating", "review": "Good day, L stayed in holiday inn orlando florida for almost 8 days and i really enjoy my days spending in the hote, Most especially when it comes to restaurant service OMG is owesome Mr. Joel always take care of us every time were having breakfast his so friendly , attentive and approachable , and Ms. Mallany shes so Caring she make sure we serve us right drinks and check us every minute if we had a great breakfast experience. Only the restaurant it self is amazing and the waitre's , I haighly recomend this hotel .. God Bless", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r618412599", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Pre cruise accommodation ", "review": "An August 17 dissatisfactory stay and I usually like HI.  I usually book places for a complimentary breakfast which this location does not have. I put that down on my list because was willing to wait since had an early cruise boarding to have lunch.  Main booking reason this location was recently renovated and they advertised new beds.  My second reason was I read that they offered transportation to local businesses.   I was somewhat disappointed before even arriving to this location.  Their best price guarantee is a joke!  The main site should state 24 hours within booking.  I booked early on June 13 at a $96.90 pre taxed rate.  On July 23 I found a rate of $74.10 on their own website that I tried emailing and would not receive any difference.    Here are my suggestive…", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r618384416", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Thanks Lena!", "review": "Hello JSwizer,  Thank you for your stay and for taking the time to leave us feedback. I am sorry to learn about the issues encountered with the staff service received. Along with your observations about the shuttle service, your comments have been shared with the hotel staff and management team as reference to improve the services offered.   As for IHG's Best Price Guarantee, note that Terms and Conditions do apply, see https://www.ihg.com/hotels/us/en/customer-care/lowest-internet-rate-terms-conditions.   I appreciate all your suggestions. These will surely be considered towards our efforts to constantly become better with what we do.  We hope to welcome you back!  Best regards,  Clayton G. Case Manager IHGService", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r616992372", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Only if a bed and proximity to MCO are what you are looking for", "review": "We were stranded in Orlando because of thunderstorms and weren't too happy. We ended up at this Holiday Inn and it was great. Beautiful room, and friendly help. Lena the bartender was great with the drinks and helped make our unexpected stay less frustrating.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r616630850", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Happy 44yrs Lena , The Bartender", "review": "Dear Jen Kramer K, I'm so glad you joined us here in Orlando, and equally pleased you wrote such a positive review. I'm glad your stay was comfortable and that you loved how spacious and beautiful the room was.  Clean, comfortable rooms with all the modern amenities such as free Wi-Fi, coffee maker, microwave, refrigerator and more is our top priority — we want our guests to be able to completely relax and feel right at home. We want all of our guests to experience the Holiday at its best so it's great when we hear comments such as yours. We look forward to many more visits from you. Thank you and safe travels! Bob McCoy General Manager ", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r615226547", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Unsatisfactory", "review": "This is my second time of staying at Holiday Inn in two months.  Unfortunately it did not impress me either.    Their shuttle came within 10 minutes, but it took another 15 minutes before heading toward the hotel.  Although its interior is updated, the design is not elegantly done and style looks cheap, too.  Since this hotel is doing business with Carnival, be aware that the check in process can be longer.  We got assigned to room 543, where is at the end of hallway.  I actually like it since there is less traffic and closer to the stairs.  The sofa bed only comes with 2 pillows and there was no blanket or flat sheet.    The worst part of this stay is the AC unit.  The temp is now set at 61 degrees, but I still cannot sleep under the comforter.  If you are a polar bear, you may…", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r614800514", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Lena at the bar is amazing ", "review": "We checked in last night because we had a super early flight out today.  We went to the lobby bar to have a nice drink before bed.  We met Lena.  She is amazing.  Fun and easy to talk to.   We enjoyed meeting her and her customer service is first rate.  ", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r614438192", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Whoa!  What A Great Remodel Job", "review": "Dear Vacation215327, I appreciate the kind words about your stay, especially in regards to Lena at the bar. We take great care to only select the best possible team members and I'm very glad they met and exceeded your expectations. Please visit us again soon, we look forward to impressing you once again.                                                                                                                                                             Bob McCoy General Manager ", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r612118291", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Nice hotel, spacious lobby", "review": "I stayed at this hotel years ago when I was working an assignment here in Orlando at the nearby airport. It was always close and convenient to the airport, with multiple name-brand restaurants within two blocks of the hotel.  It was always a decent hotel, so I thought I knew what to expect tonight when I arrived here. I was wrong!  This hotel has been totally remodeled from the lobby and reception area, all the way to the bedrooms. It looks darn good.  The lobby agent for nice, receptive, and friendly. I was able to get into my room in less than 5 minutes.  Here is what to expect.  New carpet, new furniture, multiple places to sit in the room, that includes a sofa, an office chair with table and another chair in front of a mirror.  The bed that I am lying down on is big and…", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r611566449", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Lena the bartender", "review": "Dear Lifetraveler1 Thank you for your fantastic five star rating of the Holiday Inn Orlando - International Airport. I was delighted to find that you found our recent renovation to your liking. Thank you especially for highlighting all the new amenities we offer. We know how convenient it is to have extra comfortable bedding and plenty of space! I'm sure your experience in Orlando was just as enjoyable as your accommodations at the Holiday, and hope to have another opportunity to host you again on your next visit.  Bob McCoy General Manager\" ", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r610657105", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Attentive and Energetic Emma in Holiday Inn Orlando Airport", "review": "This hotel was included in our Go Port Canaveral package.  We had 2 rooms and they were pleasant and clean.  The lobby, newly-renovated, was spacious and modern with large screen TVs and fruity ice water available.  The shuttle driver (from the airport) was very nice and friendly.  We liked having Denny's across the road for lunch.  Good pick-up from Go Port Canaveral at 10 am the following day.  Breakfast was for a fee, not complimentary.  A free breakfast would be a big plus.", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r608352067", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Beautiful hotel, but noisy", "review": "We booked this hotel through a package with Go Port Canaveral for an overnight stay for our cruise leaving the next day.  The location of the hotel from the airport, and port was good.  The appearance of the hotel was great.  Our room was clean and comfortable.  However, they only had one person at the desk checking in people, and a line of people were in the lobby.  Then another lady came to the desk, and starting doing something on the other computer at the desk, but still did not wait on anyone.  We were put in the first room in the hall near the lobby.  The lobby has a bar, and music going all the time.  There should have been a door to separate the lobby, and the rooms, but there was not so we heard music all night, and the music got louder like it turned into a club last…", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r607805964", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Holiday Inn, MCO Orlando", "review": "Dear Jennifer W, We appreciate your candid review. While I'm very glad you enjoyed most of your guest experience, I'm very sorry that everything wasn't quite perfect. The noise level in rooms close to the lobby can be addressed and we can look for a solution. We sincerely hope you'll join us again soon so that we can give you the perfect stay you expect in a room on the upper floors. Bob McCoy General Manager ", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r604824047", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Great Hotel and Comfortable", "review": "Great, friendly staff at front desk! Dinning experience was very nice, thank you Lena at the bar, you made it a comfortable and fun night. Nice beautiful and clean hotel, I was very impressed. If work brings me back out this way, I will most definitely be booking here.", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r604128839", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great service from Lena the bartender", "review": "Dear jtirres,  Thank you for such a positive review! I'm pleased you found all of our amenities so much to your liking here at the Holiday Inn Orlando Airport. We take great pride in every aspect of our service and facility and Lena at the bar is one of the best, and it's always enjoyable to hear that our guests loved their stay with us. We certainly look forward to extending our hospitality again soon.                                                                                                      Bob McCoy General Manager ", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r603672864", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Very Nice, Clean, Comfortabke", "review": "Excellent customer service. The hotel exceeded my expectations. Clean, nice, and comfortable.   We had to wait a little to check in. I just chalked it up to numerous people arriving at the same time. No big deal. The front desk did the best they could and were super helpful.", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r603268967", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Great Hotel at Orlando Airport", "review": "When our flight was cancelled we needed an overnight room at Orlando Airport.  All of the $100 to $110 dollar a night hotels were full so I checked the Holiday Inn Aitport Hotel, not to be confused with the Holiday Inn Express, and booked it through AAA at $134 for the night. The hotel has their own complimentary airport shuttle which picked us up right at our terminal. The hotel is located right near 6 different restaurant chains and has their own onsite restaurant, bar, pool, tennis courts and workout area. Pretty impressive for $134 a night. The room was very clean and comfortable and had a large in room refrigerator and large screen HDTV with cable. Free wi fi is also included. You could actually vacation for a few days at this hotel! A great choice.", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r602738376", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great bartender Brett", "review": "Dear djjohnz,  Thank you for such a great review! I'm pleased you found all of our amenities so much to your liking here at the Holiday Inn Orlando Airport. We take great pride in every aspect of our service and facility, and it's always enjoyable to hear that our guests  loved their stay with us. We certainly look forward to extending our hospitality to you again soon.                                                                                                      Bob McCoy General Manager ", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r600594415", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Holiday Inn International Airport", "review": "This was the absolute best place I've stayed! Brett the bartender was excellent! Best bartender around the Atlanta area. Very friendly guy! Wait wasn't long, always coming checking to see if we needed anything. Hotel is very clean and very friendly staff. Kids loved the pool and and a wonderful time here at sea world. Pool was very clean. Food was on point! Hot wings, burgers were great! Will be staying here again. Breakfast was buffet and off the chain.", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r600593794", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Holiday Inn, Orlando Florida", "review": "Thank you for taking the time to post such generous comments about our culinary team and especially Brett at the bar. It was terrific to hear how much you enjoyed the variety of cuisine we offer. We're quite proud of our chefs and service staff at the Drift Kitchen and Bar. Thank you for your positive review and we hope to see you again soon!  Bob McCoy General Manager ", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r600593556", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great Service from the Lena the bartender", "review": "Brett the bartender was  awesome!!!  Very  nice  and  speedy! If  something wasn't  right  he  didn't  hesitate  to  fix  the  problem.  Brett  make  great   drinks!!! I will consider Hoilday Inn International Airport for my family vacation again. The rooms are nice and cozy, up to date, very clean.", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r600060222", "sub_review": {"Value": 4, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Where dreams come true", "review": "Flew in to Florida for a quick visit with a niece. Due to flight arrival time stayed at the Holiday inn. Hotel was fantastic,booking on website was easy and room matched what I requested. The ease of the shuttle courtesy van was great despite arriving at 11pm!!! Bed was comfortable and room was great. The ease of catching the shuttle back to the airport to collect a rental car was again a bonus. Would stay here again and recommend it!!!", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r599707924", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "So helpful!", "review": "Dear Commando01, Thank you so much for being our guest and for sharing your experience. I was delighted to hear that you thoroughly enjoyed your stay at the Holiday Inn Orlando Airport. We love making our guests feel at home and it's wonderful to hear that we accomplished that goal. Thanks again for your comments and we hope that you'll stay with us again very soon!                                                                                                      Bob McCoy General Manager ", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r599627250", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Outstanding service from ROSA", "review": "Love the friendly staff! Denisse (at the front desk) really went out of her way to help me get the best parking rate before we went on vacation. The room was clean. The shuttle to the airport was prompt and courteous.", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r599334972", "sub_review": {"Location": 4, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "crew member", "review": "Dear emilymp2018,  I appreciate the kind words about your stay, especially in regards to our associate Denisse. We take great care to only select the best possible team members and I'm very glad they she and exceeded your expectations. Please visit us again soon, we look forward to impressing you once again.                                                                                                                                                                Bob McCoy General Manager ", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r598828571", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Very upbeat and friendly place", "review": "I checked into the hotel with 4 pieces of luggage i asked for a trolley at the front desk and one one could assist me then putting all the luggage on top of each other struggling and as soon as i came close to the elevators Rosa (i think shes housekeeping) came running to me to help and helped me to my room and made me feel very special and welcome!! You need more willing and friendly staff like Rose Thank You", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r598446450", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Average stay, at best", "review": "I frequently stay Holiday Inn Express properties while traveling for business.  This was my first time staying in Holiday Inn and I won't be returning.  When we arrived we had an okay check in.  But when we got to our room the door would not open I went back to the front desk and they called maintenance.  He came very quickly and said the \"clutch\" mechanism was worn out.  So the door would only operate by pushing up on the handle not down.  The next morning we tried to get a shuttle back to the airport  and was told it runs every half hour. So we sat in the lobby for 25 minutes and just made our flight. It would have been helpful to have been told this at check in or post a sign with the information.  The gentleman working the front desk the morning of July 16th was easily the…", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r598421099", "sub_review": {}, "travel_purpose": "", "rating": 2}, {"title": "Nice place", "review": "Dear buktvlr, Thank you very much for being our guest and for also for sharing about your experience. Please accept my sincere apology for the lack of attention from the front desk staff on your morning of departure. We pride ourselves on offering exceptional service to all of our guests, I'm sorry that you did not experience us at our best. Thank you for bringing the entry door issue to our attention, as this was corrected quickly. We appreciate your business and would welcome an opportunity to restore a favorable impression the next time you are in our area.  Bob McCoy General Manager ", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r597648077", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Amazing attitude", "review": "Large, clean room with comfortable beds. Hotel also has a restaurant and bar on site which is an added plus when coming off of the road after a long drive. The staff were all friendly from the front desk to the bartender. If I come back for a launch I will not hesitate to stay here", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r597471015", "sub_review": {"Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "They gave away my family's prepaid rooms.", "review": "Dear j r,  Thank you for the gracious review. The comfort of your night's sleep is the simplest and most important part of our job. This is the most fundamental service we offer: a clean, fresh, comfortable, excellent place to rest on your travels. That's why we take your night's rest so seriously, and do our absolute best to only provide the highest quality beds, linens, and pillows. Thank you for letting us know how much you enjoyed your rest and our staff service, please join us again in the near future.  Bob McCoy General Manager  ", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r596160908", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Flight in distress", "review": "I visited the Holiday Inn for a leadership seminar. During the break for the seminar we went to the bar to grab some coffee. Brett served us. His bright and welcoming attitude was so refreshing. I work in the hospitality industry - so I know that two coffees does not equal a big gratuity. But that didn't seem to phase him at all. He smiled and answered our questions and visited with us like we were old friends. Brett definitely made our night even more memorable.  Thanks Brett!", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r595869908", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Great staff, cool Technology", "review": "From the moment I walked in, I had a \"wow\" experience the renovated lobby was really impressive with a ginormous TV in the lounge to watch the World Cup - along with an unexpectedly upscale bar experience.  The room was definitely nicer than your typical Holiday Inn - including a Keurig , uber-comfortable bed and a really cool TV experience.  I was able to log-in to my Netflix to watch (again) episodes of The Office while I worked, and later to watch content from my phone.  Definitely above expectations and would stat again for sure.", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r595704292", "sub_review": {"Sleep Quality": 5, "Cleanliness": 4, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Fun Pre-Cruise Hotel Stay", "review": "Hi Dominic, we're so excited you had a wow experience at the hotel and loved our amenities such as the 275\" tv screen at the Drift bar and all of our in-room amenities and comfortable beds. We hope to be able to serve you again when your travels bring to Orlando!  ", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r594689077", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Excellent experience", "review": "My sister and I stayed at the Holiday Inn Orlando Airport the night before our cruise.  We booked the cruise special which provided us with roundtrip transportation to Port Canaveral.  We were very happy with the Holiday Inn because we found it to be very clean, the staff was friiendly and informative.  There are plenty of restaurants within walking distance.  We also walked to the walgreens and Ross store.  You won't be disappointed with this hotel.", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r594544287", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Great Bartender", "review": "Dear karenwCleveland_oh, It's true, our hotel is just about as conveniently located in Orlando as possible. Orlando International Airport is just minutes away, the shops and restaurants downtown are just as close. We like to think of ourselves as a convenient hub to all that Orlando has to offer, whether you're in town for business or leisure. We can't wait for you to join us again here at the Holiday Inn Orlando - International Airport.  Bob McCoy General Manager", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r593728532", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Fan-fabulously ", "review": "Location and amenities were perfect. Very clean comfortable room and bed, very nice shower products.  Check in went smoothly and quickly. Front desk employee Marelix knew exactly what she was doing. Very helpful,  efficient and very friendly.", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r593607469", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "The best hotel stay I've had in years!", "review": "I stayed at the Holiday Inn Orlando Airport the 27yh & 28th for training with the company I just started with. My stay there was fantastic! Every single employee I came in contact with had a smile on their face, was friendly, helpful & were sincerely concerned if my stay was great. My favorite was Joel a host in the dining area that I got to talk to during my first morning there.  His service & help was stellar!  Definitely 5 star! 🌟🌟🌟🌟🌟 I will definitely stay there again.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r592750301", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "HI orlando", "review": "Dear ZimmerD, thank you so much for being our guest and for sharing your experience. We were so excited to see your review and hear that you thoroughly enjoyed your stay at the Holiday Inn Orlando Airport. We love making our guests feel welcome and it's wonderful to hear that we accomplished that goal. Thanks again for your comments and we hope that you'll stay with us again very soon!                                                                                                      Bob McCoy General Manager ", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r592639330", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "i would like to stay with my family in this hotel ", "review": "The service they really incredible,always ask for what I need, they are friendly, always smiling, I am very satisfied with the services of their good.hope to see you again Thank you so much for you guys", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r591952827", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Fast and friendly service", "review": "Dear Sadam S,   Thank you for your great review. We always strive to make our guests happy by smiling and being friendly to every guest we encounter. We're so excited you enjoyed your stay and hope to see you again in the future at the Holiday Inn Orlando Airport.   Bob McCoy General Manager ", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r591783420", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Mrs Fentress", "review": "My name is Sivam Shrivastav i was stayed in hiliday inn international orlando airport am really happy with staff members and one of tha housekeeping staff Camille hall she's very very helpful and taking care of my room is very good i really want to thnx to her. Very clean comfortable hotel Nice place,good price great location Highly recommended Modern hotel,great area , great price The titles say it all, a very pleasant well located and appointed hotel with friendly , helpful front of house staff , that nothing was a problem for. The hotel is very modern looking and is of a high standard , I could not pick fault with anything , the rooms, lobby, reception were all kept in a clean and welcoming way,breakfast was a delight.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r591303822", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Room not ready at 11PM on Check-in Day - Unacceptable", "review": "My wife and daughter were flying into Orlando on way to Ft. Lauderdale.  They just needed a hotel to sleep for one night before driving rest of the way down to Ft. Lauderdale.  They arrived to the hotel on check-in day at 11:00PM after a long day of travelling and were told that the room was not ready for them due to a backlog due to housekeeping.    I called the national IHG customer care line letting them know that having a room not ready at 11PM on check-in day is not acceptable.  They said they contacted the hotel directly and that it was not due housekeeping but actually due to a systems issue.  Whatever...I was told that the hotel manager would call me back to resolve the issue and discuss a possible reduction in nightly rate.  I never received any call.    After leaving…", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r590941296", "sub_review": {"Sleep Quality": 3, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Terrible service, rattling doors, dirty air filters!", "review": "Dear nbaker75v, thank you very much for being our guest and for also for sharing about your experience. Please accept my sincere apology for the lack of attention from housekeeping in getting rooms ready by 11pm. We failed in our service expectations. Rest assured, we are taking immediate action to prevent this from happening again and I have shared your comments with Rooms team to come up with an action plan for better training of our staff. We appreciate your business and would welcome an opportunity to restore a favorable impression the next time you are in our area.  Bob McCoy General Manager  ", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r590186654", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "The Hotel to stay at in Orlando.", "review": "I don’t normally post reviews but the lackadaisical attitude of the front desk staff at this hotel has annoyed me so much I feel compelled to warn others. In the room there are several advertisements for breakfast, suggesting room service. After spending 22mins trying to get someone at the room service number (390) to answer the phone I called the front desk to ask if there was another room service number I could call, my question was responded to with “so, what do you want?”, I replied “I just want to order breakfast”, then silence and the phone starts ringing out again. I was clearly patched through to the room service number, 7mins later still no answer. I called front desk again and a different lady answered. I explained the situation and was told “well, they’ve obviously…", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r590081347", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Nice service", "review": "Dear lizmufc, Please accept my sincerest apologies for the problems you encountered during your recent stay. I am so sorry for the issues that you experienced at our front desk. It is unacceptable to not answer the phone and take care of our guests basic needs. We certainly fell short of delivering the guest experience we strive for. I have shared your comments with my management team and rest assured, immediate corrective action will be taken. I hope that you will give us another chance to prove ourselves and show you why we take great pride in the service we provide to all our guests, every day.    Bob McCoy General Manager ", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r589918935", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Great staff!", "review": "When flying in to Orlando Florida, stay at the Holiday Inn by the Airport. Amazing layout and environment. Fun atmosphere. The hotel bar is inviting, open, and relaxing. Just ask Brett for a drink and he will not disappoint. Such a fantastic bartender. Love the rooms. I'd definitely stay here again.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r589913542", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Great Place to Stay for an Early Flight", "review": "Decided to stay near the airport since we had an early (6am) flight.  Arrived to airport to find out they were overbooked, even though we had a reservation.  The lady at the front desk (I wish I had gotten her name) was super friendly.  She gave us drink vouchers for the inconvenience and we only waited maybe 15 minutes before getting a key to our room.  We weren't there for very long since we didn't get in till about 9pm.  We caught the shuttle at 3:30am, which is when it starts, and we got to the airport in plenty of time.  Amazing hotel!  Would definitely recommend!", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r589860397", "sub_review": {"Location": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Holiday Inn saved the day!!", "review": "Dear scheyenne, Thank you for the kind review, it was a pleasure to hear how much you enjoyed your stay. I'm glad you mentioned the convenience of our airport shuttle. We recognize that the majority of our guests going to or coming from the Orlando Airport, and we couldn't be more pleased to offer complimentary transportation. It just makes things easier. Please join us again soon!  Bob McCoy General Manager ", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r589848954", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "holiday inn review", "review": "My flight was cancelled so I went to the holiday inn. Jessenia took such good care of me. Ended up giving me a free drink voucher to help turn my night around. Everyone was so friendly including the bartender.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r589349224", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Great staff", "review": "Dear Amy M, thank you for letting us know how Jessenia took great care of you after your cancelled flight and making sure your experience at the Holiday Inn Orlando Airport was pleasant. We hope to serve you again in the future when your travels bring you to the Orlando area.   Kindest regards,   Bob McCoy General Manager", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r589289384", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Needs work", "review": "Really Good Hotel, all the staff are nice, specially Damian, has a big smile all the time. Great food, great pool. Amazing room, has shuttle to the airport all the time, close to great restaurants and stores.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r589057644", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Average MCO Hotel", "review": "I fly out of MCO frequently and usually spend the night before the flight at a hotel near the airport, so I think I've tried them all.  Here, the staff was great, the hotel lobby and room were nice, but what brings my score down is the nickel and diming I got with my stay.  Parking for the night was $12 - I understand my reservation probably said that but I never noticed because I've never paid for parking around here - and coffee in the morning was $2!  I get they are trying to bring the room price down, but things like this are aggravating.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r587799216", "sub_review": {"Location": 4, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Pre cruise stay", "review": "Dear Fifithegreat, Thank you so much for your feedback regarding your recent stay. I am very sorry that your guest experience wasn't perfect. We truly take pride in our guest service, so thank you for pointing out a couple of things that were troubling about your stay with the charges for coffee and parking. We always appreciate feedback, positive or not-so positive about out hotel. Thank you again.    ", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r587553705", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Updated Hotel with easy access to area attractions", "review": "We stayed here for 1 night before heading on a cruise. The hotel room was really big and very comfortable. Nice location just a short stroll away from some bars and restaurants. Modern inside with a lovely pool. We had room service from breakfast which was nice.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r587275901", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "GREAT PARKING FOR MCO AIRPORT", "review": "Dear RMR288, It's true, our hotel is just about as conveniently located in Orlando as possible. Orlando International Airport is just minutes away, the shops and restaurants downtown are just as close, and of course Walt Disney World Resort, Universal Orlando, and Sea World. We like to think of ourselves as a convenient hub to all that Orlando has to offer, whether you're in town for business or leisure. We can't wait for you to join us again here at the Holiday Inn Orlando - International Airport.  Bob McCoy General Manager ", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r584617007", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Fantastic beds", "review": "Wow, the bed here was soft! I generally have difficulty getting comfortable on hotel beds, but had no issue here. The pillows were generous and the bed itself soft. In the morning, we walked across the street to Denny’s for breakfast (the hotel breakfast wasn’t really in our budget). Recently renovated, the hotel is gorgeous, modern, and large. We spent the night here before our Disney Cruise. The recreational area seems to be the only area not renovated. A walk outside and you pass a “smoker’s garden” followed by a covered hot tub area with towels. The pool had both a deep end and shallow area for kids. Although the landscaping by the pool was beautiful, someone mowed the area just inches away from us while we were there, kind of ruining the relaxation (and aggravating…", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r584006888", "sub_review": {"Location": 5, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Awesome renovation took me by surprise.", "review": "Once again I had the opportunity to choose a venue for a meeting in Orlando. I was happy to go back to the Holiday Inn Orlando International Airport, and wow! The hotel is totally renovated, the lobby is modern and updated, the sleeping rooms with their new beds make it hard to get up in the morning and the meeting rooms are very nice as well. I'd like to personally thank Adriana Medina and her staff for the outstanding customer service. I'd be remiss if I don't mention Beatriz and her attention to detail, she always goes above and beyond to guarantee we walk away with our expectations surpassed.", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r583921244", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Average at best", "review": "Dear Clara Guzman, Thank you for such a positive review! I'm pleased you found all of our amenities so much to your liking here at the Holiday Inn Orlando Airport. We take great pride in every aspect of our service and facility, and it's always enjoyable to hear that our guests loved their stay with us. We appreciate you pointing out to fantastic associates with Adriana and Beatriz and the outstanding customer service they provided you. We certainly look forward to extending our hospitality again soon.                                                                                                       ", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r581555991", "sub_review": {"Value": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Amazing Surprise!", "review": "Very slow wi-fi, staff was not overly-friendly, hotel was \"dated\", no ice machine on my floor so I had to go to another floor to get it.  I stayed for 1 night only and would not consider staying at this hotel again - I think there are better options.  The one positive is that the bed was very comfortable (it was noted in the room that the mattress was new).", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r581054823", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "My worst hotel stay experience", "review": "Dear blue5839, Thank you so much for your feedback regarding your recent stay. I am very sorry that your guest experience wasn't perfect. We truly take pride in our guest service, so thank you for pointing out a couple of things such as the wifi and ice machines that were troubling about your stay. I have, of course, communicated with my team about the issues you encountered. We do thank you for making a point to mention our new beds. All of our guestrooms have been renovated in the last six months so I'm not sure what about the room looked \"dated\" to you. We look forward to welcoming you back to experience our hotel the way you should have during this visit. Thank you again.  ", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r580696215", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 1}, {"title": "Started my vacation off bad", "review": "Jessie at Front Desk & also Dee  in concierge go & see them ASAP! Highly recommended remodeled and beautiful atmosphere. Treated my Mother here for her birthday after another reservation was cancelled somewhere else. Thank God it was all meant to be I guess. Haven’t seen my Mom so happy in a longtime. Rooms very comfortable all members of staff so friendly and willing to assist with whatever need. More then satisfied with Dee and Jessie who both with their own special individual efforts made us feel like family and at home. Thank you Jessie and Dee we will be back! ", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r580523509", "sub_review": {"Location": 3, "Cleanliness": 4, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Thank you for your servise", "review": "It's was a nice time. Good staff is working there.Jessie(girl from reception) help me a lot with everything. Thank you so much!!!!!!! You are doing a good job!! For my next time for sure will come back.", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r579089089", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Lovely amenities but needs work", "review": "I appreciate the kind words about your stay, especially in regards to our reception and Jessie. We take great care to only select the best possible team members and I'm very glad they met and exceeded your expectations. Please visit us again soon, we look forward to impressing you once again. ", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r579010064", "sub_review": {"Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great location", "review": "We stayed at this property for 1 night as we had an early flight. Great location close to lots of restaurants. Had a swim in the pool which was lovely. The beds were comfortable and lots of plug-ins to recharge our devices. Check in and out was a breeze. A few things that need work. There were no clean towels in the pool area although there were wet ones in the bin, the extra door locks didn't work very well, the AC unit was loud, and my husband had trouble getting someone at the front desk to answer the phone (he was requesting a wake up call).", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r577964086", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Hotel From Hell", "review": "We appreciate your candid review. While I'm very glad you enjoyed most of your guest experience, I'm very sorry that everything wasn't quite perfect. The deficiencies you mentioned have been noted and will be corrected, rest assured. We sincerely hope you'll join us again soon so that we can give you the perfect stay you expect. ", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r575897405", "sub_review": {"Value": 1, "Sleep Quality": 2, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Unclean, Outdated, Nothing Worked", "review": "Staff is friendly but the hotel is old and needs an upgrade. Valet parking is only $2  more than self parking. The kitchen is very limited. Rooms are nice. Door locks are malfunctioning most of the time. Room service does not pick up the phone. Menu in room is not correctly displaying available meals. ", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r575754047", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 1}, {"title": "Beautiful Place, Communication Needs Improved", "review": "This is a beautiful hotel that has recently been remodeled. It is an unusual decor with a mixture of art deco and rustic decor. Everything was very clean. We arrived very early in the morning due to flights. Isaac, a very helpful young employee, offered to keep our luggage for us in storage until our room would be ready. He stated that he had two guests ahead of us, he should have something shortly. This was around 10:00 a.m. We went to breakfast at a nearby Denny's (walking distance) and had a leisurely breakfast. We returned about 11:30 and we were told that no rooms would be available until 2:00. It was a different staff and we told her that Isaac had said that we would be next on the list. She did not know about this and said she would call him. We waited again for an hour.…", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r575190526", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Wanted to love it but there were problems", "review": "Thank you so much for being our guest and for sharing your experience. I appreciate you having patience with our new front desk agents, we will use this an a learning experience. I was delighted to hear that you thoroughly enjoyed your stay at the Holiday Inn Orlando Airport. We love making our guests feel at home and it's wonderful to hear that we accomplished that goal. Thanks again for your comments and we hope that you'll stay with us again very soon! ", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r573581082", "sub_review": {"Sleep Quality": 2, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Charged twice", "review": "Pros- They take dogs and have a nice green space to walk them. The pool looked great and they had a fitness room. The bar was nice. The person from room service the next morning went out of his way to get us breakfast so we could make our flight. Cons-The food was average. The phone didn't work, I tried to call when people were yelling and shouting at 1:00 am, no response. I tried to call for room service-didn't work. I tried to call with my cell phone, no one answered.  You need phones that work, that seems like the least to expect.....", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r573264918", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 1}, {"title": "Horrible nasty dirty yuk ", "review": "Thank you very much for being our guest and for also for sharing your experience. Please accept my sincere apology for the lack of attention from the reception. We failed to live up to your service expectations and our own standards. We pride ourselves on offering exceptional service to all of our guests, I'm sorry that you did not experience us at our best. Rest assured, we are taking immediate action to prevent this from happening again and I have shared your comments with our management team to come up with an action plan for better training of our staff. We appreciate your business and would welcome an opportunity to restore a favorable impression the next time you are in our area.", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r572877601", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "What a disappointment!", "review": "I was charged twice, the night I stayed plus the no show for the same night. Few people on reception. They took 1 hour to understand the mistake and fix. Also, the orange juice offered on breakfast was never served. Poor service.", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r568987733", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Spring Break with son 2018", "review": "Hotel is going through some remodeling. The room was an average 2 double bed room. No restaurant for dinner. The hotel was clean and nice but the prices were ridiculous! I paid $250+ a night for a $80 room. Regular parking is not free and is ridiculous. I would recommend staying there only if you have to or prices come way down.M", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r568321603", "sub_review": {"Location": 5, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Not the best", "review": "I appreciate your feedback. I am very sorry that you felt the quality of your stay was not in line with our pricing. We take great pride in our excellent service staff, luxurious accomodations, and top-notch cuisine; providing this does sometimes come at a premium price. However, we try very hard to keep our pricing reasonable and competitive with the local Orlando hotels. Thank you again for your comments, and I hope you will come back soon.  ", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r566744042", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "DOUBLE BILLED- DIRTY- NO A/C- HORRIBLE PLACE!!!!!!!!", "review": "Our flight was canceled this hotel was within 2 miles of the airport. I booked no issue which I was thankful for. Then we arrive to find that the hotel is undergoing major construction which we weren’t notified of. They also have two different costs listed for overnight parking rate one being 8 dollars the other says 10. The charge you each time you leave the lot. The worst was the next morning waking up to a note that said all water was going to be shut off from 10-2 everyday. None of this was stated prior to booking. So upset with this hotel I think they should’ve been upfront and honest and perhaps not charge the full room rate since we were being inconvenienced. They need to work on their customer service.", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r565508530", "sub_review": {"Location": 1, "Cleanliness": 1, "Service": 1}, "travel_purpose": "Traveled on business", "rating": 1}, {"title": "Beatriz is a ROCK STAR", "review": "Thank you for being our guest and also for sharing your experience. I understand there were several issues with your stay, I'm sorry we were not able to meet your and our expectations for excellent guest service. While it saddens me any time a guest has a less than stellar experience, I am grateful that you took the time to explain the problems you had so that they can be promptly remedied. I've personally shared this review with my staff and management team and I'm confident that the problems you had can be quickly remedied. Please, do join us again soon, I promise your stay will be excellent. ", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r565424604", "sub_review": {"Location": 4, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "A night at the Holiday Inn", "review": "Total crooks.  Don't ever stay here even if they claim the renovations are done.    I'm happy to post a review for great service. This was a horrible experience from beginning to end  Arrived late to find that the hotel is under major construction.  Too late to go anywhere else.  Room wasn't very clean.  Air didn't work in the room and the door didn't close right so I could see the hall lights around it.  Checked out the following morning and cancelled for the following day.  They gave me a discount on the stay.  Fine.  Two days later I get another bill on my credit card for the day I stayed plus two more days that I didn't at full price.  Called every day and left messages for a manager who is either never there or can't hear the calls because of the construction.  Bounced from…", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r564987700", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Business-Social Weekend", "review": "Stayed there 22/2/18 through the weekend. There was a lot remodelling going on, which made check-in chaotic and room availability limited. But, Alicia, Lena, Michelle Beatriz, Dee and Adriana made it a far less painful experience.", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r563010823", "sub_review": {"Value": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Major renovation underway but nice property", "review": "Thank you for choosing us to stay with us while our remodel is going on. I'm glad our staff was able to make your stay much more pleasant. It's great to hear they were able to make such an impact. We appreciate the glowing review and invite you to stay with us again if you're ever back in Orlando.", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r562534566", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Pathetic..", "review": "Hotel is undergoing a MAJOR renovation so be prepared for this if booking here. That said though, this property is going to be very nice once completed. The lobby bar area is simply gorgeous and has the largest tv over the bar that you will find anywhere. Nice rooms, plenty of shopping and dining in easy walking distance and a free 24 hour airport shuttle make this a solid choice when by the airport.", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r561601305", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 2}, {"title": "Only stay if you want to be treated as a non-entity", "review": "Thank you so much for your amazing review and staying with us towards the end of our renovation. We appreciate you noticing the TV it's over 300+ inches and noting our great location. The location along with service and comfort are among the top things we pride ourselves in. We certainly look forward to extending our hospitality again soon.", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r561462335", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 1}, {"title": "Never again", "review": "Arrived here 2/3 days ago and still here for 4 more nights (233 usd per night!!!) Hotel under renovation, dirty, dusty, poor breakfast, very noisy The cleaning in the rooms is erratic and my colleagues have called 3 times today to have their room cleaned... When I arrived my shower had still the feet marks of the previous customer! Not managed to get a manager yet to complain but this is the last time I will stay here ", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r561454556", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 1}, {"title": "Weekend Whammy", "review": "2/15-2/17/18:  When making reservations the staff neglected to tell us about the construction!!!!  Look at the photos.  $214.00 plus $26.00 nightly tax plus parking .... to waggle through painters and ripped up carpets, dust and glue smells!   Add to that all the additional workers in the hallways with paint cans, ladders, walking over drop cloths and ripped up carpet.    You would think IHG would offer a construction bonus to make its loyal customers (we are Spire elite). I’m sure this is a lovely hotel under non-construction, but really! We are on vacation away from dust dirt and mayhem-not wanting to be a part of it when we are away from home.    This IHG really dropped the ball when informing clients of the dirty conditions during reconstruction.  Perhaps construction…", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r561009833", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Pre cruise", "review": "Thank you for taking the time to provide us with your review of our hotel. I understand there were several issues with your stay and I apologize that you did not have the outstanding stay you deserve. We try our best to put renovation announcements on all sites. I would also like to discuss what we can do to make it up to you. Please contact us at your convenience. I hope that we will have another occasion to meet your expectations and to welcome you back in the near future. Once our renovation is one please let me know beforehand so I can personally arrange your next reservation, and to make sure that you have a pleasant stay.", "date": "January 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r560804599", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "People waiting for rooms and construction underway", "review": "Under construction  .   Unable to get hold of the front desk to order the shuttle bus from the hotel had to get a taxi . Hotel very dusty.    breakfast was upstairs in one of the rooms weather was too cold to use the pool plus the pool needed cleaning .", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r559476112", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Room was fine.", "review": "Thank you very much for being our guest and for also for sharing your experience. Please accept my sincere apology for the lack of attention from the front desk. We failed to live up to your service expectations and our own standards. We pride ourselves on offering exceptional service to all of our guests, I'm sorry that you did not experience us at our best. Rest assured, we are taking immediate action to prevent this from happening again. We appreciate your business and would welcome an opportunity to restore a favorable impression the next time you are in our area.", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r558329802", "sub_review": {"Location": 3, "Rooms": 3, "Service": 2}, "travel_purpose": "Traveled on business", "rating": 2}, {"title": "Breakfast in lobby now", "review": "I was not impressed at check-in by the way we and others were just told that our rooms were not ready. I mentioned that I would report this on Trip Advisor and a room miraculously became available. However, I found that construction is underway with dining rooms closed, the smell of paint and noise and dust and power extension cords in the corridors. I am attaching the view this afternoon  by the sixth floor elevator.  Unless you get a very low price I'd go somewhere else. I really dislike hotels that do this to guests. And I get really annoyed by signs that ask us to forgive them the noise and the dust because this is to make it better for us. Nonsense, I'll never come here again.", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g34515-d87983-r558067118", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}]