[{"title": "Good, but four stars might be too high rated", "review": "Nice hotel opposite the train station Alameda and overlooking the banks of the Guadalmedina river.  It has the look and feel of a business oriented hotel. We experienced a friendly but somewhat uninterested and cold reception by a receptionist who does not very well speak English and that might have been the reason the check-in feels somewhat impersonal. Rooms are spacious with lots of storage space and TV and coffee/tea making is provided  Our room had a nice firm king-size bed with enough space to walk around it. The bathroom is neat and clean, with all necessities provided. Hotel location is fine to explore Malaga on foot.   Two things are however lacking to qualify for a full four star rating:  1) A decent amount of power sockets to charge phones/tablets/laptops, especially at the side of the bed  2) A bar or lounge where you can enjoy a drink when returning from whatever you were doing in the city. There is some seating space, but this is often also used as office space by local businesspeople.  we did not try the breakfast. I cannot see a reason to book an expensive continental buffet when all we need in the morning is a cup of coffee, an orange juice and a toast with tomato and ham. We had breakfast for under €10 for the two of us at the local panaderia's…", "date": "November 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r727762682", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Excellent location ", "review": "Literally 2/3 mins from the railway station. Very friendly receptionists and lovely room with modern bathroom/walk in powerful shower. Good value inc breakfast and would recommend. Location good for walk into,the old town or the marina.", "date": "November 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r726519627", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good value for money, nice staff", "review": "The hotel building isn't fancy. And the road, where it is located, even less. However, it's in walking distance to the old town centre (10-15 min). Hotel rooms are clean, big enough, and have a wooden floor (I hate carpets). Bathroom is big enough as well, shower is good. Staff is very polite and helpful. And the hotel is not expensive. I can recommend staying there. It's good value for money. There is no gym. And I didn't try the breakfast.", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r718644217", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Nice little hotel", "review": "Lovely, small(ish), and very clean hotel on the side of the river course in the city centre. Easy location for travellers - literally 25 meters from the current (2019) closest city centre metro station, and just 10 mins stroll from Malaga Maria Zambrano central train station. It's within easy walking distance to all you'd want to see and do in Malaga city.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r717651167", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Very good hotel handy for everything", "review": "We stayed for four nights (six of us) and were very impressed with the hotel.  Staff were friendly and helpful, four stops on the train from the airport to last station on the line (Malaga Central) and just  across the road and round the corner.  Very near to cafes and short walk to promenade and castle.   Large rooms very clean with tea and coffee making, fridge and safe.  View across river.  Very quiet hotel never had any noise.  Breakfast OK costs 12 Euro but good choice with hot dishes.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r712692014", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Unbeatable location", "review": "I like the location of the hotel - 15 min walk to the old town, and across the street from the train station. The train brings you direct from the airport. One station away is the bus station where buses bring you to other parts of Spain.", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r711184504", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Clean room, great breakfast, ok location", "review": "Room was just what we needed for a medical related trip. Very clean, comfy, quiet and air con. Daily cleaning to a great standard. Rather interesting smell in the corridors, couldn't put my finger on it but didn't impact the experience at all. The breakfast options were really good, for continential breakfasts there was a really varied choice of pastries, cheese, bread, fruit etc. We only had it twice and i didn't even get to try the cooked options as was enjoying the self service so much. Hotel staff were knowledgable about the area and booked a taxi for us back to the airport. The location was about 15-20 minute walk to old town, or port or a bit further to the beach. There did seem a lot of other methods of transport such as the scooters, bikes and the bus if you don't want…", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r708872786", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Priceworthy hotel", "review": "Nice and clean hotel. Normalsize rooms with efficient WIFI. Good aircondition in the rooms. To get to Malagas old town, you need to walk for 10-15 minutes, but that`s ok for this prize. Not a lot of restaurant close by, breakfast at the hotel is sufficient.", "date": "February 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r688990236", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Location Deceiving", "review": "I expect the location to be central but not really, as Malaga is relatively small. Otherwise the room is spacious and clean but not well-furnished. Staff speaks little English. There are better hotel choices.", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r683268806", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Andy & anne holiday ", "review": "Hotel guadalmedina very good hotel just outside of the centre of Malaga only a 10-15min walk into the centre nice walk rooms are clean with and have a kettle towels changed every day beds also made every day all the staff are fab reception staff are fab good knowledge of Malaga always happy to help would recommend ", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r675056591", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "good location for the sight seeing", "review": "We stayed 3 nights broken up with a trip to Seville. The hotel is 25m from the Central rail station which links directly in 11 minutes to Malaga airport £1.80 each way. It is a 10 minute walk to Malaga old town restaurants and bars, 15 minutes to the cathedral, 20 minutes to the port area, a very good location.Reception staff are very helpful and friendly and speak good English. The rooms are spacious good bathroom, large bed, everything you need. Other than no coffee, (only tea) in the room and no milk, it was very good. Breakfast is 12 euros and is good value. 4* is a correct rating", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r674700002", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Loads to see and do in and near Malaga", "review": "Three of us work colleagues to Celebrate a Big Birthday for one of us, we went to Malaga for four days and took in Malaga itself and the Old Town area but also went to Cordoba on a day trip which was fantastic well worth going there. Also we did a tour and walk to Caminito Del Rey on the third day and it was stunning too but you would need a head for heights as lots of high suspension walk ways and bridge but totally beautiful to see and do.", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r669411317", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "A nice stay", "review": "The hotel is just 5-7 minutes walk from the old center of the city. It is cozy, breakfasts were good, the room is clean and spacious enough, towels are changed every day. A teapot, cups and tea sachets are offered at your request which is good enough. We were satisfied with our stay at this hotel.", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r667131525", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Malaga Weekend Break", "review": "This was our second visit to Malaga & our first to this hotel. On the positive side, the staff were very friendly & extremely helpful. Everywhere spotlessly clean & rooms nicely decorated. An ideal place to stay either as a weekend break or a business trip. Situated close to the centre & waterfront with a 10 -15 minute walk. good places to eat close by. The only down side being that as the hotel is positioned on a busy main road, the front of the hotel is noisy. We were given a room at the front on the first floor. After one restless night we asked if we could be moved to a quieter room. As the hotel was busy we didn't think this would be possible but we were told to pack up our things & on returning later in the day, our bags would be in a different room on the 6th floor. When…", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r663690104", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "great service", "review": "Passing through Malaga, we had occasion to go into the hotel on Sunday the 24 th of march due to a little emergency.The receptionist was wonderful, smiling ,helpful and sorted out our problem , I will definitely stay there on our next visit.", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r661811349", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Vacation", "review": "Hotel is in a good location, not far from Mediterranean beaches and shopping.  Rooms a bit small.  Good breakfast, lots of variety for food. No coffee in rooms, you have to call the front desk to get an electric kettle for tea or coffee.  No pool, excerise center or restaurant on site.newer hotel.  Staff very helpful. No extra city tax charged.", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r661173378", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Great service & helpful staff!", "review": "We chose this hotel due to its location and since we had a late flight we wanted a 24hr reception. It’s basically located just exactly between the old city part and the shopping district. You can easily walk it to the old city... will take approx 10/15 minutes or take a taxi for about €6. Same with the shopping district (3 huge department stores...  le Cortes Ingles, Primark, Dunnes, Zara etc) The staff spoke perfect English and were helpful in everything we asked for... answered all our questions, called taxis and kept our luggage after check out. Room was clean and towels were replaced every day. It was perfect for a weekend break with the girls 😊", "date": "March 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r659761474", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Close to the old part via the river bridge and to the train and bus stations", "review": "I selected this hotel as located close to the stations (bus staion -5 min, train - 8 min) and also for the reviews. Everything was good if not the noise- both wings of the hotel faced noisy heavy transport roads. But if you do not put attention on it everything was very good. Helpful staff, special thanks to Ester who gave me the full tray of tea items as I had a sore throat. Big markets very closr to the hotel, comfortable clean  rooms and good bathroom. Beds and pillows very really perfect!", "date": "January 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r648307192", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Brilliantly located.", "review": "So near to most places of interest tp visit. The Cathedral, The castile  and Piccasso museum. So many eateries and tapas bars very close. Comfortable hotel, very pleasant people.Nothing too much trouble.", "date": "December 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r644398362", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nice hotel near railway station", "review": "Booked the hotel as near railway station (around 5 minutes away - come out of main entrance, cross the road and take the road on the right). Hotel not far from all the main attractions and nice walk to old town. Room nice size and clean. Did not have breakfast at hotel so cannot comment on food.  Would stay again if visiting Malaga again.", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r643002747", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Typical city hotel", "review": "Stayed here 4 nights in Oct 2018 - Very convenient location for train station, but next time I will try to stay closer to city center and the beach. Good for short stay, but not for holidays. Quite impersonal - staff looked very tired.", "date": "October 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r629055112", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "A convenient hotel for onward travel.", "review": "I chose this hotel for its close proximity when leaving the Metro station on route from the Malaga Airport, about 5 min walk. It was approximately 10/15 mins walk to the train and main bus services for onward travel the following day. It is a typical city hotel. Staff were friendly and helpful. The rooms are clean and of a reasonable standard, beds comfortable and bathroom facilities on power with other city hotels. Breakfast was available at 12 euros.  There are lots of places to eat in the evening, eg tapas or a full meal and places for breakfast including in the Shopping Centre where the bus station is situated. ", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r616974125", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Excellent ", "review": "Stayed 3 nights here. Good location, 10 minutes into the old town, 6 minutes to the railway station(which is adjacent to a shopping centre with all the big names). Hotel is spotlessly clean with comfortable rooms and free WiFi. Ask for tea making facilities as kettles, tea bags etc are not kept in the room. Staff are very helpful. Breakfast was very good: breads, cold meats, cheese, eggs, fruit, yoghurts, jams, cakes and just ask for omelettes, bacon and eggs and they are made to order. The breakfast room is well laid out and very clean. Couple of bars across the road by the statue.... the first bar is nice. ", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r611243279", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Convenient for town", "review": "We stayed one night before flying home. Not cheap, but excellent location - easy walk into town and away from the noise and hustle and bustle. Very comfortable room with air conditioning. We didn't have breakfast as we had to leave at 4.30am to get to the airport!", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r610462906", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Convenient for train station", "review": "This hotel was chosen for proximity to Malaga train station for an early morning train and it worked in that respect.  10 minute walk to the centre of the city for tapas etc.  The room was very average and noisy as it was on the main road, with a substandard bathroom and I wouldn't choose to return.  I would prefer to stay somewhere more comfortable and taxi to the train station next time.", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r606239374", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Very happy ", "review": "Used this hotel,as wanted to spend 1 night in Malaga before early flight home as the airport hotel.options seemed limited, and crazy taxi prices to the airport didn't make sense. Hotel 1 minute to malaga central train station, 1st train leaves at 5.20am,10 minutes to airport €1.80 one-way.Also very close to shopping,resturants & bars. Would use again in the future.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r587968638", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "A new visit to this Hotel", "review": "We had stayed at the Hotel Guadalmedina before but we were trying other hotels in Malaga city and had not been there for a long  time. We decided to vist this hotel again and we were pleasantly surprised, since our last visit it has had a makeover. The rooms have been redecorated and are very nice, It is in a great place for accces to various areas of the city and we must recommend it to any visitors to Malaga. The staff are very helpful and you will enjoy your stay.", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r587142349", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Perfect location!", "review": "Location location location! We stayed in the hotel for 2 night. The room was clean and pleasant,  with very comfortable bed and pillows.The staff was super friendly and helpful. The location is very good, and we could walk to the center easily - a few minutes. We did not have a car so I don't know about parking arrangements there. The breakfast was good enough and in a nice athmosphere. Negatives - and that's the only one -  as the building is located on a busy street we hear the street and traffic noises at early morning, what was little bit disturbing.", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r578958579", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Clean, great location", "review": "We chose this hotel because it is very convenient to get the train there from the airport (less than 1 minute walk) and we were arriving on Good Friday during the busy time of processions in the city centre. It is also only a short walk into the city centre. There are lots of good cafes nearby for breakfast, so we did not eat in the hotel. Reception staff were friendly. The rooms were clean and spacious. The aircon didn't seem to work too well, so we had to open the window overnight. That made it a bit noisy and might be more of an issue in the summer.", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r573213189", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Very good hotel, in great location ", "review": "I have found everything I was needed in this hotel: good service from the staff, decent price, very good location - a short walking distance from the main sites of Málaga, large and comfortable room, and pretty good breakfast.  This is very good place if you want to hang out to the city or the train/bus station by walking distance, and it has good restaurants not far away from the same zone. ", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r570686029", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Superb location", "review": "Location stands out *Underground: less than 1 min (direct train to Malaga airport, 3rd stop, and it only take 11 mins) *National train: Malaga main station is 5 - 10 mins  *Tour bus stop 2 is 1 mins walk from the hotel *Tour bus for all routes stop 1 from national train station (5-10 mins walk) *Hotel is located at the end of residential and beginning of tourist area *high street is only 2mins from the hotel.  *You can walk to nearly almost the attractions in 5-10 mins *Shopping mall, outlets etc are all within reach as well . Facilities *The receptionists are welcoming and helpful. *Basic toilet needs catered for. *Room: comfortable and light *Happy with my room though too close to the window Not happy with *Bedding was not changed throughout my stay, which makes my last two…", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r566546259", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "2nd Stay Here", "review": "Good hotel in a nice location. We’ve stayed here in the past and have had no problems. This time we were give a wrong room key, and the elevator didn’t work with our key card so we went up the stairs to our room. After I had a shower our room flooded and water started spilling out in the hallway. We called reception and someone came up 15 minutes later to mop the room. And we changed rooms the next day. Second room was much better and had no plumbing issues. On our second night, at around 1am a man with a suitcase walked in and woke us up. Giving a fright to the gentleman and ourselves, reception had a mix up. Extremely unprofessional and very very awkward for us and the other guest involved. Spoke to the manager and we were offered no compensation for the issues we had just a…", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r562682528", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Nice staff but has some draw backs ", "review": "I would say I might stay here again but only because of reasonable pricing and staff were attentive to the issues we had. It is just across the river Guadalmedina- a short walk ( 10minutes) from the city centre - but the area is like something out of a Mad Max film set - graffiti, construction and feeling of being less safe. It is right beside the central rail station to the airport and that is an advantage. We had trouble in room 410 as it was noisy ( from other rooms and from plumbing noises) and the drains were very smelly in the room ( the staff attended to this but it returned)  Great city though and once the area around the hotel gets cleaned up it will be a super place to stay ", "date": "February 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r561110317", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Comfortable hotel in good location", "review": "Stayed for two nights whilst on business.  Location is very good being a short 5-10 min walk from the main part of the old town.    Rooms was ok, a bit on the warm side with not so great aircon. Bed and pillows were comfortable and bathroom had good space with a very good shower.   Breakfast was quite extensive even though laid out in a relatively small space. Some a la carte options such as eggs and bacon available to order. ", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r542562297", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Good location", "review": "Great location in the centre of Malaga.  Our room had two single beds pushed together - we would have preferred a double bed. The car park is under the hotel, tight squeeze to get in as you need to use a car elevator.  The hotel met our needs in terms of convenience of its proximity to Malaga old town. ", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r541925130", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Excellent Choice.", "review": "Stayed last weekend.5males over 60s.booked with easement,2 rooms,3 in one room,2 in the other made it a bit cheaper.Room was great ,plenty room for 3 beds,hanging space,large bathroom,cleaned each day.Staff very helpful and friendly.Nice breakfast,you just had to ask for cooked eggs,bacon,beans,must mention our lovely waitress Abigail Villamor,she always had a smile and gave the impression she loved looking after you,nothing a problem. Location,out of rail station from airport,cross the road 20/30 yards hotel door.5/10 mins walk into Centre,bus station about the same,we used this to Visit Nerja,a must visit if you've got time,mainly old Spanish which is great,but also plenty English bars if your looking to watch the sport.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r536587544", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "2nd visit not as good", "review": "Stayed here 5-9th October,having stayed before it was good this time not so good.Our room was very noisy,bed uncomfortable asked for a double and got two singles pushed together. We were on the first floor and the noise was constant from the traffic and the main door to the hotel. The staff were great though very helpful. Not a bad hotel but not the best either.", "date": "October 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r531579264", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Quality nights stay", "review": "I was visiting town for an overnight trip and picked this place for a number of reasons. It is very close to the center of Malaga. The convenient location was a big draw. The train from Malaga airport has a stop literally across the street from the hotel. In addition to the train, there are a number bus stops right outside the doors. In addition, since it is so close to the center of town, you really can walk anywhere you want. The staff were very responsive and accommodating. The room I chose was a basic room, but had all the comforts I needed.  The bed was comfortable as well as the pillows. The room was very clean and well organized. There was very little if any noise during the night. ", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r528523411", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Second visit", "review": "The hotel is spotlessly clean and reasonably priced , large cool bedrooms and charming and helpful staff (they stored our cases for our late flight). Breakfast choice fabulous with option of bacon and eggs if required. The hotel is conveniently located for walking to old town and shopping and restaurant district. The train from airport to hotel is only 1.80 euro. The cool and relaxing roof terrace of El Corte Ingles is two minutes walk away as is the bus stop for the Malaga bus tour (a good way to see whole of city ). Set just over the bridge from a gallery of modern art (free entry)  the area has more of a local feel away from the busier town/beach area. It is a pleasant evening walk from the hotel to the waterfront area to witness great sunsets and locals and tourists enjoying…", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r525978810", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Enjoyable Stay", "review": "The location was perfect for us. It was a short walk into the centre and the Alameda Centre railway station was 50 metres away, which gave us very easy access to the airport and other places such as Torremolinos, Benalmedina and Fuengirola. The rooms were large and extremely clean with a very powerful shower. We ate out for breakfast and found a great place nearby en route to the city centre. It's located over the bridge three streets down once you've crossed the road.", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r523508052", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Pleasant stay ", "review": "Got this hotel last minute via LateRooms.com & it was very nice indeed. It is a short walk to the old city (approx 10 mins). The room was clean, with nice decor & bathroom etc. Would recommend & use again if in this area. ", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r515823950", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Close to train station", "review": "Stayed there for 1 nights between arriving to Malaga and starting our trip to Malaga. We selected the hotel because it is close to the train station where we rented a car. The location of the hotel is indeed central but not especially lovely, the overall quality is acceptable but nothing special. A positive surprise was the really king size bed in our room. The staff was very friendly. Would not recommend for a longer stay.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r506986833", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "good hotel just outside the centre", "review": "room was clean en comfortable. with a clean parket floor Location is a bit outside the centre. Nearby are some restaurants en bars. Acros the bridge the centre. trainstation malaga centro is very close", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r505917537", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good location, nice staff, that's about all.", "review": "Hotel Guadalmedina is centrally located near the harbor, restaurants and sights. It was a bit difficult to find due to metro construction. There is onsite parking however our car was too big to enter parking garage and we had to pay 52 Euros for 2 days of parking at parking garage. The hotel is older and the rooms are stuffy smelling, The mattress was not that comfortable and there were plastic covers on the mattress which was a bit strange. The bathroom seemed newly renovated and the bathtub and shower were very nice. It is okay if you are not going to spend any time in your room, which we didn't as Malaga is such a great city. I would not want to have to spend much time in the room however.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r505576954", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "clean modern convenient", "review": "Located just across the river from the end of the Alameda, an easy walk from the main railway station and close to the Central cercanias stop. Pleasant modern hotel. A nice touch was the availability - at no extra charge - of a tea set (kettle, cups and teabags). ", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r504095428", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "1 night stay...clean comfy room & parking onsite.", "review": "Booked this on the way back from Gibraltar as needed a 1 night stay in Malaga before flying back home. Arrived to find parking onsite for €14 overnight. Very handy. Room was clean & spacious. After a quick shower we headed to the CAC Contemporary Art gallery opposite the hotel. Well worth a visit & free entry. Walked into town for dinner which took 10 mins. Asked for tea making facilities which were provided. Found bed & pillows to be very comfy & slept well ( room 303) Breakfast was included & we asked for omlette & srambled eggs which were freshly cooked to order. All areas were clean & staff were friendly & helpful. Would return if staying for a weekend in Malaga as ideal for a short stay. ", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r503478190", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Weekend Break", "review": "Had a great 3 nights in Malaga City, Hotel is located 10 minutes walk from the centre, Check in was swift and organised. Rooms are very spacious and modern with free wifi and well stocked for a weekend break.Hotel offers breakfast between 7am-11am with plenty on offer. Ideal for a short breaks and would recommend.", "date": "July 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r499065815", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Dont expect luxury but you cant beat the price and the comfort", "review": "If you are looking for an inexpensive hotel that doesn't skimp on the necessary details such as great air conditioning, good bed, nice size room look no further.   Very well situated. Walking distance from train station as well as the city center location is ideal.  Staff is friendly.  A few caveats...   No bar or place to sit and have a drink. You can have a sit and read but  no bar or food service.  They do serve a great bfast but found out after the gave there is an added charge.    12 euros for bfast is ok wish I had known beforehand.   All in all highly recommended.    Would stay again in a heart beat. ", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r497093447", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Everything you need", "review": "We really enjoyed our stay at the Guadalmedina.  I wouldn't call the hotel luxurious but it featured everything we needed included great customer service from the front desk, spacious rooms and a very good location only a 5 minute walk from the city center.  I would recommend this hotel if you are looking for a great value during your visit to Malaga.", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r494095575", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "OK ", "review": "Only 10 minutes from the airport. Check in very swift and organised.   Rooms very comfortable and well stocked from the bar to razors, combs and toothbrushes.   The bar is closed at the moment - just for information.   Only 10 minute walk to the old time and maybe 20 to the restaurants and shops at the port.   Maybe a little too pricey at 90 euros a room a night if I'm honest as the location is not the prettiest abs apart from the room then there were no other facilities", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r489294994", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Ok", "review": "Basic hotel with nice friendly staff. As it's very close to the station, it's very easy to visit Granada, Ronda, Nerja etc. Bedroom was a good size with good clean bathroom with very powerful shower over the bath. Bed was huge but very hard, although some might like that. Area seems very safe, unlike some city hotels by a station. If you go right out of hotel there is a lovely Italian resturant, just 2 minutes away. It doesn't look much but meals are good. Across from there are others that are also good. Hotel breakfast wasn't the best, but I've had worse. Could hear outside noise from 3rd floor although it's double glazed and not a particularly busy road, so try to get a room higher up. Could also hear toilets being flushed and showers being used", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r480586228", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Average hotel - nothing to write home about", "review": "We spent one night here at the start of our trip.  It wasn't a cheap hotel but didn't really offer anything over and above to make it special.  The location was reasonably close to the old town but not a particularly nice area.  The room was clean but no frills.  You can request a tea / coffee tray for your room which we did.  Our booking did not include breakfast so we can't comment on that.", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r480202243", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great Hotel for a City Break", "review": "We stayed with three other couples and we were given four rooms all adjacent on the fifth floor.  All the rooms were very clean and well equipped and overlooking the river. The road is quiet and we had no loud noise in the evenings and slept well each of the four nights. Breakfast was very good. Only disappointment was the yoghurt, it is sweetened and we prefer natural sugar free. Not a big deal as there is plenty of fresh fruit and good bread and a toaster. The cook will make fresh scrambled eggs or omelette on request. The reception staff were very helpful and pleasant. Overall we were very impressed.", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r475500476", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "good central location", "review": "we spent 3 nights at l Guadalmedina . Staff very polite,friendly and helpful.  The room was clean and modern,beds comfortable.The bathroom shower was very good.tea making facilities available on request. Wi-Fi good. We stayed on first floor and there was a lot of traffic noise till about 2.00 in morning and again at 6.00. The location is good for exploring the City.Train station across the road and 10 mins to Zambranno station.  The bed was super comfy! 10 minutes away from the city centre (by walk) with all shops and restaurants. Not very close to the beach but we love to walk! So for us it was not a big issue. Internet was not the best but not too bad. All in all a lovely holiday! We strongly recommend it!", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r465389931", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Stop over on the way to Granada", "review": "We caught a bus from Malaga airport to Malaga. Get off in front of the railway station rather than the bus station behind it. It took us about 10 mins to walk to the hotel. The hotel itself is clean and fairly quiet. Spacious rooms. Can get tea and coffee making facilities on request.", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r462081408", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "How does a 4-star Hotel not serve ANY food after 1630hrs?", "review": "Quite enjoyed our stay in the hotel. Location is first class with one exit from the Airport train terminal only 50m away. Rooms are good, staff are first class and responded to a problem instantly. Only five minutes walk from Alameda where all the buses run and a further five to Larius, the main shopping street with the fabulous dome of light covering the length of the street at night. Only quibble is the lack of a restaurant serving meals or even a sandwich after 4.30pm. I cannot understand how they received four stars!", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r459254403", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Clean, polite staff, close to the city centre ", "review": "I've spent 5 nights at Hotel Guadalmedina with my boyfriend. We found the place very clean and the staff very polite and friendly. The bed was super comfy! 10 minutes away from the city centre (by walk) with all shops and restaurants. Not very close to the beach but we love to walk! So for us it was not a big issue. Internet was not the best but not too bad. All in all a lovely holiday! We strongly recommend it! ", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r458994039", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Excellent", "review": "This hotel is just over the road from the Malaga central station ( local train - end of the line ) . The room was clean and lots of  toiletries for your convenience. The bed was enormormous and we were impressed with the space and comfort. Bath and overhead shower unusual in Spain. Would go again. ", "date": "November 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r434829342", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Very Conveniennt Location", "review": "We chose this hotel as it was close to the train line from the airport, and after an overnight flight, convenience is key. After riding the train, we easily walked to the hotel for check in. Very friendly and efficient staff. Check in was easy. The room was clean and comfortable. The hotel was within easy walking distance of the old city and the port, so finding supper was easy. The advice given at the hotel, that meals only started late, was incorrect as many smaller restaurants serve meals after 6 pm. The room was not particularly quiet. You might ask for one off the main street but the back street did not look any less busy. Breakfast was served in a small restaurant in the hotel and provided good variety. It was certainly busy, though. A ggod choice. Wish we had stayed there…", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r434034525", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Relax in Malaga", "review": "Easy to reach from the airport by train, station just cross the street from the hotel. Close to the old town and shopping. Rich breakfast buffet with Spanish standards, not only cakes :-) Worked fine with luggage storage room that felt safe. Clean & fresh and reasonably spacious room. Large bathroom. Air conditioning. Good wifi. Quiet as long you don´t open the window. Hard bed and \"sausages\" to the pillow. Only one chair even though it was a room for two people.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r433717686", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great value for money", "review": "Got the train from Malaga airport to the central station, less than 15 minute journey, the hotel is one minute from the station. 10 minute walk to city centre ,10 minute walk to bus station, great location.  All the staff we encountered were friendly and very helpful. The hotel is clean and comfortable. The hotel's proximity to the train station also allows easy access to the resort towns of Torremolinos and Fuengirola.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r431892727", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great location ", "review": "A pleasant hotel in a very good location. Close to the train station and the centre of town. All within a ten minute walk. Helpful staff. Comfortable beds and good showers. We can't comment on the food since we didn't eat there. Not very pretty surroundings. ", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r430930142", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Terrific", "review": "we were pleasantly surprised.  The hotel was in a great location- walking distance from the old town and super restaurants.  The rooms were not huge but large enough.  The facilities were fine.   No coffee making facilities in room, buy they do do a tea service.  That was quickly put in place.  Nothing was too much trouble.  I had to change my holdall whilst there, and they even disposed of the old one for me.   Very accommodating.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r429392591", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent Base For A Malaga Holiday", "review": "This is an excellent base for anyone thinking of a trip to Malaga. Ideal location for a 15 minute walk into the centre of Malaga for everything....bars, shopping, marina etc. And 2 minutes from the train station! So if you are travelling from Malaga Airport its the train and then almost to the door of the hotel - so simple and just what you need after a day of travelling. Our trip was a 3 night stay. The staff were extremely friendly and nothing was too much trouble. The rooms are very good - clean and comfortable. The breakfast is \"continental\" - but if you want something else all you need to do is ask - for example, fried egg and bacon.  Well worthy of the 4 stars registered for this hotel.", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r426664488", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Standard mid-range hotel in Malaga, not a bad location", "review": "Giving this hotel an average review, but there is nothing really wrong with it at all.  It has large beds, big rooms, and a location across the canal that is not bad for the price. There was just nothing special about it - it did the trick for a one night stay and a visit to the beach.  Staff are very nice, and there is parking downstairs for 13 or 14 Euro.  If all you need is good nights sleep, you're set!", "date": "October 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r424490733", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Great value/great location.", "review": "The hotel location was ideal for walking  to all bars and cafes and tourist sights and the city bus tour stop was just round the corner. The hotel is just beside local cafes providing a very welcome sight for late evening arrivals when you just want to eat and go to bed.  The hotel staff were welcoming and informative. The wonderful breakfast choice made a relaxing and well nourished start to the day. The room was very clean and spacious and  changed each day. The large shared room with an extra bed in room gave us excellent value for money and breakfast was included in our bill.  I would really recommend this hotel .", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r420769866", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Nice Hotel in Good Location", "review": "Spent a couple of nights here before travelling onto Seville. The hotel has really helpful staff and has everything you need for an enjoyable stay. It's location is ideal (just 10 minutes walk from the old town) and there are plenty of bars and cafes closer to the hotel. Malaga Centro train station is right next door and it's only a short walk to the Renfe station, Maria Zambrano too. Rooms were great and cleaned very well. Would recommend as good value for a great base for visiting the wonderful city of Malaga. ", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r420569387", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great location ", "review": "Rooms great ...air-conditioning and fridge in each room . 4 piece bathroom. Great staff very helpful. Cafe breakfast lovely and fresh. 10-15 mins walk from the shopping mall... same for the harbour and beach. 15 mins walk in the opposite direction for the old town... markets.. cathedral and Picasso museum. No shortage locally of bars shops and attractions. Train station and bus stops are all around the area should you want to travel further down or up the coast. Great location for those wishing to city break in the fantastic Malaga city. The harbour restaurants are amazing. We would definitely return to the same hotel.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r419668020", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good hotel", "review": "Stayed for 5 nights,hotel location is spot on,very clean,good sized rooms.The staff are very helpful,a good place to stay just for a short trip.This hotel is not luxurious and wouldn't say it's a 4star hotel,never had breakfast here but was never given the option. It's good for what it is but would consider staying elsewhere if I decide to visit Malaga again.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r416631169", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Great location with basic hotel amenities", "review": "Stayed for a week in July 2016 with just R/O as comments left by previous guests  commented on the poor catering facilities. The hotel does not have a restaurant,  but a sliding partition that leads to a cafe in an adjoining street. There are plenty of  Cafes/Restaurants in the area, but most do not open for breakfast until about 9.00am. The hotel though is placed extremely close to the Cercanias station that connects with Torremolinos,Benalmadena and Fuengirola which is punctual and good value for money. All in all a good reasonable hotel with no frills in a good location.", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r414133273", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Very welcoming!", "review": "Highly recommend this hotel. The staff are very friendly, they don't speak much English and I don't speak much Spanish but they always understand any requests or questions that I have. They are really helpful. The rooms are nice and spacious, we stayed on the sixth floor, which was also a smoking room. It was very clean, smelled fresh and looked really appealing. There is a fridge in the room, air conditioning, a window which opens, a safe and wardrobe facilities . The only downside is the cost of laundry! Do it yourself at a laundry shop, or pay €50 for a few t-shirts. Other than that, thanks for such a good stay! ", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r401624942", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great bunch!", "review": "Came down from Scotland for an appointment and the guys at the front were very helpful and informative with where I need to go to buy something important for the trip. Room and toilet totally clean and spotless will stay again if im in malaga :)", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r400229959", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Totally fine", "review": "Really have no complaints about this hotel, but also have nothing remarkable to share either. Very clean, very efficient and the attached bar/restaurant was classic-no, modernly Spanish. Only a few blocks from most of the major Málaga attractions. ", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r399349154", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good location", "review": "Visited here for one night last week while travelling to Cadiz. In an excellent location right next to Malaga central and only a walk over the bridge to the city centre. Staff at reception were very helpful although it wasn't  easy getting in on the night after midnight because the door was locked. The room was quite modern and bathroom of good size. Thankfully good air on too. Only small issue was there were  only 2 of us yet a third bed had been out up taking room away from wardrobe and desk. Very strange. Overall a good 1 night stay", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r391044547", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Nice hotel with breakfast issues", "review": "We, my wife, son and I, stayed here from the 20th - 22nd of June and the hotel is in a nice location being real close to the train station and not too far from the beach. There are several restaurants and shops very close by for walking. The staff at the front desk were very helpful with information of the local businesses and such. The room we had was a good size room with modern sleek decor, with the typical mini fridge and safe that was in the closet. There is also a tea service available with pre-order notification. The odd thing was with us being a family with two adults and a child, we had three single beds in the room with two of them pushed together for a makeshift king size bed. During our sleep both of us adults had some type of body appendage slipping in between the…", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r387184745", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Excellent customer service", "review": "Professional, friendly staff with good local knowledge. Very clean with good sized bedrooms. We had a vegetarian in our group and the catering staff altered the menu to accommodate this person. Conveniently located near underground for easy access to airport and rail connections.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r385151793", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Clean and comfortable rooms", "review": "It was a nice hotel with friendly staff. The location of the hotel was really good, you can walk to the city center in just 5 minutes. The room was clean and had a really big and comfortable bed. Breakfast was ok.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r379247854", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Breakfast?....Don't bother  ", "review": "On arrival reception staff were very friendly and helpful. The hotel itself in general exceeded my expectations which was good. Our room was a really good size and we actually had a double bed rather than 2 singles pushed together which was a bonus! Lovely bathroom with all the amenities you need. Location was very good, not far from the airport, plenty of shops and places to eat nearby, also only about a 15/20 minute walk to the beach. The one thing I found disappointing was the breakfast, which we paid extra for and it was not worth it. Cold meats and cereal only. We asked the waitress if there were any available hot food and she informed us they would provide us with only bacon and scrambled eggs which we had for our entire stay. Other than that I would stay here again and…", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r379128530", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great place", "review": "The hotel is clean, rooms are comfortable and the location is great.  The staff at the reception is been more than friendly and attentive to my needs. I had a double but the room was massive, the bathroom full of any confortable. I will recommend this hotel without any doubt.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r372382973", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "LOVELY HOTEL NEAR TO OLD QUARTER AND TRAIN STATION", "review": "we stayed at the guadalmedina and found the bedrooms superb. the bed was very large and everything about the room was fabulous. there was a cafeteria which doubled as the dining room but unfortunately the meal we had was not very good. there are plenty of cafeterias nearby so not a great problem. would recommend bed & breakfast but not evening meals. reception staff were very helpful . right next to the malaga centro railway station. ideal location for visiting the old quarter and port area.", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r372361852", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "An excellent Hotel!", "review": "All the Malaga attractions close to the hotel. A comfortable, clean hotel. Nice staff. Train station next to the hotel. Malaga wonderful combination of history, art, good food and sun. Ronda worth of visit.", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r369027702", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "good location for malaga city", "review": "We have stayed in this hotel 4 times now and have enjoyed every stay. It is ideally situated for the port, the town centre and Huellin. The rooms are very good quality and the staff were most helpful and polite. The cafe is great for breakfast and snacks throughout the day.", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r368445345", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good location!", "review": "This hotel is clean and modern, rooms a good size and the bathrooms well equipped and spacious.  The location is good for the train station, city centre and port.  The staff were polite and efficient, reminded us of a posh premier inn!", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r367309213", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Short break", "review": "Stayed here for a mini break , good location just a few minutes walk from the old town Malaga , very quite hotel we actually thought we were the only people staying in it 😃 Rooms nice with TV and radio ,fridge , the only pit fall was no kettle for tea and coffee in the room  Which you would expect from a four star Hotel , other than that everything ok and staff pleasant and helpful 👍", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r365182027", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Conveniently located hotel", "review": "The hotel is a 10-15 minute walk to Calle Larios which makes it very convenient for the shops & food. There is a large El Corte shop nearby. The staff were friendly. Room was clean & quite spacious. Bathroom was a good size. Wifi was free and fast. After reading the other reviews about the traffic noise, we asked for rooms on the higher floors; our rooms on the 5th floor was fine. The not so good was the breakfast- continental only, although there was a reasonable selection of cold cuts, fresh fruit and pastries. Coffee was from a machine - just adequate. An ok stay.  ", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r364843778", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Good position", "review": "This hotel have a very good location. Not far from centre a not far from bus and railway station.  Rooms are good but not great. Bed is not  much comfortable but rooms are clean and barhroom is big with good equipment. Breakfast is rather poor. For me the worst thing  is a noise from street. ", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r364407940", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Short weekend in Malaga to see Barcelona FC", "review": "We chose the hotel based on location close to the old town and museums and close to the Malaga FC football ground, and we scored a goal.  The hotel is new and very clean, the staff were very friendly and the rooms were very comfortable.  It's probably sensible to pay for the garaging as there is limited on-street parking in the area", "date": "January 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r343982953", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Ok, but probably would not return", "review": "Firstly, the positves. Clean and well maintained room and very friendly and helpful reception staff. We booked the hotel quite late and the price was good for a pre-Christmas weekend get away. The location was ok, but a 10-15 minute walk from the city centre. The negatives were the noise of traffic outside and the room temperate, which was hot and the air con just made it warmer! All in all it was an ok hotel, but not one that we would be likely to return to.", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r333966631", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great Malaga Stay", "review": "A very clean and very professional Hotel, Very comfortable, a bit on the edge of town, but close enough walk through the artisan style side streets parallel to the main road. Rooms are very comfortable and spacious with a modern style. Bathroom was also very large and modern in style with a fantastic rain head shower and all amenities. Rooms service offers a free tea service, where they offer you a kettle and tea bits for making a lovely cup of afternoon tea, make sure you ask for black tea, otherwise you will only get Mint/Green or Red Tea. Staff are very friendly and helpful and always able to help. The car park is definitely an experience.....just make sure you have a small car!!!  My only complaint would be about the breakfast, the choice was great however for the first TWO…", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r329249420", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Very convenient for the station", "review": "Reception staff very polite and efficient. Rooms super clean, and well equipped . Some nice little extras ..comb....razer.....toothbrush and paste. No tea making facility in room! We visited in October and air con had been turned off, which meant the room was far to  hot.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r327349177", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Long weekend with a friend who lives in Spain", "review": "Excellent location for central Malaga and the port. Close to buses and train connection to Malaga Airport. Quiet area at night. Friendly staff. kettle and tea bags available for your room if you request this. We asked on arrival and it quickly appeared in our room.", "date": "November 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r326711033", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Nice quiet hotel", "review": "A nice hotel by the canal, walking distans to the center. They had an ordinary breakfast served in the local bar. I had a veiw overlooking the canal. Nice and helpful staff. The room was nice and clean.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r326280480", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "'Perfect location for travellers'", "review": "We stayed at Hotel Guadalmedina on our last night of a two week stay in Spain. We used the public transport to get around and needed a hotel where we didn't have to drag our cases far once we got off the train, this was perfect, about 60m from the station. The rooms were clean and the bed was massive. The shower was powerful and all toiletries supplied. Breakfast was available in a small shop/restaurant on the ground floor but we opted to stay room only. Wifi is included, a fridge and there was a few English tv channels. It was about 20-25 mins walk to the harbour but the walk is well worth it. Our Spanish trips will always end in a trip to Malaga from now on and will stay here because of our initial experience. Malaga has everything from beaches, harbour, city centre shops,…", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r321521376", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great value for money", "review": "Booked this hotel last minute on a weekend so you can expect all of Malaga to be fully booked. The locaiton was good, a bit outside the preferred area but still 5-10 minutes walking to the city center and 10 minutes walk from the train/bus station.   The hotel lacks any wow factor, but you do get a bit more of what you pay for. You can see that the rooms were recently refurbished but with not so high quality materials. The amenities are very basic and soap and shampoo come from locked dispensaries. Internet was complimentary and very reliable.  The people at the front desk were nice at all times providing tips for the city and giving us a room in a high floor, as requested.   In conclusion its a nice hotel if you are looking to walk around Malaga and not expecting to come back…", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r321168850", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Comfortable feeling and good location", "review": "Location location! It only takes a 5 minute walk from the train station to the hotel. The bed was very good, the best we had during our stay in Malaga. We also stayed in two other hotels from which one was also a 4****hotel but the bed at Guadalmedina was definitely the best! TV met our expectations, really good.  Breakfast was in a rather small room. Ample choice although presentation is not very attractive. People who are not guests from the hotel can also have breakfast there.                 ", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r316325229", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Short Break", "review": "jump on the train at the airport and the hotel is in Malaga central. Just around the corner from the train station. Very modern, excellent room and friendly staff. Within walking distance of all sights and shopping, no need for a car. Open top bus is a must!", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r310518557", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Nothing special but conveniently located", "review": "Foreword: without knowing it in advance, we were in Málaga during the \"Feria\" and in that week (around August 18th) all prices increase considerably and finding a room can be quite difficult. So we ended up paying for this hotel much more than I'd reckon a correct price, but this couldn't be avoided given the period.  Pros: the hotel location is very convenient. City centre and harbour are at walking distance (10-15 minutes). If you feel like walking, you can also reach the Malagueta beach (5-10 more minutes from the harbour).  Also rather close are the train and bus stations, and the shopping district with Corte Inglés, FNAC and other major stores is nearly in front of the hotel. The Museum of Modern Art (which we didn't visit) is on the other shore of the river Guadalmedina…", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r310136549", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "The lottery of 4* hotels", "review": "I always say the with 4* hotels there is a lottery like with no others. With 3* you know what to expect, as well with 5*. Buy with 4* it is either exceptional or disappointing. With Guadalmedina it is more on the disappointing side. No real breakfast (everything seems bought from a cash and carry), quite noisy and the reception place so small that it can be compared to a hostel not a 4*.  ", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r309323153", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Good hotel and a great location.", "review": "We stayed for two nights in the hotel. It is situated in a great location, next to Guadalmedina river, about ten minutes walking from the Old Town and less than a minute from the Malaga Centro Alameda train station. We only dealt with the staff on the reception desk and they were very friendly, helpful and efficient. The room was a good size, the beds were comfortable and it made a nice change to have Sky News on the TV. The mini bar only had soft drinks and were very expensive so we brought in our own. As with every Spanish hotel we have visited it didn't have any tea and coffee making facilities in the room which would have been nice after a long day sightseeing. The reason for not giving 5 stars was that the advertised free WiFi in all areas didn't work most of the time.…", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r307806562", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "4-star?", "review": "The location of the hotel is good. It situates between the city centre and the train station / bus station. One can walk to the bus station to have a day trip to Ronda or other places and a fine dining at the city centre. However, given the facilities provided by the hotel, I really dun think it is a 4-star hotel.", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r301011504", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Nice hotel, great location, a bit expensive.", "review": "I stayed for two nights in the hotel. It is situated at a great location, just next to Guadalmedina river, about ten minutes walking from Old Town.   The hotel generally is clean, the room was spacious enough, the bed was good but the corridors from the room to the elevator were a bit smelly, maybe from humidity. Also, the walls are like papers! We could hear everything from the room next door.  Most of the staff was super friendly, very helpful and most of them is speaking English adequately. Unfortunately, I had some incident with the manager(?) which was very disappointing. They found some problem with my credit card booking from Greece, so she came knocking at my door at around 18:00, DEMANDING that I come down to the reception within 5 (!) minutes in order to give another…", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r291788298", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Impecable  Staff, Perfect location", "review": "The Staff was lovely, very warm and friendly,ready to help us every moment and to realize our requests!.The location is perfect,the subway station is just crossing the street.The room quite comfortable!Sure a very good selection to stay in the city!", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r275006376", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Not basic, pure for business stay, four star?", "review": "I needed a hotel for a three days business trip near the hotel Barcelo. Barcelo was full, so I found the Guadalmedina. A check on Tripadvisor showed me a variety of opinions and I checked in.   It´s clean and efficient. Nice people at the reception, willing to help you with every question or request. The room is tidy and indeed Ikea-like, but the bed is excellent and so is the bathroom. Very big for a singlebed room. Excellent safetybox for you laptop. Speaking about energy, just a view plugs for your electronic gear...... Strange.  The airco is your best partner on trips in these hot countries, works ok but very noisy. My advise: earplugs in and you can open your window, it´s near a noisy street. Even Spanish people go to sleep eventually. This country is always alive.  Wifi…", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r274128066", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Great situation, plus a kettle in the room, but . . .", "review": ".  Hotel Guadalmedina Malaga – great situation, plus a kettle in the room, but . . .  This hotel gets 5 stars for its situation, but overall only 3.  I'd come again, mind you!  The position is extremely convenient.  It is on a road next to the river – the river Guadalmedina in fact.  From the Maria Zambrano mainline station, if you are coming from Madrid, it's a 12 minute stroll.  Easily manageable with a carry-on sized suitcase on wheels.  From the bus station, it's 5 minutes.  And if you arrived in Malaga at the airport, just catch the train – every 20 minutes through the main part of the day – and get off at Malaga Centro Alameda station (it'll cost you 1€30), cross the road, go into the cafeteria La Manduka which is part of the hotel.  The double doors at the back left take…", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r269739081", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "4 stars !", "review": "we found this hotel to be very basic. the room was a good size, the bed was comfortable. the flooring was a very poor quality laminate. the breakfast buffet tucked into the corner of the groundfloor bar/restaurant. very basic not to 4 star standard. the staff were very kind and helpful and can't be faulted.  we've stayed in other 4 star hotels in malaga and received lavish service and facilities. thankfully we were only staying for one night. a prolonged stay in this hotel would have proved very disappointing.  the streets outside were noisy with traffic late into the night.", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r266236187", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "One Night Stay", "review": "We found the Hotel was easy to find and was located quite well for a trip to Malaga. The underground parking was a bit of a nightmare. You have to enter from the street and make a 45 degree turn into an elevator which takes you down to the car park which is itself very small. I only drive a Seat Leon, anything bigger would be very difficult. For the €14 per night charge there is better parking close by.", "date": "February 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r254454692", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Great service", "review": "Amazing experience I had in this hotel.  Staff are extremely helpful, going out of their way to make your stay as comfortable as possible. All in fluent English.  The rooms are not big, but feel quite spacious.  Location is great. Not being in the actual hustle of the city's vibrant heart, it manages to offer quiet rooms. If you want to get to the city centre, all you have to do is cross the bridge.  As I had suffered an injury, I relied on room service for my meals. And what a service, indeed. Very fast, quite cheap and always very good quality food.  Although it's a little above the budget I would normally spend on a hotel, this place is for sure more than worth the price and I would surely consider staying here again whenever I'm in Malaga again!", "date": "February 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r253696941", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "Great location", "review": "We were staying in Benalmadina but wanted an overnight stay in Malaga to see some of the Carnaval we arrived at. The price was reasonable and the location excellent, very close to the suburban train station. The room was large and spacious and well decorated, as was the bathroom. The TV quality was great, though we would have liked some UK channels apart from BBC World and Sky News. The only negative point was the \"tea tray\" which you had to ask for at reception. It was very spartan and when we went to make tea in the morning there was no milk (there were sachets of sugar and what turned out to be sweetener, not powdered milk as we first thought).", "date": "February 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r253301425", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "what a find!", "review": "The hotel is great! Staffs are friendly and attentive. The place is spotless and the bed: HUGE and super comfortable. The best night sleep in weeks!!! The room was very spacious, and the shower had a great pressure. They do have a car park, but we already parked our car in the public one, which by the way hosted an impromptu Art exhibition!! It was all about saying good bye, which was quite fitted as it was our last night in Spain. The public Car park cost us 20.00 euros (for a night, please check with reception if theirs is better, as Public car park nearby don’t display their cost). If you are looking for a great location and great service and amenities… look no further!", "date": "January 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r249683790", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Modern Hotel, Good Location", "review": "The hotel is an easy 10 minute walk from the train station and a similar time to walk to the old town. Although a single traveller I was given a double room overlooking the road and was surprised how quite it was. I was impressed with the cleanliness of the room and hotel in general. The bedroom was also a good size with modern décor. The young lady on reception was very helpful and provided me with a map and pointed out all the major points of interest. I did not have breakfast as there are numerous places to eat in and around the old town. Probably more of a business type than tourist hotel. Would certainly recommend and use again if in Malaga.", "date": "November 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r239443378", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Avoid in spring and autumn!", "review": "Let's start with the headlines for this hotel and tell you when NOT to book this hotel.  1. Like other hotels I have stayed at in Spain, Air Conditioning and Heating are centrally controlled in some way. This means that ALL customers either get an option to heat OR chill their room, but not both. Go in summer and that's fine: you'll have air conn. Go in winter and that's fine: you'll have heating. Go in say April, May or October and you may find the weather unseasonably hot or cold and have nowhere to go. We've just had three wonderful days in Malaga with temperatures in the upper 20sC and the option of using the heating... We opted for open windows which meant noisy nights and mosquito bites. 2. We booked a double room but it was a double room with two single beds pushed…", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r235886609", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Average hotel, good location and price", "review": "The hotel is ok. The rooms are standard, relatively nice, but nothing special to be mentioned. The hotel is located on one large street, which is not so noisy, but also not the most quite one. The location is 10 mins walking from the city center, and that is really nice. Also the price is quite good.", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r229157251", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Be warned", "review": "A four star disaster! Booked the room few months in advance as they were one of very few that would offer triple room (3 adults). Turned out to be a double room with extra small single bed squashed in between wardrobe, desk and the window. Room was located right above service door - nighttime laundry collection and deliveries, crashing metal door and all sorts of back door activities noises. The room was facing main street and there was less street noise than the hotel operations noise. The housekeeping staff was going through our personal items without even bothering to put them back in place. One of us had a very expensive shirt missing which was never returned back. The only advantage is the train nearby, which brings you to the airport within 10 minutes and quite helpful…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r226863336", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "A nice hotel", "review": "That's really a very nice hotel with good prices for the room. Location is perfect, close to the main streets and directly by the metro station. Very friendly and helpful stuff.  One bad point- you have to pay for parking for the car (15 or 20€/ night).", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r220905607", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Try to avoid breakfast and good luck with parking", "review": "Breakfast was very bad for a 4 star hotel and for the 11 Euros I paid. Parking is a pain. Receptionist told me that I have to remove my car at 11 AM the next day or I will be charged, ridiculous because the checkout is at 12 pm. I arrived at 1 AM and needed to park the car for a while in front of the hotel. Maximum allowance by the receptionist was 15 minutes and I had to look for parking at 1 AM at night.  I woke up to a car using the luggage drop off area to park. The same car kept on using that space as parking and invading the luggage drop off area for about 2 days. Hotel did nothing about it. Very disrespectful and not fair for a customer like me who had to pay 14 euros for parking overnight. Only good thing about this hotel is location and that the showers with good water…", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r218904254", "sub_review": {}, "travel_purpose": "", "rating": 1}, {"title": "Great Location", "review": "Location of hotel is between 10-15 minutes walk from main railway station and bus station. 10 minutes walk the other way is Malaga old town centre. the hotel itself is modern and efficient. I arrived 4 hours before check in time from a overnight journey just expecting to be able to leave my bags but as they had a room ready I was checked in which I was impressed with. Good wifi through hotel which is a must when traveling on business. I did not eat in the hotel as the range of places to eat close by was too tempting.", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r212810007", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Good value for money and helpful staff. Excellent location", "review": "My friend and I stayed at the Just Guadalmedina Malaga in May 2014. Our first impressions of the area was a little disappointing. After having a bad morning the fist person we met upon our arrival to the hotel was a lady with long blonde hair(pity I didn't get her name). She was so friendly and helpful to us. She gave us a whole new impression of the place. The rooms were efficient and modern. After walking around the the area abit upon the Adobe of the friendly lady we discovered that the hotel was in the perfect location. We were 7 min from the Maria Zambrano train station which was great for shopping and taking day trips to other cities and 10 min walking in the opposite direction we found ourselves in the historic center of Malaga. The beach was not too far off either.  I…", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r208825476", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Good value for money", "review": "The hotel has got the perfect position to visit Malaga since it is about 10 minutes from the centre and it is even closer to the main train and bus station if you want to reach the rest of Andalucia. There are also a couple of good restaurants nearby and plenty of shops and cafes. My room was very confortable, with a big single bed, air conditioning and modern bathroom. It had a view on the river. I had a wifi connection in my room, but it was quite poor. I would definitely recommend it!", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r204285943", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "In hotel customer care less than zero !!!!!", "review": "Booked 2 rooms for family of 5 this for one night before our cruise. It was April and unexpectedly warm. We arrived after a very long day travelling approx 10pm . And we were leaving by 9 am so expensive for our time there but locality to Dock was good enough for us to pay.   The rooms air con was not working and was left in 'warm' mode so we were literally melting in our beds. Windows fully open so road noise not helping our sleep.  After an awful nights sleep we wanted to speak to the manager at 9 am and was bluntly told that the manager was in bed as it was early ( I know !  To early made me laugh as well ) and would not want to be woken !  The receptionist was unhelpful , blunt, couldn't care less. I asked for a refund of some description and was told flatly no ! And yet…", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r203622342", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Good Travel Option Stay !", "review": "Stayed for 1 night, as flying early the following morning. Travelled from Estepa to Malaga, and needed somewhere close to train link to airport, for early flight the following day. The hotel is across the road from Malaga Centro (Central) station, which takes you to Malaga airport (feungirola line) and a 10 minute walk from the bus station. I walked into Malaga central promenade, which took 15mins. A great location for a hotel, room was a good size, along with bathroom. Staff were very helpfull and courteous.", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r203565680", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Great value for money", "review": "The hotel is within easy reach of the train station and close to the shops, bars and restaurants in the centre. This modern hotel offers clean, bright and spacious rooms with good size modern bathroom, flat screen tv and minibar. For these with a hire car there is also the added advantage of private parking which is available to guests for an additional charge. Overall I would recommend this hotel for those on a short break or if travelling on business.", "date": "March 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r198890839", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Group visit", "review": "At the start of our five days, and at the end, we met Carlos. A very welcoming and informative member of staff. As one of a party staying at the Guadalmedina, I did wonder if the 'restaurant' would cope with our numbers for breakfast. Cope in the sense of space available and dishes available. Because our arrivals were somewhat staggered, this did not become a problem. The hotel is not too far from the historic centre but is well-placed for the coast railway or the main RENFE station.", "date": "February 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r196020308", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "good location, BIG BED", "review": "This hotel is just a few minutes walk to the city.  You just head north go over the bridge and you are there. It is 30 seconds away from one of the smaller entrances to Malaga centro train station and a couple of minutes to a large entrance if you prefer more light. Its less than 10 mins to the main Maria Zambrano station which is near the bus station. We took the bus to Nerja (1hr 20min) from here. The hotel staff were friendly and helpful.  Room was a little smaller than anticipated but was nice and bed very large. The drinks in the fridge are chargeable and as usual a little pricey. We were on the first floor directly above the restaurant/breakfast area and this was a little irritating.  We could not hear voices but could hear them  them setting up in the morning and water…", "date": "January 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r194039981", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Modern Hotel", "review": "Stayed here for a week, courtesy of insurance company whilst our motor home was being repaired in Malaga, nice comfy rooms Queen sized bed, very clean, and it was centrally situated ,within wailking distance of the city. They also take dogs ( well behaved) The only down thing for us there wasnt any tea or coffee facilities in the room.", "date": "January 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r193845839", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Nice Modern Hotel", "review": "Great hotel, Friendly efficient staff. The hotel is within a 10-minute walk of Malaga’s old town and the shops and bars of Larios Street. Location is great and just a 5 minute walk  from malaga central train station. The rooms are clean and modern with with free wifi that worked great in our room 510 and free safe, comfortable 2 metre double bed, great shower with plenty of hot water.", "date": "December 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r188158009", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Probably right in the middle between Train Station and City Centre", "review": "It's a reasonable distance walk (15 min) from the train station to the hotel. The hotel is also around 10 min walk from the city centre. The room is clean and the wifi connection is fine. The receptionists are friendly. It is quite close to the department store El Corte Ingles so if you need some basic items (e.g. water) you can get them from the supermarket.", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r184216991", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Clean, convenient and well organized", "review": "Hotel Guadalmedina was clean and modern.  Everything worked as it should and the room was quite roomy with comfortable beds and a large bath.  It was within walking distance to the harbor, gardens, train and bus station, art museum and the main part of downtown.  It was close to restaurants although, it also served breakfast there at the hotel.  It is also within walking distance to the metro that takes you to the airport.  It is more like a business travel hotel, however as tourists not looking for a pool and spa, we found it to be in the perfect spot.    The staff was helpful and efficient.  I would not hesitate to use it again.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r179227690", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Not a 4star hotel.", "review": "Very clean and with good room space.  However, it doesn't deserve the 4star hotel rate. Very few services, very low internet, the parking is very difficult to use. The restaurant is not expensive, but there is no menu to choose, just some daily choices, very limited.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r178007972", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Perfect spot", "review": "We doubt you'll find a better location or quality of hotel in Malaga for the price. Great location, within 5 minute walk to old town, shopping and sites. About 15 minute walk from beach. Room are modern and nicely appointed, bathroom is very nice, bedding excellent. Staff were extremely helpful and friendly.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r175656857", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "One of the Best Options in Malaga for the Price", "review": "I searched for a long time for hotels in Malaga that were in my price range and also in a safe location for a woman traveling alone. Well this hotel ended up being perfect. It was a comfortable room, extremely clean, modern feeling and great internet connection to research your next day or dinner location. The staff was not overly helpful, however, they were pleasant enough. A walk to the best places to eat or many of the sites such as the cathedral most the time only took 10 to 15 minutes. I had a blast in the area.   I should caveat this review by stating that this hotel even though great for my needs does meet everyone's expectations. If you are looking to feel like you are in Andalusia while in your room (this is not the hotel for you) or if you are looking to have a place…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r173474717", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Very pleasant stay in a beautiful town", "review": "I read some excellent reviews of this hotel on Trip Adviser band I am in agreement with them all. The hotel is modern clean and represents good value. It is also just across the bridge from the old city and access to all attractions was within walking distance. A few meters from the hotel are some quaint cafes and bars where we would regularly have breakfast or lunch at very reasonable prices. We did not eat in the hotel. The staff were helpful and pleasant.   The most important thing to share is the proximity to the airport. One of the reasons we booked this particular hotel was because they offered a transfer to the airport. They then quoted us 25 euros each for the service and we decided that for 25 X 2 Euros we could probably just get a taxi. As it turned out we caught a…", "date": "July 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r167795419", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "good value for money", "review": "a very good surprise - the hotel is new - very recent design and central location not in old city but just a bridge to cross - friendly staff, very clean, wifi is free and works well (maybe a bit slow in rooms) - they have perfect english spoken & fluent french - I had an extremely low rate for a double room, probably due to the low season. I had no car - would not recommend to have a car there..very decent place for a short stay in Malaga with reasonable price.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r161687852", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "Good stay in good location", "review": "I booked my room for two nights on internet and the price was most reasonable - then I needed to stay another night, for which I paid rather a lot - my own fault but something to be aware of!  Otherwise the room was large and comfortable, bathroom clean and spacious with good bath and shower.  There were also extra pillows in wardrobe - a big plus for me!", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r161090457", "sub_review": {}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Good basic comfort in the city", "review": "We stayed for 3 nights before moving on to stay with friends. The reception area was not promising but the room turned out to be large and comfortable. The super king sized bed was firm but comfortable and the pillows were nicely soft. The bathroom was large with a good shower.  The hotel 'restaurant ' turned out to be a street cafe/restaurant in which hotel guests were welcome to take breakfast. This was not great unless you like your bacon and fried eggs very cold.    The service at reception was welcoming and any queries or requests for help or information were met helpfully with a smile in English.  This is a business hotel hence no pool or sunbathing facility. The latter could easily be located on the roof which would be a very welcome addition for non-business users. Wifi…", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r158824456", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Would not qualify for a 4 star in my opinion", "review": "Just spent two nights at this hotel. The positive points are the location. Very close to the central shopping and eating areas and to both the local and main railway stations. The bathroom almost makes it into a 4 star, except for the awful washing/ bathing soap facility which is an all purpose liquid thing, one near the wash basin and one near the bath/shower. It left both my skin and hair in a terrible condition, I didn't take my usual shampoo as it gave a fabulous description of the toiletries available. The bedroom too would have got a 4 star rating, except there was no indication of how to work certain aspects of the rooms techno stuff eg. the TV, where service was abysmal, the radio didn't work and there was no information about the programmes available, we had to discover…", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r156852207", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Sterile decor and thin walls!", "review": "We booked this hotel for an overnight after a cruise and flying home the next day.  We had pre-paid the room, but the hotel tried to tell us we had cancelled the reservation,  A phone call to the cruise line was required to sort that out. Then when we got to the room we could not get any lights etc to work, a quick call to the desk and we found out you need to insert your key card into a slot near the front door to activate the electricity. Who knew? This was mildly irritating as they only gave us one card, so when one of us went out to get something the card had to stay in place for te person in the room. Additionally my ipad could not charge while we were out for dinner.  The free wifi wouldnt connect and desk clerk said it didnt work well for tablets.....  Hmm. Why?  We also…", "date": "February 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r152992733", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "AWESOME VALUE NICE HOTEL!", "review": "Dear Sir,                                                                                                                                                       We are really sorry for the inconvenience. The electric system in the rooms are with the magnetic card, normally we give one key at the check-in. We are in reception 24 hours in order to help our customers. If our customer needs a copy, we are charmed to give  two copies.       As far as the problem with the wifi, we realise that we had a general and puntual  problem during   one day.  We look forward to seeing you again at our hotel, Thank you for  your comment Yours sincerely,   Hotel Husa Guadalmedina", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r144341793", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "One Night", "review": "I always expect anything in Europe to be too small and too pricy.  We were so surprised at the minimal price we paid and how updated, clean, hospitable and the size of the rooms.  We were a little nervous because some of the surroundings were a little shady but the street the hotel was on was safe.  There were a few restaurants but we were there on Sunday but most everything was closed.  The hotel restaurant was super convenient and the food was good.  We would stay there again!", "date": "October 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r142869170", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 4}, {"title": "good location, good staff.", "review": "In general terms is a hotel with good value for money, at least in October. Well situated, not far from the center just opposite the Museum of Contemporary Art. The only problem is the parking: just terrible even for an experienced driver and a middle sized car. ", "date": "July 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r135759976", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Well located", "review": "Our room was clean, modern and for the price we payed it was a perfect value. It's easy to walk to old town also to the marina. The guy at the reception was super super helpful. He answered all our questions and he gave us many suggestions. I would definitely go back there.", "date": "February 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r125470435", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Fair average", "review": "The rooms are OK, meaning spacious and clean. The bathroom, although spacious, had only a shower type 'drain in the floor', meaning the whole thing gets immediately inondated when you turn on the shower. But besides that, everything is up to Spanish 4-star standards. Just the breakfast is somewhat below expectations: a bit unimaginative and the breakfast room is definitely too small.", "date": "November 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r120472868", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "4 Stars???", "review": "The room was clean with plenty of storage space and a comfortable bed, bathroom spacious and clean. But why FOUR stars? Terrible welcome, poor and expensive to eat. No air-con that we could find, although it was October so not really necessary. If this had been 3 stars with a 3 star price I'd have been delighted; as it was I feel ripped off, also, registration was not smooth as it should be. Rooms are great but the hospitality needs work.", "date": "October 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r119760895", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "An incredible disapointment", "review": "After touring through Andalusia for a couple weeks we had a flight back to Malaga and spent one night at this hotel. It was quite easily the worst hotel I have stayed at in the last few years and I wouldn't recommend it to anyone. After booking through Splendia you would expect a certain level of quality but not one thing was right with this hotel. Of particular note was the moody staff and overwhelming smell of cat food that fills the building. But honestly I would be happy with this place if I were looking for a hostel because that what it appears to be a good hostel in a 4 star hotel's clothes that has only got there by ticking boxes (minibar, large rooms etc.)  THE BAD: -Given smoking rooms when asked for non-smoking. -Booked 3 rooms next to each other recieved 3 rooms each…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r117143707", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Great value walking distance to everything!", "review": "I got this hotel lastminute and I was very impressed. Free wifi, good sized room and close to the old town. V handy for the train station that takes you to the airport and along the coast.  Staff were helpful and friendly    Only downside is that the cafe is right off the lobby so could be a bit smokey. ", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r116919711", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Lonely", "review": "Stayed in this hotel for 3 nights. The rooms reminded me of a travel lodge and it was very clean and tidy. The shower was almost a trickle of water but still searved it's purpose. Don't use the handwash it's awful.  Air con was ok but to really benefit it needed to be on for hours.  The beds were two singles pushed together typical of Europe but very confy. We had a mini bar but the drinks were warm and expensive so we bought our own from a near by super Market. Reception staff friendly but the bar staff don't speak English and it was a chore ordering food. We had to point to the picture of the food we wanted. They knew we were English but still spoke to us in Spanish.  Comfortable stay overall but wouldn't recommend it. The location is crap it seems far out from anywhere and…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r116837859", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Good rooms but hotel facilities average.", "review": "Good location and good rooms. 4* - not so sure. Hotel facilities pretty limited. The 'breakfast room' was shared with the general public, many of whom were smoking; it was cramped and noisy. Staff friendly and helpful.", "date": "February 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r55558518", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Perfectly acceptable stay", "review": "Our room was a decent size with large beds, did everything a hotel room should and was nice and clean. TV had over 20 channels including BBCW/CNN/CNBC, didn't have breakfast opting for local cafes or El Corte Ingles over the road. Reception is small but staff were friendly.  The hotel is less than 10 mins walk to the old town and a similar distance from Maria Zambrano station which has a direct link from the airport. A tram line is being constructed which will take travellers virtually to the hotels door step.  It's officially a 4 star but whilst there's nothing wrong with the place, espicially at the price we paid (71 Euros) it felt more like a 3 star, which isn't a criticism, more an observation.  The city is small enough to explore on foot and we used the train to go further…", "date": "December 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r51197006", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "medium", "review": "we reserved this hotel for 1 night as a hub since we had a very early flight the next morning, and we thought the price was good For a 4* Hotel (65Euros), But still, for a 4* hotel, you do expect the bathrooms to be clean. At my entrance, I could see hair all over the bathroom floor! On the other side, the staff are sweet and would do their best to help you with your questions. We couldn't use the swimming pool and jacuzzi since the were repairing them!", "date": "September 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r45187215", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "luxury", "review": "We booked three nights at this hotel, as we had business near malaga, we used to ive in Spain and always said we would like to stay for a weekend. The hotel was lovely. we were close to the station which is cheap and comfortable, close to the port and the shopping centre. It was small and compact but quiet very clean and very friendly. There was no noise and you never saw a cleaner. The bathrooms were top quality aa were the bedrooms. We booked through the internet and had a great deal. We were joined to a cafe that was very cheap with good food and excellent coffee. It is cheaper to buy breakfast ect direct from the cafe rather than booking through the hotel. Brilliant Husa hotels", "date": "July 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r37794539", "sub_review": {}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Excellent! Central, modern, would book again.", "review": "In my 20s - stayed here with a friend on a short weekend break. Room was spacious enough for two people, lots of wardrobe space,very modern, clean and comfortable, bright, nice view etc. Big bathroom. Extremely happy with our room- we didn't get great weather so nice to have somewhere comfortable to come back and relax in after rainy sightseeing - wifi, tv with international channels etc. Hotel is central, walking distance from shopping area, nightlife, beaches and directly across from excellent Contemporary Art Museum. Also walking distance to train and bus station linking airport. Only negative is there is no tea/coffee facilities in room but i think this is normal for most Spanish hotels? Unfortunately you couldn't get hot drinks in the hotel late at night as the bar is small…", "date": "December 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g187438-d944656-r23407980", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}]