[{"title": "Noisy paradise for heavy smokers and alcoholics", "review": "I can only say this was the best hotel I have stayed in ! It was spotless, friendly staff! Couldn’t do enough for us! Brilliant entertainment as if the evening show wasn’t to our taste there was other entertainment to be found! The rooms (budget) were big clean and lovely! Mini fridge and toiletries restocked daily, room cleaned daily. The food was lovely with lots of choice for all ages,and tastes, we didn’t go expecting English food as we were in Turkey! Even tho lots of English food available! Have to say for the small charge the al la carte restaurants lovely! Only one complaint I didn’t want to leave! We will be back! Ignore any negative posts as having stayed in many hotels in Antalya this was by far the  best so far!", "date": "October 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r717589587", "sub_review": {"Location": 2, "Rooms": 2, "Service": 2}, "travel_purpose": "", "rating": 2}, {"title": "Amazing hotel", "review": "Thank you so much for your nice comment and choosing Sueno hotel for your holiday. We are very happy to hear that you have had a great holiday in our hotel and hope to see you again in the nearest future. All our Sueno team sends our sunny greatings to you. Best regards,", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r684355900", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "our summer tradition for every year!", "review": "Perfect place for families, activities, foods, beach, alacarte restaurants are all great. We are going to same hotel, every summer for last five years. Thank you to all stuff and management. Hope to see you next summer too!", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r717045295", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Fully geared to Turkish guests only", "review": "As they have Turkish singers perform there, the vast majority of the guests are Turkish.  Food was of low quality, 20+ wild cats waking around, unfriendly staff at reception and guest services, men are served first at the bar, cocktails are disgusting, not enough staff to turn over the tables in the restaurant, fairground is dead as you have to pay for the rides, ten pin bowling 20 euro, all activities at the pool for 18+ so my 11 yr old son wasn’t allowed to join, kids club for the really small kids looked good though. All in all only good for Turkish people with small children.  It was my first time in Turkey, it will take me a lot of convincing to go back and if I do it certainly won’t be to this hotel.", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r708045627", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Great Hotel with above-average service and everything you need", "review": "Sueno Beach resort belongs to a dozens of megalomanian projects in the city of Side. With the capacity of around four thousand visitors it spreads on a tremendous area all the way to the beach.  Rooms are of a european size standard with bath and toilet with bidet function, hair-dryer, King size bed and a balcony. Minibar is refilled daily and free of charge. We had an incident gere when we caught a   cleaning-lady in a closed room with our stuff from the backpack layed out on the bed. We called reception immediatelly to come deal with the situation. Receptionist apologized and promised the manager will come back to us but it never happened.   Variety of bars in the hotel building, along the pools, near the beach and directly on the pier provide a selection of cocktails and drinks. Refrigerators with Water are available practically everywhere to grab.  Main restaurant is where breakfast lunch and dinner are served. Variety of meat meals and vegetarian warm meals, cold salads vegetables and fruits, diet corner (boiled vegetables meat and rice) and specialties section which differs every night. Waiters usually do not notice you and just clean the table after you are done. If you desire some drinks you will save a lot of time and energy by going to the bars and ask for them.  Side street offers different food during the day directly in the pool area. Then there are a la carte restaurants to choose from if desired.  Hotel offers plenty of activities such as gaming section with various arcade games, bowling, billiard etc, small roller coasters and ferris wheel, water slides, gym and diiferent activities during the day organised by the animation team.  Beach is private and belonging to the resort. It is clean with enough sunbeds for everyone.  All in all it was a great holiday (except of the cleaning lady incident) in a resort which offers everything you could think of. Despite the possibilities it doesnt feel like its too big and you can easilly get from one side to another. Service could be bit better and proactive not to wait for visitors to ask for everything.  I would have given the hitel 5 stars but the fact that they did not come back to us when we were surprised by the cleaning lady incident is disappointing. Givinf the resort benefit of a doubt i do suggest it if you are looking for a place to completely relax and enjoy yourself  …", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r707563588", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Typical huge resort with poor services", "review": "After a few years, we revisited Sueno hotels for a family holiday this summer. We always prefer the lake houses (family villa concept) which allows you to get away from the crowd and spend private time in the lake pool during the day. But we also enjoyed a lot the sea side and the pier on the beach where spend almost half of the day. Overall, the main restaurants and the bars have improved in terms of both physical appearance as well as the quality of the foods and drinks being served. For example, there was usually a special concept each night in the main restaurant (like seafood, Asian, Italian or Turkish) and we did not need to reserve for a-la-carte restaurants. It may be a little bit over crowded in rush hours so it is better either to go early or late in dinner time. They…", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r707558630", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Sueno hotel is renewed and upgraded", "review": "We had a family room, which was big enough with a big bathroom.  The hotel offers great food, you just have to fight for a place to sit and to choose from the offer as there were many people in the restaurant.  The evening program is great as well as the pool and the beach.  Massage, games are not in included.  Hotel has a cinema and shops.", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r707099171", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Great Hotel for Relaxing", "review": "Short review about our fabulous holiday in the Sueno Beach in Side. There is so much to do here. A lot of activities and a huge amphitheatre.  Really was one of the best holidays we have had. All people are very polite. The all inclusive package included a lot.Cant recommend this place enough! we can say just bravo Sueno.", "date": "August 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r706803345", "sub_review": {"Rooms": 5, "Service": 5}, "travel_purpose": "", "rating": 5}, {"title": "Best holidays", "review": "Me and our family enjoyed our time in hotel. We spent a wonderful week. Foods are wonderful. Especially alacarte restoraurants are multicultural, reachable and cheap. Each guest must try fish and Turkish alacarte restaurants. A PR hotel staff named Tanya helped us a lot with her fluent English, merry and tolerant character. Will Come again!", "date": "September 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r705401754", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good times", "review": "One of the best hotels we stayed in Antalya. We are a family of 4 and we stayed at lake houses, very quiet area and good to start our day swimming next to our door.   The entertainment team was great, but a special thanks to Sefa who did a great job with kids training football everyday and nice bike tours for adults.  What needs to be improved is main restaurant where service is not really 5 stars.", "date": "July 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r690673730", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Very good hotel. Perfect holiday.", "review": "The hotel is exceptional. Accommodation, food, beach, service - the highest level. But more important are the people who work there. I would like to express my thanks to the Olena Sokhodon-Gest Relations, to Mr.Mehmed Sener-Security Manager, to Hanna Verbych, Vladislav Skalozyb and Veselka Todorova from Tez Tour. I don`t have proper words to express how grateful I am to these people. They are outstanding professionals and very good people. My husband lost his bag in a taxi.We received extraordinary help from those people who searched for the bag for hours. Finally they found the bag. And all this happened in out-of-work time.Thank you very much for your help, thank you for being able to be in this wonderful hotel. God bless you. Valentina Petrova Plovdiv, Bulgaria ", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r685433955", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Perfect hotel and exellent service", "review": "Dear Valentina Petrova, Thank you so much for your nice words. We are very happy to hear that you have had a great holiday in our hotel and hope to see you again in the nearest future. All our Sueno team sends our sunny greatings to you. Best regards, Ramazan Adıgüzel", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r684503644", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Peoples", "review": "The Food was great. To much Peoples and Childrens in the Hotel and in the Beach. The music at afternoon is finish at 00:00, and than you can sleep. When you have a child on the next room, then is a short night!", "date": "June 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r684140887", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Great holidays, only dissapointed with the language", "review": "Dear Dream62659265747,  Thank you for your review. We are really apprecciate it.  We all looking forward to see you again in the near future, Best regards, ", "date": "May 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r677072042", "sub_review": {"Value": 5, "Location": 3, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Over rated", "review": "My wife and me arived there about april2018 on an ultra all inclusive tour witch any food and drinks and snacks you may desire is totally free and available 24/7. The hotel was quiet and clean, had relaxing atmosphere. Reception and staff were friendly and smiling. Rooms were clean and well conditioned. Had great view to sea and trees.inside and outside pools were clean and water was clear. Bars were ready and bartenders were polite and skillfull. The kitchen and food was excellent and a mix of traditional and modern food were served. The disco was good and DJs were cool! And also there was an amazing live concert totally free for hotel vacancies. Lovely, well-known turkish singer \"Sibel Can\". However some parts of hotel were inactive despite the advertisement.like beach…", "date": "April 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r670391619", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Nice facilities, some inactive", "review": "This is my 5. visit of this hotel, with my family and friends, we get much crowded everyear more. Who goes to this hotel, wants to come here again for the celebrity music singer, fun and the style of food for Turkish people. Espeicially Side street is great. The see, pools too. There is only one thing to say critisize; it become old they have to make restoration, the rooms, the lunapark maybe lobby etc. But I still like this hotel. For the hotel this year you changed your waiter and waitresses with Kırgızistans; they don't know Turkish İt is a big problem for Turks please change it again aith old ones", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r668246395", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Turks Love this hotel", "review": "When I was is Turkey this summer, I lived in a luxurious and comfortable hotel. It is a five-star hotel with friendly staff. A sunny double bedroom with a private bathroom in our apartment. Only two minutes from the sea and with a terrace with great views. There are lot or restaurants, cafes and clubs nearly. Food was ordinary. All hotels guests can visit the gym and swimming pool for free. Many sports grounds for outdoor activities. It is an ideal place for recreation. Hotel has a lunapark and makes great fun for kids.  I would like to visit Sueno once more in the future.", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r626068548", "sub_review": {"Location": 5, "Rooms": 3, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "The beautiful hotel for vacation.", "review": "Sueno Hotels Beach Side Dates of stay: Sep 3 - Sep 13, 2018 Tourists: 2 adults and 1 infant  Safety of tourists is not the priority of Sueno Hotels Beach Side. And I will explain why. Unfortunately my little son caught KOKSAKI virus on Sep 10. Tourist hotel service helped to call a doctor. We got a prescription to take medicine and to apply ointment on the acne. No sunbathing, no swimming. So we spent the rest 3 days till end of our stay in the hotel room. At our final day the checkout was at 12:00, we wanted to extend our stay till 18:00 as we need to take medicine, to apply ointment, and to change nappies often cause of diarrhea. I explained all that to Emin (Chief manager of reception, responsible person that day, Sep 13 2018) and you know what I was told. To checkout and to…", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r618336221", "sub_review": {"Sleep Quality": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Really awful", "review": "It’s the first time I’m here but I really like this hotel. Everything is high quality here. All drinks, food and service. :) all staff are smiling always and they are so cute 😄😍 here is like my house I’ll be there again and again :) ", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r610730143", "sub_review": {"Sleep Quality": 1, "Rooms": 1, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "GREAT", "review": "As we received a room we started having issues. We got one that was quite far away from the main building and it also looked differently than in the photos it is advertised in, so we asked for another place at the hotel's front desk. We were given a new room which was better and was similiar to one in advertisement photos but had another problem. It was facing a loud ventilation system outside so we decided again to ask for another room swap but the manager became very hostile and agressive as we did so. He started to talk in raised tone while we were trying to deal with him peacefully but he was having none of it. We even asked if it was possible to upgrade to some better option for extra pay but instead we were arrogantly suggested that we could be moved to different room one…", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r610486745", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Terrible staff and false advertising", "review": "Now when i make my comment about this hotel i am still there.Absolutely terrible.After entered the hotel no one met us.Such us we were at city hotel.Beach is far from hotel and if you can fine sunbed around the swimming pool you are really lucky.At restaurant also finding empty table is luck for you.The table us like a pension ,just eat and run .The quality and variety of food are really bad .We came from long way and wanted to sleep just one hour but this is impossible,A lot of children around shouting and uneducated families are clients of this hotel .Hotel should give children family next to not bothered outhers.If you give yourself importance dont spent money for earn anger.You can sit whole day at lobby but no one will come to ask you Would you like to drink something 😂", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r610140977", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Prices and quality contradict ", "review": "We fell in love with this hotel 7 years ago and we came back almost every summer. Service is great throught the whole complex...clean rooms, very good food, amazing beach and pools, good entertainment and hard working personel. The best place to relax, enjoy and recharge batteries.", "date": "July 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r598198121", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "All you need, everything you want", "review": "Dear Daniella;  Thank you for your comment first.We are glad to see you among us.See you again during your next holiday season.", "date": "June 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r595609730", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "It could be better", "review": "I have visited this hotel with an all inclusive in May. It was a family trip and it included everything starting with food and ending with anything you can possibly think of. The beach was very clean and the pools were extremely clean with the water being crystal clear. They provide different types of food on a daily basis and you can get anything you like anytime. The alcohol is also free and you can drink 24/7. If you’d like juice, you can have it whenever you like. They also provide beach towels, so no need for an extra towel.  They allow you to change the towels until they close at night around 5-7 in the evening. You have coffee all day long and you also have an option of a cocktail or tea and of course fresh and boxed juice. The rooms are clean, and they provide a mini…", "date": "April 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r583838556", "sub_review": {"Value": 3, "Location": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "ABSOLUTELY GORGEOUS PLACE!!! ", "review": "Stayed 3 nights, nice designed large hotel. many good attractions and enough space for everyone even high season. Kisd club and night shows very satisfying. Our stay was at lakeside villas, inside air was not fresh. Asked for room change and they offered second floor but humidity smell was the same. Other thing to criticize is weak kitchen. Food was ordinary, hard to say good enough. Otel has a lunapark and makes great fun for kids. Don't expect excellent food but remain is okay. ", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r582791469", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Weak kitchen, remain is okay.. ", "review": "Very friendly staff&good food Old tree . broad beach .entertainment variations. as the onset day , befor 14 o'clock the room received .the ancient side far from hotel only 10 minutes walking . at All i am satisfied", "date": "May 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r579488368", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Very good hotel", "review": "Nice place for staying with kids. Good food, pools and lots of fun for kids.  Ancient Side is in 45 min distance by foot, 7€ taxi or 3TL by bus. Managvat 10 km for the same price by bus or taxi.  Good hotel and place. We would like to visit Sueno once more in the future.", "date": "March 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r569935828", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Perfect vacation", "review": "Hotel location, rooms, service, food, beach perfect . Manager taking care with everything. Staff is very helpful . This year was my second visit better than last year. I am very glad and thanks for hotel staff and management ", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r526761583", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Excellent ", "review": "This was my third time at this beautiful Hotel of Side. Great beach, good facilities and entertainmant. Altough rooms needs some refurbishment, they're spacious and very clean. With it's aquapark, pools, great beach, quality of drinks and animation hotel meets my expectations. But at my last visit there was a meeting of Ankara Chamber of Commerce, members and their families. Among that  big conservative crowd, I felt like I went to an islamic holiday resort instead of a beach club. Restaurants and food were definately insufficent. One can not find a clean table (even a dirty one sometimes), long queues for almost everything, empty bowls on the buffet must not frustrate you. As a result since I can not risk my holiday and money once again, I will not prefer this lovely hotel for…", "date": "September 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r520998037", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Nice hotel, wrong time.", "review": "We (4 adults + 4 kids) stayed in this hotel at the end of May 2017 and were delighted, we would like to come back again! First I would like to thank all the staff in the hotel, they were just great, always friendly and helpful!!  They even served us drinks when we were sitting outside by the evening performances.  Evening performances were THE BEST. Every evening there was some group of about 10-20 people with breath-taking performance. Amazing, also our kids were delighted. After the performances the program continued for example with live music, oldies disco party etc. One evening there was a live performance by the sea, we were sitting by the table from which there was not a good view, and after a few minutes a waiter came to me and offered, that there was one table with…", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r500820401", "sub_review": {"Rooms": 4, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "I have never been to a better place!", "review": "Pros: big and well-groomed territory of the hotel varieties of food number of pools evening animation was amazing location - very close to the ruins of Side   Cons Rooms are a bit tired. The main building is newer comparing to Garden Villas.   This is not a pure 5 star hotel, but I give it 5 stars here as a sign of respect to the people who work hard to keep the o keep the territory green and tidy and to feed people in the hotel.", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r496811430", "sub_review": {"Sleep Quality": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Chraming beach and luxury. Real price-performance hotel", "review": "It's a very Old hotel, what we not expected. Room, balconies, and bathroom...i don’t' know if they ever been renovated...? I've been in Turkey for 5 Turkey for five times, but this was the worst interior in \"5 Star hotel\" i have ever been.  The staff behavior was like in a cheap motel somewhere near some road. Almost nobody speaks English, they don't understand what you want to order, so if you make your order, they say ok, and do not come back....i was chocked!   In the Turkish Cafeteria they forget your orders, also no English, so we usually served ourselves..:)) Also, why the  bar staff is not familiar with how to make cocktails which they have in their Menu???  Nobody cleans pool area during the day, to if there lots of people who make a mess near the pool with their trach…", "date": "June 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r489604756", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Very OLD hotel, totally not 5 stars", "review": "visited sueno in april with my family thoroughly enjoyed our stay at this beautiful hotel located on the best part of side beach you name it it has it food and drink 24 hours a day friendly staff rooms are spotless pools are superb and so clean only downside of our trip is that the amazing pier was not open also that the al a carte restuarants were closed  overall a large hotel with everything which I would thoroughly recommend", "date": "May 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r487900477", "sub_review": {"Value": 3, "Sleep Quality": 3, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "beautiful sueno", "review": "It was average to me , if you wanna have a good date in it , it's possible but at first be sure about the type of rooms you booked. And know that there is no Sea View rooms there. But in general, it's a good hotel. ", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r475996510", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "It's far from Antalia but you can most things in hotel. But as UALL hotel , its facilities were not enough. ", "review": "She is wonderful facilities and great staff and you encounter new foods and excellent restaurants serving him. The hotels were the best choice.The best staff and the best service the hotel and finally enjoy a good game the screen you can bring along family", "date": "April 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r471925579", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Simply the best", "review": "The restaurants is very good with diversity of foods.amusement park for children and pools is designed well. The rooms are very clean with good facilities. I was there in march 2016 and I would like to visit there again.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r455581235", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Excellent ", "review": "Mister Shadi R Thank you for your kind words. It is our pleasure to see that you felt at home with us and you were able to enjoy your holiday to the fullest.  We would like to welcome you again in your next holidays in order to indulge you culinary and relaxing the same time.  We wish you all the best. ", "date": "January 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r451873197", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "pervyi lyubov - vot polyubili i vsyo", "review": "We were staying in this hotel in July-August 2016 for 3 weeks. It was the 5-th time we visited Sueno and I hope we will come back here more and more. This hotel concentrated all that is needed for families with children: kids club \"Lollipop\", amusement park, children's pools with slides, and most importantly, lots of trees, creating shadow for a comfortable rest in the afternoon. Also animators create a good mood for adults throughout the day. Every evening on the stage of the amphitheater are the Turkish pop stars and groups from different countries. Rooms are cozy, bright, quiet and equipped with everything needed for a comfortable stay.On the bed comfortable, medium hard mattress, but uncomfortable synthetic pillows. Bed linen changed every day, if necessary. The food are…", "date": "August 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r434102238", "sub_review": {"Value": 3, "Location": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Excellent ", "review": "Firendly personel, quality and delicious food and meals sun beach sea pool open and close disco enterteinmant programs famous Turkish singers Turkish  hospitality free Wi-Fi good breakfest what ylu like more for holiday I am sure you will find there. How do I know? Because this is my fifth visit to Sueno in five years.  ", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r418458352", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Brilliant Holiday !", "review": "Everything was Excellent. Staff were friendly and helpful.( Special thanks to Mr. Demir ) Fantastic place . Everything is open and the all inclusive is excellent. Food great drink generous. Recommended for everyone.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r418001851", "sub_review": {"Value": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Great hotel", "review": "Me and my family stayed here in March/April 2016 and it was absolutely superb. This was during the quiet time of the season aswell. You can never get bored and the building is generally just beautifully designed. Brilliant views from the bedrooms. Near to Side. We actually walked there. Just a very memorable holiday. Suggest strongly. Food was also brilliant by the way.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r415392078", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Brilliant holiday", "review": "Değerli Misafirimiz Borat S,  Öncelikle bu güzel yorumlarınızı bizlerle ve tatilcilerle paylaştığınız için çok teşekkür ederiz. Sizlerin görüşleri ekibimiz için büyük bir moral ve motivasyon kaynağı olduğunu belirtir, Sueno ailesi olarak sizlere teşekkürlerimizi iletiriz. Bu güzel yorumunuz bizleri çok mutlu etmiştir.  Sizleri tekrar aramızda görmekten ve tesisimizde ağırlamaktan mutluluk duyacağımızı belirtir, iyi günler dileriz.  Saygılarımızla,", "date": "April 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r412099728", "sub_review": {"Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Awesome place but a little dated", "review": "Stayed here with my wife and in-laws (her parents and her two sisters) in August/September 2015. A year prior we were going to choose this place to get married but decided to keep it local in the end.  Thankfully we didn't get married here... but firstly to the positives. Food - so much variety and you're truly spoilt for choice. From breakfast, lunch through to dinner you can choose a smorgasboard from the buffet or head outside and pick more food from burgers and Turkish pizzas. I seriously put on a few kilos the week we stayed there.  Entertainment - fantastic. Every night had great concerts from famous Turkish singers in Ebru Gundes and Sibel Can (although I couldn't understand a word they were singing - they had the crowd singing along) to a Russian circus and African…", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r407822080", "sub_review": {"Sleep Quality": 4, "Rooms": 3, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Lake houses are relaxing", "review": "Best hotel for families. If your child is over 5 years old I advise you the lake houses. (Cause doctors advise sea below 5 ) The pool is just front of your room. It is so much fun. Also the beachside is perfect. The pier is so nice and not very crowded even when hotel is full. Game center and lunapark is best for kids. ", "date": "July 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r399509393", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Totally relaxing and enjoyable", "review": "Dear Sema , Thank you so much for your feedback about your recent stay at our hotel. All the points you mentioned in your comment has been forwarded to our management and taken into consideration.  We were glad to read, that in general you liked your stay at Sueno Beach Side  Looking forward to see you here again.  Kind Regards,  ", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r383684839", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "pleasant holiday", "review": "Hotel location, pools and garden are nice. The pier is great. Cats are fantastic, provided you did not forget to close your ground floor balcony, otherwise you wake up surrounded by cats. But rooms are tired, last decorated twenty years ago and noisy, with an old air-conditioning impossible to turn off. And service. Mandatory wake up at 8.00 as cleaning staff does not care that you want to sleep. Almost no English, I got body lotion instead of shampoo in shower every day. And zero care about individual guests, do not risk your holiday, if you are not a part of busload of tour operator group.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r382889424", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "For families with kids only", "review": "What a great hotel. Huge lobby and main restaurant. Great choice of tasty food. Rooms clean and modern. Lovely hotel grounds. Right on the beach. A nice walk to local marina and roman ruins! The staff were professional and friendly. We went as a family and had a relaxing stay. Not all facilities were open yet as we went in late March. Would love to visit this hotel again.", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r381724769", "sub_review": {"Value": 3, "Location": 4, "Service": 2}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Fab spring getaway", "review": "Nice hotel for a holiday with 2 kids. Room was clean, all inclusive meal plan was fine. Every second of the day you can find something to do for the kids, so parents can enjoy the summer... :)  Evening Events are satisfactory as well. No idea How the nights were...  In-House shops were expensive. ", "date": "March 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r370503001", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good ", "review": "A lovely hotel and some amazing and very helpful staff.  Went on a 2 week holiday here with my wife our two young sons, we were really taken aback by how pleasant the staff were and how they made such a fuss out of our boys.  The animation team were all just fabulous.  It was great to see so many people so happy in their jobs, I would have to mention Ali the man who handed out the towels each day is one of the nicest, happiest people I have ever met always smiling and you could see the pride he took in his job.    The hotel was kept immaculately clean, there was someone always on hand cleaning up and making sure that the hotel was kept spotless.  I can not put more into words how clean this hotel was kept during our holiday.   We did have a couple of issues, on the second night…", "date": "August 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r365209381", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great hotel", "review": " Dear Milos , Thank you so much for your nice review.  It is a pleasure to see that you have had already the second time a nice holiday in our hotel and that you loved all of our facilities.  We looking forward to welcome you back in Sueno Beach Side  very soon, for another holiday with fun, tasty foods and times to relax.  Best Regards ", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r354735997", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Perfect match for your vacation", "review": "As a couple we spent great time here. Everything was perfect - from the facilities to the personnel. The rooms were regularly cleaned and the meals at the restaurant were delicious. The beach is attached to the whole complex and well preserved with thin sands. We enjoyed our winter holiday to the full. The center of Side is just 15 min away on foot along the beach. We highly recommend this hotel to anyone who is eager to spend the perfect holiday.", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r338822095", "sub_review": {"Location": 4, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Visit for Christmas and New Year", "review": "Very nice hotel, really clean and tidy. Rooms are massive with good facilities. Nice restaurant although food sometimes was a little repetitive. A la carte restaurants are very good and definitely worth visiting. Indoor pool large and heated with facility to swim outside in heated pool, nice. Outdoor areas are spacious with numerous pools, nice beach area and No shortage of sunbeds.  All staff in all areas very friendly and welcoming, and also cleaning staff always about making sure Hotel is pristine. Went to Christmas Eve Ball and New Year Gala dinner, which were both included in price,very good food at both and entertainment was good, layout in these rooms very festive. Wifi  was good in hotel, especially in the rooms.  Will definitely go back to this Hotel.", "date": "December 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r338414043", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "nice hotel", "review": "beautiful hotel if you choose a room with swimout in the quieter area of the hotel. good aircondition in the room and food is served all day long. only bad thing is that the staff barely know any english and the beds are really hard.", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r335238057", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Perfect", "review": "I've read a lot of bad thing about this hotel, all wrong. Food tones of it, drink very good, entertainment very good. The sea with very fine sand, staff all with the smile on the face, nothing bad about this hotel.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r323542569", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Nices rooms", "review": "Dear Acicabrita, many many thanks for this lovely report and for the years of loyalty. We are truly honored to count people like you and your family to our long standing regulars and we always look forward to welcome you again in our hotel.  Kindley Regards,", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r323487014", "sub_review": {"Rooms": 4, "Cleanliness": 5, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Annual holiday", "review": "It was our sixth visit to Sueno ,we love everything about it .they treat us like their family the whole hotel is perfect for couples and families . After visiting so many times we were just as welcome as the first time we arrived at Sueno. The staff are so helpful anything you need they get for you ,so Sueno will always be a holiday resort for  Sueno we love you. Thanks to Yasar Ersoy and all his Staff Jill and Norman Dyer London", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r321592721", "sub_review": {"Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good Hotel", "review": "Mrs.Jill,  Thank you so much for taking your time to write down your experiences with our hotel on Holidaychek.   We are happy that you had a fabulous time at our hotel and that you enjoyed your vacation.  The whole team was pleased to hear your commendation. It would be a great pleasure for us to welcoming you again at Sueno Beach Side  in the near future.  Sunny greetings from the Turkish Riviera.", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r319365040", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Best family holiday ever!", "review": "Good hotel  Staff okay but not that attentive apart from one or two. Football tournament on the week we were there. Entertainment re-arranged at nights Moscow state acrobats outstanding but really that was it. Food was good quality. Might return", "date": "October 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r316739964", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Never again", "review": "Dear GeorgebL6504LC,  Thank you so much for your feedback about your recent stay at our hotel. All the points you mentioned in your comment has been forwarded to our management and taken into consideration.  We were glad to read, that in general you liked your stay at Sueno Beach Side  Looking forward to see you here again.  Kind Regards,", "date": "September 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r311725489", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Excellent hotel", "review": "It's taken a while to get around to writing this review..... I stayed with my partner, 19 year old son and my mother, in March this year. Although we did manage to enjoy our holiday we did have many issues with the hotel.   Going out of season (which we do regularly) we do expect things to be a bit slower paced but not over half of the hotel being closed and building works next to the only usable swimming pool. The hotel has a number of pools but apart from the in/outside pool they had not been cleaned and none of the guests were using them. There was not enough sun beds for the number of guests and when we ventured to the beach, as the concrete dusted from the concrete slabs being cut with disk cutters was unbearable, we found it was a mess with the wooden structures, I can…", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r304836908", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Poor hotel and service", "review": "i had traveled with my family for 10 days. all gone right and was i could not expected  more i am blessed to see many resort and till now most of resort i have visited i was most lucky one to have right choice. highly recommended", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r303290172", "sub_review": {"Location": 2, "Sleep Quality": 4, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "amazing time", "review": "From the moment we arrived until the moment we left there is nothing at all we could fault. The staff were great, food was good (you could eat all day long if you wanted to!!) The activities for the children were varied and my 5 year old done something different every day in the kids club. Rooms were spacious, the all inclusive option was better than I have experienced in many places. Overall a great family holiday and we are looking to book up to the sister hotel in Belek next year.", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r302002268", "sub_review": {"Value": 4, "Location": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Fantastic family resort", "review": "The pools were very nice but not suitable if you have problems, There was only one area we could get in with steps and there are no hand rails we found it difficult Every thing else was very nice not many English if fact we never met any.  ", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r298700210", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Very enjoyable holiday", "review": "Just got back from our first holiday in Turkey. We travelled as a family of 10, ages ranging from 9 to 75. Actually had a 75th. birthday whilst there and had a fabulous party meal complete with free birthday cake in the Italian restaurant. We all had meals in the Asian and Barbecue restaurants and enjoyed every one. Food in general was excellent, with plenty of choices in many different eating places. Drinks were of very good quality, compared to some all inclusive holidays. We found the staff very helpful at all times even though there was sometimes a language problem, hardly any English at the hotel, but nothing was too much trouble for them. Our only disappointment was our room had a very small balcony, but we were immediately given keys to view an alternative room with large…", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r294982538", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Excellent Family Holiday", "review": "We had a two weeks family holiday in Sueno Side hotel in June 2015.  The hotel is extremely clean and obviously very carefully taken care of. Not once did we step into a toilet that didn't smell fresh and shine like new, even outside. This was one of the best things about this hotel.  Food at the all inclusive buffet restaurant is tasty but a little repetitive; on the other hand the Side street with many sorts of street food bars is delightful and has a nice variety of choice for lunch, even sushi..! The beach restaurant is a nice place too, if you want to have a more peaceful lunch away from the somewhat noisy main restaurant.  Pool area is well taken care of too, and we always found sunbeds for the three of us. Our 11 yo daughter was thrilled with the water park and the…", "date": "July 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r290473713", "sub_review": {"Location": 4, "Sleep Quality": 4, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Nice, relaxing holiday", "review": "This was our first visit to turkey ,and have to say it wont be our last. This hotel was lovely,nice little touches like free water  and mini bar in our room. the food was great, not fancy food,but nice choices and my son loved the breads. the food bit outside had a really good choice at lunch time. burgers, kebabs,jacket potatoes with loads of different toppings,pasta,and homemade chicken nuggets,also ice creams. We liked the beach pier to cool down. The water slides were really fast so beware. the little fun fair in the evenings was ok for small children. The evening entertainment was first class,we loved the moscow circus. The only thing i knocked a star of for was the beds were really hard and my husband ended up trying to sleep on the sofa.", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r289463863", "sub_review": {"Value": 5, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "lovely relaxed holiday", "review": "Dear  Flirty 96, Thank you so much for your feedback about your recent stay at our hotel. All the points you mentioned in your comment has been forwarded to our management and taken into consideration.  We were glad to read, that in general you liked your stay at Sueno Beach Side  Looking forward to see you here again.  Kind Regards,", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r282337955", "sub_review": {"Value": 5, "Sleep Quality": 3, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Excellent hotel", "review": "Travelled as a family of 13 with several young children and babies. Hotel had something for everyone on site. Food was of a good standard in both the buffet restaurants and the ala carte. We visited the Italian and the Mexican restaurants and enjoyed both. We also booked the beach bungalows on 2 occasions and had a great time both times. Some difficulties with the language as the hotel has large numbers of German visitors but this was not a major problem.  ", "date": "June 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r280319159", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "Wasted potential", "review": "I have stayed here with my parents in summer 2013 and it was one of the best hotels I have ever been to and probably one of my favourite vacation. My parents really enjoyed it as well, and we had the chance to see Sibel Can performing live which was a bonus on top of the great customer service, amazing food and probably one of the best beach in Turkey. Animation team were really friendly but I must say photo team was my favourite, we had some great photos to remember thsi beautiful holiday with my parents. We used to go to the downstairs Hamam and massages were very good too, I will definitely go back here in near future, highly recommended", "date": "May 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r272586697", "sub_review": {"Value": 2, "Location": 3, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "AMAZING HOTEL", "review": "The hotel and staff were amazing we enjoyed our time there but the only thing we didn't like was it was the week where over 40s football tournament held so it was crowded with so many men that we couldn't relax as we had to use indoor pool sauna steam room and Turkish Bath a lot because of the weather so it was too crowded with men and some of them were really rude and loud then after they left on Friday it was the architects organisation thing for the weekend so was even more people but mostly women this time we struggled to find a table to eat or sit in the lobby area when the entertainment was on apart from that the food choice and quality was great if you miss your lunch you could have food near the pool 12 till 5pm amazing deserts that you cant stop yourself eating the…", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r267700528", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Fantastic Family Hotel", "review": "Dear Yasemin , many many thanks for this lovely report and for the years of loyalty. We are truly honored to count people like you and your family to our long standing regulars and we always look forward to welcome you again in our hotel. Kindley regards,", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r266250741", "sub_review": {"Value": 5, "Location": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Lovely hotel with a beautiful sun deck ..", "review": "Great hotel to stay in.. Food is amazing , hotel has numbers of different restaurant with plenty of cousins to choose from .. Turkish , Italian, Suchi, Chinese and intercontinental so no way to be Hungary !!! Hotel staff is so friendly and super helpful they go out of their way .. We loved the beach bar and the sun batching deck  .. It's so lovely .. But you need to be there early in the morning to reserve a place but I should say it wasn't too bad we managed to find a place most of the time .. Hotel also has live music aka carte restaurant especially for is Turkish guest which we absolutely loved it ... as I said there is plenty of things to do in this placer and we are definitely going back there in September this year .. Thank you Sueno !!!!", "date": "April 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r263570166", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "My holiday in March (2015)", "review": "Mrs.Canan Ferah  Thank you so much for taking your time to write down your experiences with our hotel on Tripadvisor.   We are happy that you had a fabulous time at our hotel and that you enjoyed your vacation.  The whole team was pleased to hear your commendation. It would be a great pleasure for us to welcoming you again at Sueno Beach Side  in the near future.  Sunny greetings from the Turkish Riviera.", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r262926189", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Nice and Great Hotel", "review": "Mrs.Angeladenhartrog,  Thank you for your kind words. It is our pleasure to see that you felt at home with us and you were able to enjoy your holiday to the fullest.  We would like to welcome you again in your next holidays in order to indulge you culinary and relaxing the same time.  Lovley Girls,:)  We wish you all the best.", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r262832121", "sub_review": {"Location": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Super hotel we come here 15 years", "review": "Hello everyone. We where in Sueno beach for the 15 year we where here from 21-3-2015 till 1-4-2015 pity we go home tomorrow. It is just like all that years a very nice and a friendly and clean hotel. Al the staff (from garden staff till reception) are very sweet and they do anything to it that you have a wonderful holiday. We recommend the hotel to anyone , even if you have children. There is plenty to do in the hotel and outside the hotel they have an amusement park that really is fun for everyone . The beach is also very clean and near the beach you can also get a drink. It's also nice that they have a laundry they can wash your clothes for a low price. There is also internet access available in  the hotel and even in your hotel room It's also nice that the reception and the…", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r262829921", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good vacation ", "review": "Mrs.Angelahartrog,  Thank you very much for taking the time to write this nice and detailed review. We are happy to know that you chose Sueno Beach Side again to enjoy one more memorable time with us. Our sincerest gratitude also for your warm and eulogistic words, especially addressed in this context to our personal. We are joyfully waiting to welcome you back “home” very soon.  Kindley regards,", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r262722829", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Very friendly environment", "review": "Best animation team (cüneyt, özcan, mustafa), friendly staff (turkey and...), beautiful garden, delicious food and good a la carte restaurants especially Mexican  All facilities weren't open because of cold season. Warm breakfast was limited. Sleep quality wasn't ok because repair in area. ", "date": "March 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r262032470", "sub_review": {}, "travel_purpose": "", "rating": 5}, {"title": "The Sueño Of Reason Begets... Nothing Good", "review": "Dear Guest,  We are happy to know that we could contribute to make your  visit to Turkey a great experience. Our sincerest gratitude for your kind words forAnimatıon members and the recommendation of our hotel. It would be very nice to welcome you back at Sueno Beach Side  Kindley Regards ,", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r255207521", "sub_review": {"Location": 3, "Sleep Quality": 1, "Service": 1}, "travel_purpose": "Traveled as a couple", "rating": 1}, {"title": "four week winter stay", "review": "Dear Carol p ,  Thank you very much for taking the time to write this nice and detailed review. We are happy to know that you chose Sueno Beach Side again to enjoy one more memorable time with us. Our sincerest gratitude also for your warm and eulogistic words, especially addressed in this context to our personal. We are joyfully waiting to welcome you back “home” very soon Kindley Regards ,", "date": "January 2015", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r254265021", "sub_review": {"Value": 5, "Location": 3, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "great xmas  AND NEW YEAR", "review": "STAYED AT HOTEL WITH A GROUP OF 8 FRIENDS. FOR  10  DAYS .I WOULD LIKE TO THANK ALL STAFF  FOR MAKING US VERY WELCOME FROM    RECEPTION  TO GUEST RELATIONS  .WHO LOOKED AFTER OUR EVERY  NEED. RESTAURANT STAFF  BAR AND ANIMATION AND HOUSEKEEPING WHO ALL WORK VERY  HARD.WE HAD A XMAS EVE 7 COURSE DINNER  WHICH WAS FANTASTIC  AND A  NEW YEARS  EVE GALA  ALL CREDIT  GIVEN TO SUENO STAFF. ROOM WAS COMFORTABLE ON 3RD   FLOOR   restaurant good choice of food  also had a lovely meal at fish a la carte  restaurant  and the mexican  also was very  good ..as it was winter some things were  closed. the beach at hotel was lovely sandy beach  .shame we didnt have great weather. but did not spoil our holiday. we were in minority as british guests  mostly german  belgium and turkish at new year…", "date": "December 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r248911197", "sub_review": {"Sleep Quality": 5, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 4}, {"title": "Post Christmas New Year break", "review": "Mrs.Leynee, Thank you very much for taking the time to write this nice and detailed review. We are happy to know that you chose Sueno Beach Side again to enjoy one more memorable time with us. Our sincerest gratitude also for your warm and eulogistic words, especially addressed in this context to our personal. We are joyfully waiting to welcome you back “home” very soon.  Kindley Regards,", "date": "December 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r248887648", "sub_review": {"Location": 5, "Rooms": 4, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Average service, beautiful location", "review": "We really enjoyed our stay at Sueno. The ladies in the office really did there best to phone & sort out our lost luggage (Turkish Airlines, another story!) Mine came after 2 days & my husbands after 3! The hotel gala dinner was amazing. Service & food during our stay excellent. Nothing was too much trouble. The Management sent up fruit & a bottle of wine to our room. The indoor/ outdoor pool was spotless despite it being the worst few days weather of the winter. If you enjoy swimming the indoor pool is a good size. You can walk to Side along the beach. However due to the rough sea it had created channels you could not cross. We have stayed many times at Sueno & really enjoy a quiet time out of season. The only down side is the entertainment really caters for the German market…", "date": "November 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r244572948", "sub_review": {"Rooms": 3, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled on business", "rating": 3}, {"title": "Not well catered for English guests", "review": "Mrs.Marcieake, We would like to thank you for your feedback, which is useful not only for all the TripAdvisor users, but also for us in order to pay attention to the things, which our guests like more and which less. It is nice to know, that you liked your stay and are recommending our property to other people.  Please note, it would be a great pleasure to welcome you here again. Kindley Regards,", "date": "November 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r241807407", "sub_review": {"Value": 3, "Location": 5, "Rooms": 4, "Cleanliness": 5, "Service": 3}, "travel_purpose": "", "rating": 4}, {"title": "Great hotel!", "review": "Just got back from Sueno beach, Great hotel, lovely room although the air con would not go cool enough. Food in the buffet restaurant was ok but would have preferred a couple more of the a la carte  restaurants open particularly the turkish, although we did use the Mexican twice. Obviously out of season and inclusive alcoholic drinks limited (no whiskey) if you wanted any kind of branded drink be prepared to pay 7-9 euro a shot. Very relaxing holiday. if your looking for a relaxing inexpensive break  in nice surroundings give it a go.  Rob", "date": "April 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r239981643", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Good and bad", "review": "We came here for a conference but also to have a holiday and found everything great. It has absolutely everything from pools, games, bars, entertainment, great food, gym, spa, shops, lovely beach, you name it, it has it! Plus its all inclusive so everything is included; all food, all drinks, ice creams, every bar and every restaurant. You won't pay a penny while here. For the price I think this is great value for money. The staff were all very friendly, helpful and smartly dressed. The conference facilities were good also. There is a really good kids club for during the day and evening entertainment so loads for kids to do also.  You can also walk to a place called Side via the beach, only 1km and there are shops/bars etc there, plus lots of ruins to look round. Also lots of…", "date": "November 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r239891493", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 2}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "Great place, all round fantastic conference and holiday resort", "review": "I was just coming to visit my family we all travel with travel agency nazar from Finland and Sweden.I come for to pick up them from theres hotel i stay in alanya come with same flight.When i come there security ask me keycard i say i go pick up my Mother and family ,hi say not aloud.in bad english ,i explain him hi call to reception after there they say if you really want come in you have to pay 40 € are you still interest ? …. i say i only come to meet them and we will go to city together after hi call to room say talk .and hi talk with them in room after hi say wait they need walk out to pick up me from entrance i ask why …i never get so bad service with long times waiting 40 min hi tell go to reception give me your passport .that time i was already sootier of him so i was…", "date": "October 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r236178150", "sub_review": {"Location": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Badservice", "review": "Stayed 14 nights in Sueno with my 3 children, from arrival to departure we received fantastic service, hotel staff was very friendly and courteous, food and accommodation absolutely first class, evening shows are very good fun, lovely beach front location and excellent water slides too,as a whole we had the best holiday ever. Well done to hotel management we will definitely go back. Truly TURKISH DELIGHT", "date": "September 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r231675570", "sub_review": {"Value": 1, "Location": 4, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "First Class", "review": "Mr. Hayri,  Thank you very much for taking the time to write this nice and detailed review. We are happy to know that you chose Sueno Beach Side again to enjoy one more memorable time with us. Our sincerest gratitude also for your warm and eulogistic words, especially addressed in this context to our managment. We are joyfully waiting to welcome you back “home” very soon.  Kindley Regards,", "date": "August 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r224570184", "sub_review": {"Value": 5, "Sleep Quality": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Good Place for a Family Holiday", "review": "Mrs.Güliz, We would like to thank you for your feedback, which is useful not only for all the TripAdvisor users, but also for us in order to pay attention to the things, which our guests like more and which less. It is nice to know, that you liked your stay and are recommending our property to other people.  Please note, it would be a great pleasure to welcome you here again.  Kindley Regards,", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r219399514", "sub_review": {"Value": 4, "Location": 3, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Like paradiso", "review": "Attractive and versatile hotel with two sides: normal crowded main hotel and peacefull lake side with villas, own large pool area (where one can actually swim), pool bar and restaurant. Lots of other activities within the hotel area (water park, funfair, beach).  Comparable to Club Paradiso in Alanya.", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r214476800", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "A nice hotel", "review": "Mr.jsheikkila ,  Thank you for your kind words. It is our pleasure to see that you felt at home with us and you were able to enjoy your holiday to the fullest.  We would like to welcome you again in your next holidays in order to indulge you culinary and relaxing the same time.  We wish you all the best.", "date": "July 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r214280648", "sub_review": {"Value": 5, "Rooms": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "very good place but not perfect", "review": "My wife and I spent two weeks (June-July) at Sueno. It was the fourth time for us here (including honeymoon 5 years ago). Excellent as always. Exceptional food (especially the restaurants a la carte, Asia perfect). Room cleanliness impeccable. Quality pools: impressive. Pier: one of the best around Antalya. Staff friendly and helpful.  Very fine sand beach, entering the water is low slope. Lots of vegetation, trees, flowers, gardens impeccable. But this year that impressed me most was the entertainment team. One of the best that I've met in Antalya last 8 years. And another thing: for those who like cats, here you will find \"cat heaven\" (of course kept under surveillance: clean, healthy, sterilized). Two weeks per year spent here are certainly not enough. I hope to return at…", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r213294856", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A paradise for kids, and also great for adults!", "review": "Mr. Marius, We are happy to know that we could contribute to make your 4 visit to Sueno Beach Side a great experience. Our sincerest gratitude for your kind words and the recommendation of our hotel. It would be very nice to welcome you back at Sueno Beach Side  Kindley Regards,", "date": "June 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r209459081", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Great hotel.", "review": "Mrs.Karen Thank you for your kind words. It is our pleasure to see that you felt at home with us and you were able to enjoy your holiday to the fullest.  We would like to welcome you again in your next holidays in order to indulge you culinary and relaxing the same time.  We wish you all the best.", "date": "May 2014", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r208819654", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Amzing holiday", "review": "Sueno beach is really so good hotel Its a verry big hotel Food you can choose in so much things Drinks are good Animation is super good and great shows in the evening They have a little funapark also.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r193411375", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Very nice holiday", "review": "Mss./Mr.Debore, Firstly, thank you so much for taking the time to leave a review for our hotel. We look on all reviews as a gift, so that we can be sure our guests are receiving a great level of service. I m very pleased to hear that your stay with us was enjoyable and that you once again chose our establishment for your golfing holiday. We also look forward to your many future visits to us and can't wait to welcome you again. Thank you once again for your very kind words.", "date": "November 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r191503003", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "price-quality very good hotel             stephan and netty", "review": "We had a great week here with my big family, group of 10 people. Rooms were very nice with a seaview and near by each other. We had AI and food was very good and tasty. The only thing what was not nice was that waterpark was closed and Sueno Street was open only one day. Well it was not high season, first week november, but we were a litte bit disapointed. And my 8 year granson, he was very disapointed. Weather was incredibly nice for the whole week, just sun. And Side is beautiful. If you think to go or not to, go. It's wort it.", "date": "October 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r184159580", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Birthday and autumn holiday", "review": "we've stayed for 13 days in oktober-november. (winterseasson)very nice beach. the best in turkey. from the hotel you can walk over the beachline to the old city and the harbor. do this when the sun is going under and you don't believe what you see.very very beautifull. about the hotel, when you have respect for the waiters, cleaning people, management, animation, then you get respect back and more. everything was good. Eating, drinking, spa, animation, (Ersoy your the best my man) Rooms very nice, My wife and had a very good vacation. Thank you Sueno beach. we come back, prommised.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r183065050", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "German Palace", "review": "Our travel agency recommended this place but I think they didnt know about the poor service and food. It's like hotel management cut down the costs as much as possible. Inexperienced staff, understaffed, not smiling staff, not well dressed staff, checking women staff, all here. Also they try to save money from food quality, other than ala carte restaurants which some of them are very good, hotel food is well below average. This hotel was like this all summer or is it now? Even animators, guards, barmen, everybody is inexperienced. But, beach, location, sea, lake rooms, plan, car park, environment, ala cart restaurants, gym, spa, pools are good. Side street is a good idea but not well run. Turkish and Italian restaurants were excellent. Just for 5 € per person extra. Lake rooms…", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r179104285", "sub_review": {"Value": 4, "Location": 2, "Rooms": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "", "rating": 4}, {"title": "Good hotel but poor service and low quality food", "review": "My family and I were at Sueno for Spring Break and  we loved it, we moved from a hotel room to the Gazebo and it was amazing! And my kids enjoyed the waterpark and the 'rollercoaster'. The beach was also very nice, and we loved to walk from the hotel to the town. It was an amazing experience! everything was enjoyable.", "date": "September 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r178855839", "sub_review": {"Value": 3, "Location": 5, "Rooms": 4, "Cleanliness": 4, "Service": 2}, "travel_purpose": "", "rating": 4}, {"title": "I had a lot of Fun with Family :)", "review": "This is a terrible hotel with a fantastic beach.  The hotel itself very poorly maintained with poor response and service from staffs.  Our room was not fully cleaned and prepared everyday.  Animations being non-existent.  The food was awful.  The staff is very rude with turkey non-speaking people.  It was 5th time in Turkey, but this Hotel was worst choise!", "date": "March 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r177934544", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 2, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "The Worst Hotel in Turkey", "review": "We have accommodated in family room in lake houses (2 adult + 2 kids) for 10 days.   Hotel has a good plan, meaning everything is nearby. Beach volley, minigolf, pilayes/gym area are next to the beach, nice that I can play beach volley while my wife is doing morning gym and kids are swimming or playing mini golf. If you are hungry you don't have to get dressed and go to the main restaurant. There is a large dining place (Side Street) close to beach. You can find variety of choices.   I highly recommend lake family suites. You may even don't want to go to the beach. My friends stayed at the hotel family room which is much smaller and is not compareble to lake suites.   Sea is generally \"great\" except the windy times. Clean and warm.   I may give 4 or 5 stars for the hotel - room,…", "date": "August 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r175892874", "sub_review": {"Value": 2, "Location": 5, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 1}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "All was nice but the service ...", "review": "I always care about the food which hotels serve. And this one suprised me very much. Taste of the meals were good, definitely above standarts but the main things is that restaurant opens at 11:30pm again, after dinner. Also you can drink soup until morning if you are still hungry:). Hotel Sueno has many activities to do such as bowling, aquapark, billard, beautiful blue flag beach and sea, fair, etc... All in all, I believe it is worth to go for everyone, especially in summer and spring time.", "date": "June 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r165102007", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 3, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "A Real All-included Hotel", "review": "Apart from the hotel holding a rather large conference about recycling (we think), there being lots of groups of men in the indoor pool (intimidating if I was swimming on my own) and not many Brits, we had a good holiday. This was the first time we had been on an all inclusive holiday. Great at first but then it got a bit repetetive as the food was the same every day. Very dissapointed the pier was not open. However, the Amination team were fab, especially Sarah and Kar. Lots of activities for everyone. The room was adequate for us although the toilet was not cleaned every day. Staff were on the go all day both inside and out. Lots of painting happening and works on the beach. The beach bar wasn't open. We were just a few weeks too early for the best weather.", "date": "May 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r160080938", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "April holiday.", "review": "April 2nd to 8th: After reading about the Sueno Beach Hotel through Thompson/First Choice we decide to book our first family holiday of 2013 here, big big mistake. Sold to us as all inclusive, everything open lots to do for everyone from the 1st April; Ha water slides closed as they were being repaired, as was the fun fair. The indian Restaurant full of sunbeds, the pier dismantled. O.K. I can accept these issues if told about them before booking. However whilst talking to the customer relations manager who blatantly lied to us in front of the First Choice Rep assuring us that everything was fully functioning and open it took them a further 3 days to get some areas opened, even then whilst using the water slides painting, grinding and other repairs were still ongoing and my…", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r158695575", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Holiday or Conference? Give in.", "review": "We had a family trip last year in August. We were three families total of 14 people and we all enjoyed our vacation. It was very reasonable and we all had great time. Hotel personnel was very friendly and helpful.   Kids mostly spent their time around the pool and other activities in the sea. The sea was mostly calm with some wind and the sand was awesome.   Food was GREAT and always too many choices. Rooms were clean. We had great time and no surprises. We are going this year again.", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r157607474", "sub_review": {"Value": 1, "Location": 3, "Sleep Quality": 2, "Rooms": 2, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 2}, {"title": "Family trip", "review": "My husband and I stayed at the Sueno for one week in November 2012.  We booked this holiday through First Choice, and paid a total of £652.00 for all inclusive.  November is obviously the low-season and we were warned in advance that some of the hotel facilities would not be open - I think this was 4 of the a la carte restaurants and some other eating areas, as well as alot of the outdoor activities.  The Sueno is a nice hotel however it is very big, so do not expect the intimacy of a small hotel.  It is certainly not a 5 star, more like a good 3 star hotel.  The food was ok, but not great.  The main buffet restaurant was huge, but the staff were very slow to clear the tables and you often had to do this yourself before you could eat.  The British are only a very small minority…", "date": "April 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r156772588", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Ok,  but not great .......", "review": "I have read the reviews listed below we had a 2 week stay at thee Sueno we found the staff help full rooms clean a bit of grim around the bath but was cleaned an hour or two after it was brought to the attention of the staff on the hole I good holiday although I do agree it is mainly for the Germans but I did complane that on the one night that the entertainment was for the British the Germans had it turned off this I did really went to town about but the wife told me not to start ww3 but we did on the hole have a good time would go back as I think by the time the reviews get around it might be more British orientated if they want our custom.", "date": "November 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r154929691", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "november 2012", "review": "Do not go here at this time of year only about 30% of the site open only two of the so called  al A carte open food okay but very repetitive day in day out and if you don't eat early the quality drops.The majority of holiday guests are long stay residents from Germany or Russia not many English speaking staff and they pretend not to understand! Our bathroom had black mould as did several other guests we spoke to the resort needs some TLC? Every day lots of different conferences going on and business suits everywhere which made you feel uncomfortable and we were treated as second class to everyone else the orange vibrant all inclusive wrist bands didn't help. We did not get value for money and will not be returning The all inclusive drinks are very limited if you can get served…", "date": "November 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r154741275", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "not five star and not friendly", "review": "Arrived at Sueno Hotel in Side on 5 March 2013. First impression were nice hotel but not the 5* that it had on the outside, Thomson holidays rated it as 4*, which in my opinion was still slightly high, more like 3*. The hotel had conferences on Monday to Friday and also had a football tournament during the first half of our holiday so it was extremely busy for March. Our room was clean but smelt very musty. Went all inclusive so decided to make use of the bar straight away. I was surprised to find the only local spirits were Vodka, Raki, Gin or Cognac. Having stayed all inclusive in other hotels I was somewhat disappointed by the lack of choice of spirits at Sueno. The food in the restaurant was ok but very repetitive and as we found out later was based round Turkish and German…", "date": "February 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r154694622", "sub_review": {"Value": 1, "Location": 3, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "For the money spended - fair quality", "review": "Very good hotel, I've been to many 5 stars hotels in Turkey, but this is one of the best. I went to this hotel on the dec 12, reception were helpful and efficient, and good spoke English and German. The room was nice and comfortable - clean, full bathroom with a free mini bar. Delicious and varied meals. Lots of fruit. Different type of cuisine. Nice atmosphere.", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r152078867", "sub_review": {"Value": 4, "Location": 3, "Sleep Quality": 3, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Come here and you'll come back yet", "review": "Went alone for a value for money break this January, on a first choice package. I was the only one checking to this hotel from my flight, reception were helpful and efficient, and spoke reasonable English. The room was a pleasant surprise - quite spacious, clean, full bathroom, and a free mini bar (filled every other day with beer, water and soft drinks). I also found free Wi-Fi worked in my room. Having stayed in quite a few all inclusive hotels, was pleased to find the drinks included a more than drinkable wine, decent beer, but only limited spirits. The bar team nearly always served you in order, and I found saying thanks each time was all it needed to be treated fairly - and  they nearly always remembered your last drink.  The food in the main restaurant was quite often…", "date": "December 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r151870937", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled solo", "rating": 5}, {"title": "What you make of it", "review": "my week in this hotel was accompanied by<i was told> 1600 imams.half the hotel was closed as its winter.no real surprises.the five star rating isn't a 'european' rating ,bt having been to turkey before i knew this.bar staff are waiting for tips,hence 'germans' got better service than the non-tipping brits!food was 'school dinnerish'.my main gripe was that it was always tepid or cold.the 'a la carte' restaurants were mexican or asiatic.the latter was good but one is restricted to how many times one can go.the unsually terrible weather also meant the hotel leaked.all in all barely average", "date": "January 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r151007758", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "well it was cheap!!", "review": "Stayed at this hotel for new year 2012/2013, there was mould around our bath, aquapark pool and lakeside pool were full of algae, frogs and leaves. There was food with mould on it on the buffet, food was always the same everyday, there were no labels saying what the food was, staff were very very poor we were ignored a number of times. Lots and lots of cats including wandering in the restaurant and on the chairs/tables. Very poor entertainment, activities through the day most of them didnt run, and the evening entertainment was on 9:30 until 10:30. Only one bar was open, cocktails were vodka and cordial, had to pay for fresh juice at breakfast, otherwise there was cordial which was horrible. We found the alcoholic drinks were very watered down. I am making a complaint about this…", "date": "January 2013", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r150167209", "sub_review": {"Value": 3, "Location": 3, "Sleep Quality": 4, "Rooms": 3, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled solo", "rating": 3}, {"title": "Poor staff!", "review": "Excellent All Inclusive hotel with plenty of activities (tennis, minigolf, movies, daycare, squash, spa, several pools and restaurants), great with kids, one does not have to leave the hotel if one does not want to.", "date": "December 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r147931739", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Excellent All Inclusive Hotel with Plenty of Activities", "review": "The hotel and staff were very welcoming.  The food was very good,al la carte excellent but only two were open being out of season. We had a lovely walk along the beach to Side, good place to shop and have a bite to eat.Dont take the long walk down the road, much easier to walk on the beach, takes about 15 mins.Got a bargain only cost £590 for two for a week. Would love to go back in season and would reccomend.", "date": "December 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r147288814", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 3, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "weather not so good in november", "review": "Strong point: - sand beach - divers pools - nice green areas  Weak points: - services - meal is under average - the hotel needs repair in many places  It's not a 5 stars hotel!!! Maybe 3 stars in reality.", "date": "November 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r146542564", "sub_review": {"Value": 5, "Location": 4, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "A mass tourist bussiness", "review": "Just returned from this hotel yesterday (26.9.2012)  and felt compelled to write a review straight away. Yes the hotel looks great, loads of pools, grounds are good on the beach and the entertainment is ok. The food well what can I say the breakfast is poor - fried eggs fried eggs fried eggs, No fresh fruit terrible little bun type things, evening meals are not much better either. The hotel seemed to be short of staff... Huge queues to get drinks at night. The Piano Bar was never open. Trying to get food after 9.30 was a nightmare. Myself and a German couple waited for ages for a member of staff to make us a toastie... in the end we went behind the counter and made our own!  If you are English do not go here, even if you are German. We met some nice German people and  they were…", "date": "September 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r141467503", "sub_review": {"Value": 2, "Location": 3, "Rooms": 3, "Cleanliness": 2, "Service": 2}, "travel_purpose": "", "rating": 2}, {"title": "a very good choice", "review": "Our family spend a week in Sueno Beach. The hotel has a good infrastructure (indoor pool, restaurants, sport infrastructure ...) and rooms (spaceous, clean, ...). The quality of the food is on average good.  Unfortunately the expectations towards a 5 star hotel are higher: especially on the variation of the food (the cold buffet was 95% the same during the whole week, apart from appels and oranges there is hardly any fresh fruit, the breakfast choice is not really extensive, the wine was really bad, no cheese in the evening, ...) and the service of the personnel in the bars (no menu, not friendly, poor language knowledge, ...). Lots of renovation (painting, cleaning... ) and maintenance (gardening, ...) was ongoing to give the hotel a better outlook. One can alk to Side along…", "date": "June 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r131434379", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 5, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Not a 5 star hotel! You pay for 4 stars and get 4 stars level", "review": "We are now at our last day of a two week family vacation with one baby, 9 months.  5 best/ worst Positive: 1. Food is very good. free bar, \"free\" food with all inclusive. 2. The service from the staff was good too. There were an entertainment team that was working to please the hotel guest. They were really nice and helpful.  3. There was a lot to do for people interested in more than sunlicking. Such as dart, minigolf, cinema, aerobic. 4. The hotel room was nice with hottub, shower, toilet with toiletpaper, and a mirror. 5. Good spa, hammam. Nice treatments. Proffesionaly personell that know what they're doing.  Not so good: 1. A LOT of sound pollution. A lot of boom-boom-boom music during the day by the pool. We like to listen to the birds and the ocean. We also like to have…", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r128240937", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Nice stay with a few minuses", "review": "After 10 years we decided to have our summer holidays in Turkey again. It was a good choice! The hotel was outstanding - the pools, the beach, the ultra all inclusive was beyond our expectations. Also the staff was very polite and helpfull. Hotel is very close to the centre of Side and Manavgat. The public transportation is right in front of the hotel.  On monday there is a famers market in Manavgat which is about 10 km long!  Boat trips to side and manavgat were very worthwhile, we also saw many turtles  The shows in this hotel were also very good. Conclusion: Sueno Beach is indeed a 5 star hotel.", "date": "April 2012", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r127863367", "sub_review": {}, "travel_purpose": "", "rating": 3}, {"title": "Fantastic summer holiday", "review": "I was one week and it rained heavily mostly. Service was okay. Something small being offered play tennis on a concrete court in the company of a number of Turkish students, who are also in this period had some additional training. City Side and Manangavat are particularly interesting when you get used to the local bus service for 1 Euro.", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r127502794", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "One big factory", "review": "Good wellness, restaurants average, drinks -good choice,", "date": "November 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r120903437", "sub_review": {"Value": 2, "Location": 2, "Sleep Quality": 2, "Rooms": 2, "Cleanliness": 2, "Service": 2}, "travel_purpose": "Traveled on business", "rating": 1}, {"title": "Nice hotel, not just new, too large", "review": "For the money it was about right. A nice hotel away from everything, Side about 10min walk away, My thoughts on certain areas of the hotel.  Main Restaurant - Our first night we ventured into main restaurant and it was chaotic!! We looked at each other with horror. Rest assured, it is only like this at peak times. Avioid peak times and the experience will be rather pleasant. Bottled water on the table, waiters supplying wine or whatever drink you fancy. The range of food is immense, vast. Sometimes the quality is hit and miss but when catering on such a huge scale its going to be a little sporadic. Overall, quite good.  Rooms - As hotel rooms go it was very nice. Twin beds, air con that worked, fridge stocked with soft drinks (Pepsi, Fanta, Sprite) and water which is replenished…", "date": "November 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r119288319", "sub_review": {"Value": 3, "Location": 5, "Sleep Quality": 3, "Rooms": 3, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with friends", "rating": 3}, {"title": "Good Alround Hotel in Nice Location", "review": "I'd like to go there again . every things are excellent.", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r118626966", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Paradise", "review": "just came back from this hotel.I'll try to point positive and negative aspects for each item:  1.Location-1,5 hour from the aeroport.The hotel is near the temple of Apollo-very nice to visit. If you want to take a walk outside the hotel it's imposible-there is no sidewalk and no lightning, so it's very risky, besides there's nothing to see.If you want you can take a taxi to the center of Side-bazar and ruins-5euro, 7 at return to the hotel. 2.Beach-excelent, sandy, clean. 3.Food and beverage- the food at the restaurant was mainly average-at the pool bar there were hamburgers, shaorma, hot-dogs, pizza, and grill.The juice was good-natural juice, alcoholic beverage original. 4.Rooms- here we had a problem-we had 2 rooms-double and single- but they gave us an apartment reasoning…", "date": "August 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r116934073", "sub_review": {"Value": 5, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "its good but not excellent", "review": "Well, my brother has chosen this hotel because of  Aqua park. I cannot say anything bad about it but in my opinion there are much more better things about Sueno hotel.  Firstly, I really want to commend SERVICE. Staff take a good care of  every guest. Also, there you can find various ENTERTAINMENT (beach disco, evening shows, etc.). Animation team will offer you how to spend your time but I'm so happy that they weren't obsessive as at other hotels. Next FOOD. It was great. At this hotel you will find a big variety of cuisines. I also could say that if you want you can eat non stop all day.  The BEST THING was Coffee House. I always have a big problem to find normal coffee while traveling and this time didn't need to worry about it. Let's talk about BEACH. I've spent all free…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r116572332", "sub_review": {"Value": 3, "Sleep Quality": 5, "Cleanliness": 3, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Place where I'd like to come back", "review": "Stayed there for a conference. The hotel was 100% full even in April. Lots of different symposium groups and also worldwide travelers.The hotel is so large that except for the breakfast time, there are never jostling crowds. The rooms are comfortable, most of them seemed to have good views, the beach was large,food variety was enormous and most of the food was delicious. We tried the italian a la carte restaurant and very much enjoyed it as well.The fish restaurant seemed to be in a very nice part of the hotel with a great ambiance ( amidst some trees, dimly-lit lamps and a fishing boat as a decoration) . We discovered it on our last day, so we could not test the food there.It rained in the second half of our last day and we went to play bowling and spent some time in the sauna.…", "date": "July 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r115955497", "sub_review": {"Value": 4, "Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "A high quality hotel", "review": "Do Go! Do Stay! Do Eat! Do Relax! Do Participate! Do lay in the sun or shade by the pool or on the beach! Do go down each and every slide!  Do visit their amusement park! Do enjoy the wonderful service that you will receive from the moment you walk in this resort! Do enjoy the food! Do enjoy the different types of food and wonderful drinks! Do enjoy and we will see you on our next visit!", "date": "May 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r106554087", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 4, "Rooms": 4, "Cleanliness": 5, "Service": 4}, "travel_purpose": "Traveled on business", "rating": 5}, {"title": "Yes, a little piece of heavon", "review": "We stayed at lake houses, my kid daughter, my wife, pregnant 6 months and myself. I want to present my experience and some tips if you want to be well treated. First of all, I will start with the positive items: huge resort, great variety of things to be done, quite a lot of restaurants. Drinks OK, plenty of food (rather average quality). Quite a good range of animations both at the seaside and at the pool. They have a pool restaurant that is quite interesting, several little kioskues with different types of food. They also have an amusement parc quite good (take some money with you, you get only 2 tickets per peson) Unfortunatelly, this is it about the good things. The personel is not good at all, they speak only Turkish and a little Russian. English? Rara avis. Anyway, I do…", "date": "April 2011", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r105571873", "sub_review": {"Value": 4, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Good, but could have been better", "review": "Dont get me wrong the hotel is fantastic we loved it, the staff were fun the pool area was nice the rooms lovely food was ok, but the reason we will never return to this hotel is because of the beach disco at night, it was awfuly loud till 2am i didnt think there was a need to have the music so loud, we couldnt sleep and worse of all neither could my children, they were tired and very grizly so you can emagine how my nights where at this hotel, if you like your sleep then dont go to this hotel ! recommend to under 30's with no children", "date": "May 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r66781945", "sub_review": {"Value": 2, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 4, "Service": 3}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "never again!!!", "review": "We enjoyed our holıday - the beach was great, and the jetty, the locatıon was lovely, over lookıng the vıllage of Sıde .  The gardens were bıg.  Our bıggest problem was the dısco on the beach, whıch was terrıbly loud and went on tıll 2am.   Wouldnt go there agaın - unless I was 18 and could sleep all day", "date": "May 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r64939728", "sub_review": {"Value": 4, "Location": 4, "Sleep Quality": 1, "Rooms": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled with family", "rating": 3}, {"title": "Noıse of Dısco on beach ruıned our sleep", "review": "We stayed at this place for one week and wish we could have stayed longer. We are from Australia and the resort catered for all our needs and more...the rooms were very clean, staff very friendly, food was excellent, entertainment was superb...my kids aged 6 & 10 at the time are still talking about it now and then they say lets go SUENO BEACH coz we cannot find a resort in Australia or any other country so far that offered us all the great features that Sueno offered if only Turkey was not so far we would be going to this place a lot more often...for what we paid we got our money's value and more..i would recommend this resort to others as we have high expectations and you will love this resort it is the best!!!", "date": "May 2010", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r64073201", "sub_review": {"Value": 3, "Location": 4, "Sleep Quality": 1, "Rooms": 4, "Cleanliness": 3, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "HEAVEN", "review": "We knew when we booked this hotel that it was off the British tour company radar and as a result we were not surprised that we were (we think) the only family from England staying at the hotel.  Loads of Russians, Turkish, German, Dutch and French guests, and the usual sprinkling of rude, loud and pushy people who don't know how to wait their turn.  Our first impressions of the hotel were that it looked a bit dated and tired. The reception area in the hotel could really do with a spruce up, just to bring it into the 21st century and the main bar area just off reception was not particularly welcoming. However we had a Lake Villa Family room and this was really spacious and clean which made up for the 70s styling!  Two really large bedrooms, a bathroom and spacious hall, leading…", "date": "August 2008", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r61296286", "sub_review": {"Value": 5, "Location": 5, "Sleep Quality": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "The best holiday ever", "review": "Short review about our fabulous holiday in the Sueno Beach in Side. There is so much to do here. A lot of activities and a huge amphitheatre.  Really was one of the best holidays we have had. All people are very polite. The all inclusive package included a lot.Cant recommend this place enough! we can say just bravo Sueno.", "date": "June 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r34716609", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "Bravo Sueno", "review": "As students of Bogazici University, we went to Sueno Hotels Beach Side for our spring break. Unfortunately, the service and the staff of the hotel knew nothing about kindness and customer satisfaction. The drinks and desserts were awful. We were yelled at by bartenders about why we were so crowded, where they should have been happier to have so many guests around! Besides, one of the students was beaten by the security staff and had his tooth broken. Hence, I strongly advise everyone not to go to this hotel and make them earn anymore until they learn how to behave.", "date": "June 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r34564447", "sub_review": {"Value": 5, "Location": 5, "Rooms": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with family", "rating": 5}, {"title": "One of the worst hotels...", "review": "This may be unclear to foreign tourists but most of the customers of this hotel are harrassers of young women and children. Me and my friends, students of one of the most privileged universities (Boğaziçi University) in Turkey, stayed there in April 2009 during Springbreak and were uneasy about the sexual assaults on the beach side and the discotheque. The Turkish customer profile is definitely of very low quality. I wouldn't recommend it to anyone, especially people with babies and adolescent children. The security guards kicked our friend in the face because he complained about the low security measures. The aqua park is unsafe and there are seldom lifeguards on the beach. Moreover, the service, food and drinks are NOT all inclusive. It's not a safe place to stay in Turkey.", "date": "April 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r29170516", "sub_review": {"Value": 1, "Location": 3, "Rooms": 4, "Cleanliness": 3, "Service": 1}, "travel_purpose": "", "rating": 1}, {"title": "Not brilliant at all!", "review": "Just a short review about our fabulous holiday to the Sueno Beach in Side. There is so much to do here - about 9 pools, aquapark with amazing slides, a small theme park with dodgems, sakting rink and rollercoaster, 7 a la carte restaurants (where you can dine every night if you wish), loads of activities and a huge amphitheatre.  It really was one of the best holidays we've had as a family - we stayed in a lake house villa and were spoilt rotten. The all inclusive package included international brands as well as cocktails and suprisingly lovely house wine! Cant recommend this place enough! The only downside (if you can call it that) is that there are not many British people here - mainly Russian. We found everyone very polite and conversation when spoken to. Dont hesitate to get…", "date": "April 2009", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1192102-d952353-r29120382", "sub_review": {"Value": 1, "Location": 3, "Rooms": 2, "Cleanliness": 2, "Service": 1}, "travel_purpose": "", "rating": 1}]