[{"title": "Good cost benefit", "review": "We stayed two nights in Urban Dream Nevada. The room is simple, but it was confortable, clean, and it had a table and chair for two people (it helps if you want to eat something in the room). The only part that wasn’t so nice was the shower,  it was really small, hard to move inside. There’s no separation for the bathroom, it’s inside the room, it has only a glass door separating the toilet and the shower, so everybody stays together. :D In the reception they have a microwave, plates, glasses, cutlery, and it helps a lot if you plan to eat something in the room. It also have a super market in the street in front of the hotel, so you may by water and food there (it’s easy, you can go walking). The crew is great! Very willing to help! The provide us al the kitchen utensils that we needed and opened our wine for us! ;) It’s easy to park in front of the hotel, but it’s far from Alhambra and the center of the city (you’ll have to drive these places).…", "date": "February 2019", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1989939-d9694736-r655497202", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "KNOW WHAT YOU ARE AND WHAT YOU ARE  NOT GETTING", "review": "We had room 123, First Floor, no \"personal\" toiletries, just a dispenser on the shower wall and on the wall of the area of the handbasin. Everything being separate. The shower was a decent sized cubicle.The toilet was separate, but a bit squashed. The hand basin is in a little alcove next to the Bed. We had no \"black out curtains\", just one net curtain, so the room was illuminated all night by the street light. Nice twin beds. Rock hard pillow.No hair dryer, no telephone, no coffee/tea-making facilities. No mini fridge. However, the staff were lovely, and the Breakfast at 7 Euros per head was a real feast. There is parking underground at 6 Euros per night, but if you can find a parking space in the Hotel circumference, it is free, but we were also told that in Granada, overnight parking is allowed in most places till 8am . So know what you are getting, and what you are not getting, for what has to be an excellent price for a major town with so many attractions. Eileen T, Spain…", "date": "September 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1989939-d9694736-r617429755", "sub_review": {}, "travel_purpose": "", "rating": 4}, {"title": "Nice place, clean rooms and very convenient", "review": "Staff were friendly! Everything was as expected. Had a lovely stay! Kids loved it! Pool is small but cools you down! Breakfast was lovely with a lot of choice! Kids particularly liked the churros!  Only negative was waiting for drinks as only one member of staff on reception and cafe/bar.", "date": "August 2018", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1989939-d9694736-r611235192", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Cheap & cheerful ", "review": "Cheap and cheerful, very friendly staff, quite and peaceful, not far from Alhambra, around 7-10 min drive away plus free parking, they could do with tea and coffee in the bedroom tho. Recommend to all. ", "date": "August 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1989939-d9694736-r515999095", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 5}, {"title": "Visit to the city of Granada.", "review": "On our visit to the city of Granada we booked a stay of 2 nights into the hotel named “Urban Dream Nevada”. We are very pleased with the hotel service and accommodation, the staff also is very friendly and helpful when you have some question like we had to buy our entrance tickets for the Alhambra, they also provided us a city map, so no need to look after a Tourist Information Center. In the hotel you have the choice to park your car on the public parking in front of the hotel, or to take the option of the private and covered parking of the hotel for this option they will cover you 6€ a day, we took this option and are very pleased with it. The breakfast is in buffet form and very good, viewed price/quality. The room is spacious and very clean, you have everything you need, separated toilet, shower, flat screen TV, and free wireless Internet. The hotel is located at about 10 km by car from the Alhambra,  As we did not booked our visit of  the Alhambra online, so leaved the hotel early in the morning and so we arrived at 08h00 on the location and there was no problem to get our tickets, even as there were no more tickets available online the day before. The only inconvenience was that we had to wait until 12h00 to be able to enter the Palace, we can tell that it is need to take the complete visit of 14€ pro person, when you like to have an audio guide you have to pay above the entrance price, and the parking will cost you 10€. To pay your entrance tickets be advised that you only can pay with liquid money, they do not accept any Bankcard or Credit Card. And to visit the historic city center the best solution is when you do not take the Hop On – Hop Off, is to leave your car into the covered car park of Triunfo located on the “Avenida de la Constituicion”. Please be shure to wear good shoes for your visit, because you have allot of stairs to do also. We were very happy with our visit and the hotel, and can warmly recommend the hotel.…", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1989939-d9694736-r466812459", "sub_review": {"Sleep Quality": 4, "Cleanliness": 4, "Service": 4}, "travel_purpose": "Traveled solo", "rating": 4}, {"title": "Simple, clean, price is right.", "review": "Came to area to visit ski area with the children and also decided to take in the new shopping mall. Access to mall was very easy. Location was good and right off the highway to head up to Sierra Nevada ski area. Not a tourist area, but not a bad area either. Place is very simple, beds comfortable, and clean bathrooms. Food service for breakfast was good too.  Not luxury, but if you want a good deal on a place to sleep, this is one safe bet. Building was very warm so we had window open, and the road noise was significant, but close the window and you hear nothing. So the proximity to the highway will not be a negative for sleeping.", "date": "March 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1989939-d9694736-r466343103", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 4}, {"title": "Comfortable stay", "review": "Clean room, nice atomosphere. Quite far out from the city center so this hotel is ideal if you have a car although there are bus stops just outside. This hotel is also right next to the famous science museum of Granada if you are interested in visiting it. Great breakfast with a good selection. I enjoyed my stay although i did´nt hang around as it was only for 1 night and arrived pretty late and left again early morning.", "date": "February 2017", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1989939-d9694736-r457770263", "sub_review": {"Sleep Quality": 4, "Rooms": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}, {"title": "Not worth your stop", "review": "Stayed here as a stop on a trip along with a couple other families.   A budget hotel by the highway on the outskirts of Granada at a price double what is worth.   Rooms are tiny, noisy and dirty.   Breakfast is a race to grab the few things offered before the other guests. Poorest coffee I have tried, if you want a better one, you can buy it.   Granada has much better hotels to offer. ", "date": "December 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1989939-d9694736-r447273183", "sub_review": {}, "travel_purpose": "Traveled with family", "rating": 1}, {"title": "Good Budget Hotel", "review": "This is a budget hotel so do not expect 5 star quality. The rooms are quirky with separate toilet and shower pods but no drawers so a short stay would suit. Staff are friendly and the hotel is clean and airy. It is situated at the end of the bus route and needs 2 buses to the centre.but still only 30 min for 1.20 euro.  Try it for fun. Taxi into centre about 6.50 euros. Breakfast is fine but don't expect hot bacon or scambled egg. I don't  think they understand the British love of hot food. A couple of bars/restaurants within 20 metres so you need not have to go far in the evening.", "date": "September 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1989939-d9694736-r419775432", "sub_review": {}, "travel_purpose": "Traveled as a couple", "rating": 3}, {"title": "excellent budget hotel for a one night stay", "review": "We had an unexpected stay in Granada and didn't want to spend too much money on a hotel. A local friend recommended this hotel so we booked it for one night. I believe I paid less than 40 euros so prior to arriving at this hotel, I was expecting a run down place. However, when I arrived, I was surprised to find a modern looking hotel, which didn't have the looks of a budget hotel.  The only negative was the room I was given, which was a room on the ground floor, which was across the reception desk, behind glass doors that didn't close well. When the reception was busy with guests, you could hear everything going on in the reception area because the glass doors didn't provide a good enough seal to insulate the noise. Also, these glass doors don't close automatically, so it was up…", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1989939-d9694736-r395914574", "sub_review": {"Sleep Quality": 5, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled with friends", "rating": 5}, {"title": "Basic budget and clean hotel close to Granda attractions", "review": "We booked to stay for two nights in June 2016 but we only stayed for one of the nights in the end. The room was spacious but felt a little like we were staying in a portacabin. The bed was large and comfortable with particularly nice pillows. The room was a bizarre layout in that the shower and toilet were part of the bedroom and next to the bed. The shower was warm and powerful and the facilities were clean.  Wifi was available in the room and the connection was strong enough to sustain us steaming videos.  The hotel itself is located in an urban area on the outskirts of Granada. There is a busy road right next to the hotel and the general environment means the small pool area is not the most attractive space to spend time. The pool however appeared to be clean and sanitary.…", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1989939-d9694736-r387113827", "sub_review": {"Rooms": 3, "Cleanliness": 5, "Service": 5}, "travel_purpose": "Traveled as a couple", "rating": 2}, {"title": "Not that great ", "review": "The rooms are big but there aren't really bathrooms. Everything is just in the room. The shower is right next to the bed, it's very strange. They offer free wifi but it doesn't work. The only thing that I really liked about this hotel was the service and the breakfast. There's a Carrefour very close so if you get hungry, that's probably your best bet because it's about a 5 minute taxi ride to the town center. ", "date": "June 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1989939-d9694736-r381077482", "sub_review": {}, "travel_purpose": "Traveled with friends", "rating": 2}, {"title": "Great Beds, Good Location, Awesome Shower", "review": "You'll need a car if you're staying here, but it's a quick drive to town, and it's right off the highway. Plenty of free parking too. Free internet didn't work well, but it wasn't a huge deal. The best thing about the hotel was the price ($60 for a double). It was two beds even though we requested a double (we saw the same setup in several rooms), but the bedding was fantastic. Air con was good too. And the shower had great water pressure and tons of hot water, even during the busiest time in the morning. The hotel also had fantastic coffee for a euro. I would avoid the rooms with connecting rooms, because the door was quite thin. We could hear the people next door pretty clearly. Fortunately, they were quiet. We only stayed one night, but overall, we were quite impressed with…", "date": "May 2016", "page_url": "https://www.tripadvisor.com/ShowUserReviews-g1989939-d9694736-r377343265", "sub_review": {"Value": 5, "Sleep Quality": 4, "Service": 4}, "travel_purpose": "Traveled as a couple", "rating": 4}]